{"title":"An iteratively adaptive multi-scale finite element method for elliptic PDEs with rough coefficients","uri":"","abstract":"We propose an iteratively adaptive Multi-scale Finite Element Method (MsFEM) for elliptic PDEs with rough coefficients. The choice of the local boundary conditions for the multi-sale basis functions determines the accuracy of the MsFEM numerical solution, and one needs to incorporate the global information of the elliptic equation into the local boundary conditions of the multi-scale basis functions to recover the underlying fine-mesh solution of the equation. In our proposed iteratively adaptive method, we achieve this global-to-local information transfer through the combination of coarse-mesh solving using adaptive multi-scale basis functions and fine-mesh smoothing operations. In each iteration step, we first update the multi-scale basis functions based on the approximate numerical solutions of the previous iteration steps, and obtain the coarse-mesh approximate solution using a Galerkin projection. Then we apply several steps of smoothing operations to the coarse-mesh approximate solution on the underlying fine mesh to get the updated approximate numerical solution. The proposed algorithm can be viewed as a nonlinear two-level multi-grid method with the restriction and prolongation operators adapted to the approximate numerical solutions of the previous iteration steps. Convergence analysis of the proposed algorithm is carried out under the framework of two-level multi-grid method, and the harmonic coordinates are employed to establish the approximation property of the adaptive multi-scale basis functions. We demonstrate the efficiency of our proposed multi-scale methods through several numerical examples including a multi-scale coefficient problem, a high-contrast interface problem, and a convection-dominated diffusion problem.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251411","docid":251411,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250283","fileid":1250283,"datasetid":"document","objectid":251411,"filename":"1-s2.0-S0021999117300955-main.pdf","mime_type":"application/pdf","hash":"2364f10a978a14b2d72a355f8366cba9","hash_type":"MD5","filesize":3614508,"mtime":"2017-04-27 21:45:13","url":"http://authors.library.caltech.edu/77020/1/1-s2.0-S0021999117300955-main.pdf"}],"eprintid":77020,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"1-s2.0-S0021999117300955-main.pdf","content":"published"}],"note":"© 2017 Elsevier Inc. \n\nReceived 26 June 2015. Received in revised form 28 August 2016. Accepted 2 February 2017. Available online 9 February 2017. \n\nThis research was in part supported by NSF Grants DMS-1613861, DMS-1318377. The second author was also supported in part by the Ministry of Science and Technology of Taiwan, MOST-104-2115-M-008-011, MOST-105-2115-M-008-007.","id":77020,"rev_number":8,"userid":772,"eprint_dir":"disk0/00/07/70/20","datestamp":"2017-04-27 21:55:26","lastmod":"2017-04-27 21:55:26","status_changed":"2017-04-27 21:55:26","type":"article","metadata_visibility":"show","creators":[{"given":"Thomas Y.","family":"Hou","id":"Hou-T-Y","orcid":""},{"given":"Feng-Nan","family":"Hwang","id":"Hwang-Feng-Nan","orcid":""},{"given":"Pengfei","family":"Liu","id":"Liu-Pengfei","orcid":""},{"given":"Chien-Chou","family":"Yao","id":"Yao-Chien-Chou","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Iteratively adaptive MsFEM; Global-to-local information transfer; Two-level multi-grid method; Elliptic equation with rough coefficients; Convection-dominated diffusion equation","date":"2017-05-01","date_type":"published","publication":"Journal of Computational Physics","volume":"336","number":"","pagerange":"375-400","id_number":"CaltechAUTHORS:20170427-144329075","refereed":true,"issn":"0021-9991","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170427-144329075","related_url":[{"url":"https://doi.org/10.1016/j.jcp.2017.02.002","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0021999117300955","type":"pub","description":"Article"}],"referencetext":["[1]R.E. Alcouffe, A. Brandt, J.E. Dendy Jr., J.W. Painter, The multi-grid method for the diffusion equation with strongly discontinuous coefficients, SIAM J. Sci. Stat. Comput. 2(4) (1981) 430–454.\n[2]G. Allaire, Homogenization and two-scale convergence, SIAM J. Math. Anal. 23(6) (1992) 1482–1518.\n[3]G. Allaire, Shape Optimization by the Homogenization Method, vol. 146, Springer Science \u0026 Business Media, 2012.\n[4]A. Averbuch, G. Beylkin, R. Coifman, M. Israeli, Multiscale inversion of elliptic operators, Wavelet Anal. Appl. 7 (1998) 341–359.\n[5]I. Babuška, G. Caloz, J. Osborn, Special finite element methods for a class of second order elliptic problems with rough coefficients, SIAM J. Numer. Anal. 31(4) (1994) 945–981.\n[6]I. Babuška, X. Huang, R. Lipton, Machine computation using the exponentially convergent multiscale spectral generalized finite element method, ESAIM: Math. Model. Numer. Anal. 48(02) (2014) 493–515.\n[7]I. Babuska, R. Lipton, Optimal local approximation spaces for generalized finite element methods with application to multiscale problems, Multiscale Model. Simul. 9(1) (2011) 373–406.\n[8]I. Babuška, J. Osborn, Generalized finite element methods: their performance and their relation to mixed methods, SIAM J. Numer. Anal. 20(3) (1983) 510–536.\n[9]I. Babuška, J. Osborn, Can a finite element method perform arbitrarily badly?, Math. Comput. AMS 69(230) (2000) 443–462.\n[10]M. Bebendorf, Hierarchical Matrices, Springer, 2008.\n[11]A. Bensoussan, J.L. Lions, G. Papanicolaou, Asymptotic Analysis for Periodic Structures, vol. 374, American Mathematical Soc., 2011.\n[12]G. Beylkin, N. Coult, A multiresolution strategy for reduction of elliptic PDEs and eigenvalue problems, Appl. Comput. Harmon. Anal. 5(2) (1998) 129–155.\n[13]A. Brandt, Multi-level adaptive technique (MLAT) for fast numerical solution to boundary value problems, in: Proceedings of the Third International Conference on Numerical Methods in Fluid Mechanics, Springer, 1973, pp.82–89.\n[14]A. Brandt, Algebraic multigrid theory: the symmetric case, Appl. Math. Comput. 19(1) (1986) 23–56.\n[15]A. Brandt, S. McCoruick, J. Huge, Algebraic multigrid (AMG) for sparse matrix equations, in: Sparsity and Its Applications, 1985, p.257.\n[16]M.E. Brewster, G. Beylkin, A multiresolution strategy for numerical homogenization, Appl. Comput. Harmon. Anal. 2(4) (1995) 327–349.\n[17]Z. Chen, T.Y. Hou, A mixed multiscale finite element method for elliptic problems with oscillating coefficients, Math. Comput. 72(242) (2003) 541–576.\n[18]I.L. Chern, Y.C. Shu, A coupling interface method for elliptic interface problems, J. Comput. Phys. 225(2) (2007) 2138–2174.\n[19]C.C. Chu, I. Graham, T.Y. Hou, A new multiscale finite element method for high-contrast elliptic interface problems, Math. Comput. 79(272) (2010) 1915–1955.\n[20]R. Codina, A discontinuity-capturing crosswind-dissipation for the finite element solution of the convection–diffusion equation, Comput. Methods Appl. Mech. Eng. 110 (1993) 325–342.\n[21]E. De Giorgi, New problems in γ-convergence and g-convergence, in: Free Boundary Problems, vol.2, 1980, pp.183–194.\n[22]E. De Giorgi, Sulla convergenza di alcune successioni d’integrali del tipo dell’area. Ennio De Giorgi, 2006, p.414.\n[23]P.M. DeZeeuw, Matrix-dependent prolongations and restrictions in a blackbox multigrid solver, J. Comput. Appl. Math. 33(1) (1990) 1–27.\n[24]M. Dorobantu, B. Engquist, Wavelet-based numerical homogenization, SIAM J. Numer. Anal. 35(2) (1998) 540–559.\n[25]L.J. Durlofsky, Y. Efendiev, V. Ginting, An adaptive local–global multiscale finite volume element method for two-phase flow simulations, Adv. Water Resour. 30(3) (2007) 576–588.\n[26]Y. Efendiev, J. Galvis, P.S. Vassilevski, Spectral element agglomerate algebraic multigrid methods for elliptic problems with high-contrast coefficients, in: Domain Decomposition Methods in Science and Engineering XIX, Springer, 2011, pp.407–414.\n[27]Y. Efendiev, V. Ginting, T.Y. Hou, R. Ewing, Accurate multiscale finite element methods for two-phase flow simulations, J. Comput. Phys. 220(1) (2006) 155–174.\n[28]Y. Efendiev, T.Y. Hou, V. Ginting, Multiscale finite element methods for nonlinear problems and their applications, Commun. Math. Sci. 2(4) (2004) 553–589.\n[29]Y. Efendiev, T.Y. Hou, X.H. Wu, Convergence of a nonconforming multiscale finite element method, SIAM J. Numer. Anal. 37(3) (2000) 888–910.\n[30]B. Engquist, E. Luo, Convergence of a multigrid method for elliptic equations with highly oscillatory coefficients, SIAM J. Numer. Anal. 34(6) (1997) 2254–2273.\n[31]C. Farhat, I. Kalashnikova, R. Tezaur, A higher-order discontinuous enrichment method for the solution of high Péclet advection–diffusion problems on unstructured meshes, Int. J. Numer. Methods Eng. 81 (2010) 604–636.\n[32]R.P. Fedorenko, A relaxation method for solving elliptic difference equations, USSR Comput. Math. Math. Phys. 1(4) (1962) 1092–1096.\n[33]L.P. Franca, S.L. Frey, T.J.R. Hughes, Stabilized finite element methods: I. Application to the advective–diffusive model, Comput. Methods Appl. Mech. Eng. 95 (1992) 253–276.\n[34]L.P. Franca, F.N. Hwang, Refining the submesh strategy in the two-level finite element method: application to the advection–diffusion equation, Int. J. Numer. Methods Fluids 39 (2002) 161–187.\n[35]J. Galvis, Y. Efendiev, Domain decomposition preconditioners for multiscale flows in high-contrast media, Multiscale Model. Simul. 8(4) (2010) 1461–1483.\n[36]A. Gloria, An analytical framework for the numerical homogenization of monotone elliptic operators and quasiconvex energies, Multiscale Model. Simul. 5(3) (2006) 996–1043.\n[37]I.G. Graham, P.O. Lechner, Robert Scheichl, Domain decomposition for multiscale PDEs, Numer. Math. 106(4) (2007) 589–626.\n[38]W. Hackbusch, A fast iterative method for solving Poisson’s equation in a general region, in: Numerical Treatment of Differential Equations, Springer, 1978, pp.51–62.\n[39]W. Hackbusch, Multi-grid Methods and Applications, vol. 4, Springer Science \u0026 Business Media, 2013.\n[40]W. Hackbusch, L. Grasedyck, An introduction to hierarchical matrices, Math. Bohem. 127(2) (2002) 229–241.\n[41]H. Hajibeygi, G. Bonfigli, M.A. Hesse, P. Jenny, Iterative multiscale finite-volume method, J. Comput. Phys. 227(19) (2008) 8604–8621.\n[42]H. Hajibeygi, P. Jenny, Adaptive iterative multiscale finite volume method, J. Comput. Phys. 230 (2011) 628–643.\n[43]P. Henning, D. Peterseim, Oversampling for the multiscale finite element method, Multiscale Model. Simul. 11(4) (2013) 1149–1175.\n[44]T.Y. Hou, P. Liu, A heterogeneous stochastic FEM framework for elliptic PDEs, J. Comput. Phys. 281 (2015) 942–969.\n[45]T.Y. Hou, P. Liu, Optimal local multi-scale basis functions for linear elliptic equations with rough coefficient, Discrete Contin. Dyn. Syst. 36(8) (2016) 4451–4476.\n[46]T.Y. Hou, P. Liu, Z. Zhang, A model reduction method for elliptic PDEs with random input using the heterogeneous stochastic FEM framework, Bull. -Inst. Math. 11 (2016) 179–216.\n[47]T.Y. Hou, X.H. Wu, A multiscale finite element method for elliptic problems in composite materials and porous media, J. Comput. Phys. 134(1) (1997) 169–189.\n[48]T.Y. Hou, X.H. Wu, Z. Cai, Convergence of a multiscale finite element method for elliptic problems with rapidly oscillating coefficients, Math. Comput. AMS 68(227) (1999) 913–943.\n[49]T.Y. Hou, X.H. Wu, Y. Zhang, Removing the cell resonance error in the multiscale finite element method via a Petrov–Galerkin formulation, Commun. Math. Sci. 2(2) (2004) 185–205.\n[50]V.V. Jikov, S.M. Kozlov, O.A. Oleinik, Homogenization of Differential Operators and Integral Functionals, Springer Science \u0026 Business Media, 2012.\n[51]Jim E. Jones, Panayot S. Vassilevski, Amge based on element agglomeration, SIAM J. Sci. Comput. 23(1) (2001) 109–133.\n[52]Z. Li, The immersed interface method using a finite element formulation, Appl. Numer. Math. 27 (1998) 253–267.\n[53]A. Målqvist, D. Peterseim, Localization of elliptic multiscale problems, Math. Comput. 83(290) (2014) 2583–2603.\n[54]J. Mandel, M. Brezina, P. Vanˇek, Energy optimization of algebraic multigrid bases, Computing 62(3) (1999) 205–228.\n[55]A. Maugeri, K. Palagachev, L.G. Softova, Elliptic and Parabolic Equations with Discontinuous Coefficients, vol. 109, Wiley, 2000.\n[56]J.M. Melenk, I. Babuška, The partition of unity finite element method: basic theory and applications, Comput. Methods Appl. Mech. Eng. 139(1) (1996) 289–314.\n[57]R. Millward, A New Adaptive Multiscale Finite Element Method with Applications to High Contrast Interface Problems, PhD thesis, University of Bath, 2011.\n[58]F. Murat, Compacité par compensation, Ann. Sc. Norm. Super. Pisa, Cl. Sci. 5(3) (1978) 489–507.\n[59]F. Murat, L. Tartar, H-Convergence, Springer, 1997.\n[60]H. Owhadi, Bayesian numerical homogenization, Multiscale Model. Simul. 13(13) (2015) 812–828.\n[61]H. Owhadi, Mult-grid with rough coefficients and multiresolution operator decomposition from hierarchical information games, arXiv:1503.03467, 2015.\n[62]H. Owhadi, L. Zhang, Metric-based upscaling, Commun. Pure Appl. Math. 60(5) (2007) 675–723.\n[63]H. Owhadi, L. Zhang, Localized bases for finite-dimensional homogenization approximations with nonseparated scales and high contrast, Multiscale Model. Simul. 9(4) (2011) 1373–1398.\n[64]H. Owhadi, L. Zhang, L. Berlyand, Polyharmonic homogenization, rough polyharmonic splines and sparse super-localization, ESAIM: Math. Model. Numer. Anal. 48(02) (2014) 517–552.\n[65]N. Panasenko, N.S. Bakhvalov, Homogenization: Averaging Processes in Periodic Media: Mathematical Problems in the Mechanics of Composite Materi-als, 1989.\n[66]D. Peterseim, Variational multiscale stabilization and the exponential decay of fine-scale correctors, arXiv:1505.07611, 2015.\n[67]J.W. Ruge, K. Stüben, Algebraic multigrid, Multigrid Methods 3 (1987) 73–130.\n[68]Y. Saad, Iterative Methods for Sparse Linear Systems, SIAM, 2003.\n[69]Y.T. Shih, H.C. Elman, Iterative methods for stabilized discrete convection-diffusion problems, IMA J. Numer. Anal. 20 (2000) 333–358.\n[70]S. Spagnolo, Sulla convergenza di soluzioni di equazioni paraboliche ed ellittiche, Ann. Sc. Norm. Super. Pisa, Cl. Sci. 22(4) (1968) 571–597.\n[71]S. Spagnolo, Convergence in energy for elliptic operators, in: Numerical Solutions of Partial Differential Equations III, Acad. Press, New York, 1976.\n[72]U. Trottenberg, C. Oosterlee, A. Sch˝uller, Multigrid, Academic Press, 2000.\n[73]P.S. Vassilevski, On two ways of stabilizing the hierarchical basis multilevel methods, SIAM Rev. 39(1) (1997) 18–53.\n[74]P.S. Vassilevski, General constrained energy minimization interpolation mappings for AMG, SIAM J. Sci. Comput. 32(1) (2010) 1–13.\n[75]P.S. Vassilevski, J. Wang, Stabilizing the hierarchical basis by approximate wavelets II: implementation and numerical results, SIAM J. Sci. Comput. 20(2) (1998) 490–514.\n[76]W.L. Wan, T.F. Chan, B. Smith, An energy-minimizing interpolation for robust multigrid methods, SIAM J. Sci. Comput. 21(4) (1999) 1632–1649.\n[77]J. Xu, Y. Zhu, Uniform convergent multigrid methods for elliptic problems with strongly discontinuous coefficients, Math. Models Methods Appl. Sci. 18(01) (2008) 77–105.\n[78]J. Xu, L. Zikatanov, On an energy minimizing basis for algebraic multigrid methods, Comput. Vis. Sci. 7(3–4) (2004) 121–127."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Thomas Y. Hou, Feng-Nan Hwang, Pengfei Liu, Chien-Chou Yao, An iteratively adaptive multi-scale finite element method for elliptic PDEs with rough coefficients, Journal of Computational Physics, Volume 336, 1 May 2017, Pages 375-400, ISSN 0021-9991, https://doi.org/10.1016/j.jcp.2017.02.002.\n(http://www.sciencedirect.com/science/article/pii/S0021999117300955)","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"DMS-1613861"},{"agency":"NSF","grant_number":"DMS-1318377"},{"agency":"Ministry of Science and Technology (Taipei)","grant_number":"MOST-104-2115-M-008-011"},{"agency":"Ministry of Science and Technology (Taipei)","grant_number":"MOST-105-2115-M-008-007"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}