{"title":"Superconducting qubits on silicon substrates for quantum device integration","uri":"","abstract":"We present the fabrication and characterization of transmon qubits formed\nfrom aluminum Josephson junctions on two different silicon-based substrates:\n(i) high-resistivity silicon (Si) and (ii) silicon-on-insulator (SOI). Key to\nthe qubit fabrication process is the use of an anhydrous hydrofluoric vapor\nprocess which removes silicon surface oxides without attacking aluminum, and in\nthe case of SOI substrates, selectively removes the lossy buried oxide\nunderneath the qubit region. For qubits with a transition frequency of\napproximately $5$GHz we find qubit lifetimes and coherence times comparable to\nthose attainable on sapphire substrates ($T_{1,\\text{Si}} = 27\\mu$s,\n$T_{2,\\text{Si}} = 6.6\\mu$s; $T_{1,\\text{SOI}} = 3.5\\mu$s, $T_{2,\\text{SOI}} =\n2.2\\mu$s). This qubit fabrication process in principle permits co-fabrication\nof silicon photonic and mechanical elements, providing a route towards\nchip-scale integration of electro-opto-mechanical transducers for quantum\nnetworking of superconducting microwave quantum circuits.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251418","docid":251418,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250424","fileid":1250424,"datasetid":"document","objectid":251418,"filename":"1703.10195.pdf","mime_type":"application/pdf","hash":"79cfaf3ee847a2ae7e672795972bbad3","hash_type":"MD5","filesize":3016707,"mtime":"2017-04-27 22:39:23","url":"http://authors.library.caltech.edu/77027/1/1703.10195.pdf"}],"eprintid":77027,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1703.10195.pdf","content":"submitted"}],"note":"We gratefully acknowledge the Martinis Group\n(UCSB/Google) for their amplifier and filter designs as\nwell as Dan Vestyck at SPTS for his support of our uEtch\nHF vapor tool. This work was supported by the AFOSR\nMURI Quantum Photonic Matter (grant 16RT0696), the\nAFOSR MURI Wiring Quantum Networks with Mechanical\nTransducers (grant FA9550-15-1-0015), the Institute\nfor Quantum Information and Matter, an NSF Physics\nFrontiers Center (grant PHY-1125565) with support of\nthe Gordon and Betty Moore Foundation, and the Kavli\nNanoscience Institute at Caltech. A.J.K. acknowledges\nan IQIM Postdoctoral Fellowship","id":77027,"rev_number":9,"userid":999,"eprint_dir":"disk0/00/07/70/27","datestamp":"2017-04-27 22:42:26","lastmod":"2017-04-27 22:42:26","status_changed":"2017-04-27 22:42:26","type":"monograph","metadata_visibility":"show","creators":[{"given":"Andrew J.","family":"Keller","id":"Keller-A-J","orcid":""},{"given":"Paul B.","family":"Dieterle","id":"Dieterle-P-B","orcid":""},{"given":"Michael","family":"Fang","id":"Fang-Michael","orcid":""},{"given":"Brett","family":"Berger","id":"Berger-B","orcid":""},{"given":"Johannes M.","family":"Fink","id":"Fink-J-M","orcid":""},{"given":"Oskar","family":"Painter","id":"Painter-O","orcid":"0000-0002-1581-9209"}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2017-03-29","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170427-153536925","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170427-153536925","related_url":[{"url":"http://arxiv.org/abs/1703.10195","type":"arxiv","description":"Discussion Paper"}],"referencetext":[" M. Devoret and R. J. Schoelkopf, Science 339, 1169\n(2013).\n[2] A. Houck, H. Tureci, and J. Koch, Nature Phys. 8, 292\n(2012).\n5\n[3] A. Blais, R.-s. Huang, A. Wallraff, S. Girvin, and\nR. Schoelkopf, Phys. Rev. A 69, 062320 (2005).\n[4] A. Blais, J. Gambetta, A. Wallraff, D. Schuster,\nS. Girvin, M. Devoret, and R. Schoelkopf, Phys. Rev.\nA 75, 032329 (2007).\n[5] M. Devoret, S. Girvin, and R. Schoelkopf, Ann. Phys.\n16, 767 (2007).\n[6] J. Koch, T. Yu, J. Gambetta, A. Houck, D. Schuster,\nJ. Majer, A. Blais, M. Devoret, S. Girvin, and\nR. Schoelkopf, Phys. Rev. A 76, 042319 (2007).\n[7] J. Schreier, A. Houck, J. Koch, D. Schuster, B. Johnson,\nJ. Chow, J. Gambetta, J. Majer, L. Frunzio, M. Devoret,\nS. Girvin, and R. Schoelkopf, Phys. Rev. B 77, 180502\n(2008).\n[8] A. Houck, J. Koch, M. Devoret, S. Girvin, and\nR. Schoelkopf, Nature Phys. 8, 105 (2009).\n[9] A. Wallraff, D. Schuster, A. Blais, L. Frunzio, R.-\nS. Huang, J. Majer, S. Kumar, S. Girvin, and\nR. Schoelkopf, Nature 431, 162 (2004).\n[10] R. Barends, J. Kelly, A. Megrant, A. Veitia, D. Sank,\nJ. Jeffrey, T. White, J. Mutus, A. Fowler, B. Campbell,\nY. Chen, Z. Chen, B. Chiaro, A. Dunsworth, C. Neill,\nP. OMalley, P. Roushan, A. Vainsencher, J. Wenner,\nA. Korotkov, A. Cleland, and J. Martinis, Nature 508,\n500 (2014).\n[11] M. Reed, L. DiCarlo, S. Nigg, L. Sun, L. Frunzio,\nS. Girvin, and R. Schoelkopf, Nature 482, 382 (2014).\n[12] N. Ofek, A. Petrenko, R. Heeres, P. Reinhold, Z. Leghtas,\nB. Vlastakis, Y. Liu, L. Frunzio, S. Girvin, L. Jiang,\nM. Mirrahimi, M. Devoret, and R. Schoelkopf, Nature\n536, 441 (2016).\n[13] A. Safavi-Naeini and O. Painter, New J. Phys. 13, 013017\n(2011).\n[14] R. Andrews, R. Peterson, T. Purdy, K. Cicak, R. Simmonds,\nC. Regal, and K. Lehnert, Nature Phys. 10, 321\n(2014).\n[15] C. Quintana, A. Megrant, Z. Chen, A. Dunsworth,\nB. Chiaro, R. Barends, C. Campbell, Y. Chen, I.-\nC. Hoi, E. Jeffrey, J. Kelly, J. Mutus, P. O’Malley,\nC. Neill, P. Roushan, D. Sank, A. Vainsencher, J. Wenner,\nT. White, A. Cleland, and J. Martinis, Appl. Phys.\nLett. 105, 062601 (2014).\n[16] C. Wang, C. Axline, Y. Gao, T. Brecht, Y. Chu, L. Frunzio,\nM. Devoret, and R. Schoelkopf, Appl. Phys. Lett.\n105, 162601 (2015).\n[17] R. McDermott, IEEE Transactions on Applied Superconductivity\n19, 2 (2009).\n[18] R. Barends, J. Kelly, A. Megrant, D. Sank, E. Jeffrey,\nY. Chen, Y. Yin, B. Chiaro, J. Mutus, C. Neill, P. OMalley,\nP. Roushan, J. Wenner, T. White, A. Cleland, and\nJ. Martinis, Phys. Rev. Lett. 111, 080502 (2013).\n[19] C. Axline, M. Reagor, R. Heeres, P. Reinhold, C. Wang,\nK. Shain, W. Pfaff, Y. Chu, L. Frunzio, and\nR. Schoelkopf, Appl. Phys. Lett. 109, 042601 (2016).\n[20] A. D. O’Connell, M. Ansmann, R. C. Bialczak,\nM. Hofheinz, N. Katz, E. Lucero, M. N. C. McKenney,\nH. Wang, E. M. Weig, A. N. Cleland, and J. M. Martinis,\nApp. Phys. Lett. 92, 112903 (2008).\n[21] S. J. Weber, K. W. Murch, D. H. Slichter, R. Vijay, and\nI. Siddiqi, Appl. Phys. Lett. 98, 172510 (2011).\n[22] A. Bruno, G. de Lange, S. Asaad, K. L. van der Enden,\nN. K. Langford, and L. DiCarlo, App. Phys. Lett. 106,\n182601 (2015).\n[23] Y. Chu, C. Axline, C. Wang, T. Brecht, Y. Gao, L. Frunzio,\nand R. Schoelkopf, Appl. Phys. Lett. 109, 112601\n(2016).\n[24] U. Patel, Y. Gao, D. Hover, G. J. Ribeill, S. Sendelbach,\nand R. McDermott, Appl. Phys. Lett. 102, 012602\n(2013).\n[25] P. B. Dieterle, M. Kalaee, J. M. Fink, and O. Painter,\nPhys. Rev. Applied 6, 014013 (2016).\n[26] A. Megrant, A. Dunsworth, C. Quintana, J. Kelly,\nR. Barends, B. Campbell, Y. Chen, Z. Chen, B. Chiaro,\nA. Fowler, E. Jeffrey, J. Mutus, C. Neill, P. O’Malley,\nP. Roushan, D. Sank, A. Vainsencher, J. Wenner,\nT. White, and J. Martinis, in APS March Meeting 2016\n(BAPS.2016.MAR.L48.2).\n[27] J. M. Fink, Quantum nonlinearities in strong coupling\ncircuit QED, Ph.D. thesis, ETH Zurich (2010).\n[28] D. I. Schuster, A. Wallraff, A. Blais, L. Frunzio, R.-S.\nHuang, J. Majer, S. M. Girvin, and R. J. Schoelkopf,\nPhys. Rev. Lett. 94, 123602 (2005).\n[29] For Fig. 3(a,c), we did not make a binary discrimination\nprior to averaging, and instead determined excited state\npopulation based on how close the mean of many measurements\nwas to the ground-state or excited-state I-Q\npoint. This does not affect our extracted T1 value.\n[30] J. Chow, J. Gambetta, L. Tornberg, J. Koch, L. Bishop,\nA. Houck, B. Johnson, L. Frunzio, S. Girvin, and\nR. Schoelkopf, Phys. Rev. Lett. 102, 090502 (2009).\n[31] E. Magesan, J. M. Gambetta, B. R. Johnson, C. A. Ryan,\nJ. M. Chow, S. T. Merkel, M. P. da Silva, G. A. Keefe,\nM. B. Rothwell, T. A. Ohki, M. B. Ketchen, and M. Steffen,\nPhys. Rev. Lett. 109, 080505 (2012).\n[32] F. Motzoi, J. M. Gambetta, P. Rebentrost, and F. K.\nWilhelm, Phys. Rev. Lett. 103, 110501 (2009).\n[33] M. D. Reed, B. R. Johnson, A. A. Houck, L. DiCarlo,\nJ. M. Chow, D. I. Schuster, L. Frunzio, and R. J.\nSchoelkopf, Appl. Phys. Lett. 96, 203110 (2010).\n[34] E. Jeffrey, D. Sank, J. Y. Mutus, T. C. White, J. Kelly,\nR. Barends, Y. Chen, Z. Chen, B. Chiaro, A. Dunsworth,\nA. Megrant, P. J. J. O’Malley, C. Neill, P. Roushan,\nA. Vainsencher, J. Wenner, A. N. Cleland, and J. M.\nMartinis, Phys. Rev. Lett. 112, 190504 (2014).\n[35] J. Witmer, J. Valery, P. Arrangoiz-Arriola, C. Sarabalis,\nJ. Hill, and A. Safavi-Naeini, arxiv:1612.02421 (2016).\n[36] M. Aspelmeyer, T. Kippenberg, and F. Marquardt, Rev.\nMod. Phys. 86, 1391 (2014).\n[37] R. Barends, J. Wenner, M. Lenander, Y. Chen,\nR. C. Bialczak, J. Kelly, E. Lucero, P. O’Malley,\nM. Mariantoni, D. Sank, H. Wang, T. C. White, Y. Yin,\nJ. Zhao, A. N. Cleland, J. M. Martinis, and J. J. A.\nBaselmans, Appl. Phys. Lett. 99, 113507 (2011).\n[38] A. D. C´orcoles, J. M. Chow, J. M. Gambetta, C. Rigetti,\nJ. R. Rozen, G. A. Keefe, M. B. Rothwell, M. B. Ketchen,\nand M. Steffen, Appl. Phys. Lett. 99, 181906 (2011)."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Air Force Office of Scientific Research (AFOSR)","grant_number":"16RT0696"},{"agency":"Air Force Office of Scientific Research (AFOSR)","grant_number":"FA9550-15-1-0015"},{"agency":"NSF","grant_number":"PHY-1125565"},{"agency":"Gordon and Betty Moore Foundation","grant_number":""},{"agency":"Kavli Nanoscience Institute","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["IQIM","Institute for Quantum Information and Matter","Kavli Nanoscience Institute"]}