{"title":"Optimal Coding for Streaming Authentication and Interactive Communication","uri":"","abstract":"Error correction and message authentication are well studied in the literature, and various efficient solutions have been suggested and analyzed. This is however not the case for data streams in which the message is very long, possibly infinite, and not known in advance to the sender. Trivial solutions for error-correcting and authenticating data streams either suffer from a long delay at the receiver’s end or cannot perform well when the communication channel is noisy.\n\nIn this work we suggest a constant-rate error-correction scheme and an efficient authentication scheme for data streams over a noisy channel (one-way communication, no feedback) in the shared-randomness model. Our first scheme does not assume shared randomness and (non-efficiently) recovers a (1 − 2c)-fraction prefix of the stream sent so far, assuming the noise level is at most c \u003c 1/2. The length of the recovered prefix is tight.\n\nTo be able to overcome the c = 1/2 barrier we relax the model and assume the parties pre-share a secret key. Under this assumption we show that for any given noise rate c \u003c 1, there exists a scheme that correctly decodes a (1 − c)-fraction of the stream sent so far with high probability, and moreover, the scheme is efficient. Furthermore, if the noise rate exceeds c, the scheme aborts with high probability. We also show that no constant-rate authentication scheme recovers more than a (1 − c)-fraction of the stream sent so far with non-negligible probability, thus the relation between the noise rate and recoverable fraction of the stream is tight, and our scheme is optimal.\n\nOur techniques also apply to the task of interactive communication (two-way communication) over a noisy channel. In a recent paper, Braverman and Rao [STOC 2011] show that any function of two inputs has a constant-rate interactive protocol for two users that withstands a noise rate up to 1/4. By assuming that the parties share a secret random string, we extend this result and construct an interactive protocol that succeeds with overwhelming probability against noise rates up to 1/2. We also show that no constant-rate protocol exists for noise rates above 1/2 for functions that require two-way communication. This is contrasted with our first result in which computing the “function” requires only one-way communication and the noise rate can go up to 1.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251425","docid":251425,"rev_number":4,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250534","fileid":1250534,"datasetid":"document","objectid":251425,"filename":"chp%3A10.1007%2F978-3-642-40084-1_15.pdf","mime_type":"application/pdf","hash":"4ff2b63f388988b112b537d427a3ad3b","hash_type":"MD5","filesize":327270,"mtime":"2017-04-27 23:59:34","url":"http://authors.library.caltech.edu/77033/1/chp%253A10.1007%252F978-3-642-40084-1_15.pdf"}],"eprintid":77033,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"chp%3A10.1007%2F978-3-642-40084-1_15.pdf","content":"published"}],"note":"© 2013 International Association for Cryptologic Research.\n\nSupported in part by NSF grants 0830803, 09165174, 1065276, 1118126 and 1136174, US-Israel BSF grant 2008411, OKAWA Foundation Research Award, IBM Faculty Research Award, Xerox Faculty Research Award, B. John Garrick Foundation\nAward, Teradata Research Award, and Lockheed-Martin Corporation Research Award. This material is based upon work supported by the Defense Advanced Research Projects Agency through the U.S. Office of Naval Research under Contract\nN00014-11-1-0392. The views expressed are those of the author and do not reflect the official policy or position of the Department of Defense or the U.S. Government. Supported in part by NSF Award 1038578.","id":77033,"rev_number":18,"userid":207,"eprint_dir":"disk0/00/07/70/33","datestamp":"2017-04-28 15:49:45","lastmod":"2017-04-28 15:49:45","status_changed":"2017-04-28 15:49:45","type":"book_section","metadata_visibility":"show","creators":[{"given":"Matthew","family":"Franklin","id":"Franklin-M","orcid":""},{"given":"Ran","family":"Gelles","id":"Gelles-R","orcid":""},{"given":"Rafail","family":"Ostrovsky","id":"Ostrovsky-R","orcid":""},{"given":"Leonard J.","family":"Schulman","id":"Schulman-L-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2013-08","date_type":"published","publication":"","volume":"","number":"8043","pagerange":"258-276","id_number":"CaltechAUTHORS:20170427-165048383","refereed":true,"issn":"0302-9743","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170427-165048383","related_url":[{"url":"https://doi.org/10.1007/978-3-642-40084-1_15","type":"doi","description":"Article"},{"url":"https://link.springer.com/chapter/10.1007/978-3-642-40084-1_15","type":"pub","description":"Article"},{"url":"https://youtu.be/28kXRYgdg8U","type":"video","description":"Presentation"},{"url":"https://www.iacr.org/cryptodb/data/paper.php?pubkey=24646","type":"org","description":""},{"url":"http://rdcu.be/rFQt","type":"pub","description":"Free ReadCube access"}],"referencetext":["1. Bonsall, C.: The case of the hungry stranger. HarperCollins (1963)\n2. Brakerski, Z., Kalai, Y.T.: Efficient interactive coding against adversarial noise.\nIn: IEEE Annual Symposium on Foundations of Computer Science, pp. 160–166\n(2012)\n3. Brakerski, Z., Naor, M.: Fast algorithms for interactive coding. In: Proceedings\nof the 24th Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2013,\npp. 443–456 (2013)\n4. Braverman, M.: Towards deterministic tree code constructions. In: Proceedings\nof the 3rd Innovations in Theoretical Computer Science Conference, pp. 161–167.\nACM (2012)\n5. Braverman, M., Rao, A.: Towards coding for maximum errors in interactive communication.\nIn: Proceedings of the 43rd Annual ACM Symposium on Theory of\nComputing, STOC 2011, pp. 159–166. ACM, New York (2011)\n6. Diffie, W., Hellman, M.: New directions in cryptography. IEEE Transactions on\nInformation Theory 22(6), 644–654 (1976)\n7. Even, S., Goldreich, O., Micali, S.: On-line/Off-line digital signatures. In: Brassard,\nG. (ed.) CRYPTO 1989. LNCS, vol. 435, pp. 263–275. Springer, Heidelberg (1990)\n8. Franklin, M., Gelles, R., Ostrovsky, R., Schulman, L.J.: Optimal coding for streaming\nauthentication and interactive communication. In: Electronic Colloquium on\nComputational Complexity (ECCC) (2012),\nhttp://eccc.hpi-web.de/report/2012/104\n9. Gelles, R., Moitra, A., Sahai, A.: Efficient and explicit coding for interactive communication.\nIn: IEEE Annual Symposium on Foundations of Computer Science,\npp. 768–777 (2011)\n10. Gennaro, R., Rohatgi, P.: How to sign digital streams. In: Kaliski Jr., B.S. (ed.)\nCRYPTO 1997. LNCS, vol. 1294, pp. 180–197. Springer, Heidelberg (1997)\n11. Goldreich, O.: Foundations of cryptography. Basic applications, vol. II. Cambridge\nUniversity Press, New York (2004)\n12. Golle, P., Modadugu, N.: Authenticating streamed data in the presence of random\npacket loss. In: ISOC Network and Distributed System Security Symposium, NDSS\n2001 (2001)\n13. Guruswami, V., Smith, A.: Codes for computationally simple channels: Explicit\nconstructions with optimal rate. In: IEEE Annual Symposium on Foundations of\nComputer Science, pp. 723–732 (2010)\n14. Hemenway, B., Ostrovsky, R.: Public-key locally-decodable codes. In: Wagner, D.\n(ed.) CRYPTO 2008. LNCS, vol. 5157, pp. 126–143. Springer, Heidelberg (2008)\n15. Hemenway, B., Ostrovsky, R., Strauss, M.J., Wootters, M.: Public key locally decodable\ncodes with short keys. In: Goldberg, L.A., Jansen, K., Ravi, R., Rolim,\nJ.D.P. (eds.) RANDOM 2011 and APPROX 2011. LNCS, vol. 6845, pp. 605–615.\nSpringer, Heidelberg (2011)\n16. Langberg, M.: Private codes or succinct random codes that are (almost) perfect.\nIn: Proceedings of the 45th Annual IEEE Symposium on Foundations of Computer\nScience, FOCS 2004, pp. 325–334. IEEE Computer Society,Washington, DC (2004)\n17. Lipton, R.: A new approach to information theory. In: Enjalbert, P., Mayr, E.W.,\nWagner, K.W. (eds.) STACS 1994. LNCS, vol. 775, pp. 699–708. Springer, Heidelberg\n(1994)\n18. Micali, S., Peikert, C., Sudan, M., Wilson, D.A.: Optimal error correction against\ncomputationally bounded noise. In: Kilian, J. (ed.) TCC 2005. LNCS, vol. 3378,\npp. 1–16. Springer, Heidelberg (2005)\n19. Miner, S., Staddon, J.: Graph-based authentication of digital streams. In: IEEE\nSymposium on Security and Privacy, pp. 232–246 (2001)\n20. Peczarski, M.: An improvement of the tree code construction. Information Processing\nLetters 99(3), 92–95 (2006)\n21. Perrig, A., Canetti, R., Tygar, J., Song, D.: Efficient authentication and signing\nof multicast streams over lossy channels. In: IEEE Symposium on Security and\nPrivacy, pp. 56–73 (2000)\n22. Schulman, L.J.: Communication on noisy channels: a coding theorem for computation.\nIn: Annual IEEE Symposium on Foundations of Computer Science, pp.\n724–733 (1992)\n23. Schulman, L.J.: Deterministic coding for interactive communication. In: STOC\n1993: Proceedings of the Twenty-Fifth Annual ACM Symposium on Theory of\nComputing, pp. 747–756. ACM, New York (1993)\n24. Schulman, L.J.: Coding for interactive communication. IEEE Transactions on Information\nTheory 42(6), 1745–1756 (1996)\n25. Shannon, C.E.: A note on a partial ordering for communication channels. Information\nand Control 1(4), 390–397 (1958)\n26. Smith, A.: Scrambling adversarial errors using few random bits, optimal information\nreconciliation, and better private codes. In: Proceedings of the Eighteenth\nAnnual ACM-SIAM Symposium on Discrete Algorithms, SODA 2007, pp. 395–404.\nSociety for Industrial and Applied Mathematics, Philadelphia (2007)"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Franklin M., Gelles R., Ostrovsky R., Schulman L.J. (2013) Optimal Coding for Streaming Authentication and Interactive Communication. In: Canetti R., Garay J.A. (eds) Advances in Cryptology – CRYPTO 2013. Lecture Notes in Computer Science, vol 8043. Springer, Berlin, Heidelberg","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"0830803"},{"agency":"NSF","grant_number":"09165174"},{"agency":"NSF","grant_number":"1065276"},{"agency":"NSF","grant_number":"1118126 "},{"agency":"NSF","grant_number":"1136174"},{"agency":"Binational Science Foundation (USA-Israel)","grant_number":"2008411"},{"agency":"Okawa Foundation","grant_number":""},{"agency":"IBM","grant_number":""},{"agency":"Xerox","grant_number":""},{"agency":"B. John Garrick Foundation","grant_number":""},{"agency":"Teradata","grant_number":""},{"agency":"Lockheed-Martin Corporation","grant_number":""},{"agency":"Office of Naval Research (ONR)","grant_number":"N00014-11-1-0392"},{"agency":"NSF","grant_number":"1038578"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}