{"title":"Maximizing fuel production rates in isothermal solar thermochemical fuel production","uri":"","abstract":"Production of chemical fuels by isothermal pressure-swing cycles has recently generated significant interest. In this process a reactive oxide is cyclically exposed to an inert gas, which induces partial reduction of the oxide, and to an oxidizing gas of either H_2O or CO_2, which reoxidizes the oxide, releasing H_2 or CO. At sufficiently high temperatures and sufficiently low gas flow rates, both the reduction and oxidation steps become limited only by the flow of gas across the material and not by material kinetic factors. In this contribution, we develop a numerical model describing fuel production rates in this gas-phase limited regime. The implications of this behavior are explored under all possible isothermal pressure-swing cycling conditions, and the outcome is optimized in terms of fuel production rate as well as fuel conversion and utilization of input gas of all types. Fuel production rate is maximized at infinitesimally small cycle times and attains a value that is independent of material thermodynamics. Gas utilization is maximized at infinitesimally small gas inputs, but the values can be made independent of cycle time, depending on manipulation of flow conditions. Gas-phase conditions (temperature, oxidant and reductant gas partial pressures, and CO_2 vs H_2O as oxidant) have a strong impact on fuel production metrics. Under realistic, finite cycle times, material thermodynamics play a measurable role in establishing fuel production rates.","documents":null,"note":"© 2016 Elsevier Ltd. \n\nReceived 5 June 2016, Revised 5 September 2016, Accepted 6 September 2016, Available online 28 September 2016.","id":77047,"rev_number":5,"userid":18,"eprint_dir":"disk0/00/07/70/47","datestamp":"2017-04-28 16:04:56","lastmod":"2017-04-28 16:04:56","status_changed":"2017-04-28 16:04:56","type":"article","metadata_visibility":"show","creators":[{"given":"Timothy C.","family":"Davenport","id":"Davenport-T-C","orcid":""},{"given":"Chih-Kai","family":"Yang","id":"Yang-Chih-Kai","orcid":""},{"given":"Christopher J.","family":"Kucharczyk","id":"Kucharczyk-C-J","orcid":"0000-0002-4712-839X"},{"given":"Michael J.","family":"Ignatowich","id":"Ignatowich-M-J","orcid":""},{"given":"Sossina M.","family":"Haile","id":"Haile-S-M","orcid":"0000-0002-5293-6252"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Solar fuels; Thermochemical cycle; Kinetics; Thermodynamics; Ceria","date":"2016-12-01","date_type":"published","publication":"Applied Energy","volume":"183","number":"","pagerange":"1098-1111","id_number":"CaltechAUTHORS:20170428-085601209","refereed":true,"issn":"0306-2619","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-085601209","related_url":[{"url":"https://doi.org/10.1016/j.apenergy.2016.09.012","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0306261916313162","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Timothy C. Davenport, Chih-Kai Yang, Christopher J. Kucharczyk, Michael J. Ignatowich, Sossina M. Haile, Maximizing fuel production rates in isothermal solar thermochemical fuel production, Applied Energy, Volume 183, 1 December 2016, Pages 1098-1111, ISSN 0306-2619, https://doi.org/10.1016/j.apenergy.2016.09.012.\n(http://www.sciencedirect.com/science/article/pii/S0306261916313162)","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}