{"title":"Olivine-melt relationships and syneruptive redox variations in the 1959 eruption of Kīlauea Volcano as revealed by XANES","uri":"","abstract":"The 1959 summit eruption of Kīlauea Volcano exhibited high lava fountains of gas-rich, primitive magma, containing olivine + chromian spinel in highly vesicular brown glass. Microprobe analysis of these samples shows that euhedral rims on olivine phenocrysts, in direct contact with glass, vary significantly in forsterite (Fo) content, at constant major-element melt composition, as do unzoned groundmass olivine crystals. Ferric/total iron (Fe^(+3)/Fe^T)ratios for matrix and interstitial glasses, plus olivine-hosted glass inclusions in eight 1959 scoria samples have been determined by micro X-ray absorption near-edge structure spectroscopy (μ-XANES). These data show that much of the variation in Fo content reflects variation in oxidation state of iron in the melt, which varies with sulfur concentration in the glass and (locally) with proximity to scoria edges in contact with air. Data for 24 olivine-melt pairs in the better-equilibrated samples from later in the eruption show K_D averaging 0.280 ± 0.03 for the exchange of Fe and Mg between olivine and melt, somewhat displaced from the value of 0.30 ± 0.03 given by Roeder and Emslie (1970). This may reflect the low SiO_2 content of the 1959 magmas, which is lower than that in most Kīlauea tholeiites. More broadly, we show the potential of μ-XANES and electron microprobe to revisit and refine the value of K_D in natural systems.\nThe observed variations of Fe^(+3)/Fe^T ratios in the glasses reflect two distinct processes. The main process, sulfur degassing, produces steady decrease of the Fe^(+3)/Fe^T ratio. Melt inclusions in olivine are high in sulfur (1060–1500 ppm S), with Fe^(+3)/Fe^T = 0.160–0.175. Matrix glasses are degassed (mostly S \u003c 200 ppm) with generally lower Fe^(+3)/Fe^T (0.114–0.135). Interstitial glasses within clumps of olivine crystals locally show intermediate levels of sulfur and Fe^(+3)/Fe^T ratio. The correlation suggests that (1) the 1959 magma was significantly reduced by sulfur degassing during the eruption and (2) the melts originally had Fe^(+3)/Fe^T ≥ 0.175, consistent with oxygen fugacity (fO_2) at least 0.4 log units above the fayalite-magnetite-quartz (FMQ) buffer at 1 atm and magmatic temperature of 1200 °C.\nThe second process is interaction between the melts and atmospheric oxygen, which results in higher Fe^(+3)/Fe^T ratios. Detailed μ-XANES traverses show gradients in Fe^(+3)/Fe^T of 0.145 to 0.628 over distances of 100–150 μm in thin, visibly reddened matrix glass bordering some scoriae, presumably caused by contact with air. This process was extremely rapid, giving insight into how fast the Fe^(+3)/Fe_T ratio can change in response to changes in external conditions.","documents":null,"note":"© 2017 Elsevier B.V. \n\nReceived 18 May 2016, Revised 14 December 2016, Accepted 15 December 2016, Available online 18 December 2016.","id":77042,"rev_number":7,"userid":18,"eprint_dir":"disk0/00/07/70/42","datestamp":"2017-04-28 16:14:20","lastmod":"2017-04-28 16:14:20","status_changed":"2017-04-28 16:14:20","type":"article","metadata_visibility":"show","creators":[{"given":"R. T.","family":"Helz","id":"Helz-R-T","orcid":""},{"given":"E.","family":"Cottrell","id":"Cottrell-E","orcid":""},{"given":"M. N.","family":"Brounce","id":"Brounce-M-N","orcid":""},{"given":"K. A.","family":"Kelley","id":"Kelley-K-A","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Redox state; Sulfur degassing; Basalt; Kīlauea; Olivine-melt Mg-Fe exchange","date":"2017-03-15","date_type":"published","publication":"Journal of Volcanology and Geothermal Research","volume":"333-334","number":"","pagerange":"1-14","id_number":"CaltechAUTHORS:20170428-081626776","refereed":true,"issn":"0377-0273","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-081626776","related_url":[{"url":"https://doi.org/10.1016/j.jvolgeores.2016.12.006","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0377027316305157","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"R.T. Helz, E. Cottrell, M.N. Brounce, K.A. Kelley, Olivine-melt relationships and syneruptive redox variations in the 1959 eruption of Kīlauea Volcano as revealed by XANES, Journal of Volcanology and Geothermal Research, Volumes 333–334, 15 March 2017, Pages 1-14, ISSN 0377-0273, https://doi.org/10.1016/j.jvolgeores.2016.12.006.\n(http://www.sciencedirect.com/science/article/pii/S0377027316305157)","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}