{"title":"Single dose testosterone administration impairs cognitive reflection in men","uri":"","abstract":"The sex steroid testosterone regulates reproductive behaviors such as intra-male fighting and mating in non-humans. Correlational studies have linked testosterone with aggression and disorders associated with poor impulse control, but the neuropsychological processes at work are poorly understood. Building on a dual-process framework, we propose a mechanism underlying testosterone’s behavioral effects in humans: reducing cognitive reflection. In the largest behavioral testosterone administration study to date, 243 men received either testosterone or placebo and took the Cognitive Reflection Test (CRT), that estimated their capacity to override incorrect intuitive judgments with deliberate correct responses. Testosterone administration reduced CRT scores. The effect was robust to controlling for age, mood, math skills, treatment expectancy and 14 other hormones, and held for each of the CRT questions in isolation. Our findings suggest a mechanism underlying testosterone’s diverse effects on humans’ judgments and decision-making, and provide novel, clear and testable predictions.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251445","docid":251445,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250719","fileid":1250719,"datasetid":"document","objectid":251445,"filename":"Testosterone impairs cognitive reflection in men.pdf","mime_type":"application/pdf","hash":"1cb3343264ddf782e92d8d20ab2f60f2","hash_type":"MD5","filesize":538501,"mtime":"2017-04-28 16:54:23","url":"http://authors.library.caltech.edu/77049/1/Testosterone%20impairs%20cognitive%20reflection%20in%20men.pdf"}],"eprintid":77049,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Testosterone impairs cognitive reflection in men.pdf","content":"submitted"}],"note":"We thank the funding of the McArthur foundation, Ivey Business School, IFREE, Russell Sage Foundation, USC, INSEAD, and Stockholm SHH. Special thanks to Jorge Barraza, Austin Henderson, and Garrett Thoelen for research assistance, David Kimball for assay testing, and Justine Carré and James Roney for their insightful comments on earlier versions of the manuscript.","id":77049,"rev_number":11,"userid":5483,"eprint_dir":"disk0/00/07/70/49","datestamp":"2017-04-28 17:12:10","lastmod":"2017-04-28 17:19:50","status_changed":"2017-04-28 17:12:10","type":"article","metadata_visibility":"show","creators":[{"given":"Gideon","family":"Nave","id":"Nave-Gideon","orcid":"0000-0001-6251-5630"},{"given":"Amos","family":"Nadler","id":"Nadler-A","orcid":"0000-0001-5069-5742"},{"given":"David","family":"Zava","id":"Zava-D","orcid":""},{"given":"Colin","family":"Camerer","id":"Camerer-C-F","orcid":"0000-0003-4049-1871"}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"Testosterone; Single Administration; Cognitive Reflection; Dual Process; Impulse Control; Neuroeconomics","date":"2017-04-11","date_type":"inpress","publication":"Psychological Science","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170428-091020875","refereed":true,"issn":"0956-7976 ","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-091020875","related_url":null,"referencetext":["Archer, J. (2006). Testosterone and human aggression: an evaluation of the challenge hypothesis. Neuroscience \u0026 Biobehavioral Reviews, 30(3), 319-345.\nBing, O., Heilig, M., Kakoulidis, P., Sundblad, C., Wiklund, L., \u0026 Eriksson, E. (1998). High doses of testosterone increase anticonflict behaviour in rat. European Neuropsychopharmacology, 8(4), 321-323.\nBos, P. A., Hermans, E. J., Ramsey, N. F., \u0026 Van Honk, J. (2012). The neural mechanisms by which testosterone acts on interpersonal trust. NeuroImage, 61(3), 730-737.\nBosch-Domènech, A., Brañas-Garza, P., \u0026 Espín, A. M. (2014). Can exposure to prenatal sex hormones (2D: 4D) predict cognitive reflection? Psychoneuroendocrinology, 43, 1-10.\nBrañas-Garza, P., Kujal, P., \u0026 Lenkei, B. (2015). Cognitive Reflection Test: Whom, how, when.\nCampbell, B. C., Dreber, A., Apicella, C. L., Eisenberg, D. T., Gray, P. B., Little, A. C., . . . Lum, J. K. (2010). Testosterone exposure, dopaminergic reward, and sensation-seeking in young men. Physiology \u0026 behavior, 99(4), 451-456.\nCarré, J. M., Geniole, S. N., Ortiz, T. L., Bird, B. M., Videto, A., \u0026 Bonin, P. L. (2016). Exogenous testosterone rapidly increases aggressive behavior in dominant and impulsive men. Biological psychiatry.\nCotrufo, P., Monteleone, P., d’Istria, M., Fuschino, A., Serino, I., \u0026 Maj, M. (2000). Aggressive behavioral characteristics and endogenous hormones in women with bulimia nervosa. Neuropsychobiology, 42(2), 58-61.\nDabbs, J. M., Carr, T. S., Frady, R. L., \u0026 Riad, J. K. (1995). Testosterone, crime, and misbehavior among 692 male prison inmates. Personality and individual Differences, 18(5), 627-633.\nDaitzman, R., \u0026 Zuckerman, M. (1980). Disinhibitory sensation seeking, personality and gonadal hormones. Personality and Individual Differences, 1(2), 103-110.\nEdwards, D. A. (1969). Early androgen stimulation and aggressive behavior in male and female mice. Physiology \u0026 Behavior, 4(3), 333-338.\nEisenegger, C., Haushofer, J., \u0026 Fehr, E. (2011). The role of testosterone in social interaction. Trends in cognitive sciences, 15(6), 263-271.\nEisenegger, C., Naef, M., Snozzi, R., Heinrichs, M., \u0026 Fehr, E. (2010). Prejudice and truth about the effect of testosterone on human bargaining behaviour. Nature, 463(7279), 356-359.\nEisenegger, C., von Eckardstein, A., Fehr, E., \u0026 von Eckardstein, S. (2013). Pharmacokinetics of testosterone and estradiol gel preparations in healthy young men. Psychoneuroendocrinology, 38(2), 171-178.\nEvans, J. S. B. (2003). In two minds: dual-process accounts of reasoning. Trends in cognitive sciences, 7(10), 454-459.\nFinley, S., \u0026 Kritzer, M. (1999). Immunoreactivity for intracellular androgen receptors in identified subpopulations of neurons, astrocytes and oligodendrocytes in primate prefrontal cortex. Journal of neurobiology, 40(4), 446-457.\nFrederick, S. (2005). Cognitive reflection and decision making. Journal of Economic perspectives, 25-42.\nGarcía, A. A. L. F. (2005). Sensation seeking, sexual curiosity and testosterone in inmates. Neuropsychobiology, 51, 28-33.\nGombos, V. A. (2006). The cognition of deception: the role of executive processes in producing lies. Genetic, social, and general psychology monographs, 132(3), 197-214.\nGrimm, V., \u0026 Mengel, F. (2011). Let me sleep on it: Delay reduces rejection rates in ultimatum games. Economics Letters, 111(2), 113-115.\nJanowsky, J. S. (2006). Thinking with your gonads: testosterone and cognition. Trends in cognitive sciences, 10(2), 77-82.\nMargittai, Z., Nave, G., Strombach, T., van Wingerden, M., Schwabe, L., \u0026 Kalenscher, T. (2015). Exogenous cortisol causes a shift from deliberative to intuitive thinking. Psychoneuroendocrinology.\nMartin, C. A., Kelly, T. H., Rayens, M. K., Brogli, B. R., Brenzel, A., Smith, W. J., \u0026 Omar, H. A. (2002). Sensation seeking, puberty, and nicotine, alcohol, and marijuana use in adolescence. Journal of the American academy of child \u0026 adolescent psychiatry, 41(12), 1495-1502.\nMazur, A. (2005). Biosociology of dominance and deference: Rowman \u0026 Littlefield Publishers.\nMehta, P. H., \u0026 Beer, J. (2010). Neural mechanisms of the testosterone–aggression relation: The role of orbitofrontal cortex. Journal of Cognitive Neuroscience, 22(10), 2357-2368.\nOldrati, V., Patricelli, J., Colombo, B., \u0026 Antonietti, A. (2016). The role of dorsolateral prefrontal cortex in inhibition mechanism: A study on cognitive reflection test and similar tasks through neuromodulation. Neuropsychologia, 91, 499-508.\nPope, H. G., Kouri, E. M., \u0026 Hudson, J. I. (2000). Effects of supraphysiologic doses of testosterone on mood and aggression in normal men: a randomized controlled trial. Archives of general psychiatry, 57(2), 133-140.\nReynolds, M. D., Tarter, R., Kirisci, L., Kirillova, G., Brown, S., Clark, D. B., \u0026 Gavaler, J. (2007). Testosterone levels and sexual maturation predict substance use disorders in adolescent boys: A prospective study. Biological psychiatry, 61(11), 1223-1227.\nRonay, R., \u0026 von Hippel, W. (2010). The presence of an attractive woman elevates testosterone and physical risk taking in young men. Social Psychological and Personality Science, 1(1), 57-64.\nSpielberg, J. M., Forbes, E. E., Ladouceur, C. D., Worthman, C. M., Olino, T. M., Ryan, N. D., \u0026 Dahl, R. E. (2014). Pubertal testosterone influences threat-related amygdala–orbitofrontal cortex coupling. Social cognitive and affective neuroscience, nsu062.\nSvensson, A. I., Åkesson, P., Engel, J. A., \u0026 Söderpalm, B. (2003). Testosterone treatment induces behavioral disinhibition in adult male rats. Pharmacology Biochemistry and Behavior, 75(2), 481-490.\nToplak, M. E., West, R. F., \u0026 Stanovich, K. E. (2014). Assessing miserly information processing: An expansion of the Cognitive Reflection Test. Thinking \u0026 Reasoning, 20(2), 147-168.\nvan Honk, J., Will, G.-J., Terburg, D., Raub, W., Eisenegger, C., \u0026 Buskens, V. (2016). Effects of testosterone administration on strategic gambling in poker play. Scientific reports, 6.\nVolman, I., Toni, I., Verhagen, L., \u0026 Roelofs, K. (2011). Endogenous testosterone modulates prefrontal–amygdala connectivity during social emotional behavior. Cerebral Cortex, bhr001.\nVon Drehle, D. (2014). Manopause!? Aging, insecurity and the $2 billion testosterone industry. Time, US Edition, 184, 36-43.\nWang, C., Plymate, S., Nieschlag, E., \u0026 Paulsen, C. A. (1981). Salivary testosterone in men: further evidence of a direct correlation with free serum testosterone. The Journal of Clinical Endocrinology \u0026 Metabolism, 53(5), 1021-1024.\nWatson, D., \u0026 Clark, L. A. (1999). The PANAS-X: Manual for the positive and negative affect schedule-expanded form.\nWibral, M., Dohmen, T., Klingmüller, D., Weber, B., \u0026 Falk, A. (2012). Testosterone administration reduces lying in men. PloS one, 7(10), e46774.\nWingfield, J. C., Hegner, R. E., Dufty Jr, A. M., \u0026 Ball, G. F. (1990). The \"challenge hypothesis\": theoretical implications for patterns of testosterone secretion, mating systems, and breeding strategies. American Naturalist, 829-846.\nZethraeus, N., Kocoska-Maras, L., Ellingsen, T., von Schoultz, B., Hirschberg, A. L., \u0026 Johannesson, M. (2009). A randomized trial of the effect of estrogen and testosterone on economic behavior. Proceedings of the National Academy of Sciences, 106(16), 6535-6538."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"John D. and Catherine T. MacArthur Foundation","grant_number":""},{"agency":"Ivey Business School","grant_number":""},{"agency":"International Foundation for Research in Experimental Economics (IFREE)","grant_number":""},{"agency":"Russell Sage Foundation","grant_number":""},{"agency":"University of Southern California","grant_number":""},{"agency":"Institut Européen d'Administration des Affaires (INSEAD)","grant_number":""},{"agency":"Stockholm SHH","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}