{"title":"X-ray-emitting active galactic nuclei from z = 0.6 to 1.3 in the intermediate- and high-density environments of the ORELSE survey","uri":"","abstract":"We studied active galactic nucleus (AGN) activity in 12 large-scale structures (LSSs) in the Observations of Redshift Evolution in Large-Scale Environments (ORELSE) survey, at 0.65 \u003c z \u003c 1.28, using a combination of Chandra observations, optical and NIR imaging and spectroscopy. We located a total of 61 AGNs that were successfully matched to optical counterparts in the LSSs. We found that AGN populations across our sample had more recently had starburst events compared to the overall galaxy populations. We find no relation between AGN activity and location within the LSSs, suggesting triggering mechanisms that depend on global environment are at most sub-dominant. To focus on differences between our AGNs, we grouped them into four sub-samples based on the spectral properties of their parents LSSs. We found one of the sub-samples, SG0023 \u0026 SC1604, stood out from the others. AGNs in this sample were disproportionately luminous. These AGNs had the most recent starburst events, in contrast to their parent populations. Additionally, both the AGNs and the overall galaxy population in SG0023 \u0026 SC1604 had the largest fraction of close kinematic pairs, which indicates a higher rate of galaxy mergers and interactions. These results suggest that major mergers are driving AGN activity in SG0023 \u0026 SC1604, while other processes are likely triggering less luminous AGNs in the rest of our sample. Additionally, minor mergers are unlikely to play a significant role, since the same conditions that lead to more major mergers should also lead to more minor mergers, which is not observed in SG0023 \u0026 SC1604.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251446","docid":251446,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250731","fileid":1250731,"datasetid":"document","objectid":251446,"filename":"stw3091.pdf","mime_type":"application/pdf","hash":"222db6bd1e00e41244f79eafe5a067a8","hash_type":"MD5","filesize":2923012,"mtime":"2017-04-28 17:07:59","url":"http://authors.library.caltech.edu/77051/1/stw3091.pdf"}],"eprintid":77051,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"stw3091.pdf","content":"published"}],"note":"© 2016 The Authors. Published by Oxford University Press on behalf of the Royal Astronomical Society. \n\nAccepted 2016 November 25. Received 2016 November 19; in original form 2016 July 28. \n\nThis material is based upon work supported by the National Aeronautics and Space Administration under NASA Grant Number NNX15AK92G. The authors thank Kirpal Nandra and Antonis Georgakakis for providing the Imperial reduction pipeline and their ongoing support of the software. The spectroscopic data presented herein were obtained at the W.M. Keck Observatory, which is operated as a scientific partnership among the California Institute of Technology, the University of California and the National Aeronautics and Space Administration. The Observatory was made possible by the generous financial support of the W.M. Keck Foundation. The authors wish to recognize and acknowledge the very significant cultural role and reverence that the summit of Mauna Kea has always had within the indigenous Hawaiian community. We are most fortunate to have the opportunity to conduct observations from this mountain.","id":77051,"rev_number":7,"userid":772,"eprint_dir":"disk0/00/07/70/51","datestamp":"2017-04-28 17:30:21","lastmod":"2017-04-28 17:30:21","status_changed":"2017-04-28 17:30:21","type":"article","metadata_visibility":"show","creators":[{"given":"N.","family":"Rumbaugh","id":"Rumbaugh-N","orcid":""},{"given":"B. C.","family":"Lemaux","id":"Lemaux-B-C","orcid":""},{"given":"A.","family":"Tomczak","id":"Tomczak-A","orcid":""},{"given":"D. D.","family":"Kocevski","id":"Kocevski-D-D","orcid":""},{"given":"L. M.","family":"Lubin","id":"Lubin-L-M","orcid":""},{"given":"P.-F.","family":"Wu","id":"Wu-P-F","orcid":""},{"given":"R. R.","family":"Gal","id":"Gal-R-R","orcid":""},{"given":"L.","family":"Shen","id":"Shen-L","orcid":""},{"given":"A.","family":"Mansheim","id":"Mansheim-A","orcid":""},{"given":"C. D.","family":"Fassnacht","id":"Fassnacht-C-D","orcid":""},{"given":"G. K.","family":"Squires","id":"Squires-G-K","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"galaxies: active, galaxies: clusters: general, galaxies: evolution, galaxies: nuclei, X-rays: galaxies","date":"2017-04","date_type":"published","publication":"Monthly Notices of the Royal Astronomical Society","volume":"466","number":"1","pagerange":"496-519","id_number":"CaltechAUTHORS:20170428-100719188","refereed":true,"issn":"0035-8711","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-100719188","related_url":[{"url":"https://doi.org/10.1093/mnras/stw3091","type":"doi","description":"Article"},{"url":"https://academic.oup.com/mnras/article/466/1/496/2617719/X-ray-emitting-active-galactic-nuclei-from-z-0-6?related-urls=yes\u0026legid=mnras;stw3091v1","type":"pub","description":"Article"}],"referencetext":["Alberts S. et al., 2016, ApJ, 825, 72\nAscasoB., Lemaux B. C., Lubin L.M., GalR.R.,Kocevski D. D., Rumbaugh\nN., Squires G., 2014, MNRAS, 442, 589\nBarrera-Ballesteros J. K. et al., 2015, A\u0026A, 582, A21\nBluck A. F. L., Conselice C. J., Almaini O., Laird E. S., Nandra K.,\nGr¨utzbauch R., 2011, MNRAS, 410, 1174\nBournaud F. et al., 2011, ApJ, 730, 4\nBoyle B. J., Terlevich R. J., 1998, MNRAS, 293, L49\nBrammer G. B., van Dokkum P. G., Coppi P., 2008, ApJ, 686, 1503\nBruzual G., 2007, in Vallenari A., Tantalo R., Portinari L., Moretti A., eds,\nASP Conf. Ser. Vol. 374, From Stars to Galaxies: Building the Pieces to\nBuild Up the Universe. Astron. Soc. Pac., San Francisco, p. 303\nBruzual G., Charlot S., 2003, MNRAS, 344, 1000\nCiotti L., Ostriker J. P., 2007, ApJ, 665, 1038\nCisternas M. et al., 2011, ApJ, 741, L11\nContini T. et al., 2016, A\u0026A, 591, A49\nCroton D. J. et al., 2006, MNRAS, 365, 11\nDressler A., Smail I., Poggianti B. M., Butcher H., Couch W. J., Ellis R. S.,\nOemler A., Jr1999, ApJS, 122, 51\nDressler A., Oemler A., Jr, Poggianti B. M., Smail I., Trager S., Shectman\nS. A., Couch W. J., Ellis R. S., 2004, ApJ, 617, 867\nDressler A., Oemler A., Jr, Poggianti B. M., Gladders M. D., Abramson L.,\nVulcani B., 2013, ApJ, 770, 62\nEhlert S. et al., 2015, MNRAS, 446, 2709\nEllison S. L., Mendel J. T., Scudder J. M., Patton D. R., Palmer M. J. D.,\n2013, MNRAS, 430, 3128\nElmegreen B. G. et al., 1998, ApJ, 503, L119\nEttori S., Tozzi P., Borgani S., Rosati P., 2004, A\u0026A, 417, 13\nFaber S.M. et al., 2003, in IyeM., Moorwood A. F. M., eds, Proc. SPIEConf.\nSer. Vol. 4841, Instrument Design and Performance for Optical/Infrared\nGround-based Telescopes. SPIE, Bellingham, p. 1657\nFaber S. M. et al., 2007, ApJ, 665, 265\nFazio G. G. et al., 2004, ApJS, 154, 10\nFerrarese L., Merritt D., 2000, ApJ, 539, L9\nFioc M., Rocca-Volmerange B., 1997, A\u0026A, 326, 950\nFord H. C., Tsvetanov Z. I., Ferrarese L., Jaffe W., 1998, in Sofue Y., ed.,\nProc. IAU Symp. 184, The Central Regions of the Galaxy and Galaxies.\nKluwer, Dordrecht, p. 377\nFruscione A. et al., 2006, in Silva D. R., Doxsey R. E., eds, Proc. SPIE\nConf. Ser. Vol. 6270, Observatory Operations: Strategies, Processes,\nand Systems. SPIE, Bellingham, p. 1\nGal R. R., Lubin L. M., 2004, ApJ, 607, L1\nGal R. R., Lemaux B. C., Lubin L. M., Kocevski D., Squires G. K., 2008,\nApJ, 684, 933\nGehrels N., 1986, ApJ, 303, 336\nGenzel R. et al., 2008, ApJ, 687, 59\nGeorgakakis A. et al., 2008, MNRAS, 385, 2049\nGeorgakakis A. et al., 2009, MNRAS, 397, 623\nGeorgantopoulos I., Rovilos E., Comastri A., 2011, A\u0026A, 526, A46\nGill S. P. D., Knebe A., Gibson B. K., 2005, MNRAS, 356, 1327\nGilmour R., Gray M. E., Almaini O., Best P., Wolf C., Meisenheimer K.,\nPapovich C., Bell E., 2007, MNRAS, 380, 1467\nGioia I. M., Wolter A., Mullis C. R., Henry J. P., B¨ohringer H., Briel U. G.,\n2004, A\u0026A, 428, 867\nGladders M. D., Yee H. K. C., 2005, ApJS, 157, 1\nGladders M. D., L´opez-Cruz O., Yee H. K. C., Kodama T., 1998, ApJ, 501,\n571\nGladders M. D., Yee H. K. C., Ellingson E., 2002, AJ, 123, 1\nGraham A. W., 2016, Astrophysics and Space Science Library, Vol. 418,\nGalactic Bulges. Springer International Publishing, Switzerland, p. 263\nHaines C. P. et al., 2012, ApJ, 754, 97\nH¨aring N., Rix H.-W., 2004, ApJ, 604, L89\nHashimoto Y., Hasinger G., Arnaud M., Rosati P., Miyaji T., 2002, A\u0026A,\n381, 841\nHashimoto Y., Henry J. P., Hasinger G., Szokoly G., Schmidt M., 2005,\nA\u0026A, 439, 29\nHasinger G. et al., 1998, A\u0026A, 340, L27\nHeckman T. M., Best P. N., 2014, ARA\u0026A, 52, 589\nHeckman T. M., Kauffmann G., Brinchmann J., Charlot S., Tremonti C.,\nWhite S. D. M., 2004, ApJ, 613, 109\nHenry J. P. et al., 1997, AJ, 114, 1293\nHern´andez-Ibarra F. J., Dultzin D., Krongold Y., Olmo A. d., Perea J.,\nGonz´alez J., 2013, MNRAS, 434, 336\nHern´andez-Ibarra F. J., Krongold Y., Dultzin D., del Olmo A., Perea J.,\nGonz´alez J., Mendoza-Castrej´on S., Bitsakis T., 2016, MNRAS, 459,\n291\nHewett P. C., Warren S. J., Leggett S. K., Hodgkin S. T., 2006, MNRAS,\n367, 454\nHicks A. K. et al., 2007, ApJ, 671, 1446\nHicks A. K. et al., 2008, ApJ, 680, 1022\nHolden B. P., Stanford S. A., Squires G. K., Rosati P., Tozzi P., Eisenhardt\nP., Spinrad H., 2002, AJ, 124, 33\nHopkins P. F., Quataert E., 2010, MNRAS, 407, 1529\nHopkins P. F., Hernquist L., Cox T. J., Di Matteo T., Robertson B., Springel\nV., 2006, ApJS, 163, 1\nJeltema T. E., Canizares C. R., Bautz M. W., Buote D. A., 2005, ApJ, 624,\n606\nJuneau S. et al., 2013, ApJ, 764, 176\nKauffmann G. et al., 2003, MNRAS, 346, 1055\nKim M. et al., 2007, ApJS, 169, 401\nKocevski D. D., Lubin L. M., Lemaux B. C., Gal R. R., Fassnacht C. D.,\nLin R., Squires G. K., 2009, ApJ, 700, 901\nKocevski D. D. et al., 2012, ApJ, 744, 148\nKormendy J., Ho L. C., 2013, ARA\u0026A, 51, 511\nKormendy J., Richstone D., 1995, ARA\u0026A, 33, 581\nKoss M., Mushotzky R., Veilleux S., Winter L., 2010, ApJ, 716, L125\nKoulouridis E. et al., 2014, A\u0026A, 567, A83\nKriek M., van Dokkum P. G., Labb´e I., Franx M., Illingworth G. D.,\nMarchesini D., Quadri R. F., 2009, ApJ, 700, 221\nLaird E. S. et al., 2009, ApJS, 180, 102\nLaird E. S., Nandra K., Pope A., Scott D., 2010, MNRAS, 401, 2763\nLemaux B. C. et al., 2009, ApJ, 700, 20\nLemaux B. C., Lubin L. M., Shapley A., Kocevski D., Gal R. R., Squires\nG. K., 2010, ApJ, 716, 970\nLemaux B. C. et al., 2012, ApJ, 745, 106\nLemaux B. C. et al., 2014, A\u0026A, 572, A90\nLubin L.M., Gal R. R., Lemaux B. C., Kocevski D. D., Squires G. K., 2009,\nAJ, 137, 4867\nMamon G. A., Sanchis T., Salvador-Sol´e E., Solanes J. M., 2004, A\u0026A,\n414, 445\nMarconi A., Hunt L. K., 2003, ApJ, 589, L21\nMartini P., Sivakoff G. R., Mulchaey J. S., 2009, ApJ, 701, 66\nMartini P. et al., 2013, ApJ, 768, 1\nMcNamara B. R., Nulsen P. E. J., 2007, ARA\u0026A, 45, 117\nMenanteau F., Jimenez R., Matteucci F., 2001, ApJ, 562, L23\nMiyazaki S. et al., 2002, PASJ, 54, 833\nMoore B., Katz N., Lake G., Dressler A., Oemler A., 1996, Nature, 379, 613\nMullis C. R. et al., 2003, ApJ, 594, 154\nNandra K. et al., 2007, ApJ, 660, L11\nNandra K. et al., 2015, ApJS, 220, 10\nNarayanan D. et al., 2008, ApJS, 176, 331\nNazaryan T. A., Petrosian A. R., Hakobyan A. A., McLean B. J., Kunth D.,\n2014, Astrophysics, 57, 14\nNetzer H., 2015, ARA\u0026A, 53, 365\nNewman J. A. et al., 2013, ApJS, 208, 5\nNoble A. G., Webb T. M. A., Muzzin A., Wilson G., Yee H. K. C., van der\nBurg R. F. J., 2013, ApJ, 768, 118\nOke J. B., Postman M., Lubin L. M., 1998, AJ, 116, 549\nPoggianti B. M., Barbaro G., 1997, A\u0026A, 325, 1025\nOemler, Jr, A.Poggianti B. M., Smail I., Dressler A., Couch W. J., Barger\nA. J., Butcher H., Ellis R. S.1999, ApJ, 518, 576\nPuget P. et al., 2004, in Moorwood A. F. M., Iye M., eds, Proc. SPIEConf.\nSer. Vol. 5492, Ground-based Instrumentation for Astronomy. SPIE,\nBellingham, p. 978\nRanalli P., Comastri A., Setti G., 2003, A\u0026A, 399, 39\nReichard T. A., Heckman T. M., Rudnick G., Brinchmann J., Kauffmann\nG., Wild V., 2009, ApJ, 691, 1005\nRobotham A. S. G. et al., 2014, MNRAS, 444, 3986\nRosario D. J. et al., 2012, A\u0026A, 545, A45\nRosario D. J. et al., 2015, A\u0026A, 573, A85\nRosati P., Della Ceca R., Norman C., Giacconi R., 1998, ApJ, 492, L21\nRosati P., Stanford S. A., Eisenhardt P. R., Elston R., Spinrad H., Stern D.,\nDey A., 1999, AJ, 118, 76\nRumbaugh N., Kocevski D. D., Gal R. R., Lemaux B. C., Lubin L. M.,\nFassnacht C. D., McGrath E. J., Squires G. K., 2012, ApJ, 746, 155\nRumbaugh N., Kocevski D. D., Gal R. R., Lemaux B. C., Lubin L. M.,\nFassnacht C. D., Squires G. K., 2013, ApJ, 763, 124\nS´anchez S. F. et al., 2004, ApJ, 614, 586\nSchawinski K., Treister E., Urry C. M., Cardamone C. N., Simmons B., Yi\nS. K., 2011, ApJ, 727, L31\nSchawinski K., Simmons B. D., Urry C. M., Treister E., Glikman E., 2012,\nMNRAS, 425, L61\nShen Y., Mulchaey J. S., Raychaudhury S., Rasmussen J., Ponman T. J.,\n2007, ApJ, 654, L115\nSilverman J. D. et al., 2008, ApJ, 675, 1025\nSilverman J. D. et al., 2009, ApJ, 696, 396\nSimcoe R. A., Metzger M. R., Small T. A., Araya G., 2000, BAAS, 32, 758\nStanford S. A., Elston R., Eisenhardt P. R., Spinrad H., Stern D., Dey A.,\n1997, AJ, 114, 2232\nStanford S. A., Holden B., Rosati P., Tozzi P., Borgani S., Eisenhardt P. R.,\nSpinrad H., 2001, ApJ, 552, 504\nStott J. P., Pimbblet K. A., Edge A. C., Smith G. P., Wardlow J. L., 2009,\nMNRAS, 394, 2098\nSutherland W., Saunders W., 1992, MNRAS, 259, 413\nTanaka M. et al., 2008, A\u0026A, 489, 571\nTaylor E. L. et al., 2005, MNRAS, 361, 1352\nTreister E., Schawinski K., Urry C. M., Simmons B. D., 2012, ApJ, 758,\nL39\nTremaine S. et al., 2002, ApJ, 574, 740\nVeilleux S. et al., 2009, ApJS, 182, 628\nVikhlinin A., McNamara B. R., Forman W., Jones C., Quintana H., Hornstrup\nA., 1998, ApJ, 502, 558\nVikhlinin A., van Speybroeck L., Markevitch M., Forman W. R., Grego L.,\n2002, ApJ, 578, L107\nVikhlinin A. et al., 2009, ApJ, 692, 1033\nVoges W. et al., 1996, in Zimmermann H. U., Tr¨umper J., Yorke H., eds,\nRoentgenstrahlung from the Universe. p. 637\nWild V., Kauffmann G., Heckman T., Charlot S., Lemson G., Brinchmann\nJ., Reichard T., Pasquali A., 2007, MNRAS, 381, 543\nWise M. W., Davis J. E., Heunnemoerder S., Houck J. C., Dewey D.,\n2003, MARX 4.0 Technical Manual. MIT Center for Space Research,\nCambridge, MA\nWisnioski E. et al., 2015, ApJ, 799, 209\nXue Y. Q. et al., 2010, ApJ, 720, 368\nXu B.-X., Wu X.-B., Zhao H.-S., 2007, ApJ, 664, 198\nYan R., Newman J. A., Faber S. M., Konidaris N., Koo D., Davis M., 2006,\nApJ, 648, 281\nYounger J. D., Hopkins P. F., Cox T. J., Hernquist L., 2008, ApJ, 686, 815"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"N. Rumbaugh, B. C. Lemaux, A. Tomczak, D. D. Kocevski, L. M. Lubin, P.-F. Wu, R. R. Gal, L. Shen, A. Mansheim, C. D. Fassnacht, G. K. Squires; X-ray-emitting active galactic nuclei from z = 0.6 to 1.3 in the intermediate- and high-density environments of the ORELSE survey. Mon Not R Astron Soc 2017; 466 (1): 496-519. doi: 10.1093/mnras/stw3091","other_numbering_system":null,"funders":[{"agency":"NASA","grant_number":"NNX15AK92G"},{"agency":"W. M. Keck Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}