{"title":"Scaling laws of passive-scalar diffusion in the interstellar medium","uri":"","abstract":"Passive-scalar mixing (metals, molecules, etc.) in the turbulent interstellar medium (ISM) is critical for abundance patterns of stars and clusters, galaxy and star formation, and cooling from the circumgalactic medium. However, the fundamental scaling laws remain poorly understood in the highly supersonic, magnetized, shearing regime relevant for the ISM. We therefore study the full scaling laws governing passive-scalar transport in idealized simulations of supersonic turbulence. Using simple phenomenological arguments for the variation of diffusivity with scale based on Richardson diffusion, we propose a simple fractional diffusion equation to describe the turbulent advection of an initial passive scalar distribution. These predictions agree well with the measurements from simulations, and vary with turbulent Mach number in the expected manner, remaining valid even in the presence of a large-scale shear flow (e.g. rotation in a galactic disc). The evolution of the scalar distribution is not the same as obtained using simple, constant ‘effective diffusivity’ as in Smagorinsky models, because the scale dependence of turbulent transport means an initially Gaussian distribution quickly develops highly non-Gaussian tails. We also emphasize that these are mean scalings that apply only to ensemble behaviours (assuming many different, random scalar injection sites): individual Lagrangian ‘patches’ remain coherent (poorly mixed) and simply advect for a large number of turbulent flow-crossing times.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251449","docid":251449,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250756","fileid":1250756,"datasetid":"document","objectid":251449,"filename":"stx261.pdf","mime_type":"application/pdf","hash":"559b052ec39be0292a7891ec2fcf3840","hash_type":"MD5","filesize":1025061,"mtime":"2017-04-28 17:19:16","url":"http://authors.library.caltech.edu/77053/1/stx261.pdf"}],"eprintid":77053,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"stx261.pdf","content":"published"}],"note":"© 2017 The Authors. Published by Oxford University Press on behalf of the Royal Astronomical Society. \n\nAccepted 2017 January 27. Received 2017 January 24; in original form 2016 October 18. \n\nSupport for MJC was provided by the Caltech Scholars Program/SURF at Caltech and St John's College, Cambridge. Support for PFH \u0026 XM was provided by an Alfred P. Sloan Research Fellowship, NASA ATP Grant NNX14AH35G and NSF Collaborative Research Grant #1411920 and CAREER grant #1455342. Support for JS was provided by the Sherman Fairchild foundation, and by the Gordon and Betty Moore Foundation through Grant GBMF5076 to Lars Bildsten, Eliot Quataert and E. Sterl Phinney. Numerical calculations were run on the Caltech compute cluster ‘Zwicky’ (NSF MRI award #PHY-0960291) and allocation TG-AST130039 granted by the Extreme Science and Engineering Discovery Environment (XSEDE) supported by the NSF.","id":77053,"rev_number":7,"userid":772,"eprint_dir":"disk0/00/07/70/53","datestamp":"2017-04-28 17:34:23","lastmod":"2017-04-28 17:34:23","status_changed":"2017-04-28 17:34:23","type":"article","metadata_visibility":"show","creators":[{"given":"Matthew J.","family":"Colbrook","id":"Colbrook-M-J","orcid":""},{"given":"Xiangcheng","family":"Ma","id":"Ma-Xiangcheng","orcid":""},{"given":"Philip F.","family":"Hopkins","id":"Hopkins-P-F","orcid":""},{"given":"Jonathan","family":"Squire","id":"Squire-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05","date_type":"published","publication":"Monthly Notices of the Royal Astronomical Society","volume":"467","number":"2","pagerange":"2421-2429","id_number":"CaltechAUTHORS:20170428-101904354","refereed":true,"issn":"0035-8711","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-101904354","related_url":[{"url":"https://doi.org/10.1093/mnras/stx261","type":"doi","description":"Article"},{"url":"https://academic.oup.com/mnras/article/467/2/2421/2966024/Scaling-laws-of-passive-scalar-diffusion-in-the?searchresult=1","type":"pub","description":"Article"}],"referencetext":["Balakrishnan V., 1985, Physica A: Stat. Mech. Appl., 132, 569\nBalescu R., 1995, Physical Review E, 51, 4807\nBanerjee S., Galtier S., 2013, PhRvE, 87, 013019\nBatchelor G. K., 1949, Aust. J. Sci. Res. A Phys. Sci., 2, 437\nBauer A., Springel V., 2012, MNRAS, 423, 2558\nCho J., Lazarian A., 2002, Phys. Rev. Lett., 88, 245001\ndel Castillo-Negrete D., Carreras B., Lynch V., 2005, Phys. Rev. Lett., 94,\n065003\nEyink G. et al., 2013, Nature, 497, 466\nFalkovich G., Fouxon I., Oz Y., 2010, J. Fluid Mech., 644, 465\nFederrath C., Klessen R. S., Schmidt W., 2008, ApJ, 688, L79\nFederrath C., Roman-Duval J., Klessen R. S., SchmidtW., Mac Low M.-M.,\n2010, A\u0026A, 512, A81\nFederrath C., Schober J., Bovino S., Schleicher D. R. G., 2014, ApJ, 797,\nL19\nFujita Y., Takizawa M., Sarazin C. L., 2003, ApJ, 584, 190\nGaltier S., Banerjee S., 2011, Phys. Rev. Lett., 107, 134501\nGuan X., Gammie C. F., 2008, ApJS, 174, 145\nHopkins P. F., 2013, MNRAS, 430, 1653\nHopkins P. F., 2015a, MNRAS, 462, 576\nHopkins P. F., 2015b, MNRAS, 450, 53\nHopkins P. F., Raives M. J., 2016, MNRAS, 455, 51\nIvezi´c ˇ Z., Beers T. C., Juri´c M., 2012, ARA\u0026A, 50, 251\nKlages R., Radons G., Sokolov I. M., 2008, Anomalous Transport: Foundations\nand Applications. John Wiley \u0026 Sons, New York\nKlessen R. S., Lin D. N., 2003, PhRvE, 67, 046311\nKowal G., Lazarian A., 2007a, in Shaikh D., Zank G. P., eds, AIP Conf.\nProc. Vol. 932, Turbulence and Nonlinear Processes in Astrophysical\nPlasmas. Am. Inst. Phys., New York, p. 421\nKowal G., Lazarian A., 2007b, BAAS, 39, 984\nKritsuk A. G., Norman M. L., Padoan P., Wagner R., 2007, ApJ, 665, 416\nKritsuk A. G., Norman M. L., Padoan P., Wagner R., 2007a, ApJ, 665, 416\nKritsuk A. G., Padoan P., Wagner R., Norman M. L., 2007b, in Shaikh D.,\nZank G. P., eds, AIP Conf. Proc., Vol. 932, Turbulence and Nonlinear\nProcesses in Astrophysical Plasmas. Am. Inst. Phys., New York, p. 393\nKritsuk A. G. et al., 2011, ApJ, 737, 13\nKritsuk A. G., Lee C. T., Norman M. L., 2013a, MNRAS, 436, 3247\nKritsuk A. G., Wagner R., Norman M. L., 2013b, J. Fluid Mech., 729, 1\nLee H., Ryu D., Kim J., Jones T. W., Balsara D., 2003, ApJ, 594, 627\nMetzler R., Klafter J., 2000, Phys. Rep., 339, 1\nA. S., Iaglom A. M., 1975, Statistical fluid mechanics: Mechanics of Turbulence.\nMIT Press, Cambridge\nPan L., Scannapieco E., 2010, ApJ, 721, 1765\nPan L., Padoan P., Kritsuk A. G., 2009, Phys. Rev. Lett., 102, 034501\nPetit A. C., Krumholz M. R., Goldbaum N. J., Forbes J. C., 2015, MNRAS,\n449, 2588\nPrice D. J., Federrath C., 2010, MNRAS, 406, 1659\nRichardson L. F., 1926, Proc. R. Soc. A, 110, 709\nSawford B., 2001, Annu. Rev. Fluid Mech, 33, 289\nScannapieco E., Schneider R., Ferrara A., 2003, ApJ, 589, 35\nSchmidt W., Federrath C., Klessen R., 2008, Phys. Rev. Lett., 101, 194505\nSchmidt W., Federrath C., Hupp M., Kern S., Niemeyer J. C., 2009, A\u0026A,\n494, 127\nSchwarz C., Beetz C., Dreher J., Grauer R., 2010, Phys. Lett. A, 374, 1039\nShen S., Wadsley J., Stinson G., 2010, MNRAS, 407, 1581\nShraiman B. I., Siggia E. D., 2000, Nature, 405, 639\nSmagorinsky J., 1963, Mon. Weather Rev., 91, 99\nSpringel V., 2011, ARA\u0026A, 48, 391\nStanislavsky A. A., 2010, in Haubold H. J., Mathai A. M.,Astrophysics and\nSpace Science Proceedings, 20, 63\nTaylor G. I., 1922, Proc. London Math. Soc., s2, 196\nTremonti C. A. et al., 2004, ApJ, 613, 898\nWadsley J.W., Veeravalli G., Couchman H. M. P., 2008, MNRAS, 387, 427\nWagner R., Falkovich G., Kritsuk A. G., Norman M. L., 2012, J. Fluid\nMech., 713, 482\nYang C.-C., Krumholz M., 2012, ApJ, 758, 48"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Matthew J. Colbrook, Xiangcheng Ma, Philip F. Hopkins, Jonathan Squire; Scaling laws of passive-scalar diffusion in the interstellar medium. Mon Not R Astron Soc 2017; 467 (2): 2421-2429. doi: 10.1093/mnras/stx261","other_numbering_system":null,"funders":[{"agency":"Caltech Summer Undergraduate Research Fellowship (SURF)","grant_number":""},{"agency":"Alfred P. Sloan Foundation","grant_number":""},{"agency":"NASA","grant_number":"NNX14AH35G"},{"agency":"NSF","grant_number":"AST-1411920"},{"agency":"NSF","grant_number":"AST-1455342"},{"agency":"Sherman Fairchild Foundation","grant_number":""},{"agency":"Gordon and Betty Moore Foundation","grant_number":"GBMF5076"},{"agency":"NSF","grant_number":"PHY-0960291"},{"agency":"St. John's College, Cambridge","grant_number":""},{"agency":"NSF","grant_number":"AST-130039"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}