{"title":"Rough-wall turbulent boundary layers with constant skin friction","uri":"","abstract":"A semi-empirical model is presented that describes the development of a fully developed turbulent boundary layer in the presence of surface roughness with length scale k_s that varies with streamwise distance x. Interest is centred on flows for which all terms of the von Kármán integral relation, including the ratio of outer velocity to friction velocity U^+_∞≡U_∞/u_τ, are streamwise constant. For Re_x assumed large, use is made of a simple log-wake model of the local turbulent mean-velocity profile that contains a standard mean-velocity correction for the asymptotic fully rough regime and with assumed constant parameter values. It is then shown that, for a general power-law external velocity variation U_∞∼x^m, all measures of the boundary-layer thickness must be proportional to x and that the surface sand-grain roughness scale variation must be the linear form k_s(x)=αx, where x is the distance from the boundary layer of zero thickness and α is a dimensionless constant. This is shown to give a two-parameter (m,α) family of solutions, for which U^+_∞ (or equivalently C_f) and boundary-layer thicknesses can be simply calculated. These correspond to perfectly self-similar boundary-layer growth in the streamwise direction with similarity variable z/(αx), where z is the wall-normal coordinate. Results from this model over a range of α are discussed for several cases, including the zero-pressure-gradient (m=0) and sink-flow (m=−1) boundary layers. Trends observed in the model are supported by wall-modelled large-eddy simulation of the zero-pressure-gradient case for Re_x in the range 10^8−10^(10) and for four values of α. Linear streamwise growth of the displacement, momentum and nominal boundary-layer thicknesses is confirmed, while, for each α, the mean-velocity profiles and streamwise turbulent variances are found to collapse reasonably well onto z/(αx)z. For given α, calculations of U^+_∞ obtained from large-eddy simulations are streamwise constant and independent of Re_x when this is large. The present results suggest that, in the sense that U^+_∞(α,m) is constant, these flows can be interpreted as the fully rough limit for boundary layers in the presence of small-scale linear roughness.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251483","docid":251483,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1251047","fileid":1251047,"datasetid":"document","objectid":251483,"filename":"roughwall_turbulent_boundary_layers_with_constant_skin_friction.pdf","mime_type":"application/pdf","hash":"b78fca4e5354f2c2efe8f1e5fc10ce6b","hash_type":"MD5","filesize":930756,"mtime":"2017-04-28 20:38:19","url":"http://authors.library.caltech.edu/77062/1/roughwall_turbulent_boundary_layers_with_constant_skin_friction.pdf"}],"eprintid":77062,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"roughwall_turbulent_boundary_layers_with_constant_skin_friction.pdf","content":"published"}],"note":"© 2017 Cambridge University Press. \n\nReceived 9 June 2016; revised 23 February 2017; accepted 27 February 2017; first published online 28 March 2017. \n\nA.S. and D.I.P. were partially supported by the KAUST Office of Competitive Research Funds (OCRF) under award no. URF/1/1394-01 and partially by NSF award CBET 1235605. W.C. was supported by the KAUST OCRF under award no. URF/1/1394-01. The authors acknowledge helpful conversations with R. A. Antonia.","id":77062,"rev_number":13,"userid":18,"eprint_dir":"disk0/00/07/70/62","datestamp":"2017-04-28 20:59:32","lastmod":"2017-06-02 17:16:28","status_changed":"2017-04-28 20:59:32","type":"article","metadata_visibility":"show","creators":[{"given":"A.","family":"Sridhar","id":"Sridhar-A","orcid":""},{"given":"D. I.","family":"Pullin","id":"Pullin-D-I","orcid":""},{"given":"W.","family":"Cheng","id":"Cheng-W","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-05","date_type":"published","publication":"Journal of Fluid Mechanics","volume":"818","number":"","pagerange":"26-45","id_number":"CaltechAUTHORS:20170428-133814936","refereed":true,"issn":"0022-1120","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-133814936","related_url":[{"url":"https://doi.org/10.1017/jfm.2017.132","type":"doi","description":"Article"}],"referencetext":["Cheng, W. , Pullin, D. I.  \u0026 Samtaney, R. 2015 Large-eddy simulation of separation and reattachment of a flat plate turbulent boundary layer. J. Fluid Mech. 785, 78–108.\nChung, D.  \u0026 Pullin, D. I. 2009 Large-eddy simulation and wall-modeling of turbulent chanel flow. J. Fluid Mech. 631, 281–309.\nClauser, F. H. 1954 Turbulent boundary layers in adverse pressure gradients. J. Aero. Sci. 21, 91–108.\nColebrook, C. F. 1939 Turbulent flow in pipes, with particular reference to the transition region between the smooth and rough pipe laws. J. Inst. Civil Engrs Lond. 11, 133–156.\nColes, D. 1956 The law of the wake in the turbulent boundary layer. J. Fluid Mech. 1 (2), 191–226.\nColes, D. 1957 Remarks on the equilibrium turbulent boundary layer. J. Aero. Sci. 24, 495–506.\nGranville, P. S. 1958 The frictional resistance and turbulent boundary layer of rough surfaces. J. Ship Res. 2, 52–74.\nInoue, M.  \u0026 Pullin, D. I. 2011 Large-eddy simulation of the zero-pressure-gradient turbulent boundary layer up to Re0 = O (1012).\nJewkes, J. W. , Chung, Y. M.  \u0026 Carpenter, P. W. 2011 Modification to a turbulent inflow generation method for boundary-layer flows. AIAA J. 49 (1), 247–250.\nJiménez, J. 2004 Turbulent flows over rough walls. Annu. Rev. Fluid Mech. 36 (1), 173–196.\nJones, M. B. , Marusic, I.  \u0026 Perry, A. E. 2001 Evolution and structure of sink-flow turbulent boundary layers. J. Fluid Mech. 428, 1–27.\nKameda, T. , Mochizuki, S. , Osaka, H.  \u0026 Higaki, K. 2008 Realization of the turbulent boundary layer over the rough wall satisfied the conditions of complete similarity and its mean flow quantities. J. Fluid Sci. Technol. 3 (1), 31–42.\nKrogstad, P.-Å. , Antonia, R. A.  \u0026 Browne, L. W. B. 1992 Comparison between rough- and smooth-wall turbulent boundary layers. J. Fluid Mech. 245, 599–617.\nLund, T. S. , Wu, X.  \u0026 Squires, K. D. 1998 Generation of turbulent inflow data for spatially-developing boundary layer simulations. J. Comput. Phys. 140 (2), 233–258.\nLundgren, T. S. 1982 Strained spiral vortex model for turbulent fine structure. Phys. Fluids 25, 2193–2203.\nMisra, A.  \u0026 Pullin, D. I. 1997 A vortex-based subgrid stress model for large-eddy simulation. Phys. Fluids 9, 2443–2454.\nMoody, L. F. 1944 Friction factors for pipe flow. Trans. ASME 66 (8), 671–684.\nNikuradse, J. 1933 Law of the wall in rough pipes. NASA Tech. Memo. 1292.\nPerot, J. B. 1993 An analysis of the fractional step method. J. Comput. Phys. 108, 51–58.\nPope, S. B. 2002 Turbulent Flows. Cambridge University Press.\nPrandtl, L.  \u0026 Schlichting, H. 1934 Das widerstandsgesetz rauher platten. Werft, Reederei, Hafen 15 (1), 4.\nRotta, J. C. 1962 Turbulent boundary layers in incompressible flow. Prog. Aerosp. Sci. 2 (1), 1–219.\nSaito, N. , Pullin, D. I.  \u0026 Inoue, M. 2012 Large eddy simulation of smooth-wall, transitional and fully rough-wall channel flow. Phys. Fluids 24 (7), 075103.\nSpalart, P. R. , Moser, R. D.  \u0026 Rogers, M. M. 1991 Spectral methods for the Navier–Stokes equations with one infinite and two periodic directions. J. Comput. Phys. 96, 297–324.\nSquire, D. T. , Morrill-Winter, C. , Hutchins, N. , Schultz, M. P. , Klewicki, J. C.  \u0026 Marusic, I. 2016 Comparison of turbulent boundary layers over smooth and rough surfaces up to high Reynolds numbers. J. Fluid Mech. 795, 210–240.\nTalluru, K. M. , Djenidi, L. , Kamruzzaman, Md.  \u0026 Antonia, R. A. 2016 Self preservation in a zero pressure gradient rough-wall turbulent boundary layer. J. Fluid Mech. 788, 57–69."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"King Abdullah University of Science and Technology (KAUST)","grant_number":"URF/1/1394-01"},{"agency":"NSF","grant_number":"CBET-1235605"},{"agency":"King Abdullah University of Science and Technology (KAUST)","grant_number":"URF/1/1394-01"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}