{"title":"The IRX–β Relation: Insights from Simulations","uri":"","abstract":"We study the relationship between the UV continuum slope and infrared excess (IRX ≡ L_(IR)/L_(FUV)) predicted by performing dust radiative transfer on a suite of hydrodynamical simulations of galaxies. Our suite includes both isolated disk galaxies and mergers intended to be representative of galaxies at both z ~ 0 and z ~ 2-3. Our low-redshift systems often populate a region around the locally calibrated Meurer et al. relation but move above the relation during merger-induced starbursts. Our high-redshift systems are blue and IR luminous and therefore lie above the Meurer et al. relation. The value of β strongly depends on the dust type used in the RT simulation: Milky-Way-type dust leads to significantly more negative (bluer) slopes compared with Small-Magellanic-Cloud-type dust. The effect on β due to variations in the dust composition with galaxy properties or redshift is the dominant model uncertainty. The dispersion in β is anticorrelated with specific star formation rate (sSFR) and tends to be higher for the z ~ 2-3 simulations. In the actively star-forming z ~ 2-3 simulated galaxies, dust attenuation dominates the dispersion in β, whereas in the z ~ 0 simulations, the contributions of star formation history (SFH) variations and dust are similar. For low-sSFR systems at both redshifts, SFH variations dominate the dispersion. Finally, the simulated z ~ 2-3 isolated disks and mergers both occupy a region in the IRX-β plane consistent with observed z ~ 2-3 dusty star-forming galaxies (DSFGs). Thus, contrary to some claims in the literature, the blue colors of high-z DSFGs do not imply that they are short-lived starbursts.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251480","docid":251480,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1251023","fileid":1251023,"datasetid":"document","objectid":251480,"filename":"1604.07402.pdf","mime_type":"application/pdf","hash":"a8b113d46461460908d0503e442fb102","hash_type":"MD5","filesize":3007337,"mtime":"2017-04-28 20:10:32","url":"http://authors.library.caltech.edu/77060/1/1604.07402.pdf"}],"eprintid":77060,"pos":1,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1604.07402.pdf","content":"submitted"},{"id":"http://authors.library.caltech.edu/id/document/251481","docid":251481,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1251025","fileid":1251025,"datasetid":"document","objectid":251481,"filename":"Safarzadeh_2017_ApJ_840_15.pdf","mime_type":"application/pdf","hash":"7be6a133c355f00eb4c77176936f03ef","hash_type":"MD5","filesize":2645795,"mtime":"2017-04-28 20:10:38","url":"http://authors.library.caltech.edu/77060/2/Safarzadeh_2017_ApJ_840_15.pdf"}],"eprintid":77060,"pos":2,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Safarzadeh_2017_ApJ_840_15.pdf","content":"published"}],"note":"© 2017 The American Astronomical Society. \n\nReceived 2016 April 25; revised 2017 April 3; accepted 2017 April 6; published 2017 April 28. \n\nWe thank Patrik Jonsson for insightful discussions. We are thankful to Caitlin Casey for providing us with data in electronic form. The Flatiron Institute is supported by the Simons Foundation. C.C.H. is grateful to the Gordon and Betty Moore Foundation for financial support. This work was partially supported by NASA's Astrophysics Data Analysis Program under grant NNX15AE54G. The computations in this paper were run on the Odyssey cluster supported by the FAS Division of Science, Research Computing Group at Harvard University. This research has made use of NASA's Astrophysics Data System Bibliographic Services and the arXiv.org preprint server.","id":77060,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/70/60","datestamp":"2017-04-28 20:29:07","lastmod":"2017-04-28 20:29:07","status_changed":"2017-04-28 20:29:07","type":"article","metadata_visibility":"show","creators":[{"given":"Mohammadtaher","family":"Safarzadeh","id":"Safarzadeh-M","orcid":""},{"given":"Christopher C.","family":"Hayward","id":"Hayward-C-C","orcid":"0000-0003-4073-3236"},{"given":"Henry C.","family":"Ferguson","id":"Ferguson-H-C","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"dust, extinction – infrared: galaxies – radiative transfer – ultraviolet: galaxies","date":"2017-05-01","date_type":"published","publication":"Astrophysical Journal","volume":"840","number":"1","pagerange":"Art. No. 15","id_number":"CaltechAUTHORS:20170428-130941321","refereed":true,"issn":"1538-4357","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-130941321","related_url":[{"url":"https://doi.org/10.3847/1538-4357/aa6c5b","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-4357/aa6c5b/meta","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1604.07402","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Agertz O. and Kravtsov A. V. 2015 ApJ 804 18\nIOPscienceADS  \n\n\nÁlvarez-Márquez J., Burgarella D., Heinis S. et al 2016 A\u0026A 587 A122\nCrossrefADS  \n\n\nBattisti A. J., Calzetti D. and Chary R. R. 2016 ApJ 818 13\nIOPscienceADS  \n\n\nBell E. F., Gordon K. D., Kennicutt R. C. J. and Zaritsky D. 2002 ApJ 565 994\nIOPscienceADS  \n\n\nBooth C. M., Agertz O., Kravtsov A. V. and Gnedin N. Y. 2013 ApJL 777 L16\nIOPscienceADS  \n\n\nBoquien M., Buat V., Boselli A. et al 2012 A\u0026A 539 A145\nCrossrefADS  \n\n\nBouwens R. J., Illingworth G. D., Franx M. et al 2009 ApJ 705 936\nIOPscienceADS  \n\n\nBouwens R. J., Illingworth G. D., Oesch P. A. et al 2012 ApJ 754 83\nIOPscienceADS  \n\n\nBouwens R. J., Illingworth G. D., Oesch P. A. et al 2014 ApJ 793 115\nIOPscienceADS  \n\n\nBuat V., Giovannoli E., Heinis S. et al 2011 A\u0026A 533 A93\nCrossrefADS  \n\n\nCalzetti D., Kinney A. L. and Storchi-Bergmann T. 1994 ApJ 429 582\nCrossrefADS  \n\n\nCapak P. L., Carilli C., Jones G. et al 2015 Natur 522 455\nCrossrefADS  \n\n\nCasey C. M., Scoville N. Z., Sanders D. B. et al 2014 ApJ 796 95\nIOPscienceADS  \n\n\nConroy C., Schiminovich D. and Blanton M. R. 2010 ApJ 718 184\nIOPscienceADS  \n\n\nCortese L., Boselli A., Buat V. et al 2006 ApJ 637 242\nIOPscienceADS  \n\n\nCox T. J., Jonsson P., Somerville R. S., Primack J. R. and Dekel A. 2008 MNRAS 384 386\nCrossrefADS  \n\n\nda Cunha E., Walter F., Smail I. R. et al 2015 ApJ 806 110\nIOPscienceADS  \n\n\nDale D. A., Gil de Paz A., Gordon K. D. et al 2007 ApJ 655 863\nIOPscienceADS  \n\n\nDraine B. T. and Li A. 2007 ApJ 657 810\nIOPscienceADS  \n\n\nDunlop J. S., McLure R. J., Robertson B. E. et al 2012 MNRAS 420 901\nCrossrefADS  \n\n\nDwek E. 1998 ApJ 501 643\nIOPscienceADS  \n\n\nFaucher-Giguère C.-A., Quataert E. and Hopkins P. F. 2013 MNRAS 433 1970\nCrossrefADS  \n\n\nFinkelstein S. L., Papovich C., Salmon B. et al 2012 ApJ 756 164\nIOPscienceADS  \n\n\nFumagalli M., Labbe I., Patel S. G. et al 2013 arXiv:1308.4132\nPreprint\n\n\nGnedin N. Y. 2014 MNRAS 793 29\nIOPscienceADS  \n\n\nGoldader J. D., Meurer G., Heckman T. M. et al 2002 ApJ 568 651\nIOPscienceADS  \n\n\nGordon K. D., Calzetti D. and Witt A. N. 1997 ApJ 487 625\nIOPscienceADS  \n\n\nGranato G. L., Lacey C. G., Silva L. et al 2000 ApJ 542 710\nIOPscienceADS  \n\n\nGrasha K., Calzetti D., Andrews J. E., Lee J. C. and Dale D. A. 2013 ApJ 773 174\nIOPscienceADS  \n\n\nGroves B., Dopita M. A., Sutherland R. S. et al 2008 ApJS 176 438\nIOPscienceADS  \n\n\nGroves B., Krause O., Sandstrom K. et al 2012 MNRAS 426 892\nCrossrefADS  \n\n\nHayward C. C., Behroozi P. S., Somerville R. S. et al 2013a MNRAS 434 2572\nCrossrefADS  \n\n\nHayward C. C. and Hopkins P. F. 2017 MNRAS 465 1682\nCrossrefADS  \n\n\nHayward C. C., Jonsson P., Kereš D. et al 2012 MNRAS 424 951\nCrossrefADS  \n\n\nHayward C. C., Kereš D., Jonsson P. et al 2011 ApJ 743 159\nIOPscienceADS  \n\n\nHayward C. C., Lanz L., Ashby M. L. N. et al 2014 MNRAS 445 1598\nCrossrefADS  \n\n\nHayward C. C., Narayanan D., Kereš D. et al 2013b MNRAS 428 2529\nCrossrefADS  \n\n\nHayward C. C. and Smith D. J. B. 2015 MNRAS 446 1512\nCrossrefADS  \n\n\nHayward C. C., Torrey P., Springel V., Hernquist L. and Vogelsberger M. 2014 MNRAS 442 1992\nCrossrefADS  \n\n\nHopkins P. F., Kere D., Oñorbe J. et al 2014 MNRAS 445 581\nCrossrefADS  \n\n\nHopkins P. F., Younger J. D., Hayward C. C., Narayanan D. and Hernquist L. 2010 MNRAS 402 1693\nCrossrefADS  \n\n\nHowell J. H., Armus L., Mazzarella J. M. et al 2010 ApJ 715 572\nIOPscienceADS  \n\n\nJames A., Dunne L., Eales S. and Edmunds M. G. 2002 MNRAS 335 753\nCrossrefADS  \n\n\nJonsson P. 2006 MNRAS 372 2\nCrossrefADS  \n\n\nJonsson P., Groves B. A. and Cox T. J. 2010 MNRAS 403 17\nCrossrefADS  \n\n\nKelson D. D. and Holden B. P. 2010 ApJL 713 L28\nIOPscienceADS  \n\n\nKennicutt R. C., Armus L., Bendo G. et al 2003 PASP 115 928\nIOPscienceADS  \n\n\nKhakhaleva-Li Z. and Gnedin N. Y. 2016 arXiv:1601.00641\nPreprint\n\n\nKong X., Charlot S., Brinchmann J. and Fall S. M. 2004 MNRAS 349 769\nCrossrefADS  \n\n\nKoprowski M. P., Dunlop J. S., Michałowski M. J. et al 2016 MNRAS 458 4321\nCrossrefADS  \n\n\nKriek M. and Conroy C. 2013 ApJL 775 L16\nIOPscienceADS  \n\n\nLanz L., Hayward C. C., Zezas A. et al 2014 ApJ 785 39\nIOPscienceADS  \n\n\nLeroy A. K., Bigiel F., de Blok W. J. G. et al 2012 AJ 144 3\nIOPscienceADS  \n\n\nMao Y.-W., Kennicutt R. C. J., Hao C.-N., Kong X. and Zhou X. 2012 ApJ 757 52\nIOPscienceADS  \n\n\nMao Y.-W., Kong X. and Lin L. 2014 ApJ 789 76\nIOPscienceADS  \n\n\nMartínez-Galarza J. R., Smith H. A., Lanz L. et al 2016 ApJ 817 76\nIOPscienceADS  \n\n\nMcKinnon R., Torrey P. and Vogelsberger M. 2016a MNRAS 457 3775\nCrossrefADS  \n\n\nMcKinnon R., Torrey P., Vogelsberger M., Hayward C. C. and Marinacci F. 2016b arXiv:1606.02714\nPreprint\n\n\nMeurer G. R., Heckman T. M. and Calzetti D. 1999 ApJ 521 64\nIOPscienceADS  \n\n\nMotta V., Mediavilla E., Muñoz J. A. et al 2002 ApJ 574 719\nIOPscienceADS  \n\n\nMuratov A. L., Keres D., Faucher-Giguere C.-A. et al 2015 arXiv:1501.03155\nPreprint\n\n\nNarayanan D., Dey A., Hayward C. C. et al 2010 MNRAS 407 1701\nCrossrefADS  \n\n\nNoll S., Pierini D., Cimatti A. et al 2009 A\u0026A 499 69\nCrossrefADS  \n\n\nOteo I., Cepa J., Bongiovanni A. et al 2013 A\u0026A 554 L3\nCrossrefADS  \n\n\nOverzier R. A., Heckman T. M., Wang J. et al 2011 ApJL 726 L7\nIOPscienceADS  \n\n\nPadin S. 2014 ApOpt 53 4431\nCrossrefADS  \n\n\nPettini M., Steidel C. C., Adelberger K. L., Dickinson M. and Giavalisco M. 2000 ApJ 528 96\nIOPscienceADS  \n\n\nReddy N., Dickinson M., Elbaz D. et al 2012 ApJ 744 154\nIOPscienceADS  \n\n\nRobertson B., Hernquist L., Cox T. J. et al 2006 ApJ 641 90\nIOPscienceADS  \n\n\nRocha M., Jonsson P., Primack J. R. and Cox T. J. 2008 MNRAS 383 1281\nCrossrefADS  \n\n\nRoebuck E., Sajina A., Hayward C. C. et al 2016 ApJ 833 60\nIOPscienceADS  \n\n\nSafarzadeh M., Ferguson H. C., Lu Y., Inami H. and Somerville R. S. 2015 ApJ 798 91\nIOPscienceADS  \n\n\nSafarzadeh M., Hayward C. C., Ferguson H. C. and Somerville R. S. 2016 ApJ 818 62\nIOPscienceADS  \n\n\nSalim S., Dickinson M., Rich R. M. et al 2009 ApJ 700 161\nIOPscienceADS  \n\n\nScoville N., Aussel H., Brusa M. et al 2007 ApJS 172 1\nIOPscienceADS  \n\n\nShapley A. E. 2011 ARA\u0026A 49 525\nCrossrefADS  \n\n\nSilva L., Granato G. L., Bressan A. and Danese L. 1998 ApJ 509 103\nIOPscienceADS  \n\n\nSmail I., Swinbank A. M., Richard J. et al 2007 ApJL 654 L33\nIOPscienceADS  \n\n\nSmith D. J. B., Dunne L., da Cunha E. et al 2012 MNRAS 427 703\nCrossrefADS  \n\n\nSnyder G. F., Cox T. J., Hayward C. C., Hernquist L. and Jonsson P. 2011 MNRAS 741 77\nIOPscienceADS  \n\n\nSnyder G. F., Hayward C. C., Sajina A. et al 2013 ApJ 768 168\nIOPscienceADS  \n\n\nSparre M., Hayward C. C., Feldmann R. et al 2015a arXiv:1510.03869\nPreprint\n\n\nSparre M., Hayward C. C., Springel V. et al 2015b MNRAS 447 3548\nCrossrefADS  \n\n\nSparre M. and Springel V. 2016 MNRAS 462 2418\nCrossrefADS  \n\n\nSpringel V. 2005 MNRAS 364 1105\nCrossrefADS  \n\n\nSpringel V., Di Matteo T. and Hernquist L. 2005 MNRAS 361 776\nCrossrefADS  \n\n\nSpringel V. and Hernquist L. 2003 MNRAS 339 289\nCrossrefADS  \n\n\nSteidel C. C., Giavalisco M., Pettini M., Dickinson M. and Adelberger K. L. 1996 ApJL 462 L17\nIOPscienceADS  \n\n\nTakeuchi T. T., Yuan F.-T., Ikeyama A., Murata K. L. and Inoue A. K. 2012 ApJ 755 144\nIOPscienceADS  \n\n\nUtomo D., Kriek M., Labbé I., Conroy C. and Fumagalli M. 2014 ApJL 783 L30\nIOPscienceADS  \n\n\nWatson D., Christensen L., Knudsen K. K. et al 2015 Natur 519 327\nCrossrefADS  \n\n\nWitt A. N. and Gordon K. D. 1996 ApJ 463 681\nCrossrefADS  \n\n\nWuyts S., Franx M., Cox T. J. et al 2009 MNRAS 700 799\nIOPscienceADS  \n\n\nYounger J. D., Hayward C. C., Narayanan D. et al 2009 MNRAS 396 L66\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Mohammadtaher Safarzadeh et al 2017 ApJ 840 15","other_numbering_system":null,"funders":[{"agency":"Simons Foundation","grant_number":""},{"agency":"Gordon and Betty Moore Foundation","grant_number":""},{"agency":"NASA","grant_number":"NNX15AE54G"},{"agency":"Harvard University","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["TAPIR"]}