{"title":"The ionization conjecture in Thomas-Fermi-Dirac-von Weizsäcker theory","uri":"","abstract":"We prove that in Thomas-Fermi-Dirac-von Weizsäcker theory, a nucleus of charge Z\u003e0 can bind at most Z+C electrons, where C is a universal constant. This result is obtained through a comparison with Thomas-Fermi theory which, as a by-product, gives bounds on the screened nuclear potential and the radius of the minimizer. A key ingredient of the proof is a novel technique to control the particles in the exterior region, which also applies to the liquid drop model with a nuclear background potential.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251517","docid":251517,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1251308","fileid":1251308,"datasetid":"document","objectid":251517,"filename":"1606.07355.pdf","mime_type":"application/pdf","hash":"a5aecb1ed7a36ea154aac2494461df01","hash_type":"MD5","filesize":348580,"mtime":"2017-05-01 15:31:50","url":"http://authors.library.caltech.edu/77090/1/1606.07355.pdf"}],"eprintid":77090,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1606.07355.pdf","content":"submitted"}],"note":"We thank the referee for helpful suggestions which improved the presentation of the paper. Partial support by U.S. National Science Foundation DMS-1363432 (R.L.F.), Austrian Science Fund (FWF) Project Nr. P 27533-N27 (P.T.N.), CONICYT (Chile) through CONICYT–PCHA/Doctorado Nacional/2014 and Iniciativa Científica Milenio (Chile) through Millenium Nucleus RC–120002 “Física Matemática” (H.V.D.B.) is acknowledged.","id":77090,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/70/90","datestamp":"2017-05-01 16:08:34","lastmod":"2017-05-01 16:08:34","status_changed":"2017-05-01 16:08:34","type":"monograph","metadata_visibility":"show","creators":[{"given":"Rupert L.","family":"Frank","id":"Frank-R-L","orcid":""},{"given":"Phan Thành","family":"Nam","id":"Nam-Phan-Thành","orcid":""},{"given":"Hanne","family":"Van Den Bosch","id":"Van-Den-Bosch-H","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2016-06-23","date_type":"submitted","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170501-083145482","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170501-083145482","related_url":[{"url":"https://arxiv.org/abs/1606.07355","type":"arxiv","description":"Discussion Paper"}],"referencetext":["[1] V. Bach, Error bound for the Hartree-Fock energy of atoms and molecules. Commun.\nMath. Phys. 147 (1992), 527–548.\n[2] R. D. Benguria, H. Brezis and E. H. Lieb, The Thomas-Fermi-von Weizs¨acker theory\nof atoms and molecules. Commun. Math. Phys. 79 (1981), 167–180.\n[3] R. D. Benguria and E. H. Lieb, The most negative ion in the Thomas-Fermi-von\nWeizs¨acker theory of atoms and molecules, J. Phys. B 18 (1984), 1045–1059.\n[4] C. Le Bris, Some results on the Thomas-Fermi-Dirac-von Weizs¨acker model., Differential\nIntegral Equations 6 (1993), 337–352.\n[5] R. Choksi and M. A. Peletier, Small volume fraction limit of the diblock copolymer\nproblem: I. Sharp-interface functional. SIAM J. Math. Anal. 42 (2010), 1334–1370.\n[6] P. A. M. Dirac, Note on Exchange Phenomena in the Thomas Atom, Proc. Cambridge\nPhilos. Soc. 26 (1930), no. 3, 376–385.\n[7] C. Fefferman and L. A. Seco, Asymptotic neutrality of large ions, Commun. Math.\nPhys. 128 (1990), 109–130.\n[8] C. Fefferman and L. A. Seco, On the energy of a large atom, Bulletin of the A.M.S.\n23 (1990), 525–530.\n[9] E. Fermi, Un Metodo Statistico per la Determinazione di alcune Priopriet`a\ndell’Atomo, Rend. Accad. Naz. Lincei 6 (1927), 602–607.\n[10] R.L. Frank and E.H. Lieb, A Compactness Lemma and Its Application to the Existence\nof Minimizers for the Liquid Drop Model. SIAM J. Math. Anal. 47 (2015), no.\n6, 4436–4450.\n[11] R.L. Frank, R. Killip and P.T. Nam, Nonexistence of large nuclei in the liquid drop\nmodel. Lett. Math. Phys. 106 (2016), 1033–1036.\n[12] W. Hughes, An atomic energy bound that gives Scott’s correction. Adv. in Math. 79\n(1990), 213–270.\n[13] E. H. Lieb, Thomas-Fermi and related theories of atoms and molecules. Rev. Mod.\nPhys. 53 (1981), 603–641.\n[14] E. H. Lieb, Bound on the maximum negative ionization of atoms and molecules. Phys.\nRev. A 29 (1984), 3018–3028.\n[15] E. H. Lieb and M. Loss, Analysis, American Mathematical Society, Providence, RI,\n2001\n[16] E. H. Lieb and R. Seiringer, The Stability of Matter in Quantum Mechanics, Cambridge\nUniversity Press, 2010.\n[17] E. H. Lieb, I. M. Sigal, B. Simon, andW. Thirring, Approximate neutrality of large-Z\nions. Commun. Math. Phys. 116 (1988), 635–644.\n[18] E. H. Lieb and B. Simon, The Thomas-Fermi theory of atoms, molecules and solids.\nAdv. in Math. 23 (1977), pp. 22–116.\n[19] P.-L. Lions, Solutions of Hartree-Fock equations for Coulomb systems. Commun.\nMath. Phys. 109 (1987), 33–97.\n[20] J. Lu and F. Otto, Nonexistence of a minimizer for Thomas-Fermi-Dirac-von\nWeizs¨acker model. Comm. Pure Appl. Math. 67 (2014), 1605–1617.\n[21] J. Lu and F. Otto, An isoperimetric problem with Coulomb repulsion and attraction\nto a background nucleus. Preprint 2015, arXiv:1508.07172.\n[22] P. T. Nam, New bounds on the maximum ionization of atoms. Commun. Math. Phys.\n312 (2012), 427–445.\n[23] P. T. Nam and H. Van Den Bosch, Nonexistence in Thomas-Fermi-Dirac-von\nWeizs¨acker theory with small nuclear charges. Math. Phys. Anal. Geom. 20 (2017),\nin press. DOI:10.1007/s11040-017-9238-0.\n[24] M. B. Ruskai, Absence of discrete spectrum in highly negative ions: II. Extension to\nfermions. Commun. Math. Phys. 85 (1982), 325–327.\n[25] . Schwinger, Thomas-Fermi model: The second correction. Phys. Rev. A 24 (1981),\n2353–2361.\n[26] J. M. C. Scott, The binding energy of the Thomas-Fermi atom. Phys. Rev. 43 (1952),\n859–867.\n[27] L. A. Seco, I. M. Sigal and J. P. Solovej, Bound on the ionization energy of large\natoms. Commun. Math. Phys. 131 (1990), 307–315.\n[28] H. Siedentop and R. Weikard, On the leading energy correction for the statistical\nmodel of an atom: interacting case. Commun. Math. Phys. 112 (1987), 471–490.\n[29] H. Siedentop and R. Weikard On the leading correction of the Thomas-Fermi model:\nlower bound. With an appendix by A. M. Klaus M¨uller. Invent. Math. 97 (1989),\n159–193.\n[30] I. M. Sigal, Geometric methods in the quantum many-body problem. Non existence\nof very negative ions. Commun. Math. Phys. 85 (1982), 309–324.\n[31] B. Simon, Schr¨odinger operators in the twenty-first century, Mathematical Physics\n2000, pp. 283–288, A. Fokas, A. Grigoryan, T. Kibble, and B. Zegarlinski. eds.,\nImperial College Press, London, 2000.\n[32] J. P. Solovej, Universality in the Thomas-Fermi-von Weizs¨acker model of atoms and\nmolecules. Commun. Math. Phys. 129 (1990), 561–598.\n[33] J. P. Solovej, The ionization conjecture in Hartree-Fock theory. Ann. of Math. (2)\n158 (2003), no. 2, 509–576.\n[34] E. Teller, On the Stability of molecules in the Thomas-Fermi theory. Rev. Mod. Phys.\n34 (1962), no. 4, 627–631.\n[35] L. H. Thomas, The calculation of atomic fields. Proc. Cambridge Phil. Soc.23 (1927),\nno. 5, 542–548.\n[36] C. F. Weizs¨acker, Zur Theorie der Kernmassen. Zeitschrift f¨ur Physik 96 (1935),\n431–458."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"DMS-1363432"},{"agency":"FWF Der Wissenschaftsfonds","grant_number":"P 27533-N27"},{"agency":"Comisión Nacional de Investigación Científica y Tecnológica (CONICYT)","grant_number":""},{"agency":"Iniciativa Científica Milenio","grant_number":"RC-120002"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}