{"title":"Color Me Intrigued: the Discovery of iPTF 16fnm, a Supernova 2002cx-like Object","uri":"","abstract":"Modern wide-field, optical time-domain surveys must solve a basic\noptimization problem: maximize the number of transient discoveries or minimize\nthe follow-up needed for the new discoveries. Here, we describe the Color Me\nIntrigued experiment, the first from the intermediate Palomar Transient Factory\n(iPTF) to search for transients simultaneously in the $g_\\mathrm{PTF}$- and\n$R_\\mathrm{PTF}$-bands. During the course of this experiment we discovered\niPTF$\\,$16fnm, a new member of the 02cx-like subclass of type Ia supernovae\n(SNe). iPTF$\\,$16fnm peaked at $M_{g_\\mathrm{PTF}} = -15.09 \\pm 0.17 \\;\n\\mathrm{mag}$, making it the second least-luminous known type Ia SN. iPTF 16fnm\nexhibits all the hallmarks of the 02cx-like class: (i) low luminosity at peak,\n(ii) low ejecta velocities, and (iii) a non-nebular spectra several months\nafter peak. Spectroscopically, iPTF$\\,$16fnm exhibits a striking resemblence to\n2 other low-luminosity 02cx-like SNe: SNe 2007qd and 2010ae. iPTF$\\,$16fnm and\nSN 2005hk decline at nearly the same rate, despite a 3 mag difference in\nbrightness at peak. When considering the full subclass of 02cx-like SNe, we do\nnot find evidence for a tight correlation between peak luminosity and decline\nrate in either the $g'$ or $r'$ band. We further examine the $g' - r'$\nevolution of 02cx-like SNe and find that their unique color evolution can be\nused to separate them from 91bg-like and normal type Ia SNe. This selection\nfunction will be especially important in the spectroscopically incomplete\nZwicky Transient Facility/Large Synoptic Survey Telescope era. We measure the\nrelative rate of 02cx-like SNe to normal SNe Ia and find $r_{N_{02cx}/N_{Ia}} =\n25^{+75}_{-18.5}\\%$. Finally, we close by recommending that LSST periodically\nevaluate, and possibly update, its observing cadence to maximize transient\nscience.\n","documents":[{"id":"http://authors.library.caltech.edu/id/document/251558","docid":251558,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1251664","fileid":1251664,"datasetid":"document","objectid":251558,"filename":"1703.07449.pdf","mime_type":"application/pdf","hash":"3b592d8781c3d33affb9427ab623c254","hash_type":"MD5","filesize":1523537,"mtime":"2017-05-01 21:47:00","url":"http://authors.library.caltech.edu/77109/1/1703.07449.pdf"}],"eprintid":77109,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1703.07449.pdf","content":"submitted"}],"note":"We thank K. Shen for a useful discussion on the color evolution of Type Ia SNe. R. Amanullah pointed us\nto several useful papers on the color evolution of Type Ia SNe, for which we are grateful. Finally, we thank J. Nordin for examining the spectra of type Ia SNe found during Color Me Intrigued. The Intermediate Palomar Transient Factory project is a scientific collaboration among the California Institute of Technology, Los Alamos National Laboratory, the University of Wisconsin, Milwaukee, the Oskar Klein Center, the Weizmann Institute of Science, the TANGO Program of the University System of Taiwan, and the Kavli Institute for the Physics and Mathematics of the Universe. This work was supported by the GROWTH project funded by the National Science Foundation under Grant No 1545949. Part of this research was carried out at the Jet Propulsion Laboratory, California Institute\nof Technology, under a contract with NASA. Some of the data presented here were obtained in part\nwith ALFOSC, which is provided by the Instituto de Astrofisica de Andalucia (IAA) under a joint agreement with the University of Copenhagen and NOTSA. Some of the data presented herein were obtained at the W.M. Keck Observatory, which is operated as a scientific\npartnership among the California Institute of Technology, the University of California and NASA. The Observatory was made possible by the generous financial support of the W.M. Keck Foundation.\nThe authors wish to recognize and acknowledge the\nvery significant cultural role and reverence that the summit\nof Mauna Kea has always had within the indigenous\nHawaiian community. We are most fortunate to have the\nopportunity to conduct observations from this mountain.\nThis research has made use of the NASA/IPAC Extragalactic\nDatabase (NED), which is operated by the Jet\nPropulsion Laboratory, California Institute of Technology,\nunder contract with NASA.","id":77109,"rev_number":9,"userid":999,"eprint_dir":"disk0/00/07/71/09","datestamp":"2017-05-01 22:04:35","lastmod":"2017-05-17 20:24:52","status_changed":"2017-05-01 22:04:35","type":"monograph","metadata_visibility":"show","creators":[{"given":"A. A.","family":"Miller","id":"Miller-A-A","orcid":""},{"given":"M. M.","family":"Kasliwal","id":"Kasliwal-M-M","orcid":"0000-0002-5619-4938"},{"given":"Y.","family":"Cao","id":"Cao-Yi","orcid":""},{"given":"A.","family":"Goobar","id":"Goobar-A","orcid":""},{"given":"S.","family":"Knežević","id":"Knežević-S","orcid":""},{"given":"R. R.","family":"Laher","id":"Laher-R-R","orcid":""},{"given":"R.","family":"Lunnan","id":"Lunnan-R","orcid":"0000-0001-9454-4639"},{"given":"F. J.","family":"Masci","id":"Masci-F-J","orcid":"0000-0002-8532-9395"},{"given":"P. E.","family":"Nugent","id":"Nugent-P-E","orcid":""},{"given":"D. A.","family":"Perley","id":"Perley-D-A","orcid":""},{"given":"T.","family":"Petrushevska","id":"Petrushevska-T","orcid":""},{"given":"R. M.","family":"Quimby","id":"Quimby-R-M","orcid":""},{"given":"U. D.","family":"Rebbapragada","id":"Rebbapragada-U-D","orcid":""},{"given":"J .","family":"Sollerman","id":"Sollerman-J","orcid":""},{"given":"F.","family":"Taddia","id":"Taddia-F","orcid":""},{"given":"S. R.","family":"Kulkarni","id":"Kulkarni-S-R","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2017-03-21","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170501-143925844","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170501-143925844","related_url":[{"url":"http://arxiv.org/abs/1703.07449","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Astier, P., Guy, J., Regnault, N., et al. 2006, A\u0026A, 447, 31\nBarbary, K., Dawson, K. S., Tokita, K., et al. 2009, ApJ, 690,\n1358\nBellm, E. C. 2016, PASP, 128, 084501\nBellm, E. C., Prince, T. A., Miller, A., et al. 2016, in American\nAstronomical Society Meeting Abstracts, Vol. 227, American\nAstronomical Society Meeting Abstracts, 421.07\nBen-Ami, S., Konidaris, N., Quimby, R., et al. 2012, in\nProc. SPIE, Vol. 8446, Ground-based and Airborne\nInstrumentation for Astronomy IV, 844686\nBlagorodnova, N., Gezari, S., Hung, T., et al. 2017, ArXiv\ne-prints, arXiv:1703.00965 [astro-ph.HE]\nBlondin, S., \u0026 Tonry, J. L. 2007, ApJ, 666, 1024\nBloom, J. S., Kasen, D., Shen, K. J., et al. 2012a, ApJ, 744, L17\nBloom, J. S., Richards, J. W., Nugent, P. E., et al. 2012b, PASP,\n124, 1175\nBrink, H., Richards, J. W., Poznanski, D., et al. 2013, MNRAS,\n435, 1047\nCao, Y., Kulkarni, S. R., Gal-Yam, A., et al. 2016a, ApJ, 832, 86\nCao, Y., Nugent, P. E., \u0026 Kasliwal, M. M. 2016b, PASP, 128,\n114502\nCenko, S. B., Kulkarni, S. R., Horesh, A., et al. 2013, ApJ, 769,\n130\nChambers, K. C., Magnier, E. A., Metcalfe, N., et al. 2016, ArXiv\ne-prints, arXiv:1612.05560 [astro-ph.IM]\nCook, D. O., Kasliwal, M. M., Van Sistine, A., et al. 2017, in\nAmerican Astronomical Society Meeting Abstracts, Vol. 229,\nAmerican Astronomical Society Meeting Abstracts, 237.08\nFilippenko, A. V. 1997, ARA\u0026A, 35, 309\nFink, M., Kromer, M., Seitenzahl, I. R., et al. 2014, MNRAS,\n438, 1762\nFolatelli, G., Morrell, N., Phillips, M. M., et al. 2013, ApJ, 773, 53\nFoley, R. J., Brown, P. J., Rest, A., et al. 2010, ApJ, 708, L61\nFoley, R. J., Chornock, R., Filippenko, A. V., et al. 2009, AJ,\n138, 376\nFoley, R. J., Challis, P. J., Chornock, R., et al. 2013, ApJ, 767, 57\nFrieman, J. A., Bassett, B., Becker, A., et al. 2008, AJ, 135, 338\nGaneshalingam, M., Li, W., Filippenko, A. V., et al. 2012, ApJ,\n751, 142\nHillebrandt, W., Kromer, M., R¨opke, F. K., \u0026 Ruiter, A. J. 2013,\nFrontiers of Physics, 8, 116\nIvezi´c, Z., Tyson, J. A., Acosta, E., et al. 2008, ArXiv e-prints, ˇ\narXiv:0805.2366\nJones, D. O., Scolnic, D. M., Riess, A. G., et al. 2016, ArXiv\ne-prints, arXiv:1611.07042\nKasliwal, M. M. 2011, PhD thesis, California Institute of\nTechnology\n—. 2012, PASA, 29, 482\nKessler, R., Marriner, J., Childress, M., et al. 2015, AJ, 150, 172\nKromer, M., Fink, M., Stanishev, V., et al. 2013, MNRAS, 429,\n2287\nKulkarni, S. R. 2013, The Astronomer’s Telegram, 4807\nKulkarni, S. R. 2016, in American Astronomical Society Meeting\nAbstracts, Vol. 227, American Astronomical Society Meeting\nAbstracts, 314.01\nLaw, N. M., Kulkarni, S. R., Dekany, R. G., et al. 2009, PASP,\n121, 1395\nLi, W., Filippenko, A. V., Chornock, R., et al. 2003, PASP, 115,\n453\nLi, W., Leaman, J., Chornock, R., et al. 2011, MNRAS, 412, 1441\nLira, P. 1996, Master’s thesis, MS thesis. Univ. Chile (1996)\nMagee, M. R., Kotak, R., Sim, S. A., et al. 2016, A\u0026A, 589, A89\n—. 2017, ArXiv e-prints, arXiv:1701.05459 [astro-ph.HE]\nMasci, F. J., Laher, R. R., Rebbapragada, U. D., et al. 2017,\nPASP, 129, 014002\nMazzali, P. A., R¨opke, F. K., Benetti, S., \u0026 Hillebrandt, W. 2007,\nScience, 315, 825\nMcClelland, C. M., Garnavich, P. M., Galbany, L., et al. 2010,\nApJ, 720, 704\nMiller, A. A., Richards, J. W., Bloom, J. S., et al. 2012, ApJ, 755,\n98\nMoriya, T., Tominaga, N., Tanaka, M., et al. 2010, ApJ, 719, 1445\nMould, J. R., Huchra, J. P., Freedman, W. L., et al. 2000, ApJ,\n529, 786\nNarayan, G., Foley, R. J., Berger, E., et al. 2011, ApJ, 731, L11\nNugent, P. E., Sullivan, M., Cenko, S. B., et al. 2011, Nature,\n480, 344\nOfek, E. O., Laher, R., Law, N., et al. 2012, PASP, 124, 62\nOke, J. B., \u0026 Gunn, J. E. 1982, PASP, 94, 586\nOke, J. B., Cohen, J. G., Carr, M., et al. 1995, PASP, 107, 375\nPerlmutter, S., Aldering, G., Goldhaber, G., et al. 1999, ApJ,\n517, 565\nPhillips, M. M. 1993, ApJ, 413, L105\nPhillips, M. M., Lira, P., Suntzeff, N. B., et al. 1999, AJ, 118, 1766\nPhillips, M. M., Li, W., Frieman, J. A., et al. 2007, PASP, 119,\n360\nPoznanski, D., Gal-Yam, A., Maoz, D., et al. 2002, PASP, 114,\n833\nQuimby, R. M., Kulkarni, S. R\nRiess, A. G., Filippenko, A. V., Challis, P., et al. 1998, AJ, 116,\n1009\nSchlafly, E. F., \u0026 Finkbeiner, D. P. 2011, ApJ, 737, 103\nSchlegel, D. J., Finkbeiner, D. P., \u0026 Davis, M. 1998, ApJ, 500,\n525\nShappee, B. J., Prieto, J. L., Grupe, D., et al. 2014, ApJ, 788, 48\nStritzinger, M. D., Hsiao, E., Valenti, S., et al. 2014, A\u0026A, 561,\nA146\nStritzinger, M. D., Valenti, S., Hoeflich, P., et al. 2015, A\u0026A, 573,\nA2\nValenti, S., Pastorello, A., Cappellaro, E., et al. 2009, Nature,\n459, 674\nWang, X., Filippenko, A. V., Ganeshalingam, M., et al. 2009,\nApJ, 699, L139\nWegner, G., Haynes, M. P., \u0026 Giovanelli, R. 1993, AJ, 105, 1251\nWhite, C. J., Kasliwal, M. M., Nugent, P. E., et al. 2015, ApJ,\n799, 52\nYaron, O., \u0026 Gal-Yam, A. 2012, PASP, 124, 668"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"OISE-1545949"},{"agency":"NASA","grant_number":""},{"agency":"W. M. Keck Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["IPTF"]}