{"title":"Cloud Structure of Three Galactic Infrared Dark Star-forming Regions from Combining Ground- and Space-based Bolometric Observations","uri":"","abstract":"We have modified the iterative procedure introduced by Lin et al., to systematically combine the submillimeter images taken from ground-based (e.g., CSO, JCMT, APEX) and space (e.g., Herschel, Planck) telescopes. We applied the updated procedure to observations of three well-studied Infrared Dark Clouds (IRDCs): G11.11−0.12, G14.225−0.506, and G28.34+0.06, and then performed single-component, modified blackbody fits to each pixel to derive ~10'' resolution dust temperature and column density maps. The derived column density maps show that these three IRDCs exhibit complex filamentary structures embedded with rich clumps/cores. We compared the column density probability distribution functions (N-PDFs) and two-point correlation (2PT) functions of the column density field between these IRDCs with several OB-cluster-forming regions. Based on the observed correlation between the luminosity-to-mass ratio and the power-law index of the N-PDF, and complementary hydrodynamical simulations for a 10^4 M_⊙ molecular cloud, we hypothesize that cloud evolution can be better characterized by the evolution of the (column) density distribution function and the relative power of dense structures as a function of spatial scales, rather than merely based on the presence of star-forming activity. An important component of our approach is to provide a model-independent quantification of cloud evolution. Based on the small analyzed sample, we propose four evolutionary stages, namely, cloud integration, stellar assembly, cloud pre-dispersal, and dispersed cloud. The initial cloud integration stage and the final dispersed cloud stage may be distinguished from the two intermediate stages by a steeper than −4 power-law index of the N-PDF. The cloud integration stage and the subsequent stellar assembly stage are further distinguished from each other by the larger luminosity-to-mass ratio (\u003e40 L_⊙/M_⊙) of the latter. A future large survey of molecular clouds with high angular resolution may establish more precise evolutionary tracks in the parameter space of N-PDF, 2PT function, and luminosity-to-mass ratio.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251612","docid":251612,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1252291","fileid":1252291,"datasetid":"document","objectid":251612,"filename":"Lin_2017_ApJ_840_22.pdf","mime_type":"application/pdf","hash":"fd6e29df87cdb757a00e127cb6bd7287","hash_type":"MD5","filesize":4885228,"mtime":"2017-05-02 20:38:03","url":"http://authors.library.caltech.edu/77129/1/Lin_2017_ApJ_840_22.pdf"}],"eprintid":77129,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Lin_2017_ApJ_840_22.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251613","docid":251613,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1252295","fileid":1252295,"datasetid":"document","objectid":251613,"filename":"1704.06448.pdf","mime_type":"application/pdf","hash":"8704340f0dbb384335e73fa99f6ceb67","hash_type":"MD5","filesize":6313607,"mtime":"2017-05-02 20:39:21","url":"http://authors.library.caltech.edu/77129/2/1704.06448.pdf"}],"eprintid":77129,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1704.06448.pdf","content":"submitted"}],"note":"© 2017 The American Astronomical Society. \n\nReceived 2016 October 29; revised 2017 April 6; accepted 2017 April 7; published 2017 May 2. \n\nWe are grateful to our referee for helpful comments that led to improvement of the paper. This work is partially supported by the International Partnership Program of Chinese Academy of Sciences, grant No. 114A11KYSB20160008 and National Natural Science Foundation of China No. 11373038. Y.X.L. acknowledge Bo Zhang and Guangxing Li for useful suggestions and discussions. G.B. acknowledges the support of the Spanish Ministerio de Enconomia y Competitividad (MINECO) under grant FPDI-2013-18204. G.B. is supported by the Spanish MINECO grant AYA2014-57369-C3-1-P. Z.Y.Z. acknowledges support from the European Research Council in the form of the Advanced Investigator Programme, 321302, cosmicism. R.G.-M. acknowledges support from UNAM-PAPIIT program IA102817. K.W. acknowledges support from Deutsche Forschungsgemeinschaft (DFG) grant WA3628-1/1 through priority program 1573 (Physics of the Interstellar Medium). The JCMT is operated by the East Asian Observatory on behalf of The National Astronomical Observatory of Japan, Academia Sinica Institute of Astronomy and Astrophysics, the Korea Astronomy and Space Science Institute, the National Astronomical Observatories of China and the Chinese Academy of Sciences (grant No. XDB09000000), with additional funding support from the Science and Technology Facilities Council of the United Kingdom and participating universities in the United Kingdom and Canada. The JCMT has historically been operated by the Joint Astronomy Centre on behalf of the Science and Technology Facilities Council of the United Kingdom, the National Research Council of Canada and the Netherlands Organization for Scientific Research. Additional funds for the construction of Q2 SCUBA-2 were provided by the Canada Foundation for Innovation.","id":77129,"rev_number":12,"userid":18,"eprint_dir":"disk0/00/07/71/29","datestamp":"2017-05-02 21:42:53","lastmod":"2017-05-02 21:42:53","status_changed":"2017-05-02 21:42:53","type":"article","metadata_visibility":"show","creators":[{"given":"Yuxin","family":"Lin","id":"Lin-Yuxin","orcid":""},{"given":"Hauyu Baobab","family":"Liu","id":"Liu-Hauyu-Baobab","orcid":""},{"given":"James E.","family":"Dale","id":"Dale-J-E","orcid":""},{"given":"Di","family":"Li","id":"Li-Di","orcid":""},{"given":"Gemma","family":"Busquet","id":"Busquet-G","orcid":""},{"given":"Zhi-Yu","family":"Zhang","id":"Zhang-Zhi-Yu","orcid":""},{"given":"Adam","family":"Ginsburg","id":"Ginsburg-A","orcid":""},{"given":"Roberto","family":"Galván-Madrid","id":"Galván-Madrid-R","orcid":""},{"given":"Attila","family":"Kovács","id":"Kovács-A","orcid":""},{"given":"Eric","family":"Koch","id":"Koch-E","orcid":""},{"given":"Lei","family":"Qian","id":"Qian-Lei","orcid":""},{"given":"Ke","family":"Wang","id":"Wang-Ke","orcid":""},{"given":"Steve","family":"Longmore","id":"Longmore-S","orcid":""},{"given":"Huei-Ru","family":"Chen","id":"Chen-Huei-Ru","orcid":""},{"given":"Daniel","family":"Walker","id":"Walker-D","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"ISM: structure – stars: formation – submillimeter: ISM","date":"2017-05-01","date_type":"published","publication":"Astrophysical Journal","volume":"840","number":"1","pagerange":"Art. No. 22","id_number":"CaltechAUTHORS:20170502-133729026","refereed":true,"issn":"1538-4357","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170502-133729026","related_url":[{"url":"https://doi.org/10.3847/1538-4357/aa6c67","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-4357/aa6c67/meta","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1704.06448","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Alstott J., Bullmore E. and Plenz D. 2014 PLoS One 9 e85777\nCrossrefADS  \n\n\nAndré P., Minier V., Gallais P. et al 2008 A\u0026A 490 L27\nCrossrefADS  \n\n\nBallesteros-Paredes J., Vázquez-Semadeni E., Gazol A. et al 2011 MNRAS 416 1436\nCrossrefADS  \n\n\nBurkhart B., Collins D. C. and Lazarian A. 2015 ApJ 808 48\nIOPscienceADS  \n\n\nBusquet G., Estalella R., Palau A. et al 2016 ApJ 819 139\nIOPscienceADS  \n\n\nBusquet G., Zhang Q., Palau A. et al 2013 ApJL 764 L26\nIOPscienceADS  \n\n\nButler M. J., Tan J. C. and Kainulainen J. 2014 ApJL 782 L30\nIOPscienceADS  \n\n\nCarey S. J., Clark F. O., Egan M. P. et al 1998 ApJ 508 721\nIOPscienceADS  \n\n\nCarey S. J., Feldman P. A., Redman R. O. et al 2000 ApJL 543 L157\nIOPscienceADS  \n\n\nChapin E. L., Berry D. S., Gibb A. G. et al 2013 MNRAS 430 2545\nCrossrefADS  \n\n\nChen H.-R., Liu S.-Y., Su Y.-N. and Wang M.-Y. 2011 ApJ 743 196\nIOPscienceADS  \n\n\nClauset A., Rohilla Shalizi C. and Newman M. E. J. 2009 SIAMR 51 661\nCrossrefADS  \n\n\nDale J. E., Ercolano B. and Bonnell I. A. 2015 MNRAS 451 987\nCrossrefADS  \n\n\nDempsey J. T., Friberg P., Jenness T. et al 2013 MNRAS 430 2534\nCrossrefADS  \n\n\nFederrath C., Klessen R. S. and Schmidt W. 2009 ApJ 692 364\nIOPscienceADS  \n\n\nFeng S., Beuther H., Zhang Q. et al 2016 ApJ 828 100\nIOPscienceADS  \n\n\nGao Y. and Solomon P. M. 2004 ApJ 606 271\nIOPscienceADS  \n\n\nGinsburg A., Bally J., Battersby C. et al 2015 A\u0026A 573 A106\nCrossrefADS  \n\n\nGinsburg A., Goss W. M., Goddi C. et al 2016 A\u0026A 595 A27\nCrossrefADS  \n\n\nGriffin M. J., Abergel A., Abreu A. et al 2010 A\u0026A 518 L3\nCrossrefADS  \n\n\nHennebelle P., Pérault M., Teyssier D. and Ganesh S. 2001 A\u0026A 365 598\nCrossrefADS  \n\n\nHenning T., Linz H., Krause O. et al 2010 A\u0026A 518 L95\nCrossrefADS  \n\n\nHildebrand R. H. 1983 QJRAS 24 267\nADS  \n\n\nHolland W. S., Bintley D., Chapin E. L. et al 2013 MNRAS 430 2513\nCrossrefADS  \n\n\nInutsuka S.-I. and Miyama S. M. 1997 ApJ 480 681\nIOPscienceADS  \n\n\nKainulainen J., Federrath C. and Henning T. 2013a A\u0026A 553 L8\nCrossrefADS  \n\n\nKainulainen J., Ragan S. E., Henning T. and Stutz A. 2013b A\u0026A 557 A120\nCrossrefADS  \n\n\nKainulainen J. and Tan J. C. 2013 A\u0026A 549 A53\nCrossrefADS  \n\n\nKauffmann J. and Pillai T. 2010 ApJL 723 L7\nIOPscienceADS  \n\n\nKleiner S. C. and Dickman R. L. 1984 ApJ 286 255\nCrossrefADS  \n\n\nKlessen R. S. 2000 ApJ 535 869\nIOPscienceADS  \n\n\nKóvacs A. 2008 Proc. SPIE 7020 70201S\nCrossrefADS  \n\n\nKritsuk A. G., Norman M. L. and Wagner R. 2011 ApJL 727 L20\nIOPscienceADS  \n\n\nLada C. J., Lombardi M. and Alves J. F. 2010 ApJ 724 687\nIOPscienceADS  \n\n\nLee Y.-N. and Hennebelle P. 2016 A\u0026A 591 A30\nCrossrefADS  \n\n\nLin Y., Liu H. B., Li D. et al 2016 ApJ 828 32\nIOPscienceADS  \n\n\nLiu H. B., Galván-Madrid R., Jiménez-Serra I. et al 2015 ApJ 804 37\nIOPscienceADS  \n\n\nLiu H. B., Jiménez-Serra I., Ho P. T. P. et al 2012a ApJ 756 10\nIOPscienceADS  \n\n\nLiu H. B., Quintana-Lacaci G., Wang K. et al 2012b ApJ 745 61\nIOPscienceADS  \n\n\nLombardi M., Alves J. and Lada C. J. 2015 A\u0026A 576 L1\nCrossrefADS  \n\n\nLu X., Zhang Q., Liu H. B., Wang J. and Gu Q. 2014 ApJ 790 84\nIOPscienceADS  \n\n\nMolina F. Z., Glover S. C. O., Federrath C. and Klessen R. S. 2012 MNRAS 423 2680\nCrossrefADS  \n\n\nMolinari S., Merello M., Elia D. et al 2016 ApJL 826 L8\nIOPscienceADS  \n\n\nMolinari S., Pezzuto S., Cesaroni R. et al 2008 A\u0026A 481 345\nCrossrefADS  \n\n\nMolinari S., Swinyard B., Bally J. et al 2010 A\u0026A 518 L100\nCrossrefADS  \n\n\nMyers P. C. 2015 ApJ 806 226\nIOPscienceADS  \n\n\nNakamura F. and Li Z.-Y. 2008 ApJ 687 354\nIOPscienceADS  \n\n\nOssenkopf V. and Henning T. 1994 A\u0026A 291 943\nADS  \n\n\nPeretto N. and Fuller G. A. 2009 A\u0026A 505 405\nCrossrefADS  \n\n\nPillai T., Kauffmann J., Tan J. C. et al 2015 ApJ 799 74\nIOPscienceADS  \n\n\nPillai T., Wyrowski F., Menten K. M. and Krügel E. 2006 A\u0026A 447 929\nCrossrefADS  \n\n\nPlanck Collaboration, Abergel A., Ade P. A. R. et al 2011 A\u0026A 536 A25\nCrossrefADS  \n\n\nPlanck Collaboration, Ade P. A. R., Aghanim N. et al 2014 A\u0026A 564 A45\nCrossrefADS  \n\n\nPlanck HFI Core Team, Ade P. A. R., Aghanim N. et al 2011a A\u0026A 536 A6\nCrossrefADS  \n\n\nPlanck HFI Core Team, Ade P. A. R., Aghanim N. et al 2011b A\u0026A 536 A4\nCrossrefADS  \n\n\nPoglitsch A., Waelkens C., Geis N. et al 2010 A\u0026A 518 L2\nCrossrefADS  \n\n\nRagan S. E., Bergin E. A., Plume R. et al 2006 ApJS 166 567\nIOPscienceADS  \n\n\nRosero V., Hofner P., McCoy M. et al 2014 ApJ 796 130\nIOPscienceADS  \n\n\nSantos F. P., Busquet G., Franco G. A. P., Girart J. M. and Zhang Q. 2016 ApJ 832 186\nIOPscienceADS  \n\n\nSchneider N., Csengeri T., Klessen R. S. et al 2015 A\u0026A 578 A29\nCrossrefADS  \n\n\nSimon R., Rathborne J. M., Shah R. Y., Jackson J. M. and Chambers E. T. 2006 ApJ 653 1325\nIOPscienceADS  \n\n\nSiringo G., Kreysa E., Kovács A. et al 2009 A\u0026A 497 945\nCrossrefADS  \n\n\nSridharan T. K., Beuther H., Saito M., Wyrowski F. and Schilke P. 2005 ApJL 634 L57\nIOPscienceADS  \n\n\nStutz A. M. and Gould A. 2016 A\u0026A 590 A2\nCrossrefADS  \n\n\nStutz A. M. and Kainulainen J. 2015 A\u0026A 577 L6\nCrossrefADS  \n\n\nTackenberg J., Beuther H., Henning T. et al 2014 A\u0026A 565 A101\nCrossrefADS  \n\n\nVazquez-Semadeni E. 1994 ApJ 423 681\nCrossrefADS  \n\n\nVázquez-Semadeni E., Gómez G. C., Jappsen A. K. et al 2007 ApJ 657 870\nIOPscienceADS  \n\n\nVázquez-Semadeni E., Gómez G. C., Jappsen A.-K., Ballesteros-Paredes J. and Klessen R. S. 2009 ApJ 707 1023\nIOPscienceADS  \n\n\nWang K. 2015 The Earliest Stages of Massive Clustered Star Formation: Fragmentation of Infrared Dark Clouds: Springer Theses (Berlin: Springer)\nADS  \n\n\nWang K., Zhang Q., Testi L. et al 2014 MNRAS 439 3275\nCrossrefADS  \n\n\nWang K., Zhang Q., Wu Y., Li H.-B. and Zhang H. 2012 ApJL 745 L30\nIOPscienceADS  \n\n\nWang K., Zhang Q., Wu Y. and Zhang H. 2011 ApJ 735 64\nIOPscienceADS  \n\n\nWang Y., Zhang Q., Pillai T., Wyrowski F. and Wu Y. 2008 ApJL 672 L33\nIOPscienceADS  \n\n\nWu J., Evans N. J. II, Gao Y. et al 2005 ApJL 635 L173\nIOPscienceADS  \n\n\nWu Y. W., Sato M., Reid M. J. et al 2014 A\u0026A 566 A17\nCrossrefADS  \n\n\nXu Y., Moscadelli L., Reid M. J. et al 2011 ApJ 733 25\nIOPscienceADS  \n\n\nZacchei A., Maino D., Baccigalupi C. et al 2011 A\u0026A 536 A5\nCrossrefADS  \n\n\nZhang Q., Wang K., Lu X. and Jiménez-Serra I. 2015 ApJ 804 141\nIOPscienceADS  \n\n\nZhang Q., Wang Y., Pillai T. and Rathborne J. 2009 ApJ 696 268\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Yuxin Lin et al 2017 ApJ 840 22","other_numbering_system":null,"funders":[{"agency":"Chinese Academy of Sciences","grant_number":"114A11KYSB20160008"},{"agency":"National Natural Science Foundation of China","grant_number":"11373038"},{"agency":"Ministerio de Economía y Competitividad (MINECO)","grant_number":"FPDI-2013-18204"},{"agency":"Ministerio de Economía y Competitividad (MINECO)","grant_number":"AYA2014-57369-C3-1-P"},{"agency":"European Research Council (ERC)","grant_number":"321302"},{"agency":"Universidad Nacional Autónoma de México","grant_number":"IA102817"},{"agency":"Deutsche Forschungsgemeinschaft (DFG) ","grant_number":"WA3628-1/1"},{"agency":"Chinese Academy of Sciences","grant_number":"XDB09000000"},{"agency":"Science and Technology Facilities Council (STFC)","grant_number":""},{"agency":"Canada Foundation for Innovation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}