{"title":"The Hawaii SCUBA-2 Lensing Cluster Survey: Radio-detected Submillimeter Galaxies in the HST Frontier Fields","uri":"","abstract":"In this second paper of the Hawaii SCUBA-2 Lensing Cluster Survey series, we cross-match SCUBA-2 maps with 3 and 6 GHz images from the Janksy-VLA Frontier Fields Legacy Survey for three cluster fields, MACS J0416.1–2403, MACS J0717.5+3745, and MACS J1149.5+2223. Within the HST coverage, 14 out of 44 850 μm sources have 3 GHz counterparts, five of which are also detected at 6 GHz. The 850 μm flux densities of these detected sources span from 0.7 to 4.4 mJy after correcting for lensing amplification. The median redshift of the sample is z = 1.28^(+0.07)_(-0.09), much lower than the typical redshifts (z = 2–3) of brighter submillimeter galaxies (SMGs) in the literature. In addition, we find that our sources have lower dust temperatures than those of the brighter SMGs. This is also confirmed by an analysis of the ratio between infrared star-formation rate and 850 μm flux density. However, these 14 sources may not represent the general submillimeter population at the same flux range, given that the SCUBA-2 sources without radio counterparts are likely at higher redshifts. Detection of these sources would require deeper radio images or submillimeter interferometry.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251609","docid":251609,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1252260","fileid":1252260,"datasetid":"document","objectid":251609,"filename":"Hsu_2017_ApJ_840_29.pdf","mime_type":"application/pdf","hash":"c2ee9ee53f25d3930585342eb9f9ed75","hash_type":"MD5","filesize":8483228,"mtime":"2017-05-02 20:12:59","url":"http://authors.library.caltech.edu/77128/1/Hsu_2017_ApJ_840_29.pdf"}],"eprintid":77128,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Hsu_2017_ApJ_840_29.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251610","docid":251610,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1252271","fileid":1252271,"datasetid":"document","objectid":251610,"filename":"1704.01159.pdf","mime_type":"application/pdf","hash":"7e18a53e2ec6bf1939236a394cef2cf9","hash_type":"MD5","filesize":7368325,"mtime":"2017-05-02 20:22:35","url":"http://authors.library.caltech.edu/77128/2/1704.01159.pdf"}],"eprintid":77128,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1704.01159.pdf","content":"submitted"}],"note":"© 2017 The American Astronomical Society. \n\nReceived 2016 December 18; revised 2017 April 3; accepted 2017 April 3; published 2017 May 2. \n\nWe gratefully acknowledge support from NSF grants AST-0709356 (L.Y.H. and L.L.C.) and AST-1313150 (A.J.B.), as well as the John Simon Guggenheim Memorial Foundation and Trustees of the William F. Vilas Estate (A.J.B.). I.R.S. acknowledges support from STFC (ST/L00075X/1), the ERC Advanced Investigator programme DUSTYGAL (321334), and a Royal Society/Wolfson Merit Award. The James Clerk Maxwell Telescope is operated by the East Asian Observatory on behalf of The National Astronomical Observatory of Japan, Academia Sinica Institute of Astronomy and Astrophysics, the Korea Astronomy and Space Science Institute, the National Astronomical Observatories of China and the Chinese Academy of Sciences (Grant No. XDB09000000), with additional funding support from the Science and Technology Facilities Council of the United Kingdom and participating universities in the United Kingdom and Canada. The James Clerk Maxwell Telescope has historically been operated by the Joint Astronomy Centre on behalf of the Science and Technology Facilities Council of the United Kingdom, the National Research Council of Canada and the Netherlands Organisation for Scientific Research. Additional funds for the construction of SCUBA-2 were provided by the Canada Foundation for Innovation. The National Radio Astronomy Observatory is a facility of the National Science Foundation operated under cooperative agreement by Associated Universities, Inc. We acknowledge the cultural significance that the summit of Maunakea has to the indigenous Hawaiian community.","id":77128,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/71/28","datestamp":"2017-05-02 20:25:11","lastmod":"2017-05-02 20:25:11","status_changed":"2017-05-02 20:25:11","type":"article","metadata_visibility":"show","creators":[{"given":"Li-Yen","family":"Hsu","id":"Hsu-Li-Yen","orcid":""},{"given":"Vandana","family":"Desai","id":"Desai-V-R","orcid":""},{"given":"Eric J.","family":"Murphy","id":"Murphy-E-J","orcid":""},{"given":"Lennox L.","family":"Cowie","id":"Cowie-L-L","orcid":""},{"given":"Ian","family":"Heywood","id":"Heywood-I","orcid":""},{"given":"Emmanuel","family":"Momjian","id":"Momjian-E","orcid":""},{"given":"Amy J.","family":"Barger","id":"Barger-A-J","orcid":""},{"given":"Ian","family":"Smail","id":"Smail-I","orcid":"0000-0003-3037-257X"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"cosmology: observations – galaxies: starburst – Galaxy: evolution – Galaxy: formation – gravitational lensing: strong – submillimeter: galaxies","date":"2017-05-01","date_type":"published","publication":"Astrophysical Journal","volume":"840","number":"1","pagerange":"Art. No. 29","id_number":"CaltechAUTHORS:20170502-131227157","refereed":true,"issn":"1538-4357","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170502-131227157","related_url":[{"url":"https://doi.org/10.3847/1538-4357/aa6ba0","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-4357/aa6ba0/meta","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1704.01159","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Balestra I., Mercurio A., Sartoris B. et al 2016 ApJS 224 33\nIOPscienceADS \nBarger A. J., Cowie L. L., Chen C.-C. et al 2014 ApJ 784 9\nIOPscienceADS \nBarger A. J., Cowie L. L. and Richards E. A. 2000 AJ 119 2092\nIOPscienceADS \nBarger A. J., Cowie L. L., Sanders D. B. et al 1998 Natur 394 248\nCrossrefADS \nBarger A. J., Wang W.-H., Cowie L. L. et al 2012 ApJ 761 89\nIOPscienceADS \nBenítez N. 2000 ApJ 536 571\nIOPscienceADS \nBenítez N., Ford H., Bouwens R. et al 2004 ApJS 150 1\nIOPscienceADS \nBertin E. and Arnouts S. 1996 A\u0026AS 117 393\nCrossrefADS \nBlain A. W. and Longair M. S. 1993 MNRAS 264 509\nCrossrefADS \nBlain A. W., Smail I., Ivison R. J., Kneib J.-P. and Frayer D. T. 2002 PhR 369 111\nCrossrefADS \nBradač M., Schneider P., Lombardi M. and Erben T. 2005 A\u0026A 437 39\nCrossrefADS \nBradač M., Treu T., Applegate D. et al 2009 ApJ 706 1201\nIOPscienceADS \nBrammer G. B., Marchesini D., Labbé I. et al 2016 ApJS 226 6\nIOPscienceADS \nBundy K., Ellis R. S., Conselice C. J. et al 2006 ApJ 651 120\nIOPscienceADS \nBussmann R. S., Riechers D., Fialkov A. et al 2015 ApJ 812 43\nIOPscienceADS \nCaputi K. I., Dunlop J. S., McLure R. J. et al 2012 ApJL 750 L20\nIOPscienceADS \nCasey C. M., Berta S., Béthermin M. et al 2012 ApJ 761 139\nIOPscienceADS \nCasey C. M., Chen C.-C., Cowie L. et al 2013 MNRAS 436 1919\nCrossrefADS \nCasey C. M., Narayanan D. and Cooray A. 2014 PhR 541 45\nCrossrefADS \nChapin E. L., Berry D. S., Gibb A. G. et al 2013 MNRAS 430 2545\nCrossrefADS \nChapman S. C., Blain A. W., Ivison R. J. and Smail I. R. 2003 Natur 422 695\nCrossrefADS \nChapman S. C., Blain A. W., Smail I. and Ivison R. J. 2005 ApJ 622 772\nIOPscienceADS \nChen C.-C., Cowie L. L., Barger A. J. et al 2013a ApJ 762 81\nIOPscienceADS \nChen C.-C., Cowie L. L., Barger A. J. et al 2013b ApJ 776 131\nIOPscienceADS \nChen C.-C., Smail I., Ivison R. J. et al 2016 ApJ 820 82\nIOPscienceADS \nCoe D., Benítez N., Sánchez S. F. et al 2006 AJ 132 926\nIOPscienceADS \nCoe D., Bradley L. and Zitrin A. 2015 ApJ 800 84\nIOPscienceADS \nCondon J. J. 1974 ApJ 188 279\nCrossrefADS \nCondon J. J. 1992 ARA\u0026A 30 575\nCrossrefADS \nCowie L. L., Barger A. J., Hsu L.-Y. et al 2017 ApJ 837 139\nIOPscienceADS \nCowie L. L., Barger A. J. and Kneib J.-P. 2002 AJ 123 2197\nIOPscienceADS \nCowie L. L., Songaila A., Hu E. M. and Cohen J. G. 1996 AJ 112 839\nCrossrefADS \nDannerbauer H., Lehnert M. D., Lutz D. et al 2004 ApJ 606 664\nIOPscienceADS \nDiego J. M., Broadhurst T., Benitez N. et al 2015 MNRAS 446 683\nCrossrefADS \nDiego J. M., Protopapas P., Sandvik H. B. and Tegmark M. 2005a MNRAS 360 477\nCrossrefADS \nDiego J. M., Sandvik H. B., Protopapas P. et al 2005b MNRAS 362 1247\nCrossrefADS \nDiego J. M., Tegmark M., Protopapas P. and Sandvik H. B. 2007 MNRAS 375 958\nCrossrefADS \nDownes A. J. B., Peacock J. A., Savage A. and Carrie D. R. 1986 MNRAS 218 31\nCrossrefADS \nDye S., Eales S. A., Aretxaga I. et al 2008 MNRAS 386 1107\nCrossrefADS \nEbeling H., Ma C.-J. and Barrett E. 2014 ApJS 211 21\nIOPscienceADS \nEddington A. S. 1913 MNRAS 73 359\nCrossrefADS \nFranceschini A., Rodighiero G., Cassata P. et al 2006 A\u0026A 453 397\nCrossrefADS \nFrayer D. T., Reddy N. A., Armus L. et al 2004 AJ 127 728\nIOPscienceADS \nFujimoto S., Ouchi M., Ono Y. et al 2016 ApJS 222 1\nIOPscienceADS \nGonzález-López J., Bauer F. E., Romero-Cañizales C. et al 2017 A\u0026A 597 A41\nCrossrefADS \nGrillo C., Suyu S. H., Rosati P. et al 2015 ApJ 800 38\nIOPscienceADS \nHeavens A., Panter B., Jimenez R. and Dunlop J. 2004 Natur 428 625\nCrossrefADS \nHelou G., Soifer B. T. and Rowan-Robinson M. 1985 ApJL 298 L7\nCrossrefADS \nHoag A., Huang K.-H., Treu T. et al 2016 ApJ 831 182\nIOPscienceADS \nHodge J. A., Karim A., Smail I. et al 2013 ApJ 768 91\nIOPscienceADS \nHogg D. W. 2001 AJ 121 1207\nIOPscienceADS \nHolland W. S., Bintley D., Chapin E. L. et al 2013 MNRAS 430 2513\nCrossrefADS \nHolland W. S., Robson E. I., Gear W. K. et al 1999 MNRAS 303 659\nCrossrefADS \nHsu L.-Y., Cowie L. L., Chen C.-C., Barger A. J. and Wang W.-H. 2016 ApJ 829 25\nIOPscienceADS \nHughes D. H., Serjeant S., Dunlop J. et al 1998 Natur 394 241\nCrossrefADS \nIbar E., Ivison R. J., Biggs A. D. et al 2009 MNRAS 397 281\nCrossrefADS \nIvison R. J., Alexander D. M., Biggs A. D. et al 2010a MNRAS 402 245\nCrossrefADS \nIvison R. J., Magnelli B., Ibar E. et al 2010b A\u0026A 518 L31\nCrossrefADS \nJauzac M., Clément B., Limousin M. et al 2014 MNRAS 443 1549\nCrossrefADS \nJauzac M., Jullo E., Eckert D. et al 2015a MNRAS 446 4132\nCrossrefADS \nJauzac M., Jullo E., Kneib J.-P. et al 2012 MNRAS 426 3369\nCrossrefADS \nJauzac M., Richard J., Jullo E. et al 2015b MNRAS 452 1437\nCrossrefADS \nJohansson D., Sigurdarson H. and Horellou C. 2011 A\u0026A 527 A117\nCrossrefADS \nJohnson T. L., Sharon K., Bayliss M. B. et al 2014 ApJ 797 48\nIOPscienceADS \nJullo E. and Kneib J.-P. 2009 MNRAS 395 1319\nCrossrefADS \nJullo E., Kneib J.-P., Limousin M. et al 2007 NJPh 9 447\nIOPscienceADS \nKawamata R., Oguri M., Ishigaki M., Shimasaku K. and Ouchi M. 2016 ApJ 819 114\nIOPscienceADS \nKnudsen K. K., van der Werf P. P. and Kneib J.-P. 2008 MNRAS 384 1611\nCrossrefADS \nKoprowski M., Dunlop J. S., Michalowski M. J. et al 2016 MNRAS 458 4321\nCrossrefADS \nKovács A., Chapman S. C., Dowell C. D. et al 2006 ApJ 650 592\nIOPscienceADS \nKroupa P. 2001 MNRAS 322 231\nCrossrefADS \nLee N., Sanders D. B., Casey C. M. et al 2013 ApJ 778 131\nIOPscienceADS \nLiesenborgs J., De Rijcke S. and Dejonghe H. 2006 MNRAS 367 1209\nCrossrefADS \nMagliocchetti M., Santini P., Rodighiero G. et al 2011 MNRAS 416 1105\nCrossrefADS \nMakovoz D. and Khan I. 2005 ASP Conf. Ser. 347, Astronomical Data Analysis Software and Systems XIV ed P. Shopbell, M. Britton and R. Ebert (San Francisco, CA: ASP) 81\nADS \nMakovoz D. and Marleau F. R. 2005 PASP 117 1113\nIOPscienceADS \nMakovoz D., Roby T., Khan I. and Booth H. 2006 Proc. SPIE 6274 62740C\nCrossrefADS \nMcMullin J. P., Waters B., Schiebel D., Young W. and Golap K. 2007 ASP Conf. Ser. 376, Astronomical Data Analysis Software and Systems XVI ed R. A. Shaw, F. Hill and D. J. Bell (San Francisco, CA: ASP) 127\nADS \nMerten J., Cacciato M., Meneghetti M., Mignone C. and Bartelmann M. 2009 A\u0026A 500 681\nCrossrefADS \nMerten J., Coe D., Dupke R. et al 2011 MNRAS 417 333\nCrossrefADS \nMobasher B., Dahlen T., Hopkins A. et al 2009 ApJ 690 1074\nIOPscienceADS \nMohammed I., Liesenborgs J., Saha P. and Williams L. L. R. 2014 MNRAS 439 2651\nCrossrefADS \nMomjian E., Wang W.-H., Knudsen K. K. et al 2010 AJ 139 1622\nIOPscienceADS \nMurphy E. J. 2009 ApJ 706 482\nIOPscienceADS \nMurphy E. J., Bremseth J., Mason B. S. et al 2012 ApJ 761 97\nIOPscienceADS \nMurphy E. J., Condon J. J., Schinnerer E. et al 2011 ApJ 737 67\nIOPscienceADS \nOffringa A. R., McKinley B., Hurley-Walker N. et al 2014 MNRAS 444 606\nCrossrefADS \nOguri M. 2010 PASJ 62 1017\nCrossrefADS \nPope A., Scott D., Dickinson M. et al 2006 MNRAS 370 1185\nCrossrefADS \nPostman M., Coe D., Benítez N. et al 2012 ApJS 199 25\nIOPscienceADS \nRawle T. D., Altieri B., Egami E. et al 2016 MNRAS 459 1626\nCrossrefADS \nRichard J., Jauzac M., Limousin M. et al 2014 MNRAS 444 268\nCrossrefADS \nRieke G. H., Alonso-Herrero A., Weiner B. J. et al 2009 ApJ 692 556\nIOPscienceADS \nSchlafly E. F. and Finkbeiner D. P. 2011 ApJ 737 103\nIOPscienceADS \nSchmidt K. B., Treu T., Brammer G. B. et al 2014 ApJL 782 L36\nIOPscienceADS \nSebesta K., Williams L. L. R., Mohammed I., Saha P. and Liesenborgs J. 2016 MNRAS 461 2126\nCrossrefADS \nSerjeant S., Dye S., Mortier A. et al 2008 MNRAS 386 1907\nCrossrefADS \nSimpson J. M., Smail I., Swinbank A. M. et al 2015 ApJ 807 128\nIOPscienceADS \nSimpson J. M., Swinbank A. M., Smail I. et al 2014 ApJ 788 125\nIOPscienceADS \nSmail I., Ivison R. J. and Blain A. W. 1997 ApJL 490 L5\nIOPscienceADS \nSmail I., Ivison R. J., Blain A. W. and Kneib J.-P. 2002 MNRAS 331 495\nCrossrefADS \nSmolčić V., Aravena M., Navarrete F. et al 2012 A\u0026A 548 A4\nCrossrefADS \nSymeonidis M., Vaccari M., Berta S. et al 2013 MNRAS 431 2317\nCrossrefADS \nTreu T., Schmidt K. B., Brammer G. B. et al 2015 ApJ 812 114\nIOPscienceADS \nU V., Sanders D. B., Mazzarella J. M. et al 2012 ApJS 203 9\nIOPscienceADS \nWang W.-H., Barger A. J. and Cowie L. L. 2012 ApJ 744 155\nIOPscienceADS \nWang W.-H., Cowie L. L. and Barger A. J. 2006 ApJ 647 74\nIOPscienceADS \nWang W.-H., Cowie L. L., Barger A. J. and Williams J. P. 2011 ApJL 726 L18\nIOPscienceADS \nWardlow J. L., Smail I., Coppin K. E. K. et al 2011 MNRAS 415 1479\nCrossrefADS \nWatson D., Christensen L., Knudsen K. K. et al 2015 Natur 519 327\nCrossrefADS \nWeiß A., De Breuck C., Marrone D. P. et al 2013 ApJ 767 88\nIOPscienceADS \nZitrin A., Broadhurst T., Umetsu K. et al 2009 MNRAS 396 1985\nCrossrefADS \nZitrin A., Meneghetti M., Umetsu K. et al 2013 ApJL 762 L30"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Li-Yen Hsu et al 2017 ApJ 840 29","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"AST-0709356"},{"agency":"NSF","grant_number":"AST-1313150"},{"agency":"John Simon Guggenheim Foundation","grant_number":""},{"agency":"William F. Vilas Estate","grant_number":""},{"agency":"Science and Technology Facilities Council (STFC)","grant_number":"ST/L00075X/1"},{"agency":"European Research Council (ERC)","grant_number":"321334"},{"agency":"Royal Society","grant_number":""},{"agency":"Chinese Academy of Sciences","grant_number":"XDB09000000"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Infrared Processing and Analysis Center (IPAC)"]}