{"title":"Automatic adaptivity in the fully nonlocal quasicontinuum method for coarse-grained atomistic simulations","uri":"","abstract":"The quasicontinuum (QC) method is a concurrent scale-bridging technique that extends atomistic accuracy to significantly larger length scales by reducing the full atomic ensemble to a small set of representative atoms and using interpolation to recover the motion of all lattice sites where full atomistic resolution is not necessary. While traditional QC methods thereby create interfaces between fully resolved and coarse-grained regions, the recently introduced fully nonlocal QC framework does not fundamentally differentiate between atomistic and coarsened domains. Adding adaptive refinement enables us to tie atomistic resolution to evolving regions of interest such as moving defects. However, model adaptivity is challenging because large particle motion is described based on a reference mesh (even in the atomistic regions). Unlike in the context of, for example, finite element meshes, adaptivity here requires that (i) all vertices lie on a discrete point set (the atomic lattice), (ii) model refinement is performed locally and provides sufficient mesh quality, and (iii) Verlet neighborhood updates in the atomistic domain are performed against a Lagrangian mesh. With the suite of adaptivity tools outlined here, the nonlocal QC method is shown to bridge across scales from atomistics to the continuum in a truly seamless fashion, as illustrated for nanoindentation and void growth.","documents":null,"note":"© 2016 John Wiley \u0026 Sons, Ltd. \n\nIssue online: 2 May 2017; Version of record online: 14 December 2016; Accepted manuscript online: 28 September 2016; Manuscript Accepted: 23 September 2016; Manuscript Revised: 1 September 2016; Manuscript Received: 26 March 2016. \n\nFunded by: National Science Foundation (NSF), Grant Number: CMMI-123436.","id":77145,"rev_number":5,"userid":18,"eprint_dir":"disk0/00/07/71/45","datestamp":"2017-05-03 17:49:56","lastmod":"2017-05-03 17:49:56","status_changed":"2017-05-03 17:49:56","type":"article","metadata_visibility":"show","creators":[{"given":"I.","family":"Tembhekar","id":"Tembhekar-I","orcid":""},{"given":"J. S.","family":"Amelang","id":"Amelang-J-S","orcid":""},{"given":"L.","family":"Munk","id":"Munk-L","orcid":""},{"given":"D. M.","family":"Kochmann","id":"Kochmann-D-M","orcid":"0000-0002-9112-6615"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"molecular mechanics; adaptivity; multiscale modeling; particle methods","date":"2017-06-01","date_type":"published","publication":"International Journal for Numerical Methods in Engineering","volume":"110","number":"9","pagerange":"878-900","id_number":"CaltechAUTHORS:20170503-094955128","refereed":true,"issn":"0029-5981","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170503-094955128","related_url":[{"url":"http://dx.doi.org/10.1002/nme.5438","type":"doi","description":"Article"},{"url":"http://onlinelibrary.wiley.com/doi/10.1002/nme.5438/abstract","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Tembhekar, I., Amelang, J. S., Munk, L., and Kochmann, D. M. (2017) Automatic adaptivity in the fully nonlocal quasicontinuum method for coarse-grained atomistic simulations. Int. J. Numer. Meth. Engng, 110: 878–900. doi: 10.1002/nme.5438","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"CMMI-123436"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}