{"title":"Identifying cancer-relevant DNA damage via a charge transfer mechanism involving [4Fe4S] cluster proteins","uri":"","abstract":"The goal of this project is to develop new in vitro and in vivo techniques to understand the mechanism by which teams of FeS cluster repair proteins detects DNA defects and upholds genome integrity. DNA defects, as arise with defective repair, lead to tumorous cell proliferation and cancerous disease development. My research objective aims at understanding the signaling and repair processes of damaged DNAs by a collection of [4Fe4S] proteins with the use of long range DNA mediated electron transfer. (A) Electrochem. using DNA modified multiplex electrode chip with 16 independently addressable gold working electrodes, ESR, and UV Vis spectroscopy to characterize proteins in various redox state. (B) Binding redistribution assay utilizing at. force microscopy specifically tailored to visualize the position of [4Fe4S] proteins on DNA and provide robust biophys. data at physiol. conditions. The redox properties and long range CT ability of DNA bound [4Fe4S] proteins is established. In particular, the oxidn. state of [4Fe4S] clusters modulates DNA binding and in turn controls protein activity. These initial studies support the mechanism that at least two proteins work in concert to\nscreen one DNA. For DNA with no mismatch or lesion, a cluster in the reduced state binds to one end of a DNA and reduces an oxidized cluster at the other end of the DNA. In the event of a base pair mismatch or lesion, electronic communication between two DNA bound clusters is disrupted. A signaling disruption increases the retention time of [4Fe4S] proteins on a defective DNA. Using a processive mechanism, these damage localized DNA binding proteins of similar redox potential work together to trace and repair the damage. This work not only delineates a distinct role for these redox active proteins in sensing and repairing DNA damage for cancer treatment, but also establishes DNA signaling as a new mechanistic framework for protein communication across the genome.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251681","docid":251681,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253165","fileid":1253165,"datasetid":"document","objectid":251681,"filename":"Tse_2017pINOR-742.pdf","mime_type":"application/pdf","hash":"f8a7ca9bd1397afe0ba0a6d8f30d12a9","hash_type":"MD5","filesize":91709,"mtime":"2017-05-03 21:49:29","url":"http://authors.library.caltech.edu/77168/1/Tse_2017pINOR-742.pdf"}],"eprintid":77168,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"Tse_2017pINOR-742.pdf","content":"published"}],"note":"© 2017 American Chemical Society.","id":77168,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/71/68","datestamp":"2017-05-04 01:33:10","lastmod":"2017-05-04 01:33:10","status_changed":"2017-05-04 01:33:10","type":"conference_item","metadata_visibility":"show","creators":[{"given":"Edmund C. M.","family":"Tse","id":"Tse-Edmund-C-M","orcid":""},{"given":"Jacqueline K.","family":"Barton","id":"Barton-J-K","orcid":"0000-0001-9883-1600"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-04","date_type":"published","publication":"","volume":"","number":"","pagerange":"INOR-742","id_number":"CaltechAUTHORS:20170503-144923412","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170503-144923412","related_url":[{"url":"https://www.acs.org/content/acs/en/meetings/spring-2017.html","type":"org","description":"Conference Website"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}