{"title":"Isotope fractionation associated with the simultaneous biodegradation of multiple nitrophenol isomers by Pseudomonas putida B2","uri":"","abstract":"Quantifying the extent of biodegradation of nitroaromatic compounds (NACs) in contaminated soils and sediments is challenging because of competing oxidative and reductive reaction pathways. We have previously shown that the stable isotope fractionation of NACs reveals the routes of degradation even if it is simultaneously caused by different bacteria. However, it is unclear whether compound-specific isotope analysis (CSIA) can be applied in situations where multiple pollutants are biodegraded by only one microorganism under multi-substrate conditions. Here we examined the C and N isotope fractionation of 2-nitrophenol (2-NP) and 3-nitrophenol (3-NP) during biodegradation by Pseudomonas putida B2 through monooxygenation and partial reductive pathways, respectively, in the presence of single substrates vs. binary substrate mixtures. Laboratory experiments showed that the reduction of 3-NP by Pseudomonas putida B2 is associated with large N and minor C isotope fractionation with C and N isotope enrichment factors, ε_C and ε_N, of −0.3 ± 0.1‰ and −22 ± 0.2‰, respectively. The opposite isotope fractionation trends were found for 2-NP monooxygenation. In the simultaneous presence of 2-NP and 3-NP, 2-NP is biodegraded at identical rate constants and ε_C and ε_N values (−1.0 ± 0.1‰ and −1.3 ± 0.2‰) to those found for the monooxygenation of 2-NP in single substrate experiments. While the pathway and N isotope fractionation of 3-NP reduction (ε_N = −24 ± 1.1‰) are independent of the presence of 2-NP, intermediates of 2-NP monooxygenation interfere with 3-NP reduction. Because neither pH, substrate uptake, nor aromatic substituents affected the kinetic isotope effects of nitrophenol biodegradation, our study illustrates that CSIA provides robust scientific evidence for the assessment of natural attenuation processes.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251718","docid":251718,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253463","fileid":1253463,"datasetid":"document","objectid":251718,"filename":"c6em00668j.pdf","mime_type":"application/pdf","hash":"383ad910bbb8ef882c3f7384613d3231","hash_type":"MD5","filesize":1134966,"mtime":"2017-05-04 16:13:53","url":"http://authors.library.caltech.edu/77189/1/c6em00668j.pdf"}],"eprintid":77189,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"c6em00668j.pdf","content":"inpress"},{"id":"http://authors.library.caltech.edu/id/document/252671","docid":252671,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1262355","fileid":1262355,"datasetid":"document","objectid":252671,"filename":"c6em00668j.pdf","mime_type":"application/pdf","hash":"02b0a2f811dbfd0284ceaf858a3f471e","hash_type":"MD5","filesize":1138742,"mtime":"2017-05-24 16:22:31","url":"http://authors.library.caltech.edu/77189/2/c6em00668j.pdf"}],"eprintid":77189,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"c6em00668j.pdf","content":"published"}],"note":"© 2017 The Royal Society of Chemistry. \n\nReceived 11th December 2016, Accepted 10th April 2017, First published on 4th May 2017. \n\nThe authors thank Sarah Pati for helpful discussions and Jakov Bolotin and Ladina Muggler for experimental support. They gratefully acknowledge funding from the Swiss National Science Foundation (Grant number 206021-139111).","id":77189,"rev_number":16,"userid":18,"eprint_dir":"disk0/00/07/71/89","datestamp":"2017-05-04 16:23:04","lastmod":"2017-05-24 16:53:22","status_changed":"2017-05-24 16:53:22","type":"article","metadata_visibility":"show","creators":[{"given":"Reto S.","family":"Wijker","id":"Wijker-R-S","orcid":"0000-0001-5104-9849"},{"given":"Josef","family":"Zeyer","id":"Zeyer-J","orcid":""},{"given":"Thomas B.","family":"Hofstetter","id":"Hofstetter-T-B","orcid":"0000-0003-1906-367X"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-05","date_type":"published","publication":"Environmental Science: Processes and Impacts","volume":"19","number":"5","pagerange":"775-784","id_number":"CaltechAUTHORS:20170504-091348858","refereed":true,"issn":"2050-7887","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170504-091348858","related_url":[{"url":"http://dx.doi.org/10.1039/c6em00668j","type":"doi","description":"Article"},{"url":"http://pubs.rsc.org/en/Content/ArticleLanding/2017/EM/C6EM00668J","type":"pub","description":"Article"}],"referencetext":["1.J. C. Spain, J. B. Hughes and H.-J. Knackmuss, Biodegradation of Nitroaromatic Compounds and Explosives, Lewis Publishers, Boca Raton, 2000 Search PubMed .\n2.G. I. Sunahara, G. R. Lotufo, R. G. Kuperman and J. Hawari, Ecotoxicology of Explosives, CRC Press, 2009 Search PubMed .\n3.K. S. Ju and R. E. Parales, Microbiol. Mol. Biol. Rev., 2010, 74, 250–272 CrossRef CAS PubMed .\n4.D. Pérez-Pantoja, P. I. Nikel, M. Chavarria and V. de Lorenzo, PLoS Genet., 2013, 9, e1003764 Search PubMed .\n5.A. de las Heras, M. Chavarria and V. de Lorenzo, Mol. Microbiol., 2011, 82, 287–299 CrossRef CAS PubMed .\n6.M. Kivisaar, Mol. Microbiol., 2011, 82, 265–268 CrossRef CAS PubMed .\n7.P. K. Arora, A. Srivastava and V. P. Singh, J. Hazard. Mater., 2014, 266, 42–59 CrossRef CAS PubMed .\n8.M. Roldan, E. Perez-Reinado, F. Castillo and C. Moreno-Vivian, FEMS Microbiol. Rev., 2008, 32, 474–500 CrossRef CAS PubMed .\n9.J. V. Weiss and I. M. Cozzarelli, Ground Water, 2008, 46, 305–322 CrossRef CAS PubMed .\n10.P. Bombach, H. H. Richnow, M. Kastner and A. Fischer, Appl. Microbiol. Biotechnol., 2010, 86, 839–852 CrossRef CAS PubMed .\n11.C. Courbet, A. Riviere, S. Jeannottat, S. Rinaldi, D. Hunkeler, H. Bendjoudi and G. de Marsily, J. Contam. Hydrol., 2011, 126, 315–329 CrossRef CAS PubMed .\n12.M. von Bergen, N. Jehmlich, M. Taubert, C. Vogt, F. Bastida, F. A. Herbst, F. Schmidt, H.-H. Richnow and J. Seifert, ISME J., 2013, 7, 1877–1885 CrossRef CAS PubMed .\n13.J. Zeyer and P. C. Kearney, J. Agric. Food Chem., 1984, 32, 238–242 CrossRef CAS .\n14.J. Zeyer, H. P. Kocher and K. N. Timmis, Appl. Environ. Microbiol., 1986, 52, 334–339 CAS .\n15.J. Zeyer and H. P. Kocher, J. Bacteriol., 1988, 170, 1789–1794 CrossRef CAS PubMed .\n16.R. Meulenberg, M. Pepi and J. A. M. deBont, Biodegradation, 1996, 7, 303–311 CrossRef CAS PubMed .\n17.T. B. Hofstetter and M. Berg, TrAC, Trends Anal. Chem., 2011, 30, 618–627 CrossRef CAS .\n18.T. B. Hofstetter, J. Bolotin, S. G. Pati, M. Skarpeli-Liati, S. Spahr and R. S. Wijker, Chimia, 2014, 68, 788–792 CrossRef CAS PubMed .\n19.T. B. Hofstetter, R. P. Schwarzenbach and S. M. Bernasconi, Environ. Sci. Technol., 2008, 42, 7737–7743 CrossRef CAS PubMed .\n20.R. S. Wijker, J. Bolotin, S. F. Nishino, J. C. Spain and T. B. Hofstetter, Environ. Sci. Technol., 2013, 47, 6872–6883 CrossRef CAS PubMed .\n21.T. B. Hofstetter, J. C. Spain, S. F. Nishino, J. Bolotin and R. P. Schwarzenbach, Environ. Sci. Technol., 2008, 42, 4764–4770 CrossRef CAS PubMed .\n22.S. G. Pati, H. P. E. Kohler, J. Bolotin, R. E. Parales and T. B. Hofstetter, Environ. Sci. Technol., 2014, 48, 10750–10759 CrossRef CAS PubMed .\n23.S. G. Pati, H.-P. E. Kohler, A. Pabis, P. Paneth, R. E. Parales and T. B. Hofstetter, Environ. Sci. Technol., 2016, 50, 6708–6716 CrossRef CAS PubMed .\n24.R. S. Wijker, Z. Kurt, J. C. Spain, J. Bolotin, J. Zeyer and T. B. Hofstetter, Environ. Sci. Technol., 2013, 47, 14185–14193 CrossRef CAS PubMed .\n25.R. S. Wijker, P. Adamczyk, J. Bolotin, P. Paneth and T. B. Hofstetter, Appl. Environ. Microbiol., 2013, 47, 13459–13468 CAS .\n26.A. Hartenbach, T. B. Hofstetter, M. Berg, J. Bolotin and R. P. Schwarzenbach, Environ. Sci. Technol., 2006, 40, 7710–7716 CrossRef CAS PubMed .\n27.A. Hartenbach, T. B. Hofstetter, M. Aeschbacher, M. Sander, D. Kim, T. J. Strathmann, W. A. Arnold, C. J. Cramer and R. P. Schwarzenbach, Environ. Sci. Technol., 2008, 42, 8352–8359 CrossRef CAS PubMed .\n28.N. B. Tobler, T. B. Hofstetter and R. P. Schwarzenbach, Environ. Sci. Technol., 2007, 41, 7773–7780 CrossRef CAS PubMed .\n29.C. A. Gorski, J. T. Nurmi, P. G. Tratnyek, T. B. Hofstetter and M. M. Scherer, Environ. Sci. Technol., 2010, 44, 55–60 CrossRef CAS PubMed .\n30.T. B. Hofstetter, A. Neumann, W. A. Arnold, A. E. Hartenbach, J. Bolotin, C. J. Cramer and R. P. Schwarzenbach, Environ. Sci. Technol., 2008, 42, 1997–2003 CrossRef CAS PubMed .\n31.M. Elsner, J. Environ. Monit., 2010, 12, 2005–2031 RSC .\n32.M. Wolfsberg, A. van Hook, P. Paneth and L. P. N. Rebelo, Isotope Effects in Chemical, Geological, and Bio Sciences, Springer, Heidelberg, 2010 Search PubMed .\n33.M. Thullner, F. Centler, H.-H. Richnow and A. Fischer, Org. Geochem., 2012, 42, 1440–1460 CrossRef .\n34.M. Elsner, M. A. Jochman, T. B. Hofstetter, D. Hunkeler, A. Bernstein, T. C. Schmidt and A. Schmimmelmann, Anal. Bioanal. Chem., 2012, 403, 2471–2491 CrossRef CAS PubMed .\n35.B. M. Van Breukelen, Environ. Sci. Technol., 2007, 41, 4004–4010 CrossRef CAS PubMed .\n36.R. S. Wijker, S. G. Pati, J. Zeyer and T. B. Hofstetter, Environ. Sci. Technol. Lett., 2015, 2, 329–334 CrossRef CAS .\n37.D. Northrop, Annu. Rev. Biochem., 1981, 50, 103–131 CrossRef CAS PubMed .\n38.J. Zeyer and P. C. Kearney, Pestic. Biochem. Physiol., 1982, 17, 215–223 CrossRef CAS .\n39.O. H. Lowry, N. J. Rosebrough, A. L. Farr and R. J. Randall, J. Biol. Chem., 1951, 193, 265–275 CAS .\n40.M. Skarpeli-Liati, S. G. Pati, J. Bolotin, S. N. Eustis and T. B. Hofstetter, Environ. Sci. Technol., 2012, 46, 7189–7198 CrossRef CAS PubMed .\n41.M. Berg, J. Bolotin and T. B. Hofstetter, Anal. Chem., 2007, 79, 2386–2393 CrossRef CAS PubMed .\n42.M. Skarpeli-Liati, W. A. Arnold, A. Turgeon, C. J. Cramer and T. B. Hofstetter, Anal. Chem., 2011, 83, 1641–1648 CrossRef CAS PubMed .\n43.M. Skarpeli-Liati, M. Jiskra, A. Turgeon, A. N. Garr, W. A. Arnold, C. J. Cramer, R. P. Schwarzenbach and T. B. Hofstetter, Environ. Sci. Technol., 2011, 45, 5596–5604 CrossRef CAS PubMed .\n44.S. Spahr, S. Huntscha, J. Bolotin, M. P. Maier, M. Elsner, J. Hollender and T. B. Hofstetter, Anal. Bioanal. Chem., 2013, 405, 2843–2856 CrossRef CAS PubMed .\n45.T. B. Coplen, Rapid Commun. Mass Spectrom., 2011, 25, 2538–2560 CrossRef CAS PubMed .\n46.M. A. Jochmann, M. Blessing, S. B. Haderlein and T. C. Schmidt, Rapid Commun. Mass Spectrom., 2006, 20, 3639–3648 CrossRef CAS PubMed .\n47.K. M. Scott, X. Lu, C. M. Cavanaugh and J. S. Liu, Geochim. Cosmochim. Acta, 2004, 68, 433–442 CrossRef CAS .\n48.D. L. Purich, Enzyme Kinetics: Catalysis \u0026 Control, Elsevier Inc., 1st edn, 2010 Search PubMed .\n49.D. L. Purich, Enzyme Kinetics: Catalysis \u0026 Control, Elsevier Inc., 2010, pp. 485–574 Search PubMed .\n50.S. G. Pati, K. Shin, M. Skarpeli-Liati, J. Bolotin, S. N. Eustis, J. C. Spain and T. B. Hofstetter, Environ. Sci. Technol., 2012, 46, 11844–11853 \n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Swiss National Science Foundation (SNSF)","grant_number":"206021-139111"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}