{"title":"Noninvasive iPhone Measurement of Left Ventricular Ejection Fraction Using Intrinsic Frequency Methodology","uri":"","abstract":"Objective: The study is based on previously reported mathematical analysis of arterial waveform that extracts hidden oscillations in the waveform that we called intrinsic frequencies. The goal of this clinical study was to compare the accuracy of left ventricular ejection fraction derived from intrinsic frequencies noninvasively versus left ventricular ejection fraction obtained with cardiac MRI, the most accurate method for left ventricular ejection fraction measurement. \n\nDesign: After informed consent, in one visit, subjects underwent cardiac MRI examination and noninvasive capture of a carotid waveform using an iPhone camera (The waveform is captured using a custom app that constructs the waveform from skin displacement images during the cardiac cycle.). The waveform was analyzed using intrinsic frequency algorithm. \n\nSetting: Outpatient MRI facility. \n\nSubjects: Adults able to undergo MRI were referred by local physicians or self-referred in response to local advertisement and included patients with heart failure with reduced ejection fraction diagnosed by a cardiologist. \n\nInterventions: Standard cardiac MRI sequences were used, with periodic breath holding for image stabilization. To minimize motion artifact, the iPhone camera was held in a cradle over the carotid artery during iPhone measurements. \n\nMeasurements and Main Results: Regardless of neck morphology, carotid waveforms were captured in all subjects, within seconds to minutes. Seventy-two patients were studied, ranging in age from 20 to 92 years old. The main endpoint of analysis was left ventricular ejection fraction; overall, the correlation between ejection fraction-iPhone and ejection fraction-MRI was 0.74 (r = 0.74; p \u003c 0.0001; ejection fraction-MRI = 0.93 × [ejection fraction-iPhone] + 1.9). \n\nConclusions: Analysis of carotid waveforms using intrinsic frequency methods can be used to document left ventricular ejection fraction with accuracy comparable with that of MRI. The measurements require no training to perform or interpret, no calibration, and can be repeated at the bedside to generate almost continuous analysis of left ventricular ejection fraction without arterial cannulation.","documents":null,"note":"© 2017 by the Society of Critical Care Medicine and Wolters Kluwer Health, Inc.","id":77183,"rev_number":6,"userid":18,"eprint_dir":"disk0/00/07/71/83","datestamp":"2017-05-04 16:17:48","lastmod":"2017-05-04 16:17:48","status_changed":"2017-05-04 16:17:48","type":"article","metadata_visibility":"show","creators":[{"given":"Niema M.","family":"Pahlevan","id":"Pahlevan-N-M","orcid":""},{"given":"Derek G.","family":"Rinderknecht","id":"Rinderknecht-D-G","orcid":""},{"given":"Peyman","family":"Tavallali","id":"Tavallali-P","orcid":""},{"given":"Marianne","family":"Razavi","id":"Razavi-M","orcid":""},{"given":"Thao T.","family":"Tran","id":"Tran-Thao-T","orcid":""},{"given":"Michael W.","family":"Fong","id":"Fong-M-W","orcid":""},{"given":"Robert A.","family":"Kloner","id":"Kloner-R-A","orcid":""},{"given":"Marie","family":"Csete","id":"Csete-M-E","orcid":""},{"given":"Morteza","family":"Gharib","id":"Gharib-M","orcid":"0000-0002-2204-9302"}],"ispublished":"inpress","subjects":null,"full_text_status":"none","keywords":"cardiac MRI, ejection fraction, heart failure, intrinsic frequency, noninvasive smartphone diagnostics ","date":"2017-04-22","date_type":"inpress","publication":"Critical Care Medicine","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170504-074749227","refereed":true,"issn":"0090-3493","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170504-074749227","related_url":[{"url":"http://dx.doi.org/10.1097/CCM.0000000000002459","type":"doi","description":"Article"},{"url":"http://insights.ovid.com/crossref?an=00003246-900000000-96620","type":"pub","description":"Article"},{"url":"http://journals.lww.com/ccmjournal/Abstract/publishahead/Noninvasive_iPhone_Measurement_of_Left_Ventricular.96620.aspx","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}