{"title":"Bayesian nonlinear structural FE model and seismic input identification for damage assessment of civil structures","uri":"","abstract":"A methodology is proposed to update mechanics-based nonlinear finite element (FE) models of civil structures subjected to unknown input excitation. The approach allows to jointly estimate unknown time-invariant model parameters of a nonlinear FE model of the structure and the unknown time histories of input excitations using spatially-sparse output response measurements recorded during an earthquake event. The unscented Kalman filter, which circumvents the computation of FE response sensitivities with respect to the unknown model parameters and unknown input excitations by using a deterministic sampling approach, is employed as the estimation tool. The use of measurement data obtained from arrays of heterogeneous sensors, including accelerometers, displacement sensors, and strain gauges is investigated. Based on the estimated FE model parameters and input excitations, the updated nonlinear FE model can be interrogated to detect, localize, classify, and assess damage in the structure. Numerically simulated response data of a three-dimensional 4-story 2-by-1 bay steel frame structure with six unknown model parameters subjected to unknown bi-directional horizontal seismic excitation, and a three-dimensional 5-story 2-by-1 bay reinforced concrete frame structure with nine unknown model parameters subjected to unknown bi-directional horizontal seismic excitation are used to illustrate and validate the proposed methodology. The results of the validation studies show the excellent performance and robustness of the proposed algorithm to jointly estimate unknown FE model parameters and unknown input excitations.","documents":null,"note":"© 2017 Elsevier Ltd. \n\nReceived 9 July 2016, Revised 15 November 2016, Accepted 27 January 2017, Available online 6 March 2017.","id":77196,"rev_number":5,"userid":18,"eprint_dir":"disk0/00/07/71/96","datestamp":"2017-05-04 18:28:59","lastmod":"2017-05-04 18:28:59","status_changed":"2017-05-04 18:28:59","type":"article","metadata_visibility":"show","creators":[{"given":"Rodrigo","family":"Astroza","id":"Astroza-R","orcid":""},{"given":"Hamed","family":"Ebrahimian","id":"Ebrahimian-H","orcid":""},{"given":"Yong","family":"Li","id":"Li-Yong","orcid":""},{"given":"Joel P.","family":"Conte","id":"Conte-J-P","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Blind identification; Damage identification; Input identification; Kalman filtering; Model updating; Nonlinear finite element model; Nonlinear system identification; Parameter estimation; Structural health monitoring","date":"2017-09-01","date_type":"published","publication":"Mechanical Systems and Signal Processing","volume":"93","number":"","pagerange":"661-687","id_number":"CaltechAUTHORS:20170504-111546307","refereed":true,"issn":"0888-3270","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170504-111546307","related_url":[{"url":"https://doi.org/10.1016/j.ymssp.2017.01.040","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0888327017300493","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Rodrigo Astroza, Hamed Ebrahimian, Yong Li, Joel P. Conte, Bayesian nonlinear structural FE model and seismic input identification for damage assessment of civil structures, Mechanical Systems and Signal Processing, Volume 93, 1 September 2017, Pages 661-687, ISSN 0888-3270, https://doi.org/10.1016/j.ymssp.2017.01.040.\n(http://www.sciencedirect.com/science/article/pii/S0888327017300493)","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}