{"title":"Discovery of the most metal-poor damped Lyman-α system","uri":"","abstract":"We report the discovery and analysis of the most metal-poor damped Lyman α (DLA) system currently known, based on observations made with the Keck HIRES spectrograph. The metal paucity of this system has only permitted the determination of three element abundances: [C/H] = −3.43 ± 0.06, [O/H] = −3.05 ± 0.05 and [Si/H] = −3.21 ± 0.05, as well as an upper limit on the abundance of iron: [Fe/H] ≤ −2.81. This DLA is among the most carbon-poor environment currently known with detectable metals. By comparing the abundance pattern of this DLA to detailed models of metal-free nucleosynthesis, we find that the chemistry of the gas is consistent with the yields of a 20.5 M_⊙ metal-free star that ended its life as a core-collapse supernova; the abundances we measure are inconsistent with the yields of pair-instability supernovae. Such a tight constraint on the mass of the progenitor Population III star is afforded by the well-determined C/O ratio, which we show depends almost monotonically on the progenitor mass when the kinetic energy of the supernova explosion is Eexp ≳ 1.5 × 10^(51) erg. We find that the DLA presented here has just crossed the critical ‘transition discriminant’ threshold, rendering the DLA gas now suitable for low mass star formation. We also discuss the chemistry of this system in the context of recent models that suggest some of the most metal-poor DLAs are the precursors of the ‘first galaxies’, and are the antecedents of the ultrafaint dwarf galaxies.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251754","docid":251754,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253881","fileid":1253881,"datasetid":"document","objectid":251754,"filename":"stx037.pdf","mime_type":"application/pdf","hash":"7bc6f23de875a6e8d11382d8a08d5c7e","hash_type":"MD5","filesize":751733,"mtime":"2017-05-05 13:46:46","url":"http://authors.library.caltech.edu/77200/1/stx037.pdf"}],"eprintid":77200,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"stx037.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251755","docid":251755,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253883","fileid":1253883,"datasetid":"document","objectid":251755,"filename":"1701.03103.pdf","mime_type":"application/pdf","hash":"cd65cc8d8578a32bf90221a3f6126cca","hash_type":"MD5","filesize":1129039,"mtime":"2017-05-05 13:47:28","url":"http://authors.library.caltech.edu/77200/2/1701.03103.pdf"}],"eprintid":77200,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1701.03103.pdf","content":"submitted"}],"note":"© 2017 The Authors Published by Oxford University Press on behalf of the Royal Astronomical Society. \n\nAccepted 2017 January 5. Received 2016 December 15; in original form 2016 November 21. \n\nWe are grateful to the staff astronomers at Keck Observatory for their assistance with the observations. We thank the anonymous referee for their prompt review, and for offering several helpful suggestions that improved the presentation of this paper. During this work, RJC was supported by a Royal Society University Research Fellowship, and by NASA through Hubble Fellowship grant HST-HF-51338.001-A, awarded by the Space Telescope Science Institute, which is operated by the Association of Universities for Research in Astronomy, Inc., for NASA, under contract NAS5-26555. RJC acknowledges support from STFC (ST/L00075X/1). CCS has been supported by grant AST-1313472 from the US NSF. This research was also supported by a NASA Keck PI Data Award, administered by the NASA Exoplanet Science Institute. Data presented herein were obtained at the W. M. Keck Observatory from telescope time partially allocated to the National Aeronautics and Space Administration through the agency's scientific partnership with the California Institute of Technology and the University of California. Our work made use of the matplotlib (Hunter 2007), emcee (Foreman-Mackey et al. 2013) and corner (Foreman-Mackey et al. 2016) python packages, which we gratefully acknowledge. The Observatory was made possible by the generous financial support of the W. M. Keck Foundation. We thank the Hawaiian people for the opportunity to observe from Mauna Kea; without their hospitality, this work would not have been possible.","id":77200,"rev_number":9,"userid":772,"eprint_dir":"disk0/00/07/72/00","datestamp":"2017-05-05 16:48:32","lastmod":"2017-05-05 16:48:32","status_changed":"2017-05-05 16:48:32","type":"article","metadata_visibility":"show","creators":[{"given":"Ryan J.","family":"Cooke","id":"Cooke-R-J","orcid":""},{"given":"Max","family":"Pettini","id":"Pettini-M","orcid":""},{"given":"Charles C.","family":"Steidel","id":"Steidel-C-C","orcid":"0000-0002-4834-7260"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"stars: Population III, ISM: abundances, galaxies: dwarf, quasars: absorption lines","date":"2017-05","date_type":"published","publication":"Monthly Notices of the Royal Astronomical Society","volume":"467","number":"1","pagerange":"802-811","id_number":"CaltechAUTHORS:20170505-064608864","refereed":true,"issn":"0035-8711","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170505-064608864","related_url":[{"url":"https://doi.org/10.1093/mnras/stx037","type":"doi","description":"Article"},{"url":"https://academic.oup.com/mnras/article/467/1/802/2877233/Discovery-of-the-most-metal-poor-damped-Lyman","type":"pmc","description":"Article"},{"url":"https://arxiv.org/abs/1701.03103","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Abel T., Bryan G. L., Norman M. L., 2002, Science, 295, 93\nAkerman C. J., Carigi L., Nissen P. E., PettiniM., Asplund M., 2004, A\u0026A,\n414, 931\nAn Z.-D., Ma Y.-G., Fan G.-T., Li Y.-J., Chen Z.-P., Sun Y.-Y., 2016, ApJ,\n817, L5\nAoki W. et al., 2013, AJ, 145, 13\nAsplund M., Grevesse N., Sauval A. J., Scott P., 2009, ARA\u0026A, 47, 481\nBecker G. D., Sargent W. L. W., Rauch M., Carswell R. F., 2012, ApJ, 744,\n91\nBeers T. C., Christlieb N., 2005, ARA\u0026A, 43, 531\nBensby T., Feltzing S., 2006, MNRAS, 367, 1181\nBerg D. A., Skillman E. D., Henry R. B. C., Erb D. K., Carigi L., 2016, ApJ,\n827, 126\nBland-Hawthorn J., Sutherland R., Webster D., 2015, ApJ, 807, 154\nBosman S. E. I., Becker G. D., 2015, MNRAS, 452, 1105\nBromm V., Loeb A., 2003, Nature, 425, 812\nBromm V., Yoshida N., 2011, ARA\u0026A, 49, 373\nBromm V., Coppi P. S., Larson R. B., 1999, ApJ, 527, L5\nBrown T. M. et al., 2014, ApJ, 796, 91\nCaffau E. et al., 2011, Nature, 477, 67\nCarigi L., 2000, Rev. Mex. Astron. Astrofis., 36, 171\nCarigi L., Peimbert M., 2011, Rev. Mex. Astron. Astrofis., 47, 139\nCescutti G., Matteucci F., McWilliam A., Chiappini C., 2009, A\u0026A, 505,\n605\nClark P. C., Glover S. C. O., Klessen R. S., 2008, ApJ, 672, 757\nCooke R. J., Madau P., 2014, ApJ, 791, 116\nCooke R., Pettini M., Steidel C. C., Rudie G. C., Jorgenson R. A., 2011a,\nMNRAS, 412, 1047\nCooke R., Pettini M., Steidel C. C., Rudie G. C., Nissen P. E., 2011b,\nMNRAS, 417, 1534\nCooke R., Pettini M., Murphy M. T., 2012, MNRAS, 425, 347\nCooke R., Pettini M., Jorgenson R. A., Murphy M. T., Rudie G. C., Steidel\nC. C., 2013, MNRAS, 431, 1625\nCooke R. J., PettiniM., Jorgenson R. A., Murphy M. T., Steidel C. C., 2014,\nApJ, 781, 31\nCooke R. J., Pettini M., Jorgenson R. A., 2015, ApJ, 800, 12\nCooke R. J., Pettini M., Nollett K. M., Jorgenson R., 2016, ApJ, 830, 148\nCrighton N. H. M., O’Meara J.M., Murphy M. T., 2016, MNRAS, 457, L44\nDessauges-Zavadsky M., P´eroux C., Kim T.-S., D’Odorico S., McMahon\nR. G., 2003, MNRAS, 345, 447\nDufour R. J., Shields G. A., Talbot R. J., Jr, 1982, ApJ, 252, 461\nDutta R., Srianand R., Rahmani H., Petitjean P., Noterdaeme P., Ledoux C.,\n2014, MNRAS, 440, 307\nEkstr¨om S., Meynet G., Chiappini C., Hirschi R., Maeder A., 2008, A\u0026A,\n489, 685\nEllison S. L., Prochaska J. X., Hennawi J., Lopez S., Usher C., Wolfe A.\nM., Russell D. M., Benn C. R., 2010, MNRAS, 406, 1435\nErni P., Richter P., Ledoux C., Petitjean P., 2006, A\u0026A, 451, 19\nEsteban C., Peimbert M., Torres-Peimbert S., Rodr´ıguez M., 2002, ApJ,\n581, 241\nEsteban C., Bresolin F., Peimbert M., Garc´ıa-Rojas J., Peimbert A., Mesa-\nDelgado A., 2009, ApJ, 700, 654\nEsteban C., Garc´ıa-Rojas J., Carigi L., Peimbert M., Bresolin F., L´opez-\nS´anchez A. R., Mesa-Delgado A., 2014, MNRAS, 443, 624\nFabbian D., Nissen P. E., Asplund M., Pettini M., Akerman C., 2009, A\u0026A,\n500, 1143\nForeman-Mackey D., 2016, J. Open Source Softw., 24\nForeman-Mackey D., Hogg D.W., Lang D., Goodman J., 2013, PASP, 125,\n306\nFrebel A., Norris J. E., 2015, ARA\u0026A, 53, 631\nFrebel A., Johnson J. L., Bromm V., 2007, MNRAS, 380, L40\nFumagalli M., O’Meara J. M., Prochaska J. X., 2011, Science, 334, 1245\nGarc´ıa-Rojas J., Esteban C., 2007, ApJ, 670, 457\nGarnett D. R., Skillman E. D., Dufour R. J., Peimbert M., Torres-Peimbert\nS., Terlevich R., Terlevich E., Shields G. A., 1995, ApJ, 443, 64\nGratton R. G., Sneden C., Carretta E., Bragaglia A., 2000, A\u0026A, 354, 169\nHeger A., Woosley S. E., 2002, ApJ, 567, 532\nHeger A., Woosley S. E., 2010, ApJ, 724, 341\nHenry R. B. C., Edmunds M. G., K¨oppen J., 2000, ApJ, 541, 660\nHirano S., Hosokawa T., Yoshida N., Umeda H., Omukai K., Chiaki G.,\nYorke H. W., 2014, ApJ, 781, 60\nHirschi R., 2007, A\u0026A, 461, 571\nHunter J. D., 2007, Comput. Sci. Eng., 9, 90\nIshigaki M. N., Tominaga N., Kobayashi C., Nomoto K., 2014, ApJ, 792,\nL32\nJanka H.-T., 2012, Annu. Rev. Nucl. Part. Sci. , 62, 407\nJoggerst C. C., Woosley S. E., Heger A., 2009, ApJ, 693, 1780\nJoggerst C. C., Almgren A., Woosley S. E., 2010, ApJ, 723, 353\nKeller S. C. et al., 2014, Nature, 506, 463\nKirby E. N., Simon J. D., Geha M., Guhathakurta P., Frebel A., 2008, ApJ,\n685, L43\nKurt C. M., Dufour R. J., Garnett D. R., Skillman E. D., Mathis J. S.,\nPeimbert M., Torres-Peimbert S., Ruiz M.-T., 1999, ApJ, 518, 246\nLai D. K., Lee Y. S., Bolte M., Lucatello S., Beers T. C., Johnson J. A.,\nSivarani T., Rockosi C. M., 2011, ApJ, 738, 51\nLehner N. et al., 2013, ApJ, 770, 138\nLehner N., O’Meara J.M., Howk J. C., Prochaska J. X., Fumagalli M., 2016,\nApJ, 833, 283\nLimongi M., Chieffi A., 2012, ApJS, 199, 38\nLo´pez-Sa´nchez A´ . R., Esteban C., Garc´ıa-Rojas J., Peimbert M., Rodr´ıguez\nM., 2007, ApJ, 656, 168\nMaio U., Ciardi B., Dolag K., Tornatore L., Khochfar S., 2010, MNRAS,\n407, 1003\nMarassi S., Chiaki G., Schneider R., Limongi M., Omukai K., Nozawa T.,\nChieffi A., Yoshida N., 2014, ApJ, 794, 100\nMeynet G., Maeder A., 2002, A\u0026A, 390, 561\nMorrison S., Kulkarni V. P., Som D., DeMarcy B., Quiret S., P´eroux C.,\n2016, ApJ, 830, 158\nMorton D. C., 2003, ApJS, 149, 205\nNakamura F., Umemura M., 2001, ApJ, 548, 19\nNissen P. E., Chen Y. Q., Carigi L., Schuster W. J., Zhao G., 2014, A\u0026A,\n568, A25\nNorris J. E., Wyse R. F. G., Gilmore G., Yong D., Frebel A., Wilkinson\nM. I., Belokurov V., Zucker D. B., 2010, ApJ, 723, 1632\nNoterdaeme P., Petitjean P., Ledoux C., Srianand R., 2009, A\u0026A, 505, 1087\nPenprase B. E., Prochaska J. X., SargentW. L.W., Toro-Martinez I., Beeler\nD. J., 2010, ApJ, 721, 1\nPettini M., Zych B. J., Steidel C. C., Chaffee F. H., 2008, MNRAS, 385,\n2011\nPlacco V. M., Frebel A., Beers T. C., Stancliffe R. J., 2014, ApJ, 797, 21\nProchaska J. X., 2003, ApJ, 582, 49\nRitter J. S., Safranek-Shrader C., Milosavljevi´c M., Bromm V., 2016,\nMNRAS, 463, 3354\nRomano D., Karakas A. I., Tosi M., Matteucci F., 2010, A\u0026A, 522, A32\nRyan S. G., Aoki W., Norris J. E., Beers T. C., 2005, ApJ, 635, 349\nSalvadori S., Ferrara A., 2012, MNRAS, 421, L29\nSharma M., Theuns T., Frenk C., Cooke R., 2016,\npreprint(arXiv:1611.03868)\nSimcoe R. A., Sullivan P. W., Cooksey K. L., Kao M. M., Matejek M. S.,\nBurgasser A. J., 2012, Nature, 492, 79\nSimon J. D. et al., 2011, ApJ, 733, 46\nSmith B. D., Sigurdsson S., 2007, ApJ, 661, L5\nSrianand R., Gupta N., Petitjean P., Noterdaeme P., Ledoux C., 2010,\nMNRAS, 405, 1888\nStacy A., Bromm V., 2013, MNRAS, 433, 1094\nStacy A., Greif T. H., Bromm V., 2010, MNRAS, 403, 45\nStacy A., Bromm V., Lee A. T., 2016, MNRAS, 462, 1307\nSteidel C. C., Strom A. L., Pettini M., Rudie G. C., Reddy N. A., Trainor\nR. F., 2016, ApJ, 826, 159\nSuda T. et al., 2008, PASJ, 60, 1159\nTominaga N., Iwamoto N., Nomoto K., 2014, ApJ, 785, 98\nTurk M. J., Abel T., O’Shea B., 2009, Science, 325, 601\nUmeda H., Nomoto K., 2003, Nature, 422, 871\nVargas L. C., Geha M., Kirby E. N., Simon J. D., 2013, ApJ, 767, 134\nVogt S. S. et al., 1994, in Crawford D. L., Eric R., Craine E. R., eds., Proc.\nSPIE Conf. Ser. Vol. 2198, The High-Resolution Echelle Spectrometer\non the Keck 10-m Telescope. SPIE, Bellingham, p. 362\nWebster D., Bland-Hawthorn J., Sutherland R. S., 2015, ApJ, 804, 110\nWise J. H., Turk M. J., Norman M. L., Abel T., 2012, ApJ, 745, 50\nWolfe A. M., Gawiser E., Prochaska J. X., 2005, ARA\u0026A, 43, 861\nWoosley S. E., Weaver T. A., 1995, ApJS, 101, 181\nYuan S., Cen R., 2016, MNRAS, 457, 487"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Ryan J. Cooke, Max Pettini, Charles C. Steidel; Discovery of the most metal-poor damped Lyman α system. Mon Not R Astron Soc 2017; 467 (1): 802-811. doi: 10.1093/mnras/stx037","other_numbering_system":null,"funders":[{"agency":"Royal Society","grant_number":""},{"agency":"NASA Hubble Fellowship","grant_number":"HST-HF-51338.001-A"},{"agency":"NASA","grant_number":"NAS5-26555"},{"agency":"Science and Technology Facilities Council (STFC)","grant_number":"ST/L00075X/1"},{"agency":"NSF","grant_number":"AST-1313472"},{"agency":"W. M. Keck Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Infrared Processing and Analysis Center (IPAC)"]}