{"title":"Far-ultraviolet to Near-infrared Spectroscopy of a Nearby Hydrogen-poor Superluminous Supernova Gaia16apd","uri":"","abstract":"We report the first maximum-light far-ultraviolet (FUV) to near-infrared (NIR) spectra (1000 Å − 1.62 μm, rest) of a hydrogen-poor superluminous supernova, Gaia16apd. At z = 0.1018, it is the second closest and the UV brightest SLSN-I, with 17.4 mag in Swift UVW2 band at −11 days pre-maximum. The coordinated observations with HST, Palomar, and Keck were taken at −2 to +25 days. Assuming an exponential (or t^2) form, we derived the rise time of 33 days and the peak bolometric luminosity of 3 × 10^(44) erg s^(−1). At the maximum, the photospheric temperature and velocity are 17,000 K and 14,000 km s^(−1), respectively. The inferred radiative and kinetic energy are roughly 1 × 10^(51) and 2 × 10^(52) erg. Gaia16apd is extremely UV luminous, and emits 50% of its total luminosity at 1000–2500 Å. Compared to the UV spectra (normalized at 3100 Å) of well studied SN1992A (Ia), SN2011fe (Ia), SN1999em (IIP), and SN1993J (IIb), it has orders of magnitude more FUV emission. This excess is interpreted primarily as a result of weaker metal-line blanketing due to a much lower abundance of iron group elements in the outer ejecta. Because these elements originate either from the natal metallicity of the star, or have been newly produced, our observation provides direct evidence that little of these freshly synthesized material, including ^(56)Ni, were mixed into the outer ejecta, and the progenitor metallicity is likely sub-solar. This disfavors Pair-instability Supernova models with helium core masses ⩾ 90, M_☉, where substantial ^(56)Ni material is produced. A higher photospheric temperature definitely contributes to the FUV excess from Gaia16apd. Compared with Gaia16apd, we find PS1-11bam is also UV luminous.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251785","docid":251785,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1254090","fileid":1254090,"datasetid":"document","objectid":251785,"filename":"Yan_2017_ApJ_840_57.pdf","mime_type":"application/pdf","hash":"db4df5de01e9f6e91c3d4da8422d9455","hash_type":"MD5","filesize":1733850,"mtime":"2017-05-05 16:33:02","url":"http://authors.library.caltech.edu/77213/1/Yan_2017_ApJ_840_57.pdf"}],"eprintid":77213,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Yan_2017_ApJ_840_57.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251789","docid":251789,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1254117","fileid":1254117,"datasetid":"document","objectid":251789,"filename":"1611.02782.pdf","mime_type":"application/pdf","hash":"7d9e6c7ef672602578b333721a1b864b","hash_type":"MD5","filesize":1671182,"mtime":"2017-05-05 16:48:29","url":"http://authors.library.caltech.edu/77213/2/1611.02782.pdf"}],"eprintid":77213,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1611.02782.pdf","content":"submitted"}],"note":"© 2017 American Astronomical Society. \n\nReceived 2016 November 7. Accepted 2017 March 30. Published 2017 May 4. \n\nWe thank Daniel Kasen for very helpful discussion and for making his model spectra available. Vikram Ravi is acknowledged for obtaining some spectra used in this paper. We are grateful to the HST staff for the prompt scheduling of these ToO observations. We acknowledge ESA Gaia, DPAC, and the Photometric Science Alerts Team.11 Based on observations made with the NASA/ESA Hubble Space Telescope, obtained from the Data Archive at the Space Telescope Science Institute, which is operated by the Association of Universities for Research in Astronomy, Inc., under NASA contract NAS 5-26555. M.M.K. acknowledges support by the GROWTH project funded by the National Science Foundation under PIRE Grant No 1545949. E.O.O. is an incumbent of the Arye Dissentshik career development chair and is grateful for support by grants from the Willner Family Leadership Institute Ilan Gluzman (Secaucus NJ), Israel Science Foundation, Minerva, and the I-Core program by the Israeli Committee for Planning and Budgeting and the Israel Science Foundation (ISF). A.G.-Y. is supported by the EU/FP7 via ERC grant No. 307260, the Quantum Universe I-Core program by the Israeli Committee for planning and funding, and the ISF, Minerva, and ISF grants, WIS-UK \"making connections,\" and Kimmel and YeS awards. Some of the data presented herein were obtained at the W. M. Keck Observatory, which is operated as a scientific partnership among the California Institute of Technology, the University of California, and the National Aeronautics and Space Administration. The Observatory was made possible by the generous financial support of the W. M. Keck Foundation. The authors wish to recognize and acknowledge the very significant cultural role and reverence that the summit of Mauna Kea has always had within the indigenous Hawaiian community. We are most fortunate to have the opportunity to conduct observations from this mountain. \n\nFacilities: Swift - Swift Gamma-Ray Burst Mission, HST (COS - , STIS) - , Keck (LRIS - , MOSFIRE) - , Palomar - . \n\nSoftware: Astropy, SEDONA, syn++.","id":77213,"rev_number":13,"userid":772,"eprint_dir":"disk0/00/07/72/13","datestamp":"2017-05-05 16:58:43","lastmod":"2017-05-17 20:23:58","status_changed":"2017-05-05 16:58:43","type":"article","metadata_visibility":"show","creators":[{"given":"Lin","family":"Yan","id":"Yan-Lin","orcid":"0000-0003-1710-9339"},{"given":"R.","family":"Quimby","id":"Quimby-R-M","orcid":""},{"given":"A.","family":"Gal-Yam","id":"Gal-Yam-A","orcid":"0000-0002-3653-5598"},{"given":"P.","family":"Brown","id":"Brown-P","orcid":""},{"given":"N.","family":"Blagorodnova","id":"Blagorodnova-N","orcid":"0000-0003-0901-1606"},{"given":"E. O.","family":"Ofek","id":"Ofek-E-O","orcid":"0000-0002-6786-8774"},{"given":"R.","family":"Lunnan","id":"Lunnan-R","orcid":"0000-0001-9454-4639"},{"given":"J.","family":"Cooke","id":"Cooke-J","orcid":""},{"given":"S. B.","family":"Cenko","id":"Cenko-S-B","orcid":""},{"given":"J.","family":"Jencson","id":"Jencson-J","orcid":""},{"given":"M.","family":"Kasliwal","id":"Kasliwal-M-M","orcid":"0000-0002-5619-4938"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"stars: massive; supernovae: individual (Gaia16apd)","date":"2017-05-01","date_type":"published","publication":"Astrophysical Journal","volume":"840","number":"1","pagerange":"Art. No. 57","id_number":"CaltechAUTHORS:20170505-093241168","refereed":true,"issn":"1538-4357","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170505-093241168","related_url":[{"url":"https://doi.org/10.3847/1538-4357/aa6b02","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-4357/aa6b02/meta","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1611.02782","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Arnett, D. 1996, in Supernovae and Nucleosynthesis: An Investigation of the\nHistory of Matter, from the Big Bang to the Present, ed. D. Arnett\n(Princeton, NJ: Princeton Univ. Press)\nArnett, W. D. 1982, ApJ, 253, 785\nBarbary, K., Dawson, K. S., Tokita, K., et al. 2009, ApJ, 690, 1358\nBaron, E., Branch, D., Hauschildt, P. H., et al. 2000, ApJ, 545, 444\nBerger, E., Chornock, R., Lunnan, R., et al. 2012, ApJL, 755, L29\nBreeveld, A. A., Curran, P. A., Hoversten, E. A., et al. 2010, MNRAS,\n406, 1687\nBrown, P. J., Breeveld, A. A., Holland, S., Kuin, P., \u0026 Pritchard, T. 2014,\nAp\u0026SS, 354, 89\nBrown, P. J., Dessart, L., Holland, S. T., et al. 2007, ApJ, 659, 1488\nBrown, P. J., Yang, Y., Cooke, J., et al. 2016, ApJ, 828, 3\nBufano, F., Immler, S., Turatto, M., et al. 2009, ApJ, 700, 1456\nCardelli, J. A., Clayton, G. C., \u0026 Mathis, J. S. 1989, ApJ, 345, 245\nCooke, J., Sullivan, M., Gal-Yam, A., et al. 2012, Natur, 491, 228\nDessart, L., Blondin, S., Brown, P. J., et al. 2008, ApJ, 675, 644\nDong, S., Shappee, B. J., Prieto, J. L., et al. 2016, Sci, 351, 257\nFoley, R. J., \u0026 Kirshner, R. P. 2013, ApJL, 769, L1\nFransson, C. 1984, A\u0026A, 133, 264\nGaia Collaboration 2016, arXiv:1609.04153\nGal-Yam, A. 2012, Sci, 337, 927\nGal-Yam, A., Bufano, F., Barlow, T. A., et al. 2008, ApJL, 685, L117\nGehrels, N., Chincarini, G., Giommi, P., et al. 2004, ApJ, 611, 1005\nGodoy-Rivera, D., Stanek, K. Z., Kochanek, C. S., et al. 2016, arXiv:1605.00645\nHamuy, M., Pinto, P. A., Maza, J., et al. 2001, ApJ, 558, 615\nHeger, A., \u0026 Woosley, S. E. 2002, ApJ, 567, 532\nHillebrandt, W., \u0026 Niemeyer, J. C. 2000, ARA\u0026A, 38, 191\nHöflich, P., Wheeler, J. C., \u0026 Thielemann, F. K. 1998, ApJ, 495, 617\nHowell, D. A., Kasen, D., Lidman, C., et al. 2013, ApJ, 779, 98\nInserra, C., Smartt, S. J., Jerkstrand, A., et al. 2013, ApJ, 770, 128\nJeffery, D. J., Kirshner, R. P., Challis, P. M., et al. 1994, ApJL, 421, L27\nKangas, T., Elias-Rosa, N., Lundqvist, P., et al. 2016, ATel, 9071\nKasen, D., Thomas, R. C., \u0026 Nugent, P. 2006, ApJ, 651, 366\nKasen, D., Woosley, S. E., \u0026 Heger, A. 2011, ApJ, 734, 102\nKirshner, R. P., Jeffery, D. J., Leibundgut, B., et al. 1993, ApJ, 415, 589\nLeloudas, G., Fraser, M., Stone, N. C., et al. 2016, arXiv:1609.02927\nLeloudas, G., Schulze, S., Krühler, T., et al. 2015, MNRAS, 449, 917\nLentz, E. J., Baron, E., Branch, D., Hauschildt, P. H., \u0026 Nugent, P. E. 2000,\nApJ, 530, 966\nLunnan, R., Chornock, R., Berger, E., et al. 2014, ApJ, 787, 138\nMaguire, K., Sullivan, M., Ellis, R. S., et al. 2012, MNRAS, 426, 2359\nMargutti, R., Metzger, B. D., Chornock, R., et al. 2016, arXiv:1610.01632\nMasci, F. J., Laher, R. R., Rebbapragada, U. D., et al. 2017, PASP, 129, 014002\nMazzali, P. A. 2000, A\u0026A, 363, 705\nMazzali, P. A., Sullivan, M., Hachinger, S., et al. 2014, MNRAS, 439, 1959\nMazzali, P. A., Sullivan, M., Pian, E., Greiner, J., \u0026 Kann, D. A. 2016,\nMNRAS, 458, 3455\nMcLean, I. S., Steidel, C. C., Epps, H. W., et al. 2012, Proc. SPIE, 8446, 84460J\nMoriya, T., Tominaga, N., Tanaka, M., Maeda, K., \u0026 Nomoto, K. 2010, ApJL,\n717, L83\nNicholl, M., Berger, E., Margutti, R., et al. 2017, ApJL, 835, L8\nNicholl, M., Berger, E., Smartt, S. J., et al. 2016, ApJ, 826, 39\nNicholl, M., Smartt, S. J., Jerkstrand, A., et al. 2013, Natur, 502, 346\nNicholl, M., Smartt, S. J., Jerkstrand, A., et al. 2015, MNRAS, 452, 3869\nNugent, P. E., Sullivan, M., Cenko, S. B., et al. 2011, Natur, 480, 344\nOfek, E. O., Arcavi, I., Tal, D., et al. 2014, ApJ, 788, 154\nOfek, E. O., Fox, D., Cenko, S. B., et al. 2013, ApJ, 763, 42\nOfek, E. O., Laher, R., Law, N., et al. 2012, PASP, 124, 62\nOke, J. B., Cohen, J. G., Carr, M., et al. 1995, PASP, 107, 375\nOke, J. B., \u0026 Gunn, J. E. 1982, PASP, 94, 586\nPadmanabhan, T. 2000, in Theoretical Astrophysics: Volume 1, Astrophysical\nProcesses, ed. T. Padmanabhan (Cambridge: Cambridge Univ. Press), 622\nPanagia, N. 2007, in AIP Conf. Proc. 937, Supernova 1987A: 20 Years After:\nSupernovae and Gamma-Ray Bursters, ed. S. Immler, K. Weiler, \u0026\nR. McCray (Melville, NY: AIP), 236\nPanagia, N., Vettolani, G., Boksenberg, A., et al. 1980, MNRAS, 192, 861\nPastorello, A., Smartt, S. J., Botticella, M. T., et al. 2010, ApJL, 724, L16\nPauldrach, A. W. A., Duschinger, M., Mazzali, P. A., et al. 1996, A\u0026A,\n312, 525\nPerley, D. A., Quimby, R. M., Yan, L., et al. 2016, ApJ, 830, 13\nPlanck Collaboration, Ade, P. A. R., Aghanim, N., et al. 2016, A\u0026A, 594, A24\nPoole, T. S., Breeveld, A. A., Page, M. J., et al. 2008, MNRAS, 383, 627\nPritchard, T. A., Roming, P. W. A., Brown, P. J., Bayless, A. J., \u0026 Frey, L. H.\n2014, ApJ, 787, 157\nQuimby, R. M., Aldering, G., Wheeler, J. C., et al. 2007, ApJL, 668, L99\nQuimby, R. M., Kulkarni, S. R., Kasliwal, M. M., et al. 2011, Natur, 474, 487\nRoming, P. W. A., Kennedy, T. E., Mason, K. O., et al. 2005, SSRv, 120, 95\nSauer, D. N., Mazzali, P. A., Blondin, S., et al. 2008, MNRAS, 391, 1605\nSchlafly, E. F., \u0026 Finkbeiner, D. P. 2011, ApJ, 737, 103\nSpergel, D., Gehrels, N., Baltay, C., et al. 2015, arXiv:1503.03757\nSvirski, G., Nakar, E., \u0026 Sari, R. 2012, ApJ, 759, 108\nTanaka, M., Moriya, T. J., \u0026 Yoshida, N. 2013, MNRAS, 435, 2483\nThomas, R. C., Nugent, P. E., \u0026 Meza, J. C. 2011, PASP, 123, 237\nValenti, S., Elias-Rosa, N., Taubenberger, S., et al. 2008, ApJL, 673, L155\nVreeswijk, P. M., Leloudas, G., Gal-Yam, A., et al. 2017, ApJ, 835, 58\nVreeswijk, P. M., Savaglio, S., Gal-Yam, A., et al. 2014, ApJ, 797, 24\nWoosley, S. E. 2016, arXiv:1608.08939\nYan, L. R. Lunnan, et al. 2017, ApJ, submitted"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Lin Yan et al 2017 ApJ 840 57","other_numbering_system":null,"funders":[{"agency":"NASA","grant_number":"NAS 5-26555"},{"agency":"NSF","grant_number":"OISE-1545949"},{"agency":"Willner Family Leadership Institute Ilan Gluzman (Secaucus NJ)","grant_number":""},{"agency":"Israel Science Foundation","grant_number":""},{"agency":"Israeli Committee for Planning and Budgeting","grant_number":""},{"agency":"European Research Council (ERC)","grant_number":"307260"},{"agency":"Quantum Universe I-Core program","grant_number":""},{"agency":"MINERVA (Israel)","grant_number":""},{"agency":"W. M. Keck Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Infrared Processing and Analysis Center (IPAC)"]}