{"title":"Enhanced plasmon-mediated photo-assisted hydrogen evolution on silicon by interfacial modification","uri":"","abstract":"The superior catalytic activity of Pt towards proton reduction suggests application of Pt also in device architectures where hydrogen is produced by light-generated charge carriers. Large optical absorption cross sections of Pt nanoparticles, however, turn the attention to potential substitutes for Pt such as Au with more advantageous optical properties. In order to approach a functional Si/Au photocathode for hydrogen evolution, we report here on modifications of the Si–Au interface which result in improvements of charge transfer kinetics and optical properties of the device. After current-less deposition of Au nanoparticles onto silicon, these improvements are realized by chemical oxide exchange reactions at the Si/SiO_2/Au interface, i.e., dynamic etching of SiO_2 and re-oxidation of Si in NH_4F (40%). A chemical reaction route for the reformation of the SiO_2 layer in the presence of Au and the aqueous NH_4F solution is discussed. Simultaneous to the modification of the Si/SiO_2 interface, small Au nanoparticles form larger clusters with enhanced effective scattering cross sections. Thereby, improved electronic interface properties and enhanced forward scattering of light increase the saturation photocurrent density by about 9% from 32 to 35 mA cm^(−2). Improved stability of the device in acidic electrolytes, near the thermodynamic potential for evolution of hydrogen, is furthermore discussed.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251792","docid":251792,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1254139","fileid":1254139,"datasetid":"document","objectid":251792,"filename":"art%3A10.1007%2Fs10800-017-1055-4.pdf","mime_type":"application/pdf","hash":"c54d09ee9dacf92ec1b8bd01113871b0","hash_type":"MD5","filesize":2328202,"mtime":"2017-05-05 16:57:07","url":"http://authors.library.caltech.edu/77217/1/art%253A10.1007%252Fs10800-017-1055-4.pdf"}],"eprintid":77217,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"art%3A10.1007%2Fs10800-017-1055-4.pdf","content":"published"}],"note":"© 2017 Springer Science+Business Media Dordrecht. \n\nReceived: 23 November 2016; Accepted: 6 February 2017; Published online: 16 February 2017. \n\nThe joint discussion and interpretation of the data and contributions to the manuscript (H.J.L.) was supported by the Joint Center for Artificial Photosynthesis, a DOE Energy Innovation Hub, supported through the Office of Science of the US Department of Energy under Award Number DE-SC0004993.","id":77217,"rev_number":7,"userid":18,"eprint_dir":"disk0/00/07/72/17","datestamp":"2017-05-05 17:03:22","lastmod":"2017-05-05 17:03:22","status_changed":"2017-05-05 17:03:22","type":"article","metadata_visibility":"show","creators":[{"given":"B.","family":"Bouabadi","id":"Bouabadi-B","orcid":""},{"given":"M.","family":"Aggour","id":"Aggour-M","orcid":""},{"given":"H.-J.","family":"Lewerenz","id":"Lewerenz-H-J","orcid":""},{"given":"M.","family":"Lublow","id":"Lublow-M","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-04","date_type":"published","publication":"Journal of Applied Electrochemistry","volume":"47","number":"4","pagerange":"457-466","id_number":"CaltechAUTHORS:20170505-095702134","refereed":true,"issn":"0021-891X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170505-095702134","related_url":[{"url":"http://dx.doi.org/10.1007/s10800-017-1055-4","type":"doi","description":"Article"},{"url":"http://link.springer.com/article/10.1007%2Fs10800-017-1055-4","type":"pub","description":"Article"}],"referencetext":["1.\n\nWalter MG, Warren EL, McKone JR, Boettcher SW, Mi Q, Santori EA, Lewis NS (2010) Solar Water Splitting Cells. Chem Rev 110:6446–6473\nCrossRefGoogle Scholar\n\n\n2.\n\nPijpers JJH, Winkler MT, Surendranatha Y, Buonassisi T, Nocera DG (2011) Light-induced water oxidation at silicon electrodes functionalized with a cobalt oxygen-evolving catalyst. PNAS 108:10056–10061\nCrossRefGoogle Scholar\n\n\n3.\n\nEsposito DV, Levin I, Moffat TP, Talin AA (2013) H2 evolution at Si-based metal-insulator-semiconductor photoelectrodes enhanced by inversion channel charge collection and H spillover. Nat Mater 12:562–568\nCrossRefGoogle Scholar\n\n\n4.\n\nChen Y, Prange JD, Dühnen S, Park Y, Gunji M, Chidsey CED, McIntyre PC (2011) Atomic layer-deposited tunnel oxide stabilizes silicon photoanodes for water oxidation. Nat Mater 10:539–544\nCrossRefGoogle Scholar\n\n\n5.\n\nSun K, Park N, Sun Z, Zhou J, Wang J, Pang X, Shen S, Noh SY, Jing Y, Jin S, Yu PKL, Wang D (2012) Nickel oxide functionalized silicon for efficient photo-oxidation of water. Energy. Environ Sci 5:7872–7877\nGoogle Scholar\n\n\n6.\n\nHu S, Shaner MR, Beardslee JA, Lichterman M, Brunschwig BS, Lewis NS (2014) Amorphous TiO2 coatings stabilize Si, GaAs, and GaP photoanodes for efficient water oxidation. Science 344:1005–1009\nCrossRefGoogle Scholar\n\n\n7.\n\nBolts JM, Bocarsly AB, Palazzotto MC, Walton EG, Lewis NS, Wrighton MS (1979) Chemically derivatized n-type silicon photoelectrodes: stabilization to surface corrosion in aqueous electrolyte solutions and mediation of oxidation reactions by surface-attached electroactive ferrocene reagents. J Am Chem Soc 101:1378–1385\nCrossRefGoogle Scholar\n\n\n8.\n\nFan FRF, Hope GA, Bard AJ (1982) Semiconductor electrodes XLVI. Stabilization of n-silicon electrodes in aqueous solution photoelectrochemical cells by formation of platinum silicide layers. J Electrochem Soc 129:1647–1649\nCrossRefGoogle Scholar\n\n\n9.\n\nBoettcher SW, Warren EL, Putnam MC, Santori EA, Turner-Evans D, Kelzenberg MD, Walter MG, McKone JR, Brunschwig BS, Atwater HA, Lewis NS (2011) Photoelectrochemical hydrogen evolution using Si microwire arrays. J Am Chem Soc 133:1216–1219\nCrossRefGoogle Scholar\n\n\n10.\n\nChristophersen M, Carstensen J, Rönnebeck S, Jäger C, Jäger W, Föll H (2001) Crystal orientation dependence and anisotropic properties of macropore formation of p- and n-type silicon. J Electrochem Soc 148:E267-E275 and references herein\n\n\n11.\n\nSeger B B, Pedersen T T, Laursen AB AB, Vesborg PCK, Hansen O, Chorkendorff I (2013) Using TiO2 as a conductive protective layer for photocathodic H2 evolution. J Am Chem Soc 135:1057–1064\nCrossRefGoogle Scholar\n\n\n12.\n\nLi S, Zhang P, Song X, Gao L (2015) Photoelectrochemical hydrogen production of TiO2 passivated Pt/Si-nanowire composite photocathode. ACS Appl Mater Interfaces 7:18560–18565\nCrossRefGoogle Scholar\n\n\n13.\n\nLublow M, Bouabadi B, Kubala S (2012) Au-Pt core-shell nanoemitters on silicon for photoelectrochemical solar energy conversion. Sol Energ Mat Sol 107:56–62\nCrossRefGoogle Scholar\n\n\n14.\n\nNorskov JK, Bligaard T, Logadottir A, Kitchin JR, Chen JG, Pandelov S, Stimming U (2005) Trends in the exchange current for hydrogen evolution. J Electrochem Soc 152:J23-J26 (2005).\n\n\n15.\n\nAtwater HA, Polman A (2010) Plasmonics for improved photovoltaic devices. Nat Mater 9:205–213\nCrossRefGoogle Scholar\n\n\n16.\n\nThimsen E, Le Formal F, Grätzel M, Warren SC (2011) Influence of plasmonic Au nanoparticles on the photoactivity of Fe2O3 electrodes for water splitting. Nano Lett 11:35–43\nCrossRefGoogle Scholar\n\n\n17.\n\nSeo D, Park G, Song H (2012) Plasmonic monitoring of catalytic hydrogen generation by a single nanoparticle probe. J Am Chem Soc 134:1221–1227\nCrossRefGoogle Scholar\n\n\n18.\n\nTanaka A, Sakaguchi S, Hashimoto K, Kominami H (2013) Preparation of Au/TiO2 with metal cocatalysts exhibiting strong surface plasmon resonance effective for photoinduced hydrogen formation under irradiation of visible light. ACS Catal 3:79–85\nCrossRefGoogle Scholar\n\n\n19.\n\nLublow M, Lewerenz HJ (2007) Combined AFM and Brewster-angle analysis of gradually etched ultrathin SiO2—comparison with SRPES results. Surf Sci 601:1693–1700\nCrossRefGoogle Scholar\n\n\n20.\n\nNakato Y, Yano H, Nishiura S, Ueda T, Tsubomura H (1987) Hydrogen photoevolution at p-type silicon electrodes coated with discontinuous metal layers. J Electroanal Chem 228:97–108\nCrossRefGoogle Scholar\n\n\n21.\n\nLublow M, Lewerenz HJ (2007) Brewster-angle analysis of native and photoelectrochemically grown silicon oxide nanotopographies. Surf Sci 601:4227–4231\nCrossRefGoogle Scholar\n\n\n22.\n\nAllongue P, Costa-Kieling V, Gerischer H (1993) Etching of silicon in NaOH solutions: I. In situ scanning tunneling microscopic investigation of n-Si(111). J Electrochem Soc 140:1009–1018\nCrossRefGoogle Scholar\n\n\n23.\n\nAllongue P, Costa-Kieling V, Gerischer H (1993) Etching of silicon in NaOH solutions: II. Electrochemical studies of n-Si(111) and (100) and mechanism of the dissolution. J Electrochem Soc 140:1018–1026\nCrossRefGoogle Scholar\n\n\n24.\n\nAllongue P, Kieling V, Gerischer H (1995) Etching mechanism and atomic structure of H-Si(111) surfaces prepared in NH4F. Electrochim Acta 40:1353–1360 (1995)\nCrossRefGoogle Scholar\n\n\n25.\n\nAllongue P, de Villeneuve CH, Morin S, Boukherroub R, Wayner DDM (2000) The preparation of flat H-Si(111) surfaces in 40% NH4F revisited. Electrochim Acta 45:4591–4598\nCrossRefGoogle Scholar\n\n\n26.\n\nBohren CF, Huffman DR (1983) Scattering of light by small particles, Wiley, New York\nGoogle Scholar\n\n\n27.\n\nKreibig U U, Vollmer M M (1995) Optical properties of metal clusters. Springer series in materials science 25. Springer, Berlin\nCrossRefGoogle Scholar\n\n\n28.\n\nLublow M, Lu Y, Wu S (2012) Brewster-angle variable polarization spectroscopy of colloidal Au-nanospheres and -nanorods at the silicon surface. J Phys Chem C 116:8079–8088\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Bouabadi, B., Aggour, M., Lewerenz, HJ. et al. J Appl Electrochem (2017) 47: 457. doi:10.1007/s10800-017-1055-4","other_numbering_system":null,"funders":[{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0004993"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["JCAP"]}