{"title":"Exploring the mechanism of action of a newly-discovered therapeutic peptide for blinding retinal diseases by identifying its receptors","uri":"","abstract":"Diabetic and age-related retinopathies, both assocd. with growth of abnormal blood vessels, are leading causes of blindness in the developed world. Current treatments, such as Laser Photocoagulation and anti-Vascular Endothelial Growth Factor (VEGF) drugs, have limited efficacy and undesirable side effects. A recently discovered therapeutic peptide Luminate has proven to be effective in human clin. trials. Over half of the patients in phase I human clin. trial demonstrated vision improvement with 4 lines or over, and in some patients, the macular thicknesses was reduced back to the healthy state. It has shown significantly longer\nlasting benefits than anti-VEGF treatments and shows synergistic effects when used with them. Thus, the\npeptide appears to act through a different pathway than anti-VEGF agents. Finding that pathway may provide\nnew insights into the retinopathies and their managements. Therefore, we are using the peptide as a tool to\nfind the mol. mechanism of its clin. obsd. therapeutic effects. The peptide and its scrambled counterparts\nare used to prep. fluorophore-peptide conjugates and peptide-directed coupling reagents. Results will be\npresented from in-vitro and ex-vivo expts. to visualize the distribution of Luminate binding using fluorophorepeptide\nconjugates. Progress toward enrichment of binding using ligand-directed receptor \"pull down\" will be described. Our goal is to enrich and identify the assocd. receptors by drug-directed crosslinking and immunopercipitation. If successful, identification of the receptor that binds Luminate could provide further insight into the mol. basis of retinopathies, which could guide novel therapeutic agents to prevent vision loss.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251821","docid":251821,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1254432","fileid":1254432,"datasetid":"document","objectid":251821,"filename":"Zhou_2017pMEDI-106.pdf","mime_type":"application/pdf","hash":"72e0f98808b181fd77e865ac2fa972dc","hash_type":"MD5","filesize":91198,"mtime":"2017-05-05 20:09:31","url":"http://authors.library.caltech.edu/77229/1/Zhou_2017pMEDI-106.pdf"}],"eprintid":77229,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"Zhou_2017pMEDI-106.pdf","content":"published"}],"note":"© 2017 American Chemical Society.","id":77229,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/72/29","datestamp":"2017-05-05 20:16:50","lastmod":"2017-05-05 20:16:50","status_changed":"2017-05-05 20:16:50","type":"conference_item","metadata_visibility":"show","creators":[{"given":"Dan","family":"Zhou","id":"Zhou-Dan","orcid":""},{"given":"Zixuan","family":"Shao","id":"Shao-Zixuan","orcid":""},{"given":"Julia A.","family":"Kornfield","id":"Kornfield-J-A","orcid":"0000-0001-6746-8634"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-04","date_type":"published","publication":"","volume":"","number":"","pagerange":"MEDI-106","id_number":"CaltechAUTHORS:20170505-130924722","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170505-130924722","related_url":[{"url":"https://www.acs.org/content/acs/en/meetings/spring-2017.html","type":"org","description":"Conference Website"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}