{"title":"Live Confocal Imaging of Developing Arabidopsis Flowers","uri":"","abstract":"The study of plant growth and development has long relied on experimental techniques using dead, fixed tissues and lacking proper cellular resolution. Recent advances in confocal microscopy, combined with the development of numerous fluorophores, have overcome these issues and opened the possibility to study the expression of several genes simultaneously, with a good cellular resolution, in live samples. Live confocal imaging provides plant biologists with a powerful tool to study development, and has been extensively used to study root growth and the formation of lateral organs on the flanks of the shoot apical meristem. However, it has not been widely applied to the study of flower development, in part due to challenges that are specific to imaging flowers, such as the sepals that grow over the flower meristem, and filter out the fluorescence from underlying tissues. Here, we present a detailed protocol to perform live confocal imaging on live, developing Arabidopsis flower buds, using either an upright or an inverted microscope.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251807","docid":251807,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1254242","fileid":1254242,"datasetid":"document","objectid":251807,"filename":"jove-protocol-55156-live-confocal-imaging-of-developing-arabidopsis-flowers.pdf","mime_type":"application/pdf","hash":"24873f6a24b078212ab691974172dea2","hash_type":"MD5","filesize":1474798,"mtime":"2017-05-05 17:59:34","url":"http://authors.library.caltech.edu/77220/1/jove-protocol-55156-live-confocal-imaging-of-developing-arabidopsis-flowers.pdf"}],"eprintid":77220,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc_nd","main":"jove-protocol-55156-live-confocal-imaging-of-developing-arabidopsis-flowers.pdf","content":"published"}],"note":"© 2017 JoVE. Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License. \n\nDate Published: 4/01/2017. \n\nThe author wish to thank Prof. Elliot M. Meyerowitz for his support, and comments on the manuscript, as well as Ann Lavanway at Dartmouth College and Dr. Andres Collazo at the Biological Imaging Facility at Caltech for their help in solving technical issues with the live confocal imaging. Nathanaël Prunet's work is supported by the US National Institutes of Health through Grant R01 GM104244 to Elliot M. Meyerowitz. \n\nThe author has nothing to disclose.","id":77220,"rev_number":10,"userid":18,"eprint_dir":"disk0/00/07/72/20","datestamp":"2017-05-05 18:07:39","lastmod":"2017-05-05 18:07:39","status_changed":"2017-05-05 18:07:39","type":"article","metadata_visibility":"show","creators":[{"given":"Nathanaël","family":"Prunet","id":"Prunet-N","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Developmental Biology, live confocal imaging, confocal microscopy, Arabidopsis, flower, flower development, flower meristem","date":"2017-04-01","date_type":"published","publication":"Journal of Visualized Experiments ","volume":"","number":"122","pagerange":"Art. No. e55156","id_number":"CaltechAUTHORS:20170505-105929140","refereed":true,"issn":"1940-087X ","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170505-105929140","related_url":[{"url":"http://dx.doi.org/10.3791/55156","type":"doi","description":"Article"},{"url":"https://www.jove.com/video/55156/live-confocal-imaging-of-developing-arabidopsis-flowers","type":"pub","description":"Article"}],"referencetext":["1.Prunet, N., Jack, T. P. Flower Development in Arabidopsis: There Is More to It Than Learning Your ABCs. Methods Mol. Biol. 1110, 3-33 (2014).\n2.Stewart, D., Graciet, E., Wellmer, F. Molecular and regulatory mechanisms controlling floral organ development. FEBS J. (2016).\n3.Heisler, M. G., et al. Patterns of auxin transport and gene expression during primordium development revealed by live imaging of the Arabidopsis inflorescence meristem. Curr. Biol. 15, (21), 1899-1911 (2005).\n4.Reddy, G. V., Meyerowitz, E. M. Stem-cell homeostasis and growth dynamics can be uncoupled in the Arabidopsis shoot apex. Science. 310, (5748), 663-667 (2005).\n5.Yadav, R. K., et al. WUSCHEL protein movement mediates stem cell homeostasis in the Arabidopsis shoot apex. Genes \u0026 Dev. 25, (19), 2025-2030 (2011).\n6.Reddy, G. V., Heisler, M. G., Ehrhardt, D. W., Meyerowitz, E. M. Real-time lineage analysis reveals oriented cell divisions associated with morphogenesis at the shoot apex of Arabidopsis thaliana. Development. 131, (17), 4225-4237 (2004).\n7.Chandler, J. W., Jacobs, B., Cole, M., Comelli, P., Werr, W. DORNROSCHEN-LIKE expression marks Arabidopsis floral organ founder cells and precedes auxin response maxima. Plant Mol. Biol. 76, (1-2), 171-185 (2011).\n8.Urbanus, S. L., et al. In planta localisation patterns of MADS domain proteins during floral development in Arabidopsis thaliana. BMC Plant Biol. 9, (2009).\n9.Hong, L., et al. Variable Cell Growth Yields Reproducible OrganDevelopment through Spatiotemporal Averaging. Dev. Cell. 38, (1), 15-32 (2016).\n10.Roeder, A. H., et al. Variability in the control of cell division underlies sepal epidermal patterning in Arabidopsis thaliana. PLoS Biol. 8, (5), e1000367 (2010).\n11.Heisler, M. G., Ohno, C. Live-imaging of the Arabidopsis inflorescence meristem. Methods Mol. Biol. 1110, 431-440 (2014).\n12.Tobin, C. J., Meyerowitz, E. M. Real-Time Lineage Analysis to Study Cell Division Orientation in the Arabidopsis Shoot Meristem. Methods Mol. Biol. 1370, 147-167 (2016).\n13.Smyth, D. R., Bowman, J. L., Meyerowitz, E. M. Early flower development in Arabidopsis. Plant Cell. 2, (8), 755-767 (1990).\n14.Prunet, N., Jack, T. P., Meyerowitz, E. M. Live confocal imaging of Arabidopsis flower buds. Dev. Biol. (2016).\n15.Fernandez, R., et al. Imaging plant growth in 4D: robust tissue reconstruction and lineaging at cell resolution. Nat. Methods. (2010).\n16.Cutler, S. R., Ehrhardt, D. W., Griffitts, J. S., Somerville, C. R. Random GFP::cDNA fusions enable visualization of subcellular structures in cells of Arabidopsis at a high frequency. Proc. Natl. Acad. Sci. U S A. 97, (7), 3718-3723 (2000).\n17.Irish, V. F., Sussex, I. M. Function of the apetala-1 gene during Arabidopsis floral development. Plant Cell. 2, (8), 741-753 (1990).\n18.Vernoux, T., et al. The auxin signalling network translates dynamic input into robust patterning at the shoot apex. Mol. Systems Biol. 7, 508 (2011).\n19.Zhou, Y., et al. Control of plant stem cell function by conserved interacting transcriptional regulators. Nature. 517, (7534), 377-380 (2015).\n20.Barbier de Reuille, P., et al. MorphoGraphX: A platform for quantifying morphogenesis in 4D. Elife. 4, 05864 (2015).\n21.Barbier de Reuille, P. B., Robinson, S., Smith, R. S. Quantifying cell shape and gene expression in the shoot apical meristem using MorphoGraphX. Methods Mol. Biol. 1080, 121-134 (2014).\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Prunet, N. Live Confocal Imaging of Developing Arabidopsis Flowers. J. Vis. Exp. (122), e55156, doi:10.3791/55156 (2017)","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":"R01 GM104244"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}