{"title":"Plasmon-Driven photoelectrochemical cells for artiftcial photosynthesis","uri":"","abstract":"Artificial photosynthesis requires a material system that can harvest sunlight, carbon dioxide (CO_2), and water to produce chem. products (e.g. ethanol) in a solar-to-fuel process analogous to that employed by photosynthetic plants. Despite much promise, current CO_2-redn. catalysts require significant electrochem. overpotentials to achieve adequate activity while lacking appreciable chem. selectivity for a given product of interest. Numerous chem. compels. are often co-evolved during electrocatalytlc operation that are difficult to effectively sep. It is further noted that most catalysts operate under dark conditions through an applied elec. bias, but these reactions must ultimately be driven by excited-state carriers produced via light absorption to adequately mimic the photosynthetic machinery of natural systems. Plasmonic-metal nanostructures are promising candidates to drive photocatalytic CO_2 redn., as they possess broadly tunable optical properties coupled with catalytically active\nsurfaces for the prodn. of chem. fuels. In particular, the plasmon-mediated prodn. of energetic, so-called “hot\" carriers on the metal nanostructure offers unique opportunities for plasmon-driven CO_2 redn. Tailoring the plasmon resonance energy with respect to the metal Fermi level provides a potential route to modify the hot carrier distributions for selectively initiating distinct\nphotochem. pathways on the metal surface with visible light. Although several plasmonic metals (e.g. Au and Cu) are known to exhibit electrocatalytic activity for CO_2 redn. under dark conditions, few examples of plasmon-driven photoelectrochem. cells for CO_2 redn. have been reported to date. Here, we detail our efforts related to the design and construction of plasmonic photoelectrodes for visible-light-driven CO_2 redn. in aq. soln. Various device architectures composed of meta/semiconductor heterostructures will be presented, including Au/GaN, Au/NiO, and Salisbury screen-type resonant absorbers exhibiting tunable absorption across the solar spectrum. Photoelectrochem. performance was correlated with the plasmon resonance of the device to evaluate the influence of plasmon excitation on Faradaic efficiency and product selectivity. The photocatalytic insights obtained from these studies are anticipated to inform the design of advanced plasmonic photosynthetic constructs for solar-to-fuel energy conversion.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251959","docid":251959,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255558","fileid":1255558,"datasetid":"document","objectid":251959,"filename":"DuChene_2017pCATL-175.pdf","mime_type":"application/pdf","hash":"ca9c8f328a99673abeb07f5b08520e60","hash_type":"MD5","filesize":474695,"mtime":"2017-05-09 17:17:04","url":"http://authors.library.caltech.edu/77297/1/DuChene_2017pCATL-175.pdf"}],"eprintid":77297,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"DuChene_2017pCATL-175.pdf","content":"published"}],"note":"© 2017 American Chemical Society.","id":77297,"rev_number":11,"userid":18,"eprint_dir":"disk0/00/07/72/97","datestamp":"2017-05-12 23:15:42","lastmod":"2017-05-12 23:15:42","status_changed":"2017-05-12 23:15:42","type":"conference_item","metadata_visibility":"show","creators":[{"given":"Joseph","family":"Du Chene","id":"Du-Chene-J","orcid":""},{"given":"Giulia","family":"Tagliabue","id":"Tagliabue-G","orcid":""},{"given":"Alex J.","family":"Welch","id":"Welch-A-J","orcid":""},{"given":"Qin","family":"Yang","id":"Yang-Qin","orcid":""},{"given":"Kate","family":"Reidy","id":"Reidy-K","orcid":""},{"given":"Artur R.","family":"Davoyan","id":"Davoyan-A-R","orcid":""},{"given":"Chuen-Yo","family":"Hsiow","id":"Hsiow-Chuen-Yo","orcid":""},{"given":"Harry","family":"Atwater","id":"Atwater-H-A","orcid":"0000-0001-9435-0201"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-04","date_type":"published","publication":"","volume":"","number":"","pagerange":"CATL-175","id_number":"CaltechAUTHORS:20170509-101657603","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170509-101657603","related_url":[{"url":"https://www.acs.org/content/acs/en/meetings/spring-2017.html","type":"org","description":"Conference Website"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}