{"title":"Biomarkers for Hepatocellular Carcinoma","uri":"","abstract":"Hepatocellular carcinoma (HCC) is the third leading cause of cancer deaths worldwide. The HCC diagnosis is usually achieved by biomarkers, which can also help in prognosis prediction. Furthermore, it might represent certain therapeutic interventions through some combinations of biomarkers. Here, we review on our current understanding of HCC biomarkers.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251960","docid":251960,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255566","fileid":1255566,"datasetid":"document","objectid":251960,"filename":"f_10.1177_1179299X16684640.pdf_8293.pdf","mime_type":"application/pdf","hash":"3353b54e02faa5676aeaaa818e2cca12","hash_type":"MD5","filesize":498783,"mtime":"2017-05-09 17:23:53","url":"http://authors.library.caltech.edu/77298/1/f_10.1177_1179299X16684640.pdf_8293.pdf"}],"eprintid":77298,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc","main":"f_10.1177_1179299X16684640.pdf_8293.pdf","content":"published"}],"note":"© 2017 The Author(s). Creative Commons Non Commercial CC-BY-NC: This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 3.0 License (http://www.creativecommons.org/licenses/by-nc/3.0/) which permits non-commercial use, reproduction\nand distribution of the work without further permission provided the original work is attributed as specified on the SAGE and Open Access pages\n(https://us.sagepub.com/en-us/nam/open-access-at-sage). \n\nReceived: September 20, 2016. Accepted: November 26, 2016. \nPublished on 28 Feb 2017.\n\nThe author(s) received no financial support for the research, authorship, and/or publication of this article. \n\nThe author(s) declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article.\n\nAuthor Contributions: All the authors conceived, organized, drafted, reviewed, and approved the manuscript.","id":77298,"rev_number":10,"userid":18,"eprint_dir":"disk0/00/07/72/98","datestamp":"2017-05-12 23:08:33","lastmod":"2017-05-12 23:08:33","status_changed":"2017-05-12 23:08:33","type":"article","metadata_visibility":"show","creators":[{"given":"Jiatao","family":"Lou","id":"Lou-Jiatao","orcid":""},{"given":"LingFei","family":"Zhang","id":"Zhang-LingFei","orcid":""},{"given":"Shaogang","family":"Lv","id":"Lv-Shaogang","orcid":""},{"given":"Chenzi","family":"Zhang","id":"Zhang-Chenzi","orcid":""},{"given":"Shuai","family":"Jiang","id":"Jiang-Shuai","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Hepatocellular carcinoma, biomarkers, diagnosis, prognosis","date":"2017-02-28","date_type":"published","publication":"Biomarkers in Cancer","volume":"9","number":"","pagerange":"Art. No. a6188","id_number":"CaltechAUTHORS:20170509-102347515","refereed":true,"issn":"1179-299X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170509-102347515","related_url":[{"url":"https://doi.org/10.1177/1179299X16684640","type":"doi","description":"Article"},{"url":"http://insights.sagepub.com/biomarkers-for-hepatocellular-carcinoma-article-a6188","type":"pub","description":"Article"},{"url":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5345949/","type":"pmc","description":"Article"}],"referencetext":["1. Spangenberg HC, Thimme R, Blum HE. Serum markers of hepatocellular carcinoma.\nSemin Liver Dis. 2006;26:385–390.\n2. Omata M, et al. Asian Pacific Association for the Study of the Liver consensus\nrecommendations on hepatocellular carcinoma. Hepatol Int. 2010;4:439–474.\n3. Tateyama M, et al. Alpha-fetoprotein above normal levels as a risk factor for the\ndevelopment of hepatocellular carcinoma in patients infected with hepatitis C\nvirus. J Gastroenterol. 2011;46:92–100.\n4. Kumada T, et al. Predictive value of tumor markers for hepatocarcinogenesis in\npatients with hepatitis C virus. J Gastroenterol. 2011;46:536–544.\n5. Tangkijvanich P, et al. Clinical characteristics and prognosis of hepatocellular\ncarcinoma: analysis based on serum alpha-fetoprotein levels. J Clin Gastroenterol.\n2000;31:302–308.\n6. Soresi M, et al. Usefulness of alpha-fetoprotein in the diagnosis of hepatocellular\ncarcinoma. Anticancer Res. 2003;23:1747–1753.\n7. Taketa K, Okada S, Win N, Hlaing NK, Wind KM. Evaluation of tumor markers\nfor the detection of hepatocellular carcinoma in Yangon General Hospital,\nMyanmar. Acta medica Okayama. Dec 2002;56(6):317–320.\n8. Marrero JA, et al. Alpha-fetoprotein, des-gamma carboxyprothrombin, and lectin-\nbound alpha-fetoprotein in early hepatocellular carcinoma. Gastroenterology.\n2009;137:110–118.\n9. McMahon BJ, et al. Screening for hepatocellular carcinoma in Alaska natives infected\nwith chronic hepatitis B: a 16-year population-based study. Hepatology.\n2000;32(Pt. 1):842–846.\n10. Chen JG, et al. Screening for liver cancer: results of a randomised controlled trial\nin Qidong, China. J Med Screen. 2003;10:204–209.\n11. Llovet JM, Ducreux M, Lencioni R, et al; European Association for the Study of\nthe Liver and European Organisation for Research and Treatment of Cancer.\nEASL-EORTC clinical practice guidelines: management of hepatocellular carcinoma.\nJ Hepatol. 2012;56:908–943.\n12. Rimola J, et al. Cholangiocarcinoma in cirrhosis: absence of contrast washout in\ndelayed phases by magnetic resonance imaging avoids misdiagnosis of hepatocellular\ncarcinoma. Hepatology. 2009;50:791–798.\n13. Saffroy R, et al. New perspectives and strategy research biomarkers for hepatocellular\ncarcinoma. Clin Chem Lab Med. 2007;45:1169–1179.\n14. Schutte K, et al. Current biomarkers for hepatocellular carcinoma: surveillance,\ndiagnosis and prediction of prognosis. World J Hepatol. 2015;7:139–149.\n15. Fattovich G, et al. Hepatocellular carcinoma in cirrhosis: incidence and risk factors.\nGastroenterology. 2004;127(suppl. 1):S35–S50.\n16. Lok AS, Lai CL. Alpha-fetoprotein monitoring in Chinese patients with chronic\nhepatitis B virus infection: role in the early detection of hepatocellular\ncarcinoma. Hepatology. 1989;9:110–115.\n17. Tao LY, et al. Comparison of serum tumor markers for intrahepatic cholangiocarcinoma\nand hepatocellular carcinoma. Am Surg. 2010;76:1210–1213.\n18. Tsuchiya N, et al. Biomarkers for the early diagnosis of hepatocellular carcinoma.\nWorld J Gastroenterol. 2015;21:10573–10583.\n19. Li D, Mallory T, Satomura S. AFP-L3: a new generation of tumor marker for\nhepatocellular carcinoma. Clin Chim Acta. 2001;313:15–19.\n20. Sterling RK, et al. Utility of Lens culinaris agglutinin-reactive fraction of alphafetoprotein\nand des-gamma-carboxy prothrombin, alone or in combination, as\nbiomarkers for hepatocellular carcinoma. Clin Gastroenterol Hepatol.\n2009;7:104-113.\n21. Kagebayashi C, et al. Automated immunoassay system for AFP-L3% using onchip\nelectrokinetic reaction and separation by affinity electrophoresis. Anal\nBiochem. 2009;388:306–311.\n22. Oda K, et al. Highly sensitive lens culinaris agglutinin-reactive alpha-fetoprotein\nis useful for early detection of hepatocellular carcinoma in patients with chronic\nliver disease. Oncol Rep. 2011;26:1227–1233.\n23. Naraki T, et al. gamma-Carboxyglutamic acid content of hepatocellular carcinoma-\nassociated des-gamma-carboxy prothrombin. Biochim Biophys Acta.\n2002;1586:287–298.\n24. Volk ML, et al. Risk factors for hepatocellular carcinoma may impair the performance\nof biomarkers: a comparison of AFP, DCP, and AFP-L3. Cancer Biomark.\n2007;3:79–87.\n25. Grizzi F, et al. Usefulness of cancer-testis antigens as biomarkers for the diagnosis\nand treatment of hepatocellular carcinoma. J Transl Med. 2007;5:3.\n26. Marrero JA, et al. Des-gamma carboxyprothrombin can differentiate hepatocellular\ncarcinoma from nonmalignant chronic liver disease in American patients.\nHepatology. 2003;37:1114–1121.\n27. Kumada T, et al. High-sensitivity lens culinaris agglutinin-reactive alpha-fetoprotein\nassay predicts early detection of hepatocellular carcinoma. J Gastroenterol.\n2014;49:555–563.\n28. Lok AS, et al. Des-gamma-carboxy prothrombin and alpha-fetoprotein as biomarkers\nfor the early detection of hepatocellular carcinoma. Gastroenterology.\n2010;138:493–502.\n29. Filmus J. The contribution of in vivo manipulation of gene expression to the understanding\nof the function of glypicans. Glycoconj J. 2002;19:319–323.\n30. Sung YK, et al. Glypican-3 is overexpressed in human hepatocellular carcinoma.\nCancer Sci. 2003;94:259–262.\n31. Hippo Y, et al. Identification of soluble NH2-terminal fragment of glypican-3 as\na serological marker for early-stage hepatocellular carcinoma. Cancer Res.\n2004;64:2418–2423.\n32. Tangkijvanich P, et al. Diagnostic role of serum glypican-3 in differentiating hepatocellular\ncarcinoma from non-malignant chronic liver disease and other liver\ncancers. J Gastroenterol Hepatol. 2010;25:129–137.\n33. Di Tommaso L, et al. Diagnostic value of HSP70, glypican 3, and glutamine\nsynthetase in hepatocellular nodules in cirrhosis. Hepatology. 2007;45:725–734.\n34. Motomura Y, et al. Embryonic stem cell-derived dendritic cells expressing glypican-\n3, a recently identified oncofetal antigen, induce protective immunity against\nhighly metastatic mouse melanoma, B16-F10. Cancer Res. 2006;66:2414–2422.\n35. Feng J, et al. CK19 and glypican 3 expression profiling in the prognostic indication\nfor patients with HCC after surgical resection. PLoS ONE. 2016;11:e0151501.\n36. Yu JP, et al. Development of a clinical chemiluminescent immunoassay for serum\nGPC3 and simultaneous measurements alone with AFP and CK19 in diagnosis\nof hepatocellular carcinoma. J Clin Lab Anal. 2015;29:85–93.\n37. Sun DW, et al. Prognostic value of cytokeratin 19 in hepatocellular carcinoma: a\nmeta-analysis. Clin Chim Acta. 2015;448:161–169.\n38. Lee JI, et al. Prognosis of hepatocellular carcinoma expressing cytokeratin 19:\ncomparison with other liver cancers. World J Gastroenterol. 2012;18:4751–4757.\n39. Kowalik MA, et al. Cytokeratin-19 positivity is acquired along cancer progression\nand does not predict cell origin in rat hepatocarcinogenesis. Oncotarget.\n2015;6:38749–38763.\n40. Kladney RD, et al. Expression of GP73, a resident Golgi membrane protein, in\nviral and nonviral liver disease. Hepatology. 2002;35:1431–1440.\n41. Marrero JA, et al. GP73, a resident Golgi glycoprotein, is a novel serum marker\nfor hepatocellular carcinoma. J Hepatol. 2005;43:1007–1012.\n42. Tian L, et al. Serological AFP/Golgi protein 73 could be a new diagnostic parameter\nof hepatic diseases. Int J Cancer. 2011;129:1923–1931.\n43. Xu WJ, et al. Diagnostic value of alpha-fetoprotein-L3 and Golgi protein 73 in\nhepatocellular carcinomas with low AFP levels. Tumour Biol. 2014;35:\n12069–12074.\n44. Muramatsu T. Midkine, a heparin-binding cytokine with multiple roles in\ndevelopment, repair and diseases. Proc Jpn Acad Ser B Phys Biol Sci. 2010;\n86:410–425.\n45. Muramatsu T. Midkine and pleiotrophin: two related proteins involved in\ndevelopment, survival, inflammation and tumorigenesis. J Biochem. 2002;132:\n359–371.\n46. Zhu WW, et al. Evaluation of midkine as a diagnostic serum biomarker in hepatocellular\ncarcinoma. Clin Cancer Res. 2013;19:3944–3954.\n47. Shaheen KY, et al. The value of serum midkine level in diagnosis of hepatocellular\ncarcinoma. Int J Hepatol. 2015;2015:146389.\n48. Qin L. Osteopontin is a promoter for hepatocellular carcinoma metastasis: a\nsummary of 10 years of studies. Front Med. 2014;8:24–32.\n49. Ramchandani D, Weber GF. Interactions between osteopontin and vascular endothelial\ngrowth factor: implications for cancer. Biochim Biophys Acta.\n2015;1855:202–222.\n50. Wan HG, et al. Comparison osteopontin vs AFP for the diagnosis of HCC: a\nmeta-analysis. Clin Res Hepatol Gas. 2014;38:706–714.\n51. Fouad SA, et al. Plasma osteopontin level in chronic liver disease and hepatocellular\ncarcinoma. Hepat Mon. 2015;15:e30753.\n52. Shang S, et al. Identification of osteopontin as a novel marker for early hepatocellular\ncarcinoma. Hepatology. 2012;55:483–490.\n53. Weber GF. The cancer biomarker osteopontin: combination with other markers.\nCancer Genomics Proteomics. 2011;8:263–288.\n54. Biasiolo A, et al. Squamous cell carcinoma antigen-IgM is associated with hepatocellular\ncarcinoma in patients with cirrhosis: a prospective study. Dig Liver Dis.\n2016;48:197–202.\n55. Pozzan C, et al. Diagnostic and prognostic role of SCCA-IgM serum levels in\nhepatocellular carcinoma (HCC). J Gastroenterol Hepatol. 2014;29:1637–1644.\n56. Giannelli G, et al. SCCA antigen combined with alpha-fetoprotein as serologic\nmarkers of HCC. Int J Cancer. 2005;117:506–509.\n57. Lokman NA, et al. The role of annexin A2 in tumorigenesis and cancer progression.\nCancer Microenviron. 2011;4:199–208.\n58. Zhang H, et al. Up-regulation of annexin A2 expression predicates advanced\nclinicopathological features and poor prognosis in hepatocellular carcinoma.\nTumour Biol. 2015;36:9373–9383.\n59. Sun Y, et al. Annexin A2 is a discriminative serological candidate in early hepatocellular\ncarcinoma. Carcinogenesis. 2013;34:595–604.\n60. Lawrie CH, et al. Detection of elevated levels of tumour-associated microRNAs\nin serum of patients with diffuse large B-cell lymphoma. Br J Haematol.\n2008;141:672–675.\n61. Chen X, et al. Characterization of microRNAs in serum: a novel class of biomarkers\nfor diagnosis of cancer and other diseases. Cell Res. 2008;18:997–1006.\n62. Mitchell PS, et al. Circulating microRNAs as stable blood-based markers for\ncancer detection. Proc Natl Acad Sci U S A. 2008;105:10513–10518.\n63. Xu J, et al. Circulating microRNAs, miR-21, miR-122, and miR-223, in patients\nwith hepatocellular carcinoma or chronic hepatitis. Mol Carcinogen. 2011;\n50:136–142.\n64. Qi P, et al. Serum microRNAs as biomarkers for hepatocellular carcinoma in\nChinese patients with chronic hepatitis B virus infection. PLoS ONE.\n2011;6:e28486.\n65. Tomimaru Y, et al. Circulating microRNA-21 as a novel biomarker for hepatocellular\ncarcinoma. J Hepatol. 2012;56:167–175.\n66. Huang JT, et al. Systematic review and meta-analysis: circulating miRNAs for\ndiagnosis of hepatocellular carcinoma. J Cell Physiol. 2016;231:328–335.\n67. Li G, et al. Identification of circulating MicroRNAs as novel potential biomarkers\nfor hepatocellular carcinoma detection: a systematic review and meta-analysis.\nClin Transl Oncol. 2015;17:684–693.\n68. Li J, et al. Expression of serum miR-221 in human hepatocellular carcinoma and\nits prognostic significance. Biochem Biophys Res Commun. 2011;406:70–73.\n69. Qu KZ, et al. Circulating microRNAs as biomarkers for hepatocellular carcinoma.\nJ Clin Gastroenterol. 2011;45:355–360.\n70. Shigoka M, et al. Deregulation of miR-92a expression is implicated in hepatocellular\ncarcinoma development. Pathol Int. 2010;60:351–357.\n71. Li LM, et al. Serum microRNA profiles serve as novel biomarkers for HBV infection\nand diagnosis of HBV-positive hepatocarcinoma. Cancer Res.\n2010;70:9798-9807.\n72. Zhou J, et al. Plasma microRNA panel to diagnose hepatitis B virus-related hepatocellular\ncarcinoma. J Clin Oncol. 2011;29:4781–4788.\n73. Lin XJ, et al. A serum microRNA classifier for early detection of hepatocellular\ncarcinoma: a multicentre, retrospective, longitudinal biomarker identification\nstudy with a nested case-control study. Lancet Oncol. 2015;16:804–815.\n74. Leon SA, et al. Free DNA in the serum of cancer patients and the effect of therapy.\nCancer Res. 1977;37:646–650.\n75. Swystun LL, Mukherjee S, Liaw PC. Breast cancer chemotherapy induces the\nrelease of cell-free DNA, a novel procoagulant stimulus. J Thromb Haemost.\n2011;9:2313–2321.\n76. Garcia-Olmo DC, et al. Cell-free nucleic acids circulating in the plasma of\ncolorectal cancer patients induce the oncogenic transformation of susceptible\ncultured cells. Cancer Res. 2010;70:560–567.\n77. Jackson PE, et al. Specific p53 mutations detected in plasma and tumors of hepatocellular\ncarcinoma patients by electrospray ionization mass spectrometry.\nCancer Res. 2001;61:33–35.\n78. Kirk GD, et al. Ser-249 p53 mutations in plasma DNA of patients with hepatocellular\ncarcinoma from The Gambia. J Natl Cancer Inst. 2000;92:148–153.\n79. Szymanska K, et al. Ser-249TP53 mutation in tumour and plasma DNA of hepatocellular\ncarcinoma patients from a high incidence area in the Gambia, West\nAfrica. Int J Cancer. 2004;110:374–379.\n80. Kirk GD, et al. The Gambia Liver Cancer Study: infection with hepatitis B and\nC and the risk of hepatocellular carcinoma in West Africa. Hepatology.\n2004;39:211–219.\n81. Kirk GD, et al. 249(ser) TP53 mutation in plasma DNA, hepatitis B viral infection,\nand risk of hepatocellular carcinoma. Oncogene. 2005;24:5858–5867.\n82. Hosny G, et al. Ser-249 TP53 and CTNNB1 mutations in circulating free DNA\nof Egyptian patients with hepatocellular carcinoma versus chronic liver diseases.\nCancer Lett. 2008;264:201–208.\n83. Wang J, et al. Detection of aberrant promoter methylation of GSTP1 in the\ntumor and serum of Chinese human primary hepatocellular carcinoma patients.\nClin Biochem. 2006;39:344–348.\n84. Wong IH, et al. Frequent p15 promoter methylation in tumor and peripheral\nblood from hepatocellular carcinoma patients. Clin Cancer Res.\n2000;6:3516–3521.\n85. Wong IH, et al. Detection of aberrant p16 methylation in the plasma and serum\nof liver cancer patients. Cancer Res. 1999;59:71–73.\n86. Yeo W, et al. High frequency of promoter hypermethylation of RASSF1A in\ntumor and plasma of patients with hepatocellular carcinoma. Liver Int.\n2005;25:266–272.\n87. Chan KC, et al. Quantitative analysis of circulating methylated DNA as a biomarker\nfor hepatocellular carcinoma. Clin Chem. 2008;54:1528–1536.\n88. Liao W, et al. Value of quantitative and qualitative analyses of circulating cellfree\nDNA as diagnostic tools for hepatocellular carcinoma: a meta-analysis.\nMedicine (Baltimore). 2015;94:e722.\n89. Shi M, et al. A blood-based three-gene signature for the non-invasive detection\nof early human hepatocellular carcinoma. Eur J Cancer. 2014;50:928–936.\n90. Kuzmanov U, Kosanam H, Diamandis EP. The sweet and sour of serological glycoprotein\ntumor biomarker quantification. BMC Med. 2013;11:31.\n91. Ahn JM, et al. Integrated glycoproteomics demonstrates fucosylated serum\nparaoxonase 1 alterations in small cell lung cancer. Mol Cell Proteomics.\n2014;13:30–48.\n92. Liu Y, et al. Mass spectrometric protein maps for biomarker discovery and clinical\nresearch. Expert Rev Mol Diagn. 2013;13:811–825.\n93. Yin H, et al. Mass-selected site-specific core-fucosylation of serum proteins in\nhepatocellular carcinoma. J Proteome Res. 2015;14:4876–4884.\n94. Gray J, et al. A proteomic strategy to identify novel serum biomarkers for liver\ncirrhosis and hepatocellular cancer in individuals with fatty liver disease. BMC\nCancer. 2009;9:271.\n95. Zinkin NT, et al. Serum proteomics and biomarkers in hepatocellular carcinoma\nand chronic liver disease. Clin Cancer Res. 2008;14:470–477."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}