{"title":"Phase Equilibria in Mafic Schist from Vermont","uri":"","abstract":"Electron microprobe analyses of coexisting minerals in mafic schist from Vermont define systematic compositional variations which are shown by least-squares, mass balance calculations to be due to differences in metamorphic grade and facies series as is indicated by intercalated pelitic schist. The metamorphism of basaltic bulk rock compositions from greenschist to low-grade amphi-bolite facies and from greenschist to blueschist facies primarily involves changes in the mineral composition and modal abundance of five phases (amphibole + chlorite + epidote + plagioclase + quartz) in the common assemblage (which also includes a Ti-phase ± Fe3+ oxide ± carbonate ± K-mica).\n\nProgressive metamorphism of common mafic schist at medium pressure results in dehydration and the following continuous changes: amphibole grows at the expense of chlorite, epidote, and plagioclase; the edenite, glaucophane, and Tschermak substitutions in amphibole increases; the Tschermak substitution in chlorite increases; and the anorthite content of plagioclase increases (discontinuously at first from albite to oligoclase and then continuously to andesine). Along with these continuous changes in the common assemblage, stilpnomelane disappears and garnet appears during the medium-pressure, progressive metamorphism of Fe-rich samples.\n\nLow-pressure facies series metamorphism results in the same continuous changes as are observed for medium-pressure metamorphism except that plagioclase increases rather than decreases in modal abundance; epidote disappears from basaltic compositions at a lower grade; and the glaucophane substitution in amphibole is less. High-pressure metamorphism culminating in the greenschist-blueschist transition is described by the discontinuous reaction: \n\nActinolite + Chlorite + Albite → Glaucophane + Epidote.","documents":null,"note":"© 1980 Oxford University Press. \n\nReceived: 05 February 1978; Revision Received: 10 September 1978; Published: 01 February 1980.","id":78010,"rev_number":6,"userid":18,"eprint_dir":"disk0/00/07/80/10","datestamp":"2017-06-07 22:34:50","lastmod":"2017-06-07 22:34:50","status_changed":"2017-06-07 22:34:50","type":"article","metadata_visibility":"show","creators":[{"given":"Jo","family":"Laird","id":"Laird-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"1980-02","date_type":"published","publication":"Journal of Petrology","volume":"21","number":"1","pagerange":"1-37","id_number":"CaltechAUTHORS:20170607-140533001","refereed":true,"issn":"0022-3530","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170607-140533001","related_url":[{"url":"https://doi.org/10.1093/petrology/21.1.1-a","type":"doi","description":"Article"},{"url":"https://academic.oup.com/petrology/article-abstract/21/1/1/1529578/Phase-Equilibria-in-Mafic-Schist-from-Vermont1?redirectedFrom=fulltext","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"JO LAIRD; Phase Equilibria in Mafic Schist from Vermont. J Petrology 1980; 21 (1): 1-37. doi: 10.1093/petrology/21.1.1-a","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}