{"title":"A Clicked Bistable [2]Rotaxane","uri":"","abstract":"A universal diazide-terminated polyether, incorporating tetrathiafulvalene (TTF, green) and 1,5-dioxynaphthalene (DNP, red) units, was prepared and subsequently employed in the template-directed synthesis of a switchable donor/acceptor [2]rotaxane. The triazole rings (magenta), which are introduced into the rotaxane during requisite click reactions, do not present themselves as competing recognition sites for the tetracationic cyclophane (blue) as it is induced to switch between the TTF unit, when it becomes dicationic (green adorned with yellow extremities), and the DNP unit.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253357","docid":253357,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1267935","fileid":1267935,"datasetid":"document","objectid":253357,"filename":"ol070052u.pdf","mime_type":"application/pdf","hash":"9480950d9ecf4775a7df6adb60bfdff9","hash_type":"MD5","filesize":451784,"mtime":"2017-06-07 21:37:02","url":"http://authors.library.caltech.edu/78014/1/ol070052u.pdf"}],"eprintid":78014,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"ol070052u.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/253358","docid":253358,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1267940","fileid":1267940,"datasetid":"document","objectid":253358,"filename":"ol070052usi20070110_113752.pdf","mime_type":"application/pdf","hash":"20d8e8c0a4026c43c8e78dc30832d69b","hash_type":"MD5","filesize":923124,"mtime":"2017-06-07 21:38:02","url":"http://authors.library.caltech.edu/78014/2/ol070052usi20070110_113752.pdf"}],"eprintid":78014,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"ol070052usi20070110_113752.pdf","content":"supplemental"}],"note":"© 2007 American Chemical Society. \n\nReceived January 8, 2007. Publication Date (Web): February 28, 2007. \n\nThis work was supported by the Microelectronics Advanced Research Corporation (MARCO) and its focus center on Functional Engineered NanoArchitectonics (FENA) and the Defense Advanced Research Projects Agency (DARPA) and the center for Nanoscale Innovative Defense (CNID).","id":78014,"rev_number":12,"userid":18,"eprint_dir":"disk0/00/07/80/14","datestamp":"2017-06-07 22:26:09","lastmod":"2017-06-07 22:26:09","status_changed":"2017-06-07 22:26:09","type":"article","metadata_visibility":"show","creators":[{"given":"Ivan","family":"Aprahamian","id":"Aprahamian-I","orcid":""},{"given":"William R.","family":"Dichtel","id":"Dichtel-W-R","orcid":""},{"given":"Taichi","family":"Ikeda","id":"Ikeda-Taichi","orcid":""},{"given":"James R.","family":"Heath","id":"Heath-J-R","orcid":"0000-0001-5356-4385"},{"given":"J. Fraser","family":"Stoddart","id":"Stoddart-J-F","orcid":"0000-0003-3161-3697"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2007-03-29","date_type":"published","publication":"Organic Letters","volume":"9","number":"7","pagerange":"1287-1290","id_number":"CaltechAUTHORS:20170607-143656605","refereed":true,"issn":"1523-7060","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170607-143656605","related_url":[{"url":"http://dx.doi.org/10.1021/ol070052u","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/ol070052u","type":"pub","description":"Article"},{"url":"http://pubs.acs.org/doi/suppl/10.1021/ol070052u","type":"pub","description":"Supporting Information"}],"referencetext":["(1) (a) Amabilino, D. B.; Stoddart, J. F. Chem. Rev. 1995, 95, 2725−2828.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Jäger, R.; Vögtle, F. Angew. Chem., Int. Ed. Engl. 1997, 36, 930−944.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Hubin, T. J.; Kolchinski, A. G.; Vance, A. L.; Busch, D. H. Adv. Supramol. Chem. 1999, 5, 237−357.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Ashton, P. R.; Ballardini, R.; Balzani, V.; Credi, A;. Dress, R.; Ishow, E.; Kocian, O.; Preece, J. A.; Spencer, N.; Stoddart, J. F.; Venturi, M.; Wenger, S. Chem. Eur. J. 2000, 6, 3558−3574.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (e) Stoddart, J. F.; Tseng, H.-R. Proc. Natl. Acad. Sci. U.S.A. 2002, 99, 4797−4800.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (f) Jeppesen, J. O.; Vignon, S. A.; Stoddart, J. F. Chem. Eur. J. 2003, 9, 4611−4625. For bistable rotaxanes based on a hydrogen bonding recognition motif, see:  (g) Gatti, G.; León, S.; Wong, J. K. Y.; Bottari, G.; Altieri, A.; Morales, M. A. F.; Teat, S. J.; Frochot, C.; Leigh, D. A.; Brouwer, A. M.; Zerbetto, F. Proc. Natl. Acad. Sci. U.S.A. 2003, 100, 10−14.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (h) Leigh, D. A.; Pérez, E. M. Chem. Commun. 2004, 2262−2263.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (i) Marlin, D. S.; Gonzalez, C.; Leigh, D. A.; Slawin, A. M. Z. Angew. Chem., Int. Ed. 2006, 45, 77−83.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (j) Serreli, V.; Lee, C.-F.; Kay, E. R.; Leigh, D. A. Nature 2007, 445, 523−527.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(2) (a) Odell, B.; Reddington, M. V.; Slawin, A. M. Z.; Spencer, N.; Stoddart, J. F.; Williams, D. J. Angew. Chem., Int. Ed. Engl. 1988, 27, 1547−1550.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Anelli, P.-L.; Ashton, P. R.; Ballardini, R.; Balzani, V.; Delgado, M.; Gandolfi, M. T.; Goodnow, T. T.; Kaifer, A. E.; Philp, D.; Pietraszkiewicz, M.; Prodi, L.; Reddington, M. V.; Slawin, A. M. Z.; Spencer, N.; Stoddart, J. F.; Vicent, C.; Williams, D. J. J. Am. Chem. Soc. 1992, 114, 193−218.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Asakawa, M.; Dehaen, W.; L'abbé, G.; Menzer, S.; Nouwen, J.; Raymo, F. M.; Stoddart, J. F.; Williams, D. J. J. Org. Chem. 1996, 61, 9591−9595.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Doddi, G.; Ercolani, G.; Mencarelli, P.; Piermattei, A. J. Org. Chem. 2005, 70, 3761−3764.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(3) (a) Collier, C. P.; Mattersteig, G.; Wong, E. W.; Luo, Y.; Beverly, K.; Sampaio, J.; Raymo, F. M.; Stoddart, J. F.; Heath, J. R. Science 2000, 289, 1172−1175.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Collier, C. P.; Jeppesen, J. O.; Luo, Y.; Perkins, J.; Wong, E. W.; Heath, J. R.; Stoddart, J. F. J. Am. Chem. Soc. 2001, 123, 12632−12641.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Luo, Y.; Collier, C. P.; Jeppesen, J. O.; Nielsen, K. A.; DeIonno, E.; Ho, G.; Perkins, J.; Tseng, H.-R.; Yamamoto, T.; Stoddart, J. F.; Heath, J. R. ChemPhysChem 2002, 3, 519−525.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Flood, A. H.; Peters, A. J.; Vignon, S. A.; Steuerman, D. W.; Tseng, H.-R.; Kang, S.; Heath, J. R.; Stoddart, J. F. Chem. Eur. J. 2004, 10, 6558−6564.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (e) Diehl, M. R.; Steuerman, D. W.; Tseng, H.-R.; Vignon, S. A.; Star, A.; Celestre, P. C.; Stoddart, J. F.; Heath, J. R. ChemPhysChem 2003, 4, 1335−1339.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (f) Steuerman, D. W.; Tseng, H.-R.; Peters, A. J.; Flood, A. H.; Jeppesen, J. O.; Nielsen, K. A.; Stoddart, J. F.; Heath, J. R. Angew. Chem., Int. Ed. 2004, 43, 6486−6491.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (g) Choi, J. W.; Flood, A. H.; Steuerman, D.; Nygaard, S.; Braunschweig, A. B.; Moonen, N. N. P.; Laursen, B. W.; Luo, Y.; DeIonno, E.; Peters, A. J.; Jeppesen, J. O.; Xu, K.; Stoddart, J. F.; Heath, J. R. Chem. Eur. J. 2006, 12, 261−279.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (h) DeIonno, E.; Tseng, H.-R.; Harvey, D. D.; Stoddart, J. F.; Heath, J. R. J. Phys. Chem. B 2006, 110, 7609−7612.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (i) Saha, S.; Stoddart, J. F. Chem. Soc. Rev. 2007, 36, 77−92.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (j) Kay, E. R.; Leigh, D. A.; Zerbetto, F. Angew. Chem., Int. Ed. 2007, 46, 72−191.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(4) (a) Balzani, V.; Credi, A.; Raymo, F. M.; Stoddart, J. F. Angew. Chem., Int. Ed. 2000, 39, 3348−3391.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Ballardini, R.; Balzani, V.; Dehaen, W.; Dell'Erba, A. E.; Raymo, F. M.; Stoddart, J. F.; Venturi, M. Eur. J. Org. Chem. 2000, 591−602.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Balzani, V.; Credi, A.; Venturi, M. Molecular Devices and Machines−A Journey into the Nano World; Wiley-VCH:  Weinheim, Germany, 2003.OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Badjić, J. D.; Balzani, V.; Credi, A.; Silvi, S.; Stoddart, J. F. Science 2004, 303, 1845−1849.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (e) Tseng, H.-R.; Wu, D. M.; Fang, N. X. L.; Zhang, X.; Stoddart, J. F. ChemPhysChem 2004, 5, 111−116.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (f) Collin, J.-P.; Heitz, V.; Sauvage, J.-P. Top. Curr. Chem. 2005, 262, 29−62.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (g) Moonen, N. N. P.; Flood, A. H.; Fernandez, J. M.; Stoddart, J. F. Top. Curr. Chem. 2005, 262, 99−132.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (h) Braunschweig, A. B.; Northrop, B. H.; Stoddart, J. F. J. Mater. Chem. 2006, 16, 32−44.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (i) Green, J. E.; Choi, J. W.; Boukai, A.; Bunimovich, Y.; Johnston-Halperin, E.; DeIonno, E.; Luo, Y.; Sheriff, B. A.; Xu, K.; Shin, Y. S.; Tseng, H.-R.; Stoddart, J. F.; Heath, J. R. Nature 2007, 445, 414−417.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (j) Ball, P. Nature 2007, 445, 362−363.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(5) (a) Schill, G. Catenanes, Rotaxanes and Knots; Academic Press:  New York, 1971.OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Molecular Catenanes, Rotaxanes and Knots; Sauvage, J.-P., Dietrich-Buchecker, C. O., Eds; Wiley-VCH:  Weinheim, Germany, 1999.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(6) (a) Ashton, P. R.; Goodnow, T. T.; Kaifer, A. E.; Reddington, M. V.; Slawin, A. M. Z.; Spencer, N.; Stoddart, J. F.; Vicent, C.; Williams, D. J. Angew. Chem., Int. Ed. Engl. 1989, 28, 1396−1399.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Anelli, P.-L.; Spencer, N.; Stoddart, J. F. J. Am. Chem. Soc. 1991, 113, 5131−5133.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(7) (a) Dichtel, W. R.; Miljanić, O. Š.; Spruell, J. M.; Heath, J. R.; Stoddart, J. F. J. Am. Chem. Soc. 2006, 128, 10388−10390.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Miljanić, O. Š.; Dichtel, W. R.; Mortezaei, S.; Stoddart, J. F. Org. Lett. 2006, 8, 4835−4838.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(8) Kolb, H. C.; Finn, M. G.; Sharpless, K. B. Angew. Chem., Int. Ed. 2001, 40, 2004−2021.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(9) (a) Huisgen, R. Pure. Appl. Chem. 1989, 61, 613−628.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Huisgen, R.; Szeimies, G.; Möbius, L. Chem. Ber. 1967, 100, 2494−2507.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Bastide, J.; Hamelin, J.; Texier, F.; Ven, V. Q. Bull. Chim. Soc. Fr. 1973, 2555−2579.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Bastide, J.; Hamelin, J.; Texier, F.; Ven, V. Q. Bull. Chim. Soc. Fr. 1973, 2871−2887.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(a) Rostovtsev, V. V.; Green, L. G.; Fokin, V. V.; Sharpless, K. B. Angew. Chem., Int. Ed. 2002, 41, 2596−2599.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Tornoe, C. W.; Christensen, C.; Meldal, M. J. Org. Chem. 2002, 67, 3057−3064.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(11) (a) Busch, D. H.; Stephenson, N. A. Coord. Chem. Rev. 1990, 100, 119−154.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Anderson, S.; Anderson, H. L.; Sanders, J. K. M. Acc. Chem. Res. 1993, 26, 469−475.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Breault, G. A.; Hunter, C. A.; Mayers, P. C. Tetrahedron 1999, 55, 5265−5293.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Templated Organic Synthesis; Diederich, F., Stang, P. J., Eds.; Wiley-VCH:  Weinheim, Germany, 2000.OpenURL CALIFORNIA INST OF TECHNOLOGY (e) Hubin, T. J.; Busch, D. H. Coord. Chem. Rev. 2000, 200, 5−52.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (f) Blanco, M.-J.; Chambron, J.-C.; Jiménez, M. C.; Sauvage, J.-P. Top. Stereochem. 2003, 23, 125−173.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (g) Busch, D. H. Top. Curr. Chem. 2005, 249, 1−65.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(12) (a) Jeppesen, J. O.; Perkins, J.; Becher, J.; Stoddart, J. F. Org. Lett. 2000, 2, 3547−3550.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Jeppesen, J. O.; Perkins, J.; Becher, J.; Stoddart, J. F. Angew. Chem., Int. Ed. 2001, 40, 1216−1221.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Yamamoto, T.; Tseng, H.-R.; Stoddart, J. F.; Balzani, V.; Credi, A.; Marchioni, F.; Venturi, M. Collect. Czech. Chem. Commun. 2003, 68, 1488−1514.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Tseng, H.-R.; Vignon, S. A.; Celestre, P. C.; Perkins, J.; Jeppesen, J. O.; Di Fabio, A.; Ballardini, R.; Gandolfi, M. T.; Venturi, M.; Balzani, V.; Stoddart, J. F. Chem. Eur. J. 2004, 10, 155−172.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (e) Tseng, H.-R.; Vignon, S. A.; Stoddart, J. F. Angew. Chem., Int. Ed. 2003, 42, 1491−1495.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (f) Tseng, H.-R.; Vignon, S. A.; Celestre, P. C.; Perkins, J.; Jeppesen, J. O.; Di Fabio, A.; Ballardini, R.; Gandolfi, M. T.; Venturi, M.; Balzani, V.; Stoddart, J. F. Chem. Eur. J. 2004, 10, 155−172.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (g) Liu, Y.; Flood, A. H.; Bonvallet, P. A.; Vignon, S. A.; Northrop, B. H.; Tseng, H.-R.; Jeppesen, J. O.; Huang, T. J.; Brough, B.; Baller, M.; Magonov, S.; Solares, S. D.; Goddard, W. A.; Ho, C.-M.; Stoddart, J. F. J. Am. Chem. Soc. 2005, 127, 9745−9759.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (h) Jeppesen, J. O.; Nygaard, S.; Vignon, S. A.; Stoddart, J. F. Eur. J. Org. Chem. 2005, 196−220.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (i) Nygaard, S.; Leung, K. C.-F.; Aprahamian, I.; Ikeda, T.; Saha, S.; Laursen, B. W.; Kim, S.-Y.; Hansen, S. W.; Stein, P. C.; Flood, A. H.; Stoddart, J. F.; Jeppesen, J. O. J. Am. Chem. Soc. 2006, 128, 960−970.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(13) Yamamoto, T.; Tseng, H.-R.; Stoddart, J. F.; Balzani, V.; Credi, A.; Marchioni, F.; Venturi, M. Collect. Czech. Chem. Commun. 2003, 68, 1488−1514.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(14) The 1H NMR spectrum shows characteristic resonances that arise from the constitutionally heterotopic methine protons of the CBPQT4+-encircled TTF units:  pairs of signals resonate at δ 6.14, 6.03 (2H) and 5.87 ppm. These resonances originate from the cis and trans isomers of such a TTF unit encircled by a CBPQT4+ ring. See:  (a) Kreitsberga, Y. N.; Liepin'sh, É.; Mazheika, I. B.; Neilands, O. Y. Zh. Org. Khim. 1986, 22, 416−420. (b) Souizi, A.; Robert, A.; Batail, P.; Ouahab, L. J. Org. Chem. 1987, 52, 1610−1611. (c) Ballardini, R.; Balzani, V.; Becher, J.; Di Fabio, A.; Gandolfi, M. T.; Mattersteig, G.; Nielsen, M. B.; Raymo, F. M.; Rowan, S. J.; Stoddart, J. F.; White, A. J. P.; Williams, D. J. J. Org. Chem. 2000, 65, 4120−4126. (d) Liu, Y.; Flood, A. H.; Moskowitz, R. M.; Stoddart, J. F. Chem. Eur. J. 2004, 11, 369−385.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(15) (a) Balzani, V.; Credi, A.; Mattersteig, G.; Matthews, O. A.; Raymo, F. M.; Stoddart, J. F.; Venturi, M.; White, A. J. P.; Williams, D. J. J. Org. Chem. 2000, 65, 1924−1936.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Ballardini, R.; Balzani, V.; Di Fabio, A.; Gandolfi, M. T.; Becher, J.; Lau, J.; Nielsen, M. B.; Stoddart, J. F. New J. Chem. 2001, 25, 293−298.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Asakawa, M.; Ashton, P. R.; Balzani, V.; Credi, A.; Mattersteig, G.; Matthews, O. A.; Montalti, M.; Spencer, N.; Stoddart, J. F.; Venturi, M. Chem. Eur. J. 1997, 3, 1992−1996.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(16) Flood, A. H.; Nygaard, S.; Laursen, B. W.; Jeppesen, J. O.; Stoddart, J. F. Org. Lett. 2006, 8, 2205−2208.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(17) (a) Bissell, R. A.; Córdova, E.; Kaifer, A. E.; Stoddart, J. F. Nature 1994, 369, 133−137.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Córdova, E.; Bissell, R. A.; Kaifer, A. E. J. Org. Chem. 1995, 60, 1003−1038.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(18) Philp, D.; Slawin, A. M. Z.; Spencer, N.; Stoddart, J. F.; Williams, D. J. J. Chem. Soc., Chem. Commun. 1991, 1584−1586."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"A Clicked Bistable [2]Rotaxane\nIvan Aprahamian, William R. Dichtel, Taichi Ikeda, James R. Heath, and J. Fraser Stoddart\nOrganic Letters 2007 9 (7), 1287-1290\nDOI: 10.1021/ol070052u","other_numbering_system":null,"funders":[{"agency":"Microelectronics Advanced Research Corporation (MARCO)","grant_number":""},{"agency":"Center on Functional Engineered NanoArchitectonics (FENA)","grant_number":""},{"agency":"Defense Advanced Research Projects Agency (DARPA)","grant_number":""},{"agency":"Center for Nanoscale Innovation for Defense (CNID)","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}