{"title":"First steps toward formal controller synthesis for bipedal robots with experimental implementation","uri":"","abstract":"Bipedal robots are prime examples of complex cyber–physical systems (CPSs). They exhibit many of the features that make the design and verification of CPS so difficult: hybrid dynamics, large continuous dynamics in each mode (e.g., 10 or more state variables), and nontrivial specifications involving nonlinear constraints on the state variables. In this paper, we propose a two-step approach to formally synthesize controllers for bipedal robots so as to enforce specifications by design and thereby generate physically realizable stable walking. In the first step, we design outputs and classical controllers driving these outputs to zero. The resulting controlled system evolves on a lower dimensional manifold and is described by the hybrid zero dynamics governing the remaining degrees of freedom. In the second step, we construct an abstraction of the hybrid zero dynamics that is used to synthesize a controller enforcing the desired specifications to be satisfied on the full order model. Our two step approach is a systematic way to mitigate the curse of dimensionality that hampers the applicability of formal synthesis techniques to complex CPS. Our results are illustrated with simulations showing how the synthesized controller enforces all the desired specifications and offers improved performance with respect to a classical controller. The practical relevance of the results is illustrated experimentally on the bipedal robot AMBER 3.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253391","docid":253391,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268199","fileid":1268199,"datasetid":"document","objectid":253391,"filename":"Master_Bipedal_Robot_Paper_NAHS_2016_rev2.pdf","mime_type":"application/pdf","hash":"67e32dd07ecf7e9394e9d7e7b96f8a50","hash_type":"MD5","filesize":19592788,"mtime":"2017-06-08 21:29:49","url":"http://authors.library.caltech.edu/78021/1/Master_Bipedal_Robot_Paper_NAHS_2016_rev2.pdf"}],"eprintid":78021,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Master_Bipedal_Robot_Paper_NAHS_2016_rev2.pdf","content":"submitted"}],"note":"© 2017 Elsevier Ltd. \n\nAvailable online 14 February 2017. \n\nThis research is supported by NSF CPS Awards 1239055, 1239037 and 1239085. Experiments were performed at Texas A\u0026M University, College Station, Texas. The robot AMBER 3 was designed and built by Eric Ambrose. The authors would like to thank Aakar Mehra for his assistance with experiments.","id":78021,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/80/21","datestamp":"2017-06-08 21:33:48","lastmod":"2017-06-08 21:33:48","status_changed":"2017-06-08 21:33:48","type":"article","metadata_visibility":"show","creators":[{"given":"Aaron D.","family":"Ames","id":"Ames-A-D","orcid":""},{"given":"Paulo","family":"Tabuada","id":"Tabuada-P","orcid":""},{"given":"Austin","family":"Jones","id":"Jones-A","orcid":""},{"given":"Wen-Loong","family":"Ma","id":"Ma-Wen-Loong","orcid":""},{"given":"Matthias","family":"Rungger","id":"Rungger-M","orcid":""},{"given":"Bastian","family":"Schürmann","id":"Schürmann-B","orcid":""},{"given":"Shishir","family":"Kolathaya","id":"Kolathaya-S","orcid":""},{"given":"Jessy W.","family":"Grizzle","id":"Grizzle-J-W","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Hybrid systems; Formal methods; Nonlinear control; Bipedal robotics\n","date":"2017-08","date_type":"published","publication":"Nonlinear Analysis: Hybrid Systems","volume":"25","number":"","pagerange":"155-173","id_number":"CaltechAUTHORS:20170608-073936974","refereed":true,"issn":"1751-570X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170608-073936974","related_url":[{"url":"https://doi.org/10.1016/j.nahs.2017.01.002","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S1751570X1730002X","type":"pub","description":"Article"}],"referencetext":["[1] AMBER-Lab. Abstraction-based control for AMBER 3.0. [Video file],\nRetrieved from http://youtu.be/UKuI7cEOEzs.\n[2] A. D. Ames. Human-inspired control of bipedal walking robots. Automatic\nControl, IEEE Transactions on, 59(5):1115–1130, May 2014.\n[3] A. D. Ames, E. A. Cousineau, and M. J. Powell. Dynamically stable bipedal\nrobotic walking with NAO via human-inspired hybrid zero dynamics. In\nProceedings of the 15th ACM international conference on Hybrid Systems:\nComputation and Control, pages 135–144. ACM, 2012.\n[4] A. D. Ames, K. Galloway, K. Sreenath, and J. Grizzle. Rapidly exponentially\nstabilizing control Lyapunov functions and hybrid zero dynamics.\nAutomatic Control, IEEE Transactions on, 59(4):876–891, 2014.\n[5] A. D. Ames, P. Tabuada, B. Sch¨urmann, W.-L. Ma, S. Kolathaya, M. Rungger,\nand J. W. Grizzle. First steps toward formal controller synthesis for\nbipedal robots. In Proceedings of the 18th International Conference on Hybrid\nSystems: Computation and Control, HSCC ’15, pages 209–218, New\nYork, NY, USA, 2015. ACM.\n[6] S. A. Burden, H. Gonzalez, R. Vasudevan, R. Bajcsy, and S. S. Sastry.\nMetrization and Simulation of Controlled Hybrid Systems. IEEE Transactions\non Automatic Control, 60(9):2307–2320, 2015.\n[7] C. Chevallereau, D. Djoudi, and J. W. Grizzle. Stable bipedal walking with\nfoot rotation through direct regulation of the zero moment point. IEEE\nTRO, 25(2):390–401, Apr. 2008.\n[8] A. Colombo and D. Del Vecchio. Supervisory control of differentially flat\nsystems based on abstraction. In 50th IEEE Conference on Decision and\nControl and European Control Conference., pages 6134–6139. IEEE, 2011.\n[9] A. Colombo and A. Girard. An approximate abstraction approach to safety\ncontrol of differentially flat systems. In European Control Conference, pages\n4226–4231. IEEE, 2013.\n[10] G. E. Fainekos, A. Girard, H. Kress-Gazit, and G. J. Pappas. Temporal\nlogic motion planning for dynamic robots. Automatica, 45(2):343–352, Feb.\n2009.\n[11] J. Fu, H. G. Tanner, and J. Heinz. Concurrent multi-agent systems with\ntemporal logic objectives: Game theoretic analysis and planning through\nnegotiation. IET Control Theory and Applications, 9(3):465–474, 2015.\n[12] R. Goebel, R. Sanfelice, and A. Teel. Hybrid dynamical systems. IEEE\nContr. Syst. Mag., 29(2):28–93, Apr. 2009.\n[13] J. W. Grizzle, G. Abba, and F. Plestan. Asymptotically stable walking\nfor biped robots: Analysis via systems with impulse effects. IEEE TAC,\n46(1):51–64, Jan. 2001.\n[14] J. W. Grizzle, C. Chevallereau, A. D. Ames, and R. W. Sinnet. 3D bipedal\nrobotic walking: models, feedback control, and open problems. In 8th IFAC\nSymposium on Nonlinear Control Systems, 2010.\n[15] A. Hereid, S. Kolathaya, M. S. Jones, J. Van Why, J. W. Hurst, and A. D.\nAmes. Dynamic multi-domain bipedal walking with ATRIAS through SLIP\nbased human-inspired control. In Proceedings of the 17th international\nconference on Hybrid systems: computation and control, pages 263–272.\nACM, 2014.\n[16] Y. H¨urm¨uzl¨u and D. B. Marghitu. Rigid body collions of planar kinematic\nchains with multiple contact points. Intl. J. of Robotics Research, 13(1):82–\n92, Feb. 1994.\n[17] C. M. Kellett, H. Shim, and A. R. Teel. Further results on robustness of\n(possibly discontinuous) sample and hold feedback. IEEE Transactions on\nAutomatic Control, 49(7):1081–1089, Jan. 2004.\n[18] A. Lamperski and A. Ames. Lyapunov theory for Zeno stability. Automatic\nControl, IEEE Transactions on, 58(1):100–112, Jan. 2013.\n[19] J. Liu, N. Ozay, U. Topcu, and R. M. Murray. Synthesis of reactive switching\nprotocols from temporal logic specifications. IEEE Transactions on\nAutomatic Control, 58(7):1771–1785, July 2013.\n[20] J. Lygeros, K. H. Johansson, S. N. Simic, J. Zhang, and S. S. Sastry. Dynamical\nproperties of hybrid automata. Automatic Control, IEEE Transactions\non, 48(1):2–17, 2003.\n[21] W.-L. Ma, H.-H. Zhao, S. Kolathaya, and A. D. Ames. Human-inspired\nwalking via unified PD and impedance control. In Robotics and Automation\n(ICRA), 2014 IEEE International Conference on, pages 5088–5094, May\n2014.\n[22] M. Mazo Jr, A. Anta, and P. Tabuada. An ISS self-triggered implementation\nof linear controllers. Automatica, 46(8):1310–1314, 2010.\n[23] R. M. Murray, Z. Li, and S. S. Sastry. A Mathematical Introduction to\nRobotic Manipulation. CRC Press, Boca Raton, Mar. 1994.\n[24] D. Nesic and A. R. Teel. Input-output stability properties of networked\ncontrol systems. IEEE Transactions on Automatic Control, 49(10):1650–\n1667, Jan. 2004.\n[25] H. Park, A. Ramezani, and J. W. Grizzle. A finite-state machine for accommodating\nunexpected large ground-height variations in bipedal robot\nwalking. IEEE Trans. Robot., 29(2):331–345, 2013.\n[26] H. Park, K. Sreenath, J. W. Hurst, and J. W. Grizzle. Identification of a\nbipedal robot with a compliant drivetrain: Parameter estimation for control\ndesign. IEEE Contr. Syst. Mag., 31(2):63–88, Apr. 2011\n[27] P. Roy, P. Tabuada, and R. Majumdar. Pessoa 2.0: A controller synthesis\ntool for cyber-physical systems. In Proceedings of the 14th International\nConference on Hybrid Systems: Computation and Control, pages 315–316,\n2011.\n[28] S. S. Sastry. Nonlinear Systems: Analysis, Stability and Control. Springer,\nNew York, June 1999.\n[29] M. W. Spong, S. Hutchinson, and M. Vidyasagar. Robot modeling and\ncontrol, volume 3. Wiley, 2006.\n[30] K. Sreenath, H. Park, I. Poulakakis, and J. W. Grizzle. A compliant hybrid\nzero dynamics controller for stable, efficient and fast bipedal walking on\nMABEL. Intl. J. of Robotics Research, 30(9):1170–1193, 2011.\n[31] P. Tabuada. Verification and Control of Hybrid Systems: A Symbolic Approach.\nSpringer, 2009.\n[32] A. Ulusoy, S. L. Smith, X. C. Ding, C. Belta, and D. Rus. Optimality and\nrobustness in multi-robot path planning with temporal logic constraints.\nThe International Journal of Robotics Research (IJRR), 32(8):889–911,\nJuly 2013.\n[33] M. Vukobratovi´c and B. Borovac. Zero-moment point—thirty five years of\nits life. International Journal of Humanoid Robotics, 1(01):157–173, 2004.\n[34] E. R. Westervelt, G. Buche, and J. W. Grizzle. Experimental validation\nof a framework for the design of controllers that induce stable walking in\nplanar bipeds. Intl. J. of Robotics Research, 24(6):559–582, 2004.\n[35] E. R. Westervelt, J. W. Grizzle, C. Chevallereau, J. H. Choi, and B. Morris.\nFeedback Control of Dynamic Bipedal Robot Locomotion. CRC Press, Boca\nRaton, June 2007.\n[36] E. R. Westervelt, J. W. Grizzle, and D. E. Koditschek. Hybrid zero dynamics\nof planar biped walkers. IEEE TAC, 48(1):42–56, 2003.\n[37] M. Zamani, G. Pola, M. Mazo Jr., and P. Tabuada. Symbolic models for\nnonlinear control systems without stability assumptions. IEEE Transactions\non Automatic Control, 57(7):1804–1809, July 2012.\n[38] H.-H. Zhao, W.-L. Ma, M. Zeagler, and A. Ames. Human-inspired multicontact\nlocomotion with AMBER2. In ACM/IEEE International Conference\non Cyber-Physical Systems (ICCPS), pages 199–210, 2014."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Aaron D. Ames, Paulo Tabuada, Austin Jones, Wen-Loong Ma, Matthias Rungger, Bastian Schürmann, Shishir Kolathaya, Jessy W. Grizzle, First steps toward formal controller synthesis for bipedal robots with experimental implementation, Nonlinear Analysis: Hybrid Systems, Volume 25, August 2017, Pages 155-173, ISSN 1751-570X, https://doi.org/10.1016/j.nahs.2017.01.002.\n(http://www.sciencedirect.com/science/article/pii/S1751570X1730002X)\n","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"CNS-1239055"},{"agency":"NSF","grant_number":"CNS-1239037"},{"agency":"NSF","grant_number":"CNS-1239085"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}