{"title":"Early Responses to Copernicus: An Essential Edition [Book Review]","uri":"","abstract":"The Nicolaus Copernicus Gesamtausgabe, which in 1974 published its first volume, a facsimile of Copernicus’ autograph manuscript of De revolutionibus, is by far the largest and most comprehensive of all editions of Copernicus’ works and sources related to Copernicus.  The present volume of texts for the reception of Copernican theory, in two parts, is among the most important.  A few of the texts have appeared in editions in the twentieth century, a few in the nineteenth century, some only in original printings in the sixteenth and early seventeenth centuries, and some are only in manuscript, edited here for the first time.  It is a reasonable guess that few of these texts will ever be edited again, so what is published here will remain the standard editions for the foreseeable future.  There is a thorough recording of variants from earlier editions; introductions describing sources, previous publication, and context of the texts; a certain amount of annotation; and German translations of the Latin texts.  What follows is a brief review of the contents.","documents":null,"note":"© 2017 The Authors. \n\nFirst Published  May 16, 2017. \n\nBook review of: Nicolaus Copernicus Gesamtausgabe, Bd. VIII: Receptio Copernicana, Texte zur Aufnahme der copernicanischen Theorie; 1 Texte, 2 Kommentare und deutsche Übersetzungen. Edited by Nobis Heribert M Folkerts Menso Kirschner Stefan Kühne Andreas and for VIII/1 Heribert M Nobis, Anna Maria Pastori with assistance of Menso Folkerts and Felix Schmeidler; for VIII/2 Stefan Kirschner, Andrea Kühne and Felix Schmeidler (VIII/1 Akademie Verlag, Berlin, 2002, De Gruyter Oldenbourg, Berlin, 2009; VIII/2 De Gruyter Oldenbourg, Berlin, 2015). Pp. xliv + 609, x + 534. €220, €234. ISBN 9783050048192, 9783642359828.","id":78033,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/80/33","datestamp":"2017-06-09 21:16:00","lastmod":"2017-06-09 21:16:00","status_changed":"2017-06-09 21:16:00","type":"article","metadata_visibility":"show","creators":[{"given":"N. M.","family":"Swerdlow","id":"Swerdlow-N-M","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-05-16","date_type":"published","publication":"Journal for the History of Astronomy","volume":"48","number":"2","pagerange":"242-246","id_number":"CaltechAUTHORS:20170608-114555678","refereed":true,"issn":"0021-8286","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170608-114555678","related_url":[{"url":"http://dx.doi.org/10.1177/0021828617706803","type":"doi","description":"Article"},{"url":"http://journals.sagepub.com/doi/10.1177/0021828617706803","type":"pub","description":"Article"},{"url":"https://www.degruyter.com/view/product/225442","type":"pub","description":"Book Publisher"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}