{"title":"Alkoxy Radical Bond Scissions Explain the Anomalously Low Secondary Organic Aerosol and Organonitrate Yields from α-Pinene + NO_3","uri":"","abstract":"Oxidation of monoterpenes (C_(10)H_(16)) by nitrate radicals (NO_3) constitutes an important source of atmospheric secondary organic aerosol (SOA) and organonitrates. However, knowledge of the mechanisms of their formation is incomplete and differences in yields between similar monoterpenes are poorly understood. In particular, yields of SOA and organonitrates from α-pinene + NO_3 are low, while those from Δ^3-carene + NO_3 are high. Using computational methods, we suggest that bond scission of the nitrooxy alkoxy radicals from Δ^3-carene lead to the formation of reactive keto-nitrooxy-alkyl radicals, which retain the nitrooxy moiety and can undergo further reactions to form SOA. In contrast, bond scissions of the nitrooxy alkoxy radicals from α-pinene lead almost exclusively to the formation of the relatively unreactive and volatile product pinonaldehyde (C_(10)H_(16)O_2), thereby limiting organonitrate and SOA formation. This hypothesis is supported by laboratory experiments that quantify products of the reaction of α-pinene + NO_3 under atmospherically relevant conditions.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253385","docid":253385,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268131","fileid":1268131,"datasetid":"document","objectid":253385,"filename":"acs%2Ejpclett%2E7b01038.pdf","mime_type":"application/pdf","hash":"661ea04b7c8bd1828dc1aa374a3c5bbd","hash_type":"MD5","filesize":1793171,"mtime":"2017-06-08 18:23:12","url":"http://authors.library.caltech.edu/78031/1/acs%252Ejpclett%252E7b01038.pdf"}],"eprintid":78031,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"acs%2Ejpclett%2E7b01038.pdf","content":"accepted"}],"note":"© 2017 American Chemical Society. \n\nPublication Date (Web): June 6, 2017. \n\nFrom the FIXCIT campaign, we thank Matthew Coggon and John Seinfeld for AMS data, Jeong-Hoo Park, Allen Goldstein, John Mak, and Alex Guenther for the PTR-MS data, John Crounse, Alex Teng and Kelvin Bates for the ToF-CIMS data and their work organizing and conducting the experiment. We also thank Alan Shusterman, Catherine Neshyba, Katie Stellmach, Rasmus V. Otkjær, Noora Hyttinen, Camilla Mia Tram, and Benjamin N. Frandsen for helpful discussions. TK thanks the Academy of Finland (266388) for funding and the CSC IT Center for Science in Espoo, Finland, for computing time. HGK and KHM thank the Center for Exploitation of Solar Energy, University of Copenhagen and the Danish Center for Scientific Computing for funding. POW thanks the NSF for funding (Grant No. CHE-1508526 and AGS-1240604). JLF gratefully acknowledges sabbatical support from the U.S. Fulbright Scholar Program and research funding from the NOAA Climate Program Office’s AC4 program (Grant\nNo. NA13OAR4310070). The National Center for Atmospheric Research is sponsored by the National Science Foundation.","id":78031,"rev_number":11,"userid":18,"eprint_dir":"disk0/00/07/80/31","datestamp":"2017-06-08 21:15:29","lastmod":"2017-06-08 21:15:29","status_changed":"2017-06-08 21:15:29","type":"article","metadata_visibility":"show","creators":[{"given":"Theo","family":"Kurtén","id":"Kurtén-T","orcid":""},{"given":"Kristian H.","family":"Møller","id":"Møller-K-H","orcid":""},{"given":"Tran Bao","family":"Nguyen","id":"Nguyen-Tran-Bao","orcid":""},{"given":"Rebecca H.","family":"Schwantes","id":"Schwantes-R-H","orcid":"0000-0002-7095-3718"},{"given":"Pawel K.","family":"Misztal","id":"Misztal-P-K","orcid":""},{"given":"Luping","family":"Su","id":"Su-Luping","orcid":""},{"given":"Paul O.","family":"Wennberg","id":"Wennberg-P-O","orcid":"0000-0002-6126-3854"},{"given":"Juliane L.","family":"Fry","id":"Fry-J-L","orcid":""},{"given":"Henrik Grum","family":"Kjærgaard","id":"Kjærgaard-H-G","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-06-06","date_type":"inpress","publication":"Journal of Physical Chemistry Letters","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170608-112307794","refereed":true,"issn":"1948-7185 ","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170608-112307794","related_url":[{"url":"http://dx.doi.org/10.1021/acs.jpclett.7b01038","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/acs.jpclett.7b01038","type":"pub","description":"Article"}],"referencetext":["1. Jimenez, J. L.; Canagaratna, M. R.; Donahue, N. M.; Prevot, A. S. H.; Zhang, Q.; Kroll,\nJ. H.; DeCarlo, P. F.; Allan, J. D.; Coe, H.; Ng, N. L.; Aiken, A. C.; Docherty, K. S.; Ulbrich, I.\nM.; Grieshop, A. P.; Robinson, A. L.; Duplissy, J.; Smith, J. D.; Wilson, K. R.; Lanz, V. A.;\nHueglin, C.; Sun, Y. L.; Tian, J.; Laaksonen, A.; Raatikainen, T.; Rautiainen, J.; Vaattovaara, P.;\nEhn, M.; Kulmala, M.; Tomlinson, J. M.; Collins, D. R.; Cubison, M. J.; Dunlea, J.; Huffman, J.\nA.; Onasch, T. B.; Alfarra, M. R.; Williams, P. I.; Bower, K.; Kondo, Y.; Schneider, J.;\nDrewnick, F.; Borrmann, S.; Weimer, S.; Demerjian, K.; Salcedo, D.; Cottrell, L.; Griffin, R.;\nTakami, A.; Miyoshi, T.; Hatakeyama, S.; Shimono, A.; Sun, J. Y.; Zhang, Y. M.; Dzepina, K.;\nKimmel, J. R.; Sueper, D.; Jayne, J. T.; Herndon, S. C.; Trimborn, A. M.; Williams, L. R.;\nWood, E. C.; Middlebrook, A. M.; Kolb, C. E.; Baltensperger, U.; Worsnop, D. R. Evolution of\nOrganic Aerosols in the Atmosphere. Science 2009, 326, 1525-1529.\n2. Sindelarova, K.; Granier, C.; Bouarar, I.; Guenther, A.; Tilmes, S.; Stavrakou, T.; Müller,\nJ. F.; Kuhn, U.; Stefani, P.; Knorr, W. Global Data Set of Biogenic VOC Emissions Calculated\nby the MEGAN Model Over the Last 30 Years. Atmos. Chem. Phys. 2014, 14, 9317-9341.\n3. IPCC 2013: Climate Change 2013: The Physical Science Basis. Contribution of Working\nGroup I to the Fifth Assessment Report of the Intergovernmental Panel on Climate Change.\nStocker, T. F.; Qin, D.; Plattne, G.-K.; Tignor, M. M. B.; Allen, S. K.; Boschung, J.; Nauels, A.;\nXia, Y.; Bex, V.; Midgley, P. M., Eds. Cambridge University Press, Cambridge United Kingdom\nand New York, NY, USA: 2013; p 1535pp.\n4. Brauer, M.; Freedman, G.; Frostad, J.; van Donkelaar, A.; Martin, R. V.; Dentener, F.;\nDingenen, R. v.; Estep, K.; Amini, H.; Apte, J. S.; Balakrishnan, K.; Barregard, L.; Broday, D.;\nFeigin, V.; Ghosh, S.; Hopke, P. K.; Knibbs, L. D.; Kokubo, Y.; Liu, Y.; Ma, S.; Morawska, L.;\nSangrador, J. L. T.; Shaddick, G.; Anderson, H. R.; Vos, T.; Forouzanfar, M. H.; Burnett, R. T.;\nCohen, A. Ambient Air Pollution Exposure Estimation for the Global Burden of Disease 2013.\nEnviron. Sci. Technol. 2016, 50, 79-88.\n5. Slowik, J. G.; Stroud, C.; Bottenheim, J. W.; Brickell, P. C.; Chang, R. Y. W.; Liggio, J.;\nMakar, P. A.; Martin, R. V.; Moran, M. D.; Shantz, N. C.; Sjostedt, S. J.; van Donkelaar, A.;\nVlasenko, A.; Wiebe, H. A.; Xia, A. G.; Zhang, J.; Leaitch, W. R.; Abbatt, J. P. D. Characterization of a Large Biogenic Secondary Organic Aerosol Event from Eastern Canadian\nForests. Atmos. Chem. Phys. 2010, 10, 2825-2845.\n6. Paulot, F.; Henze, D. K.; Wennberg, P. O. Impact of the Isoprene Photochemical Cascade\non Tropical Ozone. Atmos. Chem. Phys. 2012, 12, 1307-1325.\n7. Hoyle, C. R.; Berntsen, T.; Myhre, G.; Isaksen, I. S. A. Secondary Organic Aerosol in the\nGlobal Aerosol - Chemical Transport Model Oslo CTM2. Atmos. Chem. Phys. 2007, 7, 5675-\n5694.\n8. Pye, H. O. T.; Chan, A. W. H.; Barkley, M. P.; Seinfeld, J. H. Global Modeling of\nOrganic Aerosol: The Importance of Reactive Nitrogen (NOx and NO3). Atmos. Chem. Phys.\n2010, 10, 11261-11276.\n9. Pye, H. O. T.; Luecken, D. J.; Xu, L.; Boyd, C. M.; Ng, N. L.; Baker, K. R.; Ayres, B. R.;\nBash, J. O.; Baumann, K.; Carter, W. P. L.; Edgerton, E.; Fry, J. L.; Hutzell, W. T.; Schwede, D.\nB.; Shepson, P. B. Modeling the Current and Future Roles of Particulate Organic Nitrates in the\nSoutheastern United States. Environ. Sci. Technol. 2015, 49, 14195-14203.\n10. Ng, N. L.; Brown, S. S.; Archibald, A. T.; Atlas, E.; Cohen, R. C.; Crowley, J. N.; Day,\nD. A.; Donahue, N. M.; Fry, J. L.; Fuchs, H.; Griffin, R. J.; Guzman, M. I.; Herrmann, H.;\nHodzic, A.; Iinuma, Y.; Jimenez, J. L.; Kiendler-Scharr, A.; Lee, B. H.; Luecken, D. J.; Mao, J.;\nMcLaren, R.; Mutzel, A.; Osthoff, H. D.; Ouyang, B.; Picquet-Varrault, B.; Platt, U.; Pye, H. O.\nT.; Rudich, Y.; Schwantes, R. H.; Shiraiwa, M.; Stutz, J.; Thornton, J. A.; Tilgner, A.; Williams,\nB. J.; Zaveri, R. A. Nitrate Radicals and Biogenic Volatile Organic Compounds: Oxidation,\nMechanisms, and Organic Aerosol. Atmos. Chem. Phys. 2017, 17, 2103-2162.\n11. Geyer, A.; Alicke, B.; Ackermann, R.; Martinez, M.; Harder, H.; Brune, W.; di Carlo, P.;\nWilliams, E.; Jobson, T.; Hall, S.; Shetter, R.; Stutz, J. Direct Observations of Daytime NO3:\nImplications for Urban Boundary Layer Chemistry. J. Geophys. Res.: Atmos. 2003, 108, 4368.\n12. Ayres, B. R.; Allen, H. M.; Draper, D. C.; Brown, S. S.; Wild, R. J.; Jimenez, J. L.; Day,\nD. A.; Campuzano-Jost, P.; Hu, W.; de Gouw, J.; Koss, A.; Cohen, R. C.; Duffey, K. C.; Romer,\nP.; Baumann, K.; Edgerton, E.; Takahama, S.; Thornton, J. A.; Lee, B. H.; Lopez-Hilfiker, F. D.;\nMohr, C.; Wennberg, P. O.; Nguyen, T. B.; Teng, A.; Goldstein, A. H.; Olson, K.; Fry, J. L.\nOrganic Nitrate Aerosol Formation via NO3 + Biogenic Volatile Organic Compounds in the\nSoutheastern United States. Atmos. Chem. Phys. 2015, 15, 13377-13392.\n13. Rollins, A. W.; Browne, E. C.; Min, K. E.; Pusede, S. E.; Wooldridge, P. J.; Gentner, D.\nR.; Goldstein, A. H.; Liu, S.; Day, D. A.; Russell, L. M.; Cohen, R. C. Evidence for NOx Control\nover Nighttime SOA Formation. Science 2012, 337, 1210-1212.\n14. Fry, J. L.; Draper, D. C.; Zarzana, K. J.; Campuzano-Jost, P.; Day, D. A.; Jimenez, J. L.;\nBrown, S. S.; Cohen, R. C.; Kaser, L.; Hansel, A.; Cappellin, L.; Karl, T.; Hodzic Roux, A.;\nTurnipseed, A.; Cantrell, C.; Lefer, B. L.; Grossberg, N. Observations of Gas- and Aerosol-Phase\nOrganic Nitrates at BEACHON-RoMBAS 2011. Atmos. Chem. Phys. 2013, 13, 8585-8605.\n15. Xu, L.; Suresh, S.; Guo, H.; Weber, R. J.; Ng, N. L. Aerosol Characterization over the\nSoutheastern United States using High-Resolution Aerosol Mass Spectrometry: Spatial and\nSeasonal Variation of Aerosol Composition and Sources with a Focus on Organic Nitrates.\nAtmos. Chem. Phys. 2015, 15, 7307-7336.\n16. Kiendler-Scharr, A.; Mensah, A. A.; Friese, E.; Topping, D.; Nemitz, E.; Prevot, A. S.\nH.; Äijälä, M.; Allan, J.; Canonaco, F.; Canagaratna, M.; Carbone, S.; Crippa, M.; Dall Osto, M.;\nDay, D. A.; De Carlo, P.; Di Marco, C. F.; Elbern, H.; Eriksson, A.; Freney, E.; Hao, L.;\nHerrmann, H.; Hildebrandt, L.; Hillamo, R.; Jimenez, J. L.; Laaksonen, A.; McFiggans, G.;\nMohr, C.; O'Dowd, C.; Otjes, R.; Ovadnevaite, J.; Pandis, S. N.; Poulain, L.; Schlag, P.; Sellegri,\nK.; Swietlicki, E.; Tiitta, P.; Vermeulen, A.; Wahner, A.; Worsnop, D.; Wu, H. C. Ubiquity of\nOrganic Nitrates from Nighttime Chemistry in the European Submicron Aerosol. Geophys. Res.\nLett. 2016, 43, 7735-7744.\n17. Horowitz, L. W.; Fiore, A. M.; Milly, G. P.; Cohen, R. C.; Perring, A.; Wooldridge, P. J.;\nHess, P. G.; Emmons, L. K.; Lamarque, J.-F. Observational Constraints on the Chemistry of\nIsoprene Nitrates over the Eastern United States. J. Geophys. Res. 2007, 112, D12S08.\n18. Pierce, J. R.; Riipinen, I.; Kulmala, M.; Ehn, M.; Petäjä, T.; Junninen, H.; Worsnop, D.\nR.; Donahue, N. M. Quantification of the Volatility of Secondary Organic Compounds in\nUltrafine Particles During Nucleation Events. Atmos. Chem. Phys. 2011, 11, 9019-9036.\n19. Hallquist, M.; Wenger, J. C.; Baltensperger, U.; Rudich, Y.; Simpson, D.; Claeys, M.;\nDommen, J.; Donahue, N. M.; George, C.; Goldstein, A. H.; Hamilton, J. F.; Herrmann, H.;\nHoffmann, T.; Iinuma, Y.; Jang, M.; Jenkin, M. E.; Jimenez, J. L.; Kiendler-Scharr, A.;\nMaenhaut, W.; McFiggans, G.; Mentel, T. F.; Monod, A.; Prévôt, A. S. H.; Seinfeld, J. H.;\nSurratt, J. D.; Szmigielski, R.; Wildt, J. The Formation, Properties and Impact of Secondary\nOrganic Aerosol: Current and Emerging Issues. Atmos. Chem. Phys. 2009, 9, 5155-5236.\n20. Crounse, J. D.; Nielsen, L. B.; Jørgensen, S.; Kjaergaard, H. G.; Wennberg, P. O.\nAutoxidation of Organic Compounds in the Atmosphere. J. Phys. Chem. Lett. 2013, 4, 3513-\n3520.\n21. Ehn, M.; Thornton, J. A.; Kleist, E.; Sipilä, M.; Junninen, H.; Pullinen, I.; Springer, M.;\nRubach, F.; Tillmann, R.; Lee, B.; Lopez-Hilfiker, F.; Andres, S.; Acir, I.-H.; Rissanen, M.;\nJokinen, T.; Schobesberger, S.; Kangasluoma, J.; Kontkanen, J.; Nieminen, T.; Kurtén, T.;\nNielsen, L. B.; Jørgensen, S.; Kjaergaard, H. G.; Canagaratna, M.; Maso, M. D.; Berndt, T.;\nPetäjä, T.; Wahner, A.; Kerminen, V.-M.; Kulmala, M.; Worsnop, D. R.; Wildt, J.; Mentel, T. F.\nA Large Source of Low-Volatility Secondary Organic Aerosol. Nature 2014, 506, 476-479.\n22. Rissanen, M. P.; Kurtén, T.; Sipilä, M.; Thornton, J. A.; Kangasluoma, J.; Sarnela, N.;\nJunninen, H.; Jørgensen, S.; Schallhart, S.; Kajos, M. K.; Taipale, R.; Springer, M.; Mentel, T.\nF.; Ruuskanen, T.; Petäjä, T.; Worsnop, D. R.; Kjaergaard, H. G.; Ehn, M. The Formation of\nHighly Oxidized Multifunctional Products in the Ozonolysis of Cyclohexene. J. Am. Chem. Soc.\n2014, 136, 15596-15606.\n23. Vereecken, L.; Müller, J. F.; Peeters, J. Low-Volatility Poly-Oxygenates in the OHInitiated\nAtmospheric Oxidation of α-Pinene: Impact of Non-Traditional Peroxyl Radical\nChemistry. Phys. Chem. Chem. Phys. 2007, 9, 5241-5248.\n24. Peeters, J.; Nguyen, T. L.; Vereecken, L. HOx Radical Regeneration in the Oxidation of\nIsoprene. Phys. Chem. Chem. Phys. 2009, 11, 5935-5939.\n25. Savee, J. D.; Papajak, E.; Rotavera, B.; Huang, H.; Eskola, A. J.; Welz, O.; Sheps, L.;\nTaatjes, C. A.; Zador, J.; Osborn, D. L. Direct Observation and Kinetics of a Hydroperoxyalkyl\nRadical (QOOH). Science 2015, 347, 643-646.\n26. Griffin, R. J.; Cocker, D. R.; Seinfeld, J. H.; Dabdub, D. Estimate of Global Atmospheric\nOrganic Aerosol from Oxidation of Biogenic Hydrocarbons. Geophys. Res. Lett. 1999, 26, 2721-\n2724.\n27. Jokinen, T.; Berndt, T.; Makkonen, R.; Kerminen, V.-M.; Junninen, H.; Paasonen, P.;\nStratmann, F.; Herrmann, H.; Guenther, A. B.; Worsnop, D. R.; Kulmala, M.; Ehn, M.; Sipilä,\nM. Production of Extremely Low Volatile Organic Compounds from Biogenic Emissions:\nMeasured Yields and Atmospheric Implications. Proc. Natl. Acad. Sci. U. S. A. 2015, 112, 7123-\n7128.\n28. Fry, J. L.; Draper, D. C.; Barsanti, K. C.; Smith, J. N.; Ortega, J.; Winkler, P. M.; Lawler,\nM. J.; Brown, S. S.; Edwards, P. M.; Cohen, R. C.; Lee, L. Secondary Organic Aerosol\nFormation and Organic Nitrate Yield from NO3 Oxidation of Biogenic Hydrocarbons. Environ.\nSci. Technol. 2014, 48, 11944-11953.\n29. Hallquist, M.; Wängberg, I.; Ljungström, E.; Barnes, I.; Becker, K.-H. Aerosol and\nProduct Yields from NO3 Radical-Initiated Oxidation of Selected Monoterpenes. Environ. Sci.\nTechnol. 1999, 33, 553-559.\n30. Spittler, M.; Barnes, I.; Bejan, I.; Brockmann, K. J.; Benter, T.; Wirtz, K. Reactions of\nNO3 Radicals with Limonene and α-Pinene: Product and SOA Formation. Atmos. Environ. 2006,\n40, S116-S127.\n31. Moldanova, J.; Ljungström, E. Modelling of Particle Formation from NO3 Oxidation of\nSelected Monoterpenes. J. Aerosol Sci. 2000, 31, 1317-1333.\n32. Jenkin, M. E.; Saunders, S. M.; Pilling, M. J. The Tropospheric Degradation of Volatile\nOrganic Compounds: A Protocol for Mechanism Development. Atmos. Environ. 1997, 31, 81-\n104.\n33. Saunders, S. M.; Jenkin, M. E.; Derwent, R. G.; Pilling, M. J. Protocol for the\nDevelopment of the Master Chemical Mechanism, MCM v3 (Part A): Tropospheric Degradation\nof Non-Aromatic Volatile Organic Compounds. Atmos. Chem. Phys. 2003, 3, 161-180.\n34. Park, J.; Jongsma, C. G.; Zhang, R.; North, S. W. OH/OD Initiated Oxidation of Isoprene\nin the Presence of O2 and NO. J. Phys. Chem. A 2004, 108, 10688-10697.\n35. Vereecken, L.; Peeters, J. Theoretical Study of the Formation of Acetone in the OHInitiated\nAtmospheric Oxidation of α-Pinene. J. Phys. Chem. A 2000, 104, 11140-11146.\n36. Dibble, T. S. Reactions of the Alkoxy Radicals Formed Following OH-Addition to α-\nPinene and β-Pinene. C−C Bond Scission Reactions. J. Am. Chem. Soc. 2001, 123, 4228-4234.\n37. Møller, K. H.; Otkjær, R. V.; Hyttinen, N.; Kurtén, T.; Kjaergaard, H. G. Cost-Effective\nImplementation of Multiconformer Transition State Theory for Peroxy Radical Hydrogen Shift\nReactions. J. Phys. Chem. A 2016, 120, 10072-10087.\n38. Orlando, J. J.; Tyndall, G. S. Laboratory Studies of Organic Peroxy Radical Chemistry:\nAn Overview with Emphasis on Recent Issues of Atmospheric Significance. Chem. Soc. Rev.\n2012, 41, 6294-6317.\n39. Xie, Y.; Paulot, F.; Carter, W. P. L.; Nolte, C. G.; Luecken, D. J.; Hutzell, W. T.;\nWennberg, P. O.; Cohen, R. C.; Pinder, R. W. Understanding the Impact of Recent Advances in\nIsoprene Photooxidation on Simulations of Regional Air Quality. Atmos. Chem. Phys. 2013, 13,\n8439-8455.\n40. Nguyen, T. B.; Crounse, J. D.; Schwantes, R. H.; Teng, A. P.; Bates, K. H.; Zhang, X.;\nSt. Clair, J. M.; Brune, W. H.; Tyndall, G. S.; Keutsch, F. N.; Seinfeld, J. H.; Wennberg, P. O.\nOverview of the Focused Isoprene eXperiment at the California Institute of Technology\n(FIXCIT): Mechanistic Chamber Studies on the Oxidation of Biogenic Compounds. Atmos.\nChem. Phys. 2014, 14, 13531-13549.\n41. Schwantes, R. H.; Teng, A. P.; Nguyen, T. B.; Coggon, M. M.; Crounse, J. D.; St. Clair,\nJ. M.; Zhang, X.; Schilling, K. A.; Seinfeld, J. H.; Wennberg, P. O. Isoprene NO3 Oxidation\nProducts from the RO2 + HO2 Pathway. J. Phys. Chem. A 2015, 119, 10158-10171.\n42. Eddingsaas, N. C.; Loza, C. L.; Yee, L. D.; Seinfeld, J. H.; Wennberg, P. O. α-Pinene\nPhotooxidation under Controlled Chemical Conditions – Part 1: Gas-Phase Composition in Lowand\nHigh-NOx Environments. Atmos. Chem. Phys. 2012, 12, 6489-6504.\n43. Lim, Y. B.; Ziemann, P. J. Effects of Molecular Structure on Aerosol Yields from OH\nRadical-Initiated Reactions of Linear, Branched, and Cyclic Alkanes in the Presence of NOx.\nEnviron. Sci. Technol. 2009, 43, 2328-2334.\n44. Wängberg, I.; Barnes, I.; Becker, K. H. Product and Mechanistic Study of the Reaction of\nNO3 Radicals with α-Pinene. Environ. Sci. Technol. 1997, 31, 2130-2135.\n45. Vereecken, L.; Peeters, J. A Structure–Activity Relationship for the Rate Coefficient of\nH-Migration in Substituted Alkoxy Radicals. Phys. Chem. Chem. Phys. 2010, 12, 12608.\n46. Atkinson, R. Rate Constants for the Atmospheric Reactions of Alkoxy Radicals: An\nUpdated Estimation Method. Atmos. Environ. 2007, 41, 8468-8485.\n47. Vereecken, L.; Peeters, J. Decomposition of Substituted Alkoxy Radicals - Part I: A\nGeneralized Structure-Activity Relationship for Reaction Barrier Heights. Phys. Chem. Chem.\nPhys. 2009, 11, 9062.\n48. Vereecken, L.; Peeters, J. A Theoretical Study of the OH-Initiated Gas-Phase Oxidation\nMechanism of β-Pinene (C10H16): First Generation Products. Phys. Chem. Chem. Phys. 2012,\n14, 3802-3815.\n49. Vereecken, L.; Peeters, J. H-atom Abstraction by OH-Radicals from (Biogenic)\n(Poly)alkenes: C–H Bond Strengths and Abstraction Rates. Chem. Phys. Lett. 2001, 333, 162-\n168.\n50. Kurtén, T.; Rissanen, M. P.; Mackeprang, K.; Thornton, J. A.; Hyttinen, N.; Jørgensen,\nS.; Ehn, M.; Kjaergaard, H. G. Computational Study of Hydrogen Shifts and Ring-Opening\nMechanisms in α-Pinene Ozonolysis Products. J. Phys. Chem. A 2015, 119, 11366-11375.\n51. Fry, J. L.; Kiendler-Scharr, A.; Rollins, A. W.; Brauers, T.; Brown, S. S.; Dorn, H. P.;\nDubé, W. P.; Fuchs, H.; Mensah, A.; Rohrer, F.; Tillmann, R.; Wahner, A.; Wooldridge, P. J.;\nCohen, R. C. SOA from Limonene: Role of NO3 in its Generation and Degradation. Atmos.\nChem. Phys. 2011, 11, 3879-3894.\n52. Lee, L.; Teng, A. P.; Wennberg, P. O.; Crounse, J. D.; Cohen, R. C. On Rates and\nMechanisms of OH and O3 Reactions with Isoprene-Derived Hydroxy Nitrates. J. Phys. Chem.\nA 2014, 118, 1622-1637.\n53. Berndt, T.; Richters, S.; Jokinen, T.; Hyttinen, N.; Kurtén, T.; Otkjær, R. V.; Kjaergaard,\nH. G.; Stratmann, F.; Herrmann, H.; Sipilä, M.; Kulmala, M.; Ehn, M. Hydroxyl Radical-\nInduced Formation of Highly Oxidized Organic Compounds. Nat. Commun. 2016, 7, 13677.\n54. Eddingsaas, N. C.; Loza, C. L.; Yee, L. D.; Chan, M.; Schilling, K. A.; Chhabra, P. S.;\nSeinfeld, J. H.; Wennberg, P. O. α-Pinene Photooxidation under Controlled Chemical Conditions\n- Part 2: SOA Yield and Composition in Low- and High-NOx Environments. Atmos. Chem.\nPhys. 2012, 12, 7413-7427.\n55. Griffin, R. J.; Cocker, D. R.; Flagan, R. C.; Seinfeld, J. H. Organic Aerosol Formation\nfrom the Oxidation of Biogenic Hydrocarbons. J. Geophys. Res.: Atmos. 1999, 104, 3555-3567.\n56. Halgren, T. A. MMFF VII. Characterization of MMFF94, MMFF94s, and other Widely\nAvailable Force Fields for Conformational Energies and for Intermolecular-Interaction Energies\nand Geometries. J. Comput. Chem. 1999, 20, 730-748.\n57. Spartan'14, Wavefunction, Inc., Irvine, CA: 2014.\n58. Becke, A. D. Density‐Functional Thermochemistry. III. The Role of Exact Exchange. J.\nChem. Phys. 1993, 98, 5648-5652.\n59. Lee, C.; Yang, W.; Parr, R. G. Development of the Colle-Salvetti Correlation-Energy\nFormula into a Functional of the Electron Density. Phys. Rev. B 1988, 37, 785-789.\n60. Chai, J.-D.; Head-Gordon, M. Long-Range Corrected Hybrid Density Functionals with\nDamped Atom–Atom Dispersion Corrections. Phys. Chem. Chem. Phys. 2008, 10, 6615-6620.\n61. Dunning, T. H. Gaussian Basis Sets for use in Correlated Molecular Calculations. I. The\nAtoms Boron Through Neon and Hydrogen. J. Chem. Phys. 1989, 90, 1007-1023.\n62. Kendall, R. A.; Dunning, T. H.; Harrison, R. J. Electron Affinities of the First‐Row\nAtoms Revisited. Systematic Basis Sets and Wave Functions. J. Chem. Phys. 1992, 96, 6796-\n6806.\n63. Frisch, M. J.; Trucks, G. W.; Schlegel, H. B.; Scuseria, G. E.; Robb, M. A.; Cheeseman,\nJ. R.; Scalmani, G.; Barone, V.; Mennucci, B.; Petersson, G. A.; Nakatsuji, H.; Caricato, M.; Li,\nX.; Hratchian, H. P.; Izmaylov, A. F.; Bloino, J.; Zheng, G.; Sonnenberg, J. L.; Hada, M.; Ehara,\nM.; Toyota, K.; Fukuda, R.; Hasegawa, J.; Ishida, M.; Nakajima, T.; Honda, Y.; Kitao, O.;\nNakai, H.; Vreven, T.; Montgomery Jr., J. A.; Peralta, J. E.; Ogliaro, F.; Bearpark, M. J.; Heyd,\nJ.; Brothers, E. N.; Kudin, K. N.; Staroverov, V. N.; Kobayashi, R.; Normand, J.; Raghavachari,\nK.; Rendell, A. P.; Burant, J. C.; Iyengar, S. S.; Tomasi, J.; Cossi, M.; Rega, N.; Millam, N. J.;\nKlene, M.; Knox, J. E.; Cross, J. B.; Bakken, V.; Adamo, C.; Jaramillo, J.; Gomperts, R.;\nStratmann, R. E.; Yazyev, O.; Austin, A. J.; Cammi, R.; Pomelli, C.; Ochterski, J. W.; Martin, R.\nL.; Morokuma, K.; Zakrzewski, V. G.; Voth, G. A.; Salvador, P.; Dannenberg, J. J.; Dapprich,\nS.; Daniels, A. D.; Farkas, Ö.; Foresman, J. B.; Ortiz, J. V.; Cioslowski, J.; Fox, D. J. Gaussian\n09, Revision D.01, Gaussian, Inc.: Wallingford, CT, USA, 2009.\n64. Eckart, C. The Penetration of a Potential Barrier by Electrons. Phys. Rev. 1930, 35, 1303-\n1309.\n65. Adler, T. B.; Knizia, G.; Werner, H.-J. A Simple and Efficient CCSD(T)-F12\nApproximation. J. Chem. Phys. 2007, 127, 221106.\n66. Werner, H.-J.; Knowles, P. J.; Knizia, G.; Manby, F. R.; Schütz, M. Molpro: A General-\nPurpose Quantum Chemistry Program Package. Wiley Interdiscip. Rev.: Comput. Mol. Sci. 2011,\n2, 242-253.\n67. Glowacki, D. R.; Liang, C.-H.; Morley, C.; Pilling, M. J.; Robertson, S. H. MESMER:\nAn Open-Source Master Equation Solver for Multi-Energy Well Reactions. J. Phys. Chem. A\n2012, 116, 9545-9560."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Alkoxy Radical Bond Scissions Explain the Anomalously Low Secondary Organic Aerosol and Organonitrate Yields from α-Pinene + NO3\nTheo Kurtén, Kristian H. Møller, Tran Bao Nguyen, Rebecca H. Schwantes, Pawel K. Misztal, Luping Su, Paul O. Wennberg, Juliane L. Fry, and Henrik Grum Kjærgaard\nThe Journal of Physical Chemistry Letters Just Accepted Manuscript \nDOI: 10.1021/acs.jpclett.7b01038","other_numbering_system":null,"funders":[{"agency":"Academy of Finland","grant_number":"266388"},{"agency":"Center for Exploitation of Solar Energy","grant_number":""},{"agency":"University of Copenhagen","grant_number":""},{"agency":"Danish Center for Scientific Computing","grant_number":""},{"agency":"NSF","grant_number":"CHE-1508526"},{"agency":"NSF","grant_number":"AGS-1240604"},{"agency":"Fulbright Foundation","grant_number":""},{"agency":"National Oceanic and Atmospheric Administration (NOAA)","grant_number":"NA13OAR4310070"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}