{"title":"Gas Sorption and Barrier Properties of Polymeric Membranes from Molecular Dynamics and Monte Carlo Simulations","uri":"","abstract":"It is important for many industrial processes to design new materials with improved selective permeability properties. Besides diffusion, the molecule's solubility contributes largely to the overall permeation process. This study presents a method to calculate solubility coefficients of gases such as O_2, H_2O (vapor), N_2, and CO_2 in polymeric matrices from simulation methods (Molecular Dynamics and Monte Carlo) using first principle predictions. The generation and equilibration (annealing) of five polymer models (polypropylene, polyvinyl alcohol, polyvinyl dichloride, polyvinyl chloride-trifluoroethylene, and polyethylene terephtalate) are extensively described. For each polymer, the average density and Hansen solubilities over a set of ten samples compare well with experimental data. For polyethylene terephtalate, the average properties between a small (n = 10) and a large (n = 100) set are compared. Boltzmann averages and probability density distributions of binding and strain energies indicate that the smaller set is biased in sampling configurations with higher energies. However, the sample with the lowest cohesive energy density from the smaller set is representative of the average of the larger set. Density-wise, low molecular weight polymers tend to have on average lower densities. Infinite molecular weight samples do however provide a very good representation of the experimental density. Solubility constants calculated with two ensembles (grand canonical and Henry's constant) are equivalent within 20%. For each polymer sample, the solubility constant is then calculated using the faster (10×) Henry's constant ensemble (HCE) from 150 ps of NPT dynamics of the polymer matrix. The influence of various factors (bad contact fraction, number of iterations) on the accuracy of Henry's constant is discussed. To validate the calculations against experimental results, the solubilities of nitrogen and carbon dioxide in polypropylene are examined over a range of temperatures between 250 and 650 K. The magnitudes of the calculated solubilities agree well with experimental results, and the trends with temperature are predicted correctly. The HCE method is used to predict the solubility constants at 298 K of water vapor and oxygen. The water vapor solubilities follow more closely the experimental trend of permeabilities, both ranging over 4 orders of magnitude. For oxygen, the calculated values do not follow entirely the experimental trend of permeabilities, most probably because at this temperature some of the polymers are in the glassy regime and thus are diffusion dominated. Our study also concludes large confidence limits are associated with the calculated Henry's constants. By investigating several factors (terminal ends of the polymer chains, void distribution, etc.), we conclude that the large confidence limits are intimately related to the polymer's conformational changes caused by thermal fluctuations and have to be regardedat least at microscaleas a characteristic of each polymer and the nature of its interaction with the solute. Reducing the mobility of the polymer matrix as well as controlling the distribution of the free (occupiable) volume would act as mechanisms toward lowering both the gas solubility and the diffusion coefficients.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253401","docid":253401,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268264","fileid":1268264,"datasetid":"document","objectid":253401,"filename":"jp062942h.pdf","mime_type":"application/pdf","hash":"8f778fb55f76f661ba608b4da2f684de","hash_type":"MD5","filesize":1182829,"mtime":"2017-06-09 14:19:34","url":"http://authors.library.caltech.edu/78040/1/jp062942h.pdf"}],"eprintid":78040,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"jp062942h.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/253402","docid":253402,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268272","fileid":1268272,"datasetid":"document","objectid":253402,"filename":"jp062942hsi20061103_052556.pdf","mime_type":"application/pdf","hash":"e893f7b1de35ba609e582a1c3ea77a06","hash_type":"MD5","filesize":680359,"mtime":"2017-06-09 14:27:08","url":"http://authors.library.caltech.edu/78040/2/jp062942hsi20061103_052556.pdf"}],"eprintid":78040,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"jp062942hsi20061103_052556.pdf","content":"supplemental"}],"note":"© 2007 American Chemical Society. \n\nReceived 14 May 2006. Published online 8 March 2007. Published in print 1 March 2007. \n\nWe would like to thank Alejandro Strachan for his contribution and valuable suggestions in the initial stages of this project. We thank R. Niemer and Y. Zhou with help in building some of the polymer samples used in this study. This work was supported in part by a grant from the Avery Dennison Corporation. The facilities of the MSC are partly funded by NSF, DOE-ASCI, Chevron, NIH, ONR, Seiko-Epson, Kellogg's, General Motors, Beckman Institute, Asahi Chemical, and Nippon Steel.","id":78040,"rev_number":12,"userid":772,"eprint_dir":"disk0/00/07/80/40","datestamp":"2017-06-09 16:10:45","lastmod":"2017-06-09 16:10:45","status_changed":"2017-06-09 16:10:45","type":"article","metadata_visibility":"show","creators":[{"given":"Ioana","family":"Cozmuta","id":"Cozmuta-I","orcid":""},{"given":"Mario","family":"Blanco","id":"Blanco-M","orcid":""},{"given":"William A., III","family":"Goddard","id":"Goddard-W-A-III","orcid":"0000-0003-0097-5716"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2007-03-29","date_type":"published","publication":"Journal of Physical Chemistry B","volume":"111","number":"12","pagerange":"3151-3166","id_number":"CaltechAUTHORS:20170609-071851389","refereed":true,"issn":"1520-6106","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170609-071851389","related_url":[{"url":"http://dx.doi.org/10.1021/jp062942h","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/jp062942h","type":"pub","description":"Article"},{"url":"http://pubs.acs.org/doi/suppl/10.1021/jp062942h","type":"pub","description":"Supporting Information"}],"referencetext":["(1) Permeability and other film properties of plastic and elastomers; Plastic Design Library:  Norwich, NY, 1995.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(2) A similar expression of permeability can be derived for the permeant being a liquid.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(3) Neyertz, S.; Douanne, A.; Brown, D. Macromolecules. 2005, 38, 10286.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(4) Kucukpinar, E. and Doruker, P. Polymer 2003, 44, 3607.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(5) Hu, N. and Fried, J. R. Polymer 2005, 46, 4330.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(6) Economou, I. G. Fluid Phase Equilib. 2005, 228, 15.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(7) Kashilara, S.; Iotov, M.; Dasgupta, S.; Gao, G.; Belmares, M.; Goddard, W. A. Unpublished data.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(8) Cerius2 MSI manual, Accelrys:  San Diego, CA, April 1997.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(9) As for PET, the number of atoms in the polymeric chain is larger than that of the other polymers; a 5-mer instead of a 20-mer, having the same number of atoms as the 20-mers of PP, PCTFE, PVDC, and PVOH was constructed. Due to the presence of chiral centers, for PP and PCTFE, syndiotactic samples were built.OpenURL CALIFORNIA INST OF TECHNOLOGY\nMayo, S. L.; Olafson, B. D.; Goddard, W. A. J. Phys. Chem. 1990, 94, 8897.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(11) Hildebrand, J. H. The Solubility of Non-Electrolytes, Reinhold Publications Corporation:  New York, 1936.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(12) Blanco, M. J. Comput. Chem. 2004, 25, 1814.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(13) Polymer Handbook, 4th ed.; Brandrup, J., Immergut, E. H., Grulke, E. A., Eds.; John Wiley \u0026 Sons Inc.:  New York, 1999.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(14) Muller-Plathe, F. Macromolecules 1991, 24, 6475.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(15) Stanett, V. T. Adv. Polym. Sci. 1978, 32, 69.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(16) Vasile, C. Handbook of polyolefins; Marcel Dekker:  New York, 2000.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(17) Metropolis, N.; Rosenbluth, A. W.; Rosenbluth, M. N.; Teller, A. N.; Teller, E. J. Chem. Phys. 1953, 21, 1087.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(18) Allen, M. P.; Tildesley, D. J. Computer simulation of liquids, Clarendon Press:  Oxford, U.K., 1987.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(19) Bezus, A. G.; Kiselev, A.V.; Lppatkin, A.A.; Pham Quang, Du, J. Chem. Soc., Faraday Trans. 1978, 2, 74−367.OpenURL CALIFORNIA INST OF TECHNOLOGY\nDurill, P. L.; Griskey, R. G. AIChE J. 1996, 12, 1147.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(21) Sato, Y. Fluid Phase Equilib, 1999, 162, 261.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(22) Stern, S. A.; Mullhaupt, J. T.; Gareis, P. J. AIChE J. 1969, 15, 64.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(23) Reid, R.C. The properties of gases and liquids, 4th ed.; McGraw-Hill:  New York, 1987.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(24) http://www.diffusion-polymers.com/Gas%20Diffusion.htm.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(25) Vaia, R. A.; Giannelis, E. P. MRS Bulletin, May 2001.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(26) The occupiable volume is the fraction of the total volume of the unit cell that can be occupied by a probe of radius Rp (includes isolated voids in the polymer matrix). A probe radius of 1.2 Å was used in the present study.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(27) Strachan, A.; Cozmuta, I.; Blanco, M.; Goddard, W. A. Multi-scale, hierarchical modeling of membrane barrier properties, Technical Report; Avery Dennison:  August 2001.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(28) Barton, A. F. M. CRC handbook of polymer-liquid interaction parameters and solubility parameters; CRC Press:  New York, 1990.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(29) Supaphol, P.; Spuiell, J. E.; Lin, J. S. Polym. Int. 2000, 49, 1473."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Gas Sorption and Barrier Properties of Polymeric Membranes from Molecular Dynamics and Monte Carlo Simulations\nIoana Cozmuta, Mario Blanco, and William A. Goddard III\nThe Journal of Physical Chemistry B 2007 111 (12), 3151-3166\nDOI: 10.1021/jp062942h","other_numbering_system":null,"funders":[{"agency":"Avery-Dennison","grant_number":""},{"agency":"NSF","grant_number":""},{"agency":"Department of Energy (DOE)","grant_number":""},{"agency":"Chevron","grant_number":""},{"agency":"NIH","grant_number":""},{"agency":"Office of Naval Research (ONR)","grant_number":""},{"agency":"Seiko-Epson","grant_number":""},{"agency":"Kellogg's","grant_number":""},{"agency":"General Motors","grant_number":""},{"agency":"Caltech Beckman Institute","grant_number":""},{"agency":"Asahi Chemical","grant_number":""},{"agency":"Nippon Steel","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}