{"title":"Sampling the posterior: An approach to non-Gaussian data assimilation","uri":"","abstract":"The viewpoint taken in this paper is that data assimilation is fundamentally a statistical problem and that this problem should be cast in a Bayesian framework. In the absence of model error, the correct solution to the data assimilation problem is to find the posterior distribution implied by this Bayesian setting. Methods for dealing with data assimilation should then be judged by their ability to probe this distribution. In this paper we propose a range of techniques for probing the posterior distribution, based around the Langevin equation; and we compare these new techniques with existing methods.\n\nWhen the underlying dynamics is deterministic, the posterior distribution is on the space of initial conditions leading to a sampling problem over this space. When the underlying dynamics is stochastic the posterior distribution is on the space of continuous time paths. By writing down a density, and conditioning on observations, it is possible to define a range of Markov Chain Monte Carlo (MCMC) methods which sample from the desired posterior distribution, and thereby solve the data assimilation problem. The basic building-blocks for the MCMC methods that we concentrate on in this paper are Langevin equations which are ergodic and whose invariant measures give the desired distribution; in the case of path space sampling these are stochastic partial differential equations (SPDEs).\n\nTwo examples are given to show how data assimilation can be formulated in a Bayesian fashion. The first is weather prediction, and the second is Lagrangian data assimilation for oceanic velocity fields. Furthermore the relationship between the Bayesian approach outlined here and the commonly used Kalman filter based techniques, prevalent in practice, is discussed. Two simple pedagogical examples are studied to illustrate the application of Bayesian sampling to data assimilation concretely. Finally a range of open mathematical and computational issues, arising from the Bayesian approach, are outlined.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253444","docid":253444,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268521","fileid":1268521,"datasetid":"document","objectid":253444,"filename":"1-s2.0-S016727890600217X-main.pdf","mime_type":"application/pdf","hash":"ae75804a7b0450d865606f1e9de72096","hash_type":"MD5","filesize":2215501,"mtime":"2017-06-09 20:09:58","url":"http://authors.library.caltech.edu/78062/1/1-s2.0-S016727890600217X-main.pdf"}],"eprintid":78062,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"1-s2.0-S016727890600217X-main.pdf","content":"published"}],"note":"© 2006 Elsevier Ltd. \n\nAvailable online 8 August 2006. \n\nThe authors are grateful to Greg Eyink, Kayo Ide, Chris Jones and Arthur Krener for helpful input. AMS and JV are grateful to the EPSRC (UK) and ONR (USA) for funding. AA would like to acknowledge the support of ONR (grant number N00014-04-1-0215) and SAMSI (grant number 03-SC-NSF-1009).","id":78062,"rev_number":7,"userid":772,"eprint_dir":"disk0/00/07/80/62","datestamp":"2017-06-09 21:25:25","lastmod":"2017-06-09 21:25:25","status_changed":"2017-06-09 21:25:25","type":"article","metadata_visibility":"show","creators":[{"given":"A.","family":"Apte","id":"Apte-A","orcid":""},{"given":"M.","family":"Hairer","id":"Hairer-M","orcid":""},{"given":"A. M.","family":"Stuart","id":"Stuart-A-M","orcid":""},{"given":"J.","family":"Voss","id":"Voss-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Data assimilation; Bayesian filtering; Stochastic PDEs; Langevin equation","date":"2007-06","date_type":"published","publication":"Physica D","volume":"230","number":"1-2","pagerange":"50-64","id_number":"CaltechAUTHORS:20170609-130839195","refereed":true,"issn":"0167-2789","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170609-130839195","related_url":[{"url":"https://doi.org/10.1016/j.physd.2006.06.009","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S016727890600217X","type":"pub","description":"Article"}],"referencetext":["[1] F. Alexander, G. Eyink, J. Restrepo, Accelerated Monte–Carlo for optimal\nestimation of time series, J. Stat. Phys. 119 (2005) 1331–1345.\n[2] A.F. Bennet, Inverse Methods in Physical Oceanography, University\nPress, Cambridge, 1999.\n[3] A.F. Bennet, Inverse Modeling of the Ocean and Atmosphere, University\nPress, Cambridge, 2002.\n[4] A. Beskos, G.O. Roberts, A.M. Stuart, J. Voss, An MCMC method for\ndiffusion bridges, Ann. Appl. Prob. (submitted for publication).\n[5] D.E. Caitlin, Estimation, Control and the Discrete Kalman Filter,\nSpringer, New York, 1989.\n[6] P. Courtier, O. Talagrand, Variational assimilation of meteorological\nobservations with the adjoint vorticity equation (II): Numerical results,\nQuart. J. R. Meteorol. Soc. 113 (1987) 1329–1368.\n[7] D. Crisan, P. Del Moral, T.J. Lyons, Discrete filtering using branching\nand interacting particle systems, Markov Process. Related Fields 5 (1999)\n293–318.\n[8] G. Da Prato, J. Zabczyk, Stochastic Equations in Infinite Dimensions,\nin: Encyclopedia of Mathematics and its Applications, vol. 44, Cambridge\nUniversity Press, 1992.\n[9] G. Evensen, The ensemble Kalman filter: Theoretical formulation and\npractical implementation, Ocean Dynam. 53 (2003) 343–367.\n[10] G.L. Eyink, S. Kim, A maximum entropy method for particle filtering,\nJ. Stat. Phys. (2006) (in press).\n[11] C.W. Gardiner, Handbook of Stochastic Methods, Springer, Berlin, 1985.\n[12] D. Givon, R. Kupferman, A.M. Stuart, Extracting macroscopic dynamics:\nModel problems and algorithms, Nonlinearity 17 (2004) R55–R127.\n[13] R. Graham, Path integral formulation of general diffusion processes,\nZ. Physik B 26 (1977) 281–290.\n[14] A.K. Griffith, N.K. Nichols, Adjoint techniques in data assimilation for\ntreating systematic model error, J. Flow, Turbul. Combust. 65 (2001)\n469–488.\n[15] M. Hairer, A.M. Stuart, J. Voss, P. Wiberg, Analysis of SPDEs arising in\npath sampling, part I: The Gaussian case, Commun. Math. Sci. 3 (2005)\n587–603.\n[16] M. Hairer, A.M. Stuart, J. Voss, Analysis of SPDEs arising in path\nsampling, part II: The nonlinear case, Ann. Appl. Prob. (submitted for\npublication).\n[17] K. Ide, L. Kuznetsov, C.K.R.T. Jones, Lagrangian data assimilation for\npoint vortex systems, J. Turbul. 3 (2002) 53.\n[18] C. Johnson, N.K. Nichols, B.J. Hoskins, A singular vector perspective of\n4DVar: Filtering and interpolation, Quart. J. R. Meteorol. Soc. 131 (2005)\n1–20.\n[19] I. Karatzas, S.E. Shreve, Brownian Motion and Stochastic Calculus,\nsecond ed., Springer, 1991.\n[20] A. Krener, Reciprocal diffusions in flat space, Probab. Theory Related\nFields 107 (1997) 243–281.\n[21] L. Kuznetsov, K. Ide, C.K.R.T. Jones, A method for assimilation of\nLagrangian data, Mon. Weather Rev. 131 (2003) 2247–2260.\n[22] F. Langouche, D. Roekaerts, E. Tirapegui, Functional integral methods for\nstochastic fields, Physica 95A (1979) 252–274.\n[23] A.S. Lawless, S. Gratton, N.K. Nichols, An investigation of incremental\n4DVar using non-tangent linear models, Quart. J. R. Meteorol. Soc. 131\n(2005) 459–476.\n[24] F.-X. Le Dimet, O. Talagrand, Variational algorithms for analysis and\nassimilation of meteorological observations: Theoretical aspects, Tellus\nA 38 (1986) 97–110.\n[25] J. Liu, Monte Carlo Strategies in Scientific Computing, Springer,\nNew York, 2001.\n[26] A. Lorenc, Analysis methods for numerical weather prediction, Quart. J.\nR. Meteorol. Soc. 112 (1986) 1177–1194.\n[27] N. Nichols, Data assimilation: Aims and basic concepts, in: R. Swinbank,\nV. Shutyaev, W.A. Lahoz (Eds.), Data Assimilation for the Earth System,\nKluwer Academic, 2003, pp. 9–20.\n[28] N.K. Nichols, Treating model error in 3-D and 4-D data assimilation,\nin: R. Swinbank, V. Shutyaev, W.A. Lahoz (Eds.), Data Assimilation for\nthe Earth System, Kluwer Academic, 2003, pp. 127–135.\n[29] B. Øksendal, Stochastic Differential Equations: An Introduction with\nApplications, fifth ed., Springer, Berlin, 1998.\n[30] E. Ott, B.R. Hunt, I. Szunyogh, A.V. Zimin, E.J. Kostelich, M. Corazza,\nE. Kalnay, D.J. Patil, J.A. Yorke, A local ensemble Kalman filter for\natmospheric data assimilation, Tellus A 56 (2004) 415–428.\n[31] M. Reznikoff, E. Vanden-Eijnden, Invariant measures of stochastic PDEs,\nC. R. Acad. Sci. Paris 340 (2005) 305–308.\n[32] C.P. Robert, G. Casella, Monte Carlo Statistical Methods, Springer,\nNew York, 1999.\n[33] G. Roberts, J.S. Rosenthal, Optimal scaling for various\nMetropolis–Hastings algorithms, Statist. Sci. 16 (4) (2001) 351–367.\n[34] B.L. Rozovskii, Stochastic Evolution Systems: Linear Theory and\nApplications to Nonlinear Filtering, Kluwer, The Netherlands, 1990.\n[35] H. Salman, L. Kuznetsov, C.K.R.T. Jones, K. Ide, A method for\nassimilating Lagrangian data into a shallow-water equation ocean model,\nMon. Weather Rev. 134 (2006) 1081–1101.\n[36] Y. Sasaki, Some basic formalisms in numerical variational analysis, Mon.\nWeather Rev. 98 (1970) 875–883.\n[37] T. Shardlow, A.M. Stuart, A perturbation theory for ergodic Markov\nchains with application to numerical approximation, SIAM J. Numer.\nAnal. 37 (2000) 1120–1137.\n[38] A.M. Stuart, J. Voss, P. Wiberg, Conditional path sampling of SDEs and\nthe Langevin MCMC method, Commun. Math. Sci. 2 (2004) 685–697.\n[39] D. Talay, Second-order discretization schemes for stochastic differential\nsystems for the computation of the invariant law, Stoch. Stoch. Rep. 29\n(1990) 13–36.\n[40] J. Zabczyk, Symmetric solutions of semilinear stochastic equations,\nin: G. Da Prato, L. Tubaro (Eds.), Stochastic Partial Differential Equations\nand Applications II (Proceedings, Trento 1988), in: Lecture Notes in\nMathematics, vol. 1390, Springer, 1988, pp. 237–256."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"A. Apte, M. Hairer, A.M. Stuart, J. Voss, Sampling the posterior: An approach to non-Gaussian data assimilation, Physica D: Nonlinear Phenomena, Volume 230, Issues 1–2, June 2007, Pages 50-64, ISSN 0167-2789, https://doi.org/10.1016/j.physd.2006.06.009.\n(http://www.sciencedirect.com/science/article/pii/S016727890600217X)","other_numbering_system":null,"funders":[{"agency":"Engineering and Physical Sciences Research Council (EPSRC)","grant_number":""},{"agency":"Office of Naval Research (ONR)","grant_number":"N00014-04-1-0215"},{"agency":"Statistical and Applied Mathematical Sciences Institute (SAMSI)","grant_number":"03-SC-NSF-1009"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}