{"title":"Introduction to special issue: \"The influence of plate interaction on post-Laramide magmatism and tectonics in Mexico\"","uri":"","abstract":"Among convergent margins, Mexico is an excellent site for studying along-strike variation in plate tectonics at the trench and its effect on the accompanying volcanism and tectonics in the overriding plate. The progressive fragmentation and consumption of the Farallon plate and the interaction between the Pacific and North America plates during the Cenozoic produced some unique geologic features. These include the Sierra Madre Occidental, one of the largest silicic igneous provinces on Earth, and the Trans-Mexican Volcanic Belt, a complex continental volcanic arc underlain by two of the youngest slabs in the world. In addition, extension occurred concurrently in much of the region affected by volcanism, producing a significant part of the southern Basin and Range province, and the reactivation of older basement structures which controlled the emplacement of volcanism.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251390","docid":251390,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1249868","fileid":1249868,"datasetid":"document","objectid":251390,"filename":"1-s2.0-S0040195199003030-main.pdf","mime_type":"application/pdf","hash":"7ff03e3315300a518bd51f1f1d310c2f","hash_type":"MD5","filesize":58300,"mtime":"2017-04-27 17:54:49","url":"http://authors.library.caltech.edu/77002/1/1-s2.0-S0040195199003030-main.pdf"}],"eprintid":77002,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"1-s2.0-S0040195199003030-main.pdf","content":"published"}],"note":"© 2000 Elsevier Science B.V. \n\nAvailable online 10 April 2000. \n\nWe are indebted to Tectonophysics editor Terry Engelder who supervised the editorial process and provided useful advice. We would also like to acknowledge all the scientists who helped us in the review process with timely response and careful examination of the original manuscripts. They are (in alphabetical order): Jorge Aranda-Gomez (Instituto de Geologia, UNAM, Campus Juriquilla, Queretaro, Mexico); Tanya Atwater (University of California at Santa Barbara, USA); Gary Axen (University of California at Los Angeles, USA); Charles Bacon (US Geological Survey, Menlo Park, CA, USA); William Bandy (Instituto de Geofı́sica, UNAM, Mexico City, Mexico); Kenneth Cameron (University of California at Santa Cruz, USA); William Dickinson (University of Arizona, Tucson, USA); Apto Gogichaishvili (University of Montpellier, France); Toshiaki Hasenaka (Akita University, Japan); Claudia J. Lewis (Los Alamos National Laboratory, Los Alamos, USA); José Luis Macı́as (Instituto de Geofı́sica, UNAM, Mexico City, Mexico); Arturo Martı́n-Barajas (CICESE, Ensenada, Baja California, Mexico); William MacDonald (State University of New York, Binghamton, USA); Fred McDowell (University of Texas, Austin, USA); Jorge Nieto-Obregón (Facultad de Ingenierı́a, UNAM, Mexico City, Mexico); Angel Nieto-Samaniego (Instituto de Geologia, UNAM, Campus Juriquilla, Queretaro, Mexico); Josep Pares (Universidad Complutense de Madrid, Spain); Steve Reynolds (University of Arizona, Tucson, USA); Joaquin Ruiz (University of Arizona, Tucson, USA); Richard Sedlock (San José State University, San José, USA); Christian Teyssier (University of Minnesota, Minneapolis, USA), Gustavo Tolson-Jones (Instituto de Geologı́a, UNAM, Mexico City, Mexico); Peter Weigand (California State University at Northridge, USA); Douglas Wilson (University of California at Santa Barbara, USA); Xixi Zhao (University of California at Santa Cruz, USA).","id":77002,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/70/02","datestamp":"2017-04-27 22:16:11","lastmod":"2017-04-27 22:16:11","status_changed":"2017-04-27 22:16:11","type":"article","metadata_visibility":"show","creators":[{"given":"Luca","family":"Ferrari","id":"Ferrari-L","orcid":""},{"given":"Joann M.","family":"Stock","id":"Stock-J-M","orcid":"0000-0003-4816-7865"},{"given":"Jaime Urrutia","family":"Fucugauchi","id":"Fucugauchi-J-U","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2000-03-10","date_type":"published","publication":"Tectonophysics","volume":"318","number":"1-4","pagerange":"vii-ix","id_number":"CaltechAUTHORS:20170427-105445312","refereed":true,"issn":"0040-1951","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170427-105445312","related_url":[{"url":"http://doi.org/10.1016/S0040-1951(99)00303-0","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0040195199003030","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Luca Ferrari, Joann M Stock, Jaime Urrutia Fucugauchi, Introduction to special issue: “The influence of plate interaction on post-Laramide magmatism and tectonics in Mexico”, Tectonophysics, Volume 318, Issues 1–4, 10 March 2000, Pages vii-ix, ISSN 0040-1951, http://doi.org/10.1016/S0040-1951(99)00303-0.\n(http://www.sciencedirect.com/science/article/pii/S0040195199003030)","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Seismological Laboratory"]}