{"title":"Anomalous Sorption in Thin Films of Fluoroalkyl-Ended Poly(ethylene glycol)s","uri":"","abstract":"Absorption, desorption and swelling behavior of polymers\nplay important roles in polymer processing and performance, ranging from issues of dimensional stability\nand permeability to controlling adhesion. Rich, nonlinear\nphenomena are associated with transient swelling and drying of glassy and semicrystalline polymers. Anomalous,\nnon-Fickian behaviors are broadly associated with the\nnonlinear effects of the penetrant on the dynamics of the\npolymers. Here we describe anomalous behavior of a\ndifferent type that is associated with a sorbent-triggered\nfirst-order phase transition. The system of interest is a\nhydrophilic, semicrystalline polymer with hydrophobic end\ngroups, placed in contact with humid air.Dueto the strong\ntendency to absorb water, the melting transition of the\ncrystallites can be induced by contact with sufficiently\nhumid air; during desorption, a sufficient supersaturation\nmustbe reached before nucleation and regrowth of crystals\noccur. This leads to very different hysteresis in the sorption isotherm and overshoot in transient sorption than has been reported previously in polymers.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251389","docid":251389,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1249859","fileid":1249859,"datasetid":"document","objectid":251389,"filename":"la020255l.pdf","mime_type":"application/pdf","hash":"76b87d4eeb7766bc789341db61ca08f4","hash_type":"MD5","filesize":117313,"mtime":"2017-04-27 17:50:33","url":"http://authors.library.caltech.edu/77001/1/la020255l.pdf"}],"eprintid":77001,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"la020255l.pdf","content":"published"}],"note":"© 2002 American Chemical Society. \n\nReceived 13 March 2002. Published online 17 September 2002. Published in print 1 October 2002. \n\nThis research was supported in part by a grant from NSF (CTS-9729443), a graduate fellowship from the Korean Ministry of Education (Giyoong Tae), and by the MRSEC Program of NSF (DMR-0080065).","id":77001,"rev_number":8,"userid":772,"eprint_dir":"disk0/00/07/70/01","datestamp":"2017-04-27 22:13:34","lastmod":"2017-04-27 22:13:34","status_changed":"2017-04-27 22:13:34","type":"article","metadata_visibility":"show","creators":[{"given":"Giyoong","family":"Tae","id":"Tae-Giyoong","orcid":""},{"given":"Julia A.","family":"Kornfield","id":"Kornfield-J-A","orcid":"0000-0001-6746-8634"},{"given":"Jeffrey A.","family":"Hubbell","id":"Hubbell-J-A","orcid":""},{"given":"Diethelm","family":"Johannsmann","id":"Johannsmann-D","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2002-10-15","date_type":"published","publication":"Langmuir","volume":"18","number":"21","pagerange":"8241-8245","id_number":"CaltechAUTHORS:20170427-105022344","refereed":true,"issn":"0743-7463","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170427-105022344","related_url":[{"url":"http://pubs.acs.org/doi/abs/10.1021/la020255l","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/la020255l","type":"pub","description":"Article"}],"referencetext":["(1) Annable, T.; Buscall, R.; Ettelaie, R. J. Rheo. 1993, 37 (4), 695.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(2) Xu, B.; Li, L.; Yekta, A.; Masoumi, A.; Kanagalingam, S.; Winnik, M. A.; Zhang, K.; Macdonald, P. M.; Menchen, S. Langmuir 1997, 13, 3 (9), 2447.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(3) Tae, G.; Kornfield, J. A.; Hubbell, J. A.; HogenEsch, T. E.; Johannsmann, D. Macromolecules, 2001, 34, 6409.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(4) Tae, G.; Kornfield, J. A.; Hubbell, J. A.; Lal, J. A. Macromolecules 2002, 35, 4448.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(5) Tae, G.; Kornfield, J. A.; Hubbell, J. A. In preparation.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(6) Young, R. J.; Lovell, P. A. Introduction to polymers, 2nd ed.; Chapman \u0026 Hall:  London, 1991.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(7) Tg of Rf-PEGs have not been measured directly, but melting temperatures of Rf-PEGs are lower than those of unmodified PEGs, so low glass transition temperatures are expected for Rf-PEGs.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(8) Vrentas, J. S.; Vrentas, C. M. Macromolecules 1996, 29, 4391.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(9) Bouchard, C.; Guerrier, B.; Allain, C.; Laschitsch, A.; Saby, A.-C.; Johannsmann, D. J. Appl. Polym. Sci. 1998, 69, 2235.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nSato, Y.; Yurugi, M.; Yamabiki, T.; Takishima, S.; Masuoka, H. J. Appl. Polym. Sci. 2001, 79, 1134.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(11) Pope, D. S.; Koros, W. J. J. Polym. Sci.: Polym. Phys. 1996, 34, 1861.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(12) Hsu, W.-P.; Myerson, A. S.; Kwei, T. K. J. Appl. Polym. Sci. 1998, 70, 39.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(13) Ngui, M. O.; Mallaparagada, S. K. Polymer 1999, 40, 5393.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(14) Crank, J.; Park, G. S. Diffusion in Polymers; Academic Press:  New York, 1968.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(15) Hedenqvist, M.; Johnsson, G.; Trankner, T.; Gedde, U. W. Polym. Eng. Sci. 1996, 36, 271.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(16) Vrentas, J. S.; Duda, J. L.; Hou, A.-C. J. Appl. Polym. Sci. 1984, 29, 399.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(17) Smith, M. J.; Peppas, N. A. Polymer 1985, 26, 569.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(18) Kim, D.; Caruthers, J. M.; Peppas, N. A.. Macromolecules 1993, 26, 1841.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(19) Scranton, A. B.; Klier, J.; Peppas, N. A. Polymer 1990, 31, 1288.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nTitow, W. V.; Braden, M.; Currell, B. R.; Loneragan, R. J. J. Appl. Polym. Sci. 1974, 18, 867.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(21) Wolf, O.; Seydel, E.; Johannsmann, D. Faraday Discuss. 1997, 107, 91.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(22) Johannsmann, D.; Mathauer, K.; Wagner, G.; Knoll, W. Phys. Rev. B 1996, 46, 7808.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(23) Seinfeld, J. H.; Pandis, S. N. Atmospheric Chemistry and Physics; Wiley Interscience:  New York, 1998; Chapter 9.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(24) Clegg, S. L.; Brimblecombe, P.; Liang, Z.; Chan C. K. Aerosol Sci. Technol. 1997, 27, 345.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(25) Pope, D. S.; Koros, W. J. J. Polym. Sci., Part B: Polym. Phys. 1996, 34, 1861.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(26) Bae, Y. C.; Shim, J. J.; Soane, D. S.; Prausnitz, J. M. J. Appl. Polym. Sci. 1993, 47, 1193.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(27) Ninni, L.; Camargo, M. S.; Meirelles, A. J. A. Thermochim. Acta 1999, 328, 169.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(28) Hager, S. L.; Macrury, T. B. J. Appl. Polym. Sci. 1980, 25, 1559.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(29) Unpublished calorimetry measurements show weak effects of molecular weight on crystallization and melting of PEG over the range from 6k to 10k g/mol. The melting transition peaks at 66 °C for 10k PEG and at 63 °C for 6k PEG using 10 °C/min heating rate after preheating to 120 °C and subsequent cooling to −150 °C at −20 °C/min. Attaching fluoroalkyl groups to both ends reduces this somewhat:  59 °C for 10KC10, 57 °C for 10KC8, and 55 °C for 6KC8. The melting points remain similar to one another, suggesting that the lamellar thickness of the crystallites is nearly the same and that the presence of fluoroalkyl groups excluded into the noncrystalline regions is responsible for the depression in the melting point (increasing the interfacial free energy cost of each face of a lamellar crystal). The enthalpy of melting is also a weak function of Mw in this range:  ΔHm is 172 J/g for 10k PEG and 175 J/g for 6k PEG. Adding Rf end groups decreases the degree of crystallinity by 30−35%:  ΔHm is 126 J/g for 10KC10, 119 J/g for 10KC8, and 115 J/g for 6KC8. Given that both Tm and ΔHm are fairly constant across the series of Rf-PEG materials, their solid-state sorption behavior and the activity of water required to trigger melting upon increase of Hr would be expected to be similar, as observed. In the swollen state, increasing PEG length would be expected to correlate with somewhat greater swelling, as observed, mainly due to the lower concentration of fluoroalkyl groups (the higher molecular weight between physical cross-links is not likely to be a significant factor at the high polymer concentrations observed, \u003e50 wt % PEG even at the highest Hr).OpenURL CALIFORNIA INST OF TECHNOLOGY\nΔHm of Rf-PEG is ∼70% of homo-PEG (see above).OpenURL CALIFORNIA INST OF TECHNOLOGY\n(31) Ranucci, E.; Opelli, P.; Ferruti, P. Polym. Gel. Net. 1994, 2, 119.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(32) Vaughan, A. S.; Stevens, G. C. Polymer 2001, 42, 8891.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(33) Brandrup, J., Immergut, E. H., Ed. Polymer Handbook; Wiley: New York, 1989.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(34) The maximum temperature change associated with the jump in swelling is very small due to the submicrometer thickness of the film and due to the compensation of the heat of fusion and heat of hydration (the heat of solubilization of PEG into water at infinite dilution is −120 J/g [exo] for molten PEG, but 10 J/g [endo] for crystalline PEG). The maximum heat upon jumping from the swollen solid to the solvated gel will be between −29 J/g (based on 70% crystallinity and the values above) and 122 J/g (upper bound based on 70% crystallinity and a heat of melting of ∼175 J/g). Thus, an upper bound on the energy change per unit area of film is readily made based on the measured mass of PEG per unit area, leading to ∼12 J/m2. This phase transition occurs over a few minutes time; based on ∼5 min, the maximum heat flux is ∼0.04 J/(m2/s). Since the film has thermal conductivity greater than 0.3 W/(m/K) (poly(methylene oxide) 0.292 W/(m/K), water 0.609 W/(m/K)) and the film thickness is ∼10-7 m, the temperature change to drive the required heat flux is no more than 1.2 × 10-7 K.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(35) Quiram, D. J.; Register, R. A.; Marchand, G. R. and Ryan, A. J. Macromolecules 1997, 30, 8338.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(36) Fairclough, J. P. A.; Mai, S. M.; Matsen. M. W.; et al. J. Chem. Phys. 2001, 114, 5425.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(37) Massey, J. A.; Temple, K.; Cao, L.; et al. J. Am. Chem. Soc. 2000, 122, 11577.["],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Anomalous Sorption in Thin Films of Fluoroalkyl-Ended Poly(ethylene glycol)s\nGiyoong Tae, Julia A. Kornfield, Jeffrey A. Hubbell, and Diethelm Johannsmann\nLangmuir 2002 18 (21), 8241-8245\nDOI: 10.1021/la020255l","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"CTS-9729443"},{"agency":"Ministry of Education (Korea)","grant_number":""},{"agency":"NSF","grant_number":"DMR-0080065"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}