{"title":"Intraslab seismicity and thermal stress in the subducted Cocos plate beneath central Mexico","uri":"","abstract":"We present a model of the subducting Cocos slab beneath Central Mexico, that provides an explanation for stresses causing the occurrence of the majority of the intraslab earthquakes which are concentrated in a long flat segment. Based on the recently developed thermal models for the Central Mexico subduction zone, the thermal stresses due to non-uniform temperature contrast in the subducting slab are calculated using a finite element approach. The slab is considered purely elastic but due to high temperature at its bottom the behavior is considered as ductile creep. The calculation results show a ∼ 20 km slab core characterized by a tensional state of stress with stresses up to 70 MPa. On the other hand, the top of the slab experiences high compressive thermal stresses up to 110 MPa, depending on the elastic constants used and location along the flat part of the subducting plate. These compressive stresses at the top of the slab are not consistent with the exclusive normal fault intraslab earthquakes, and two different sources of stress are proposed.\nThe trenchward migration of the Mexican volcanic arc for the last 7 Ma indicates an increase of the slab dip through time. This observation suggests that the gravity torque might exceed the suction torque. Considering the flat slab as an embedded plate subject to an applied clockwise net torque of 0.5 × 10^(16)–1.5 × 10^(16) N m, the upper half would exhibit tensional stresses of 40–110 MPa that can actually balance the compressive thermally induced stresses.\nAn alternative stress source might come from the slab pull force caused by the slab positive density anomaly. Based on our density anomaly estimations (75 ± 20 kg/m^3), a 350 km slab length, dipping at 20° into the asthenosphere, induces a slab pull force of 1.7 × 10^(12)–4.6 × 10^(12) N m. This force produces a tensional stress of 41–114 MPa, sufficient to balance the compressive thermal stresses at the top of the flat slab.\nThe linear superposition of the thermally and torque or slab pull induced stresses shows tensile stresses up to 60–180 MPa inside the flat slab core. Also, our results suggest that the majority of the intraslab earthquakes inside the flat slab are situated where the resultant stresses are larger than 40–80 MPa.\nThis study provides a reasonable explanation for the existence of exclusively normal fault intraslab earthquakes in the flat slab beneath Central Mexico, and also it shows that thermal stresses due to non-uniform reheating of subducting slabs play a considerable role in the total stress field.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251393","docid":251393,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1249897","fileid":1249897,"datasetid":"document","objectid":251393,"filename":"1-s2.0-S0040195106001764-main.pdf","mime_type":"application/pdf","hash":"fc02d0c873fa87d732a43959131bf638","hash_type":"MD5","filesize":1867833,"mtime":"2017-04-27 18:12:54","url":"http://authors.library.caltech.edu/77006/1/1-s2.0-S0040195106001764-main.pdf"}],"eprintid":77006,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"1-s2.0-S0040195106001764-main.pdf","content":"published"}],"note":"© 2006 Elsevier B.V. \n\nReceived 20 June 2004, Revised 29 December 2005, Accepted 22 March 2006, Available online 9 June 2006. \n\nHelpful critical comments and constructive suggestions by Patrick Scheffmann, Kevin Furlong, Jeroen van Hunen, and one anonymous reviewer were used to improve the manuscript. This study was supported by CONACYT (Consejo Nacional de Ciencia y Technología) Grants G25842-T and 37293-T and by PAPIIT (Programa de Apoyo a Proyectos de Investigación e Innovación Technológica) Grant IN104801. We also like to acknowledge support from the Gordon and Betty Moore Foundation. This is a contribution 9145 of the Division of Geological and Planetary Sciences, CALTECH.","id":77006,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/70/06","datestamp":"2017-04-27 22:03:48","lastmod":"2017-04-27 22:03:48","status_changed":"2017-04-27 22:03:48","type":"article","metadata_visibility":"show","creators":[{"given":"Vlad","family":"Manea","id":"Manea-V-C","orcid":""},{"given":"Marina","family":"Manea","id":"Manea-M","orcid":""},{"given":"Vladimir","family":"Kostoglodov","id":"Kostoglodov-V","orcid":""},{"given":"Granville","family":"Sewell","id":"Sewell-G","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Thermal stress; Torque balance; Slab pull; Flat subduction; Mexican subduction zone\n\n","date":"2006-07-07","date_type":"published","publication":"Tectonophysics","volume":"420","number":"3-4","pagerange":"389-408","id_number":"CaltechAUTHORS:20170427-111249564","refereed":true,"issn":"0040-1951","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170427-111249564","related_url":[{"url":"http://doi.org/10.1016/j.tecto.2006.03.029","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0040195106001764","type":"pub","description":"Article"}],"referencetext":["Armstrong, R.L., Calderwood, A.R., 1998. Constraints on the Earth's\nviscosity from a frequency, temperature and pressure dependent\nmantle Q: the viscosity model. EOS Transactions AGU 79 (45),\nF885 (Fall Meet. Suppl.).\nBillen, M.I., Gurnis, M., Simons, M., 2003. Multiscale dynamics of the\nTonga–Kermadec subduction zone. Geophysical Journal International\n153, 359–388.\nBillen, M.I., Gurnis, M., 2001. A low viscosity wedge in subduction\nzones. Earth and Planetary Science Letters 193, 227–236.\nBoley, B.A., Weiner, J.H., 1997. Theory of Thermal Stresses, 1st\nEdition. Dover Publications, INC., Mineola, New York.\nBott, M.H.P., 1993. Modelling the plate-driving mechanism. Journal of\nthe Geological Society, London 150, 941–951.\nBratt, S.R., Bergman, E.A., Solomon, S.C., 1985. Thermoelastic\nstress: how important as a cause of earthquakes in young oceanic\nlithosphere. Journal of Geophysical Research 90, 10249–10260.\nBurov, E.B., Diament, M., 1995. The effective elastic thickness (Te)\nof continental lithosphere: what does it really mean? Journal of\nGeophysical Research 100 (B3), 3905–3927.\nCathles, L.M., 1975. Viscosity of the Earth's Mantle. Princeton University\nPress, Princeton. 403 pp.\nCollette, B.J., 1974. Thermal contraction joints in a spreading seafloor\nas origin of fracture. Nature 252, 299–300.\nConder, J.A., Weins, D.A., Morris, J., 2002. On the decompression\nmelting structure at volcanic arcs and back-arc spreading centres.\nGeophysical Research Letters 29, 171–174.\nDean,B.W., Drake, C.L., 1978. Focalmechanismsolutions and tectonics\nof the Middle America arc. Journal of Geology 86, 111–128.\nDeMets, C., Gordon, R., Argus, D., Stein, S., 1994. Effect of recent\nrevisions to the geomagnetic reversal time scale on estimates of\ncurrent plate motions. Geophys. Res. Lett. 21, 2191–2194.\nEngdahl, E.R., Villaseñor, A., 2002. Global seismicity: 1900–1999.\nIn: Lee, W.H.K. (Ed.), International Handbook of Earthquake\nEngineering and Seismology, International Geophysics Series, vol.\n81A, pp. 665–690.\nFerrari, L., Lopez-Martinez, M., Aquirre-Diaz, G., Carrasco-Nunez,\nG., 1999. Space–time patterns of Cenozoic arc volcanism in\nCentral Mexico: from Sierra Madre Occidental to the Mexican\nVolcanic Belt. Geology 27 (4), 303–306.\nFurukawa, F., 1993. Magmatic processes under arcs and formation of\nthe volcanic front. Journal of Geophysical Research 98, 8309–8319.\nGoetze, C., 1978. The mechanisms of creep in olivine. Philosophical\nTransactions of the Royal Society of London. A 288, 99–119.\nGonzález-Ruiz, J.R., 1986. Earthquake source mechanics and\ntectonophysics of the middle America subduction zone in Mexico,\nPh.D. Thesis, Univ. of Calif., Santa Cruz.\nGonzalez-Ruiz, J.R., McNally, K.C., 1988. Stress accumulation and\nrelease since 1882 in Ometepec, Guerrero, Mexico: implications\nfor failure mechanisms and risk assessments of a seismic gap.\nJournal of Geophysical Research 93, 6297–6317.\nGorbatov,A.,Kostoglodov,V., Suárez, G.,Gordeev, E., 1997. Seismicity\nand structure of the Kamchatka subduction zone. Journal of\nGeophysical Research 102, 17,883–17,898.\nGoto, K., Hamaguchi, H., Suzuchi, Z., 1985. Earthquake generating\nstresses in the descending slab. In: Kobayashi, K., Sacks, I.S.\n(Eds.), Structures and Processes in the Subduction Zones\nTectonophysics, vol. 112, pp. 111–128.\nHacker, B.R., Abers, G.A., Peacock, S.M., 2003. Subduction factory.\n1. Theoretical mineralogy, densities, seismic wave speeds, and\nH2O content. Journal Geophysical Research 108. doi:10.1029/\n2001/JB001127.\nHamaguchi, H., Goto, K., Suzuki, Z., 1983. Double-planed structure\nof intermediate-depth seismic zone and thermal stress in the\ndescending plate. Journal of Physics of the Earth 331, 329–347.\nHaxby, W.F., Parmentier, E.M., 1988. Thermal contraction and the state\nof stress in the oceanic lithosphere. Journal of Geophysical Research\n93, 6419–6429.\nHirth, G., Kohlstedt, D.L., 2003. Rheology of the mantle wedge. In:\nEiler, J. (Ed.), Inside the Subduction Factory, Geophysical\nMonograph, vol. 138. AGU, Washington DC, pp. 83–105.\nIglesias, A., Singh, S.K., Pacheco, J.F., Ordaz, M., 2002. A source and\nwave propagation study of the Copalillo, Mexico earthquake of\nJuly 21, 2000 (Mw=5.9): implications for seismic hazard in\nMexico City from inslab earthquakes. Bulletin of Seismological\nSociety of America 92 (3), 1060–1071.\nJiménez, Z., Ponce, L., 1978. Focal mechanism of six large\nearthquakes in northern Oaxaca, Mexico, of the period 1928–\n1973. Geofísica Internacional 17, 379–386.\nJischke, M.C., 1975. On the dynamics of descending lithospheric\nplates and slip zones. Journal of Geophysical Research 80 (35),\n4809–4813.\nKelemen, P.B., Rilling, J.L., Parmentier, E.M., Mehl, L., Hacker, B.R.,\n2003. Thermal structure due to solid-state flow in the mantle\nwedge beneath arcs inside the subduction factory. In: Eiler, J. (Ed.),\nGeophysical Monograph, vol. 138. AGU, Washington, pp.\n293–311.\nKincaid, C., Hall, C., 2003. Role of back arc spreading in circulation\nand melting at subduction zones. Journal of Geophysical Research\n108 (B5), 2240. doi:10.1029/2001JB001174.\nKirby, S.H., 2000. Taking the temperature of slabs. Nature 403, 31–34.\nKirby, S.H., Kronenberg, A.K., 1987. Rheology of the lithosphere:\nselected topics. Reviews of Geophysics 25, 1219–1244.\nKlitgord, K.D., Mammerickx, 1982. Northern east Pacific Rise;\nmagnetic anomaly and bathymetric framework. Journal of\nGeophysical Research 87 (138), 6725–6750.\nKostoglodov, V., Bandy,W.L., 1995. Seismotectonic constraints on the\nconvergence rate between the Rivera and North American plates.\nJournal of Geophysical Research 100, 17977–17989.\nKostoglodov, V., Bandy, W., Domínguez, J., Mena, M., 1996. Gravity\nand seismicity over the Guerrero seismic gap, Mexico. Geophysical\nResearch Letters 23, 3385–3388.\nKostoglodov, V., Singh, S.K., Santiago, J.A., Franco, S.I., Larson, K.\nM., Lowery, A.R., Bilham, R., 2003. A large silent earthquake in\nthe Guerrero seismic gap, Mexico. Geophysical Research Letters\n30 (15), 1807.\nLay, T., Astiz, L., Kanamori, H., Christensen, D.H., 1989. Temporal\nvariation on of large intraplate earthquakes in coupled subduction\nzones. Physics of the Earth and Planetary Interiors 54, 258–312.\nLefevre, L.V., McNally, K.C., 1985. Stress distribution and subduction\nof aseismic ridges in the middle America subduction zone. Journal\nof Geophysical Research 90, 4495.\nManea, V.C., Manea, M., Kostoglodov, Currie, C.A., Sewell, G., 2004.\nThermal structure, coupling and metamorphism in the Mexican\nsubduction zone beneath Guerrero. Geophysical Journal International\n158, 775–784.\nManea, V.C., Manea, M., Kostoglodov, V., Sewell, G., 2005.\nThermo-mechanical model of the mantle wedge in Central\nMexican subduction zone and a blob tracing approach for the\nmagma transport. Physics of the Earth and Planetary Interiors\n149, 165–186.\nPardo, M., Suárez, G., 1995. Shape of the subducted Rivera and Cocos\nplates in southern Mexico: seismic and tectonic implications.\nJournal of Geophysical Research 100, 12357–12373.\nPoli, S., Schmidt, M.W., 2002. Petrology of subducted slabs. Annual\nReview Earth Planetary Sciences 30, 1–29.\nSandwell, D.T. 2001. Crustal structure, isostasy and rheology. Web:\nhttp://topex.ucsd.edu/geodynamics/08crust_rheology.pdf.\nSchellart, W.P., 2004. Quantifying the net slab pull force as a driving\nmechanism for plate tectonics. Geophysical Research Letters 32,\nL07611. doi:10.1029/2004GL019528.\nStevenson, D.J., Turner, J.S., 1977. Angle of subduction. Nature 270,\n334–336.\nSegawa, S., Hamaguchi, H., Goto, K., 1982. A model experiment on\nthe generating 694 stresses for the double-plane structure of the\nintermediate-depth seismic activity. Zisin ser.2 (35), 19–34\n(J. Seismol. Soc. Japan).\nSingh, S.K., Pardo, M., 1993. Geometry of the Benioff zone and the\nstate of stress in the overriding plate in central México.\nGeophysical Research Letters 20, 1483–1486.\nSingh, S.K., Suárez, G., Domínguez, T., 1985. The great Oaxaca\nearthquake of January 1931: lithosphere normal faulting in the\nsubducted Cocos plate. Nature 317, 56–58.\nTimoshenko, S., Goodier, J.N., 1951. Theory of Elasticity, 2nd ed.\nMcGraw-Hill Book Co., New York.\nTovish, A., Schubert, G., Luyendyk, B.P., 1978. Mantle flow pressure\nand the angle of subduction: non-Newtonian corner flows. Journal\nof Geophysical Research 83, 5892–5898.\nTurcotte, D.L., 1974. Are transform faults thermal contraction cracks?\nJournal of Geophysical Research 79, 2573–2577.\nTurcotte, D.L., Schubert, G., 2002. Geodynamics, 2nd ed. Cambridge\nUniversity Press, New York.\nValdes, C.M., Mooney, W.D., Singh, S.K., Lomnitz, C., Luetgert, J.\nH., Helsley, C.E., Lewis, B.T.R., Mena, M., 1986. Crustal\nstructure of Oaxaca, Mexico, from seismic refraction measurements.\nBulletin of the Seismological Society of America 76,\n547–563.\nvan Hunen, J., van den Berg, A., Vlaar, N., 2002. On the role of\nsubducting oceanic plateaus in the development of shallow flat\nsubduction. Tectonophysics 352, 317–333.\nvan Keken, P.E., Kiefer, B., Peacock, S.M., 2002. High resolution\nmodels 716 of subduction zones: implications for mineral\ndehydration reactions and the transport of water into deep mantle.\nG-cubed 3 (10), 20.\nWatts, A.B., 2001. Isostasy and flexure of the lithosphere. Cambridge\nUniversity Print, Cambridge, New York. 458 pp.\nZhu, A., Wiens, D., 1991. Thermoelastic stress in oceanic lithosphere\ndue to hotspot reheating. Journal of Geophysical Research 96\n(B11), 18323–18334."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Vlad Manea, Marina Manea, Vladimir Kostoglodov, Granville Sewell, Intraslab seismicity and thermal stress in the subducted Cocos plate beneath central Mexico, Tectonophysics, Volume 420, Issues 3–4, 7 July 2006, Pages 389-408, ISSN 0040-1951, http://doi.org/10.1016/j.tecto.2006.03.029.\n(http://www.sciencedirect.com/science/article/pii/S0040195106001764)","other_numbering_system":[{"name":"Caltech Division of Geological and Planetary Sciences","id":"9145"}],"funders":[{"agency":"Consejo Nacional de Ciencia y Technología","grant_number":"G25842-T"},{"agency":"Consejo Nacional de Ciencia y Technología","grant_number":"37293-T"},{"agency":"Programa de Apoyo a Proyectos de Investigación e Innovación Technológica","grant_number":"IN104801"},{"agency":"Gordon and Betty Moore Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Seismological Laboratory"]}