{"title":"An experimental investigation of the micromechanics of Eglin sand","uri":"","abstract":"The mechanical behaviour of Eglin sand at the micro-scale was studied in this work. Laboratory experiments using unconventional apparatuses were carried out in order to study the contact behaviour of pairs of particles in both compression (normal loading) and shearing (tangential loading) and the strength of grains. Particle fractions were identified according to their colour by visual observation and both their chemical composition and surface morphologies were obtained. The tangential stiffnesses and inter-particle coefficients of frictions for the different fractions found in the sand sample were determined under the range of normal loadings applied (1–9 N). The results show some discrepancies between the theoretical models commonly found in literature to describe either the normal or the tangential loading response, which are able to predict the trend of the force-displacement curves but using elastic moduli that are lower than those found in literature, especially in the case of tangential loading. Also, the results of particle crushing tests show quite consistent results (excluding one particle group), probably related to the similar mineralogy of all fractions, which are mainly constituted by silica.","documents":null,"note":"© 2017 Elsevier B.V. \n\nReceived 6 October 2016, Revised 28 January 2017, Accepted 3 February 2017, Available online 7 February 2017.","id":77010,"rev_number":5,"userid":18,"eprint_dir":"disk0/00/07/70/10","datestamp":"2017-04-27 19:08:46","lastmod":"2017-04-27 19:08:46","status_changed":"2017-04-27 19:08:46","type":"article","metadata_visibility":"show","creators":[{"given":"V.","family":"Nardelli","id":"Nardelli-V","orcid":""},{"given":"M. R.","family":"Coop","id":"Coop-M-R","orcid":""},{"given":"J. E.","family":"Andrade","id":"Andrade-J-E","orcid":""},{"given":"F.","family":"Paccagnella","id":"Paccagnella-F","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Sands; Stiffness; Friction; Particle strength","date":"2017-05-01","date_type":"published","publication":"Powder Technology","volume":"312","number":"","pagerange":"166-174","id_number":"CaltechAUTHORS:20170427-114851319","refereed":true,"issn":"0032-5910","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170427-114851319","related_url":[{"url":"http://doi.org/10.1016/j.powtec.2017.02.009","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0032591017301262","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"V. Nardelli, M.R. Coop, J.E. Andrade, F. Paccagnella, An experimental investigation of the micromechanics of Eglin sand, Powder Technology, Volume 312, 1 May 2017, Pages 166-174, ISSN 0032-5910, http://doi.org/10.1016/j.powtec.2017.02.009.\n(http://www.sciencedirect.com/science/article/pii/S0032591017301262)","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}