{"title":"Prescriptive Unitarity","uri":"","abstract":"We introduce a prescriptive approach to generalized unitarity, resulting in a\nstrictly-diagonal basis of loop integrands with coefficients given by\nspecifically-tailored residues in field theory. We illustrate the power of this\nstrategy in the case of planar, maximally supersymmetric Yang-Mills theory,\nwhere we construct closed-form representations of all ($n$-point N$^k$MHV)\nscattering amplitudes through three loops. The prescriptive approach contrasts\nwith the ordinary description of unitarity-based methods by avoiding any need\nfor linear algebra to determine integrand coefficients. We describe this\napproach in general terms as it should have applications to many quantum field\ntheories, including those without planarity, supersymmetry, or massless spectra\ndefined in any number of dimensions.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251406","docid":251406,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250232","fileid":1250232,"datasetid":"document","objectid":251406,"filename":"1704.05460.pdf","mime_type":"application/pdf","hash":"3d00e86559cb39c5e98bb902d2a1caa0","hash_type":"MD5","filesize":1080710,"mtime":"2017-04-27 21:31:14","url":"http://authors.library.caltech.edu/77017/1/1704.05460.pdf"}],"eprintid":77017,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1704.05460.pdf","content":"submitted"}],"note":"We gratefully acknowledge Zvi Bern for insightful comments on the manuscript and\nthank JJ Carrasco and JJ Stankowicz for helpful discussions. This work was supported\nin part by the National Science Foundation under Grant No. NSF PHY-\n1125915; by the Danish National Research Foundation (DNRF91) and a grant from\nthe Villum Fonden (JLB); and by a grant from the Gordon and Betty Moore Foundation\nand by DOE Grant No. DE-SC0011632 (EH).","id":77017,"rev_number":8,"userid":999,"eprint_dir":"disk0/00/07/70/17","datestamp":"2017-04-27 21:36:18","lastmod":"2017-04-27 21:36:18","status_changed":"2017-04-27 21:36:18","type":"monograph","metadata_visibility":"show","creators":[{"given":"Jacob L.","family":"Bourjaily","id":"Bourjaily-J-L","orcid":""},{"given":"Enrico","family":"Herrmann","id":"Herrmann-E","orcid":""},{"given":"Jaroslav","family":"Trnka","id":"Trnka-J","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2017-04-18","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170427-142727226","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170427-142727226","related_url":[{"url":"http://arxiv.org/abs/1704.05460","type":"arxiv","description":"Discussion Paper"}],"referencetext":["G. Lusztig, “Total Positivity in Partial Flag Manifolds,” Represent. Theory 2\n(1998) 70–78. http://dx.doi.org/10.1090/S1088-4165-98-00046-6.\n[2] A. Postnikov, “Total Positivity, Grassmannians, and Networks,”\narXiv:math/0609764 [math.CO].\n[3] A. Postnikov, D. Speyer, and L. Williams, “Matching Polytopes, Toric Geometry,\nand the Totally Non-Negative Grassmannian,” Journal of Algebraic Combinatorics\n30 (2009) no. 2, 173–191, arXiv:0706.2501 [math.AG].\n[4] L. K. Williams, “Enumeration of Totally Positive Grassmann Cells,” Adv. Math.\n190 (2005) no. 2, 319–342, arXiv:math/0307271 [math.CO].\n[5] A. B. Goncharov and R. Kenyon, “Dimers and Cluster Integrable Systems,”\narXiv:1107.5588 [math.AG].\n[6] A. Knutson, T. Lam, and D. Speyer, “Positroid Varieties: Juggling and\nGeometry,” Compositio Mathematica 149 (2013) no. 10, 1710–1752,\narXiv:1111.3660 [math.AG].\n[7] R. Britto, F. Cachazo, and B. Feng, “New Recursion Relations for Tree Amplitudes\nof Gluons,” Nucl.Phys. B715 (2005) 499–522, arXiv:hep-th/0412308 [hep-th].\n[8] R. Britto, F. Cachazo, B. Feng, and E. Witten, “Direct Proof of Tree-Level\nRecursion Relation in Yang- Mills Theory,” Phys. Rev. Lett. 94 (2005) 181602,\narXiv:hep-th/0501052.\n– 48 –\n[9] N. Arkani-Hamed, J. L. Bourjaily, F. Cachazo, S. Caron-Huot, and J. Trnka, “The\nAll-Loop Integrand For Scattering Amplitudes in Planar N = 4 SYM,” JHEP 1101\n(2011) 041, arXiv:1008.2958 [hep-th].\n[10] J. Drummond, J. Henn, V. Smirnov, and E. Sokatchev, “Magic Identities for\nConformal Four-Point Integrals,” JHEP 0701 (2007) 064, arXiv:hep-th/0607160.\n[11] L. F. Alday and J. M. Maldacena, “Gluon Scattering Amplitudes at Strong\nCoupling,” JHEP 06 (2007) 064, arXiv:0705.0303 [hep-th].\n[12] J. Drummond, J. Henn, G. Korchemsky, and E. Sokatchev, “Dual Superconformal\nSymmetry of Scattering Amplitudes in N = 4 super Yang-Mills Theory,” Nucl.\nPhys. B828 (2010) 317–374, arXiv:0807.1095 [hep-th].\n[13] J. M. Drummond, G. P. Korchemsky, and E. Sokatchev, “Conformal Properties of\nFour-Gluon Planar Amplitudes and Wilson loops,” Nucl. Phys. B795 (2008)\n385–408, arXiv:0707.0243 [hep-th].\n[14] A. Brandhuber, P. Heslop, and G. Travaglini, “MHV Amplitudes in N = 4 Super\nYang-Mills and Wilson Loops,” Nucl. Phys. B794 (2008) 231–243,\narXiv:0707.1153 [hep-th].\n[15] J. M. Drummond, J. Henn, G. P. Korchemsky, and E. Sokatchev, “Conformal\nWard Identities for Wilson Loops and a Test of the Duality with Gluon\nAmplitudes,” Nucl. Phys. B826 (2010) 337–364, arXiv:0712.1223 [hep-th].\n[16] L. Mason and D. Skinner, “The Complete Planar S-Matrix of N = 4 SYM as a\nWilson Loop in Twistor Space,” JHEP 12 (2010) 018, arXiv:1009.2225 [hep-th].\n[17] S. Caron-Huot, “Notes on the Scattering Amplitude / Wilson Loop Duality,”\nJHEP 1107 (2011) 058, arXiv:1010.1167 [hep-th].\n[18] L. F. Alday, B. Eden, G. P. Korchemsky, J. Maldacena, and E. Sokatchev, “From\nCorrelation Functions to Wilson Loops,” JHEP 1109 (2011) 123, arXiv:1007.3243\n[hep-th].\n[19] B. Eden, G. P. Korchemsky, and E. Sokatchev, “From Correlation Functions to\nScattering Amplitudes,” JHEP 1112 (2011) 002, arXiv:1007.3246 [hep-th].\n[20] B. Eden, G. P. Korchemsky, and E. Sokatchev, “More on the Duality\nCorrelators/Amplitudes,” Phys. Lett. B709 (2012) 247–253, arXiv:1009.2488\n[hep-th].\n[21] N. Arkani-Hamed, J. L. Bourjaily, F. Cachazo, A. B. Goncharov, A. Postnikov, and\nJ. Trnka, “Scattering Amplitudes and the Positive Grassmannian,”\narXiv:1212.5605 [hep-th].\n[22] N. Arkani-Hamed, F. Cachazo, C. Cheung, and J. Kaplan, “A Duality For The\nS-Matrix,” JHEP 1003 (2010) 020, arXiv:0907.5418 [hep-th].\n– 49 –\n[23] N. Arkani-Hamed, F. Cachazo, and C. Cheung, “The Grassmannian Origin Of Dual\nSuperconformal Invariance,” JHEP 1003 (2010) 036, arXiv:0909.0483 [hep-th].\n[24] L. Mason and D. Skinner, “Dual Superconformal Invariance, Momentum Twistors\nand Grassmannians,” JHEP 0911 (2009) 045, arXiv:0909.0250 [hep-th].\n[25] N. Arkani-Hamed, J. Bourjaily, F. Cachazo, and J. Trnka, “Unification of Residues\nand Grassmannian Dualities,” JHEP 1101 (2011) 049, arXiv:0912.4912 [hep-th].\n[26] N. Arkani-Hamed, J. Bourjaily, F. Cachazo, and J. Trnka, “Local Spacetime\nPhysics from the Grassmannian,” JHEP 1101 (2011) 108, arXiv:0912.3249\n[hep-th].\n[27] Y.-T. Huang and C. Wen, “ABJM Amplitudes and the Positive Orthogonal\nGrassmannian,” JHEP 1402 (2014) 104, arXiv:1309.3252 [hep-th].\n[28] N. Arkani-Hamed, J. L. Bourjaily, F. Cachazo, A. Hodges, and J. Trnka, “A Note\non Polytopes for Scattering Amplitudes,” JHEP 1204 (2012) 081, arXiv:1012.6030\n[hep-th].\n[29] N. Arkani-Hamed and J. Trnka, “The Amplituhedron,” JHEP 1410 (2014) 30,\narXiv:1312.2007 [hep-th].\n[30] N. Arkani-Hamed and J. Trnka, “Into the Amplituhedron,” JHEP 1412 (2014)\n182, arXiv:1312.7878 [hep-th].\n[31] S. Franco, D. Galloni, A. Mariotti, and J. Trnka, “Anatomy of the\nAmplituhedron,” JHEP 03 (2015) 128, arXiv:1408.3410 [hep-th].\n[32] T. Lam, “Amplituhedron Cells and Stanley Symmetric Functions,” Commun.\nMath. Phys. 343 (2016) no. 3, 1025–1037, arXiv:1408.5531 [math.AG].\n[33] Y. Bai and S. He, “The Amplituhedron from Momentum Twistor Diagrams,”\nJHEP 02 (2015) 065, arXiv:1408.2459 [hep-th].\n[34] Y. Bai, S. He, and T. Lam, “The Amplituhedron and the One-loop Grassmannian\nMeasure,” JHEP 01 (2016) 112, arXiv:1510.03553 [hep-th].\n[35] L. Ferro, T. Lukowski, A. Orta, and M. Parisi, “Towards the Amplituhedron\nVolume,” JHEP 03 (2016) 014, arXiv:1512.04954 [hep-th].\n[36] L. Ferro, T. Lukowski, A. Orta, and M. Parisi, “Yangian Symmetry for the Tree\nAmplituhedron,” arXiv:1612.04378 [hep-th].\n[37] D. Galloni, “Positivity Sectors and the Amplituhedron,” arXiv:1601.02639\n[hep-th].\n[38] S. N. Karp and L. K. Williams, “The m= 1 Amplituhedron and Cyclic Hyperplane\nArrangements,” arXiv:1608.08288 [math.CO].\n[39] N. Arkani-Hamed, Y. Bai, and T. Lam, “Positive Geometries and Canonical\nForms,” arXiv:1703.04541 [hep-th].\n– 50 –\n[40] L. J. Dixon, J. M. Drummond, and J. M. Henn, “Bootstrapping the Three-Loop\nHexagon,” JHEP 1111 (2011) 023, arXiv:1108.4461 [hep-th].\n[41] L. J. Dixon, J. M. Drummond, and J. M. Henn, “Analytic Result for the Two-Loop\nSix-Point NMHV Amplitude in N = 4 Super Yang-Mills Theory,” JHEP 1201\n(2012) 024, arXiv:1111.1704 [hep-th].\n[42] L. J. Dixon, J. M. Drummond, M. von Hippel, and J. Pennington, “Hexagon\nFunctions and the Three-Loop Remainder Function,” JHEP 1312 (2013) 049,\narXiv:1308.2276 [hep-th].\n[43] L. J. Dixon and M. von Hippel, “Bootstrapping an NMHV Amplitude Through\nThree Loops,” JHEP 1410 (2014) 65, arXiv:1408.1505 [hep-th].\n[44] L. J. Dixon, M. von Hippel, and A. J. McLeod, “The Four-Loop Six-Gluon NMHV\nRatio Function,” JHEP 01 (2016) 053, arXiv:1509.08127 [hep-th].\n[45] S. Caron-Huot, L. J. Dixon, A. McLeod, and M. von Hippel, “Bootstrapping a\nFive-Loop Amplitude Using Steinmann Relations,” Phys. Rev. Lett. 117 (2016) no.\n24, 241601, arXiv:1609.00669 [hep-th].\n[46] J. M. Drummond, G. Papathanasiou, and M. Spradlin, “A Symbol of Uniqueness:\nThe Cluster Bootstrap for the 3-Loop MHV Heptagon,” JHEP 03 (2015) 072,\narXiv:1412.3763 [hep-th].\n[47] L. J. Dixon, J. Drummond, T. Harrington, A. J. McLeod, G. Papathanasiou, and\nM. Spradlin, “Heptagons from the Steinmann Cluster Bootstrap,” JHEP 02 (2017)\n137, arXiv:1612.08976 [hep-th].\n[48] A. B. Goncharov, M. Spradlin, C. Vergu, and A. Volovich, “Classical\nPolylogarithms for Amplitudes and Wilson Loops,” Phys. Rev. Lett. 105 (2010)\n151605, arXiv:1006.5703 [hep-th].\n[49] J. Golden, A. B. Goncharov, M. Spradlin, C. Vergu, and A. Volovich, “Motivic\nAmplitudes and Cluster Coordinates,” JHEP 1401 (2014) 091, arXiv:1305.1617\n[hep-th].\n[50] D. Parker, A. Scherlis, M. Spradlin, and A. Volovich, “Hedgehog Bases for An\nCluster Polylogarithms and an Application to Six-Point Amplitudes,” JHEP 11\n(2015) 136, arXiv:1507.01950 [hep-th].\n[51] C. Duhr, H. Gangl, and J. R. Rhodes, “From Polygons and Symbols to\nPolylogarithmic Functions,” JHEP 10 (2012) 075, arXiv:1110.0458 [math-ph].\n[52] E. Witten, “Perturbative Gauge Theory as a String Theory in Twistor Space,”\nCommun. Math. Phys. 252 (2004) 189–258, arXiv:hep-th/0312171.\n[53] R. Roiban, M. Spradlin, and A. Volovich, “A Googly Amplitude from the B Model\nin Twistor Space,” JHEP 04 (2004) 012, arXiv:hep-th/0402016 [hep-th].\n– 51 –\n[54] F. Cachazo, S. He, and E. Y. Yuan, “Scattering of Massless Particles in Arbitrary\nDimensions,” Phys. Rev. Lett. 113 (2014) no. 17, 171601, arXiv:1307.2199 [hep-th].\n[55] F. Cachazo, S. He, and E. Y. Yuan, “Scattering of Massless Particles: Scalars,\nGluons and Gravitons,” JHEP 1407 (2014) 033, arXiv:1309.0885 [hep-th].\n[56] F. Cachazo, S. He, and E. Y. Yuan, “Scattering Equations and Kawai-Lewellen-Tye\nOrthogonality,” Phys. Rev. D90 (2014) no. 6, 065001, arXiv:1306.6575 [hep-th].\n[57] F. Cachazo, S. He, and E. Y. Yuan, “Scattering Equations and Matrices: From\nEinstein To Yang-Mills, DBI and NLSM,” JHEP 07 (2015) 149, arXiv:1412.3479\n[hep-th].\n[58] L. Dolan and P. Goddard, “The Polynomial Form of the Scattering Equations,”\nJHEP 1407 (2014) 029, arXiv:1402.7374 [hep-th].\n[59] N. E. J. Bjerrum-Bohr, P. H. Damgaard, P. Tourkine, and P. Vanhove, “Scattering\nEquations and String Theory Amplitudes,” Phys. Rev. D90 (2014) no. 10, 106002,\narXiv:1403.4553 [hep-th].\n[60] C. Baadsgaard, N. E. J. Bjerrum-Bohr, J. L. Bourjaily, P. H. Damgaard, and\nB. Feng, “Integration Rules for Loop Scattering Equations,” JHEP 11 (2015) 080,\narXiv:1508.03627 [hep-th].\n[61] C. Baadsgaard, N. E. J. Bjerrum-Bohr, J. L. Bourjaily, and P. H. Damgaard,\n“Scattering Equations and Feynman Diagrams,” JHEP 09 (2015) 136,\narXiv:1507.00997 [hep-th].\n[62] L. Mason and D. Skinner, “Ambitwistor Strings and the Scattering Equations,”\nJHEP 1407 (2014) 048, arXiv:1311.2564 [hep-th].\n[63] Y. Geyer, L. Mason, R. Monteiro, and P. Tourkine, “Loop Integrands for\nScattering Amplitudes from the Riemann Sphere,” Phys. Rev. Lett. 115 (2015) no.\n12, 121603, arXiv:1507.00321 [hep-th].\n[64] Y. Geyer, A. E. Lipstein, and L. J. Mason, “Ambitwistor Strings in Four\nDimensions,” Phys. Rev. Lett. 113 (2014) no. 8, 081602, arXiv:1404.6219 [hep-th].\n[65] F. Cachazo and Y. Geyer, “A ’Twistor String’ Inspired Formula for Tree-Level\nScattering Amplitudes in N = 8 SUGRA,” arXiv:1206.6511 [hep-th].\n[66] Y. Geyer, L. Mason, R. Monteiro, and P. Tourkine, “One-Loop Amplitudes on the\nRiemann Sphere,” JHEP 03 (2016) 114, arXiv:1511.06315 [hep-th].\n[67] E. Casali, Y. Geyer, L. Mason, R. Monteiro, and K. A. Roehrig, “New Ambitwistor\nString Theories,” JHEP 11 (2015) 038, arXiv:1506.08771 [hep-th].\n[68] Y. Geyer, L. Mason, R. Monteiro, and P. Tourkine, “Two-Loop Scattering\nAmplitudes from the Riemann Sphere,” Phys. Rev. D94 (2016) no. 12, 125029,\narXiv:1607.08887 [hep-th].\n– 52 –\n[69] C. Baadsgaard, N. E. J. Bjerrum-Bohr, J. L. Bourjaily, S. Caron-Huot, P. H.\nDamgaard, and B. Feng, “New Representations of the Perturbative S-Matrix,”\nPhys. Rev. Lett. 116 (2016) no. 6, 061601, arXiv:1509.02169 [hep-th].\n[70] R. Huang, Q. Jin, J. Rao, K. Zhou, and B. Feng, “The Q-Cut Representation of\nOne-Loop Integrands and Unitarity Cut Method,” JHEP 03 (2016) 057,\narXiv:1512.02860 [hep-th].\n[71] Y. An and Y. Li, “General expressions for extra-dimensional tree amplitudes and\nall-plus 1-loop integrands in Q-cut representaion,” arXiv:1610.05013 [hep-th].\n[72] Z. Bern, L. J. Dixon, and D. A. Kosower, “Progress in One-Loop QCD\nComputations,” Ann. Rev. Nucl. Part. Sci. 46 (1996) 109–148,\narXiv:hep-ph/9602280.\n[73] F. Cachazo and P. Svrcek, “Lectures on Twistor Strings and Perturbative\nYang-Mills Theory,” PoS RTN2005 (2005) 004, arXiv:hep-th/0504194.\n[74] N. Beisert, C. Ahn, L. F. Alday, Z. Bajnok, J. M. Drummond, et al., “Review of\nAdS/CFT Integrability: An Overview,” Lett. Math. Phys. 99 (2012) 3–32,\narXiv:1012.3982 [hep-th].\n[75] H. Elvang and Y.-t. Huang, “Scattering Amplitudes,” arXiv:1308.1697 [hep-th].\n[76] L. J. Dixon, “A Brief Introduction to Modern Amplitude Methods,” in Proceedings,\n2012 European School of High-Energy Physics (ESHEP 2012): La Pommeraye,\nAnjou, France, June 06-19, 2012, pp. 31–67. 2014. arXiv:1310.5353 [hep-ph].\nhttp://inspirehep.net/record/1261436/files/arXiv:1310.5353.pdf.\n[77] J. M. Henn and J. C. Plefka, “Scattering Amplitudes in Gauge Theories,” Lect.\nNotes Phys. 883 (2014) 1–195.\n[78] C. Duhr, “Mathematical Aspects of Scattering Amplitudes,” in Theoretical\nAdvanced Study Institute in Elementary Particle Physics: Journeys Through the\nPrecision Frontier: Amplitudes for Colliders (TASI 2014) Boulder, Colorado, June\n2-27, 2014. 2014. arXiv:1411.7538 [hep-ph].\nhttp://inspirehep.net/record/1331430/files/arXiv:1411.7538.pdf.\n[79] S. Weinzierl, “Tales of 1001 Gluons,” arXiv:1610.05318 [hep-th].\nhttp://inspirehep.net/record/1492547/files/arXiv:1610.05318.pdf.\n[80] Z. Bern, L. J. Dixon, D. C. Dunbar, M. Perelstein, and J. S. Rozowsky, “On the\nRelationship Between Yang-Mills Theory and Gravity and its Implication for\nUltraviolet Divergences,” Nucl. Phys. B530 (1998) 401–456, arXiv:hep-th/9802162\n[hep-th].\n[81] Z. Bern, J. J. Carrasco, D. Forde, H. Ita, and H. Johansson, “Unexpected\nCancellations in Gravity Theories,” Phys. Rev. D77 (2008) 025010,\narXiv:0707.1035 [hep-th].\n– 53 –\n[82] Z. Bern, J. J. M. Carrasco, L. J. Dixon, H. Johansson, and R. Roiban, “Simplifying\nMultiloop Integrands and Ultraviolet Divergences of Gauge Theory and Gravity\nAmplitudes,” Phys. Rev. D85 (2012) 105014, arXiv:1201.5366 [hep-th].\n[83] Z. Bern, C. Cheung, H.-H. Chi, S. Davies, L. Dixon, and J. Nohle, “Evanescent\nEffects Can Alter Ultraviolet Divergences in Quantum Gravity without Physical\nConsequences,” Phys. Rev. Lett. 115 (2015) no. 21, 211301, arXiv:1507.06118\n[hep-th].\n[84] D. J. Broadhurst and D. Kreimer, “Association of Multiple Zeta Values with\nPositive Knots via Feynman Diagrams up to 9 Loops,” Phys. Lett. B393 (1997)\n403–412, arXiv:hep-th/9609128 [hep-th].\n[85] D. Kreimer, “On the Hopf Algebra Structure of Perturbative Quantum Field\nTheories,” Adv. Theor. Math. Phys. 2 (1998) 303–334, arXiv:q-alg/9707029 [q-alg].\n[86] S. Bloch, H. Esnault, and D. Kreimer, “On Motives Associated to Graph\nPolynomials,” Commun. Math. Phys. 267 (2006) 181–225, arXiv:math/0510011\n[math-ag].\n[87] F. C. S. Brown, “On the Periods of Some Feynman Integrals,” arXiv:0910.0114\n[math.AG].\n[88] F. Brown and O. Schnetz, “A K3 in φ\n4\n,” arXiv:1006.4064 [math.AG].\n[89] C. Bogner and F. Brown, “Feynman Integrals and Iterated Integrals on Moduli\nSpaces of Curves of Genus Zero,” Commun. Num. Theor. Phys. 09 (2015) 189–238,\narXiv:1408.1862 [hep-th].\n[90] F. Brown, “Feynman Amplitudes and Cosmic Galois group,” arXiv:1512.06409\n[math-ph].\n[91] E. Panzer, Feynman Integrals and Hyperlogarithms. PhD thesis, Humboldt U.,\nBerlin, Inst. Math., 2015. arXiv:1506.07243 [math-ph].\nhttp://inspirehep.net/record/1377774/files/arXiv:1506.07243.pdf.\n[92] M. Marcolli, “Feynman Integrals and Motives,” arXiv:0907.0321 [math-ph].\n[93] P. Aluffi and M. Marcolli, “Feynman Motives of Banana Graphs,” Commun. Num.\nTheor. Phys. 3 (2009) 1–57, arXiv:0807.1690 [hep-th].\n[94] F. Brown and K. Yeats, “Spanning Forest Polynomials and the Transcendental\nWeight of Feynman Graphs,” Commun. Math. Phys. 301 (2011) 357–382,\narXiv:0910.5429 [math-ph].\n[95] N. Arkani-Hamed, J. L. Bourjaily, F. Cachazo, and J. Trnka, “Singularity\nStructure of Maximally Supersymmetric Scattering Amplitudes,” Phys. Rev. Lett.\n113 (2014) no. 26, 261603, arXiv:1410.0354 [hep-th].\n[96] Z. Bern, E. Herrmann, S. Litsey, J. Stankowicz, and J. Trnka, “Logarithmic\n– 54 –\nSingularities and Maximally Supersymmetric Amplitudes,” JHEP 06 (2015) 202,\narXiv:1412.8584 [hep-th].\n[97] Z. Bern, E. Herrmann, S. Litsey, J. Stankowicz, and J. Trnka, “Evidence for a\nNonplanar Amplituhedron,” JHEP 06 (2016) 098, arXiv:1512.08591 [hep-th].\n[98] J. L. Bourjaily, A. DiRe, A. Shaikh, M. Spradlin, and A. Volovich, “The\nSoft-Collinear Bootstrap: N = 4 Yang-Mills Amplitudes at Six and Seven Loops,”\nJHEP 1203 (2012) 032, arXiv:1112.6432 [hep-th].\n[99] J. L. Bourjaily, P. Heslop, and V.-V. Tran, “Perturbation Theory at Eight Loops:\nNovel Structures and the Breakdown of Manifest Conformality in N = 4\nSupersymmetric Yang-Mills Theory,” Phys. Rev. Lett. 116 (2016) no. 19, 191602,\narXiv:1512.07912 [hep-th].\n[100] J. L. Bourjaily, P. Heslop, and V.-V. Tran, “Amplitudes and Correlators to Ten\nLoops Using Simple, Graphical Bootstraps,” JHEP 11 (2016) 125,\narXiv:1609.00007 [hep-th].\n[101] Z. Bern, L. J. Dixon, D. C. Dunbar, and D. A. Kosower, “One-Loop n-Point Gauge\nTheory Amplitudes, Unitarity and Collinear Limits,” Nucl. Phys. B425 (1994)\n217–260, arXiv:hep-ph/9403226.\n[102] Z. Bern, L. J. Dixon, D. C. Dunbar, and D. A. Kosower, “Fusing Gauge Theory\nTree Amplitudes into Loop Amplitudes,” Nucl. Phys. B435 (1995) 59–101,\narXiv:hep-ph/9409265.\n[103] R. Britto, F. Cachazo, and B. Feng, “Generalized Unitarity and One-Loop\nAmplitudes in N = 4 Super-Yang-Mills,” Nucl. Phys. B725 (2005) 275–305,\narXiv:hep-th/0412103.\n[104] C. Anastasiou, R. Britto, B. Feng, Z. Kunszt, and P. Mastrolia, “D-Dimensional\nUnitarity Cut Method,” Phys. Lett. B645 (2007) 213–216, arXiv:hep-ph/0609191\n[hep-ph].\n[105] Z. Bern, J. Carrasco, H. Johansson, and D. Kosower, “Maximally Supersymmetric\nPlanar Yang-Mills Amplitudes at Five Loops,” Phys. Rev. D76 (2007) 125020,\narXiv:0705.1864 [hep-th].\n[106] F. Cachazo, “Sharpening The Leading Singularity,” arXiv:0803.1988 [hep-th].\n[107] C. F. Berger et al., “An Automated Implementation of On-Shell Methods for\nOne-Loop Amplitudes,” Phys. Rev. D78 (2008) 036003, arXiv:0803.4180 [hep-ph].\n[108] S. Abreu, F. Febres Cordero, H. Ita, M. Jaquier, B. Page, and M. Zeng, “Two-Loop\nFour-Gluon Amplitudes with the Numerical Unitarity Method,” arXiv:1703.05273\n[hep-ph].\n[109] G. Passarino and M. Veltman, “One Loop Corrections for e\n+ e\n− Annihilation Into\nµ\n+ µ\n− in the Weinberg Model,” Nucl. Phys. B160 (1979) 151.\n– 55 –\n[110] G. Ossola, C. G. Papadopoulos, and R. Pittau, “Reducing Full One-Loop\nAmplitudes to Scalar Integrals at the Integrand Level,” Nucl. Phys. B763 (2007)\n147–169, arXiv:hep-ph/0609007 [hep-ph].\n[111] P. Mastrolia, G. Ossola, T. Reiter, and F. Tramontano, “Scattering Amplitudes\nfrom Unitarity-Based Reduction Algorithm at the Integrand-Level,” JHEP 08\n(2010) 080, arXiv:1006.0710 [hep-ph].\n[112] S. Badger, H. Frellesvig, and Y. Zhang, “An Integrand Reconstruction Method for\nThree-Loop Amplitudes,” JHEP 1208 (2012) 065, arXiv:1207.2976 [hep-ph].\n[113] P. Mastrolia, E. Mirabella, G. Ossola, and T. Peraro, “Scattering Amplitudes from\nMultivariate Polynomial Division,” Phys. Lett. B718 (2012) 173–177,\narXiv:1205.7087 [hep-ph].\n[114] S. Badger, H. Frellesvig, and Y. Zhang, “Multi-Loop Integrand Reduction with\nComputational Algebraic Geometry,” J. Phys. Conf. Ser. 523 (2014) 012061,\narXiv:1310.4445 [hep-ph].\n[115] P. Mastrolia, T. Peraro, and A. Primo, “Adaptive Integrand Decomposition in\nparallel and orthogonal space,” JHEP 08 (2016) 164, arXiv:1605.03157 [hep-ph].\n[116] H. Ita, “Two-Loop Integrand Decomposition into Master Integrals and Surface\nTerms,” Phys. Rev. D94 (2016) no. 11, 116015, arXiv:1510.05626 [hep-th].\n[117] Z. Bern, S. Davies, and J. Nohle, “Double-Copy Constructions and Unitarity\nCuts,” Phys. Rev. D93 (2016) no. 10, 105015, arXiv:1510.03448 [hep-th].\n[118] J. L. Bourjaily, S. Caron-Huot, and J. Trnka, “Dual-Conformal Regularization of\nInfrared Loop Divergences and the Chiral Box Expansion,” JHEP 1501 (2015) 001,\narXiv:1303.4734 [hep-th].\n[119] J. L. Bourjaily and J. Trnka, “Local Integrand Representations of All Two-Loop\nAmplitudes in Planar SYM,” JHEP 08 (2015) 119, arXiv:1505.05886 [hep-th].\n[120] V. A. Smirnov, Feynman Integral Calculus. Springer-Verlag, 2006.\n[121] V. A. Smirnov, “Analytic Tools for Feynman integrals,” Springer Tracts Mod.\nPhys. 250 (2012) 1–296.\n[122] J. M. Henn, “Lectures on Differential Equations for Feynman Integrals,” J. Phys.\nA48 (2015) no. 15, 153001, arXiv:1412.2296 [hep-ph].\n[123] Y. Zhang, “Lecture Notes on Multi-loop Integral Reduction and Applied Algebraic\nGeometry,” arXiv:1612.02249 [hep-th].\nhttp://inspirehep.net/record/1502112/files/arXiv:1612.02249.pdf.\n[124] D. A. Kosower and K. J. Larsen, “Maximal Unitarity at Two Loops,” Phys. Rev.\nD85 (2012) 045017, arXiv:1108.1180 [hep-th].\n[125] J. Gluza, K. Kajda, and D. A. Kosower, “Towards a Basis for Planar Two-Loop\nIntegrals,” Phys. Rev. D83 (2011) 045012, arXiv:1009.0472 [hep-th].\n– 56 –\n[126] H. Johansson, D. A. Kosower, K. J. Larsen, and M. Søgaard, “Cross-Order Integral\nRelations from Maximal Cuts,” Phys. Rev. D92 (2015) no. 2, 025015,\narXiv:1503.06711 [hep-th].\n[127] P. Griffiths and J. Harris, Principles of Algebraic Geometry. Wiley Classics\nLibrary. John Wiley \u0026 Sons Inc., New York, 1978.\n[128] S. Abreu, R. Britto, C. Duhr, and E. Gardi, “Cuts from Residues: the One-Loop\nCase,” arXiv:1702.03163 [hep-th].\n[129] N. Arkani-Hamed, J. L. Bourjaily, F. Cachazo, A. Postnikov, and J. Trnka,\n“On-Shell Structures of MHV Amplitudes Beyond the Planar Limit,” JHEP 06\n(2015) 179, arXiv:1412.8475 [hep-th].\n[130] S. Franco, D. Galloni, B. Penante, and C. Wen, “Non-Planar On-Shell Diagrams,”\nJHEP 06 (2015) 199, arXiv:1502.02034 [hep-th].\n[131] R. Frassek and D. Meidinger, “Yangian-Type Symmetries of Non-Planar Leading\nSingularities,” JHEP 05 (2016) 110, arXiv:1603.00088 [hep-th].\n[132] P. Heslop and A. E. Lipstein, “On-Shell Diagrams for N = 8 Supergravity\nAmplitudes,” arXiv:1604.03046 [hep-th].\n[133] E. Herrmann and J. Trnka, “Gravity On-shell Diagrams,” JHEP 11 (2016) 136,\narXiv:1604.03479 [hep-th].\n[134] P. Benincasa, “On-Shell Diagrammatics and the Perturbative Structure of Planar\nGauge Theories,” arXiv:1510.03642 [hep-th].\n[135] P. Benincasa and D. Gordo, “On-Shell Diagrams and the Geometry of Planar\nN \u003c4 SYM Theories,” arXiv:1609.01923 [hep-th].\n[136] N. Arkani-Hamed, J. L. Bourjaily, F. Cachazo, A. B. Goncharov, A. Postnikov, and\nJ. Trnka, Grassmannian Geometry of Scattering Amplitudes. Cambridge University\nPress, 2016.\n[137] J. L. Bourjaily, “Efficient Tree-Amplitudes in N = 4: Automatic BCFW Recursion\nin Mathematica,” arXiv:1011.2447 [hep-ph].\n[138] J. L. Bourjaily, “Positroids, Plabic Graphs, and Scattering Amplitudes in\nMathematica,” arXiv:1212.6974 [hep-th].\n[139] L. J. Dixon, J. M. Henn, J. Plefka, and T. Schuster, “All Tree-Level Amplitudes in\nMassless QCD,” JHEP 1101 (2011) 035, arXiv:1010.3991 [hep-ph].\n[140] J. Bosma, M. Sogaard, and Y. Zhang, “Maximal Cuts in Arbitrary Dimension,”\narXiv:1704.04255 [hep-th].\n[141] A. Hodges, “Eliminating Spurious Poles from Gauge-Theoretic Amplitudes,” JHEP\n1305 (2013) 135, arXiv:0905.1473 [hep-th].\n[142] S. Weinberg, “Six-Dimensional Methods for Four-Dimensional Conformal Field\nTheories,” Phys. Rev. D82 (2010) 045031, arXiv:1006.3480 [hep-th].\n– 57 –\n[143] R. K. Ellis, Z. Kunszt, K. Melnikov, and G. Zanderighi, “One-Loop Calculations in\nQuantum Field Theory: from Feynman Diagrams to Unitarity Cuts,” Phys. Rept.\n518 (2012) 141–250, arXiv:1105.4319 [hep-ph].\n[144] Z. Bern, J. Rozowsky, and B. Yan, “Two-Loop Four-Gluon Amplitudes in N = 4\nSuperYang-Mills,” Phys. Lett. B401 (1997) 273–282, arXiv:hep-ph/9702424.\n[145] C. Vergu, “The Two-Loop MHV Amplitudes in N = 4 Supersymmetric Yang- Mills\nTheory,” Phys. Rev. D80 (2009) 125025, arXiv:0908.2394 [hep-th].\n[146] N. Arkani-Hamed, J. L. Bourjaily, F. Cachazo, and J. Trnka, “Local Integrals for\nPlanar Scattering Amplitudes,” JHEP 1206 (2012) 125, arXiv:1012.6032 [hep-th].\n[147] S. Badger, H. Frellesvig, and Y. Zhang, “A Two-Loop Five-Gluon Helicity\nAmplitude in QCD,” JHEP 12 (2013) 045, arXiv:1310.1051 [hep-ph].\n[148] S. Badger, G. Mogull, A. Ochirov, and D. O’Connell, “A Complete Two-Loop,\nFive-Gluon Helicity Amplitude in Yang-Mills Theory,” JHEP 10 (2015) 064,\narXiv:1507.08797 [hep-ph].\n[149] T. Gehrmann, J. M. Henn, and N. A. Lo Presti, “Analytic form of the Two-Loop\nPlanar Five-Gluon All-Plus Helicity Amplitude in QCD,” Phys. Rev. Lett. 116\n(2016) no. 6, 062001, arXiv:1511.05409 [hep-ph]. [Erratum: Phys. Rev.\nLett.116,no.18,189903(2016)].\n[150] D. C. Dunbar and W. B. Perkins, “Two-Loop Five-Point All-Plus Helicity\nYang-Mills Amplitude,” Phys. Rev. D93 (2016) no. 8, 085029, arXiv:1603.07514\n[hep-th].\n[151] D. C. Dunbar, G. R. Jehu, and W. B. Perkins, “Two-Loop Six Gluon All-Plus\nHelicity Amplitude,” Phys. Rev. Lett. 117 (2016) no. 6, 061602, arXiv:1605.06351\n[hep-th].\n[152] Z. Bern, L. J. Dixon, and V. A. Smirnov, “Iteration of Planar Amplitudes in\nMaximally Supersymmetric Yang-Mills Theory at Three Loops and Beyond,” Phys.\nRev. D72 (2005) 085001, arXiv:hep-th/0505205.\n[153] S. Caron-Huot and K. J. Larsen, “Uniqueness of Two-Loop Master Contours,”\nJHEP 1210 (2012) 026, arXiv:1205.0801 [hep-ph]."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":[{"name":"CALT-TH","id":"2017-019"}],"funders":[{"agency":"NSF","grant_number":"PHY-1125915"},{"agency":"Danish National Research Foundation","grant_number":"DNRF91"},{"agency":"Villum Fonden","grant_number":""},{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0011632"},{"agency":"Gordon and Betty Moore Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Walter Burke Institute for Theoretical Physics"]}