{"title":"SpECTRE: A task-based discontinuous Galerkin code for relativistic astrophysics","uri":"","abstract":"We introduce a new relativistic astrophysics code, SpECTRE, that combines a discontinuous Galerkin method with a task-based parallelism model. SpECTRE's goal is to achieve more accurate solutions for challenging relativistic astrophysics problems such as core-collapse supernovae and binary neutron star mergers. The robustness of the discontinuous Galerkin method allows for the use of high-resolution shock capturing methods in regions where (relativistic) shocks are found, while exploiting high-order accuracy in smooth regions. A task-based parallelism model allows efficient use of the largest supercomputers for problems with a heterogeneous workload over disparate spatial and temporal scales. We argue that the locality and algorithmic structure of discontinuous Galerkin methods will exhibit good scalability within a task-based parallelism framework. We demonstrate the code on a wide variety of challenging benchmark problems in (non)-relativistic (magneto)-hydrodynamics. We demonstrate the code's scalability including its strong scaling on the NCSA Blue Waters supercomputer up to the machine's full capacity of 22,380 nodes using 671,400 threads.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251404","docid":251404,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250213","fileid":1250213,"datasetid":"document","objectid":251404,"filename":"1-s2.0-S0021999117300098-main.pdf","mime_type":"application/pdf","hash":"353468d8fcd2c555a235eaf5d16c9737","hash_type":"MD5","filesize":2758324,"mtime":"2017-04-27 21:26:04","url":"http://authors.library.caltech.edu/77016/1/1-s2.0-S0021999117300098-main.pdf"}],"eprintid":77016,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"1-s2.0-S0021999117300098-main.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251408","docid":251408,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250261","fileid":1250261,"datasetid":"document","objectid":251408,"filename":"1609.00098.pdf","mime_type":"application/pdf","hash":"02d6a83d2408d7857a31f6bbc9d0c1d0","hash_type":"MD5","filesize":1544552,"mtime":"2017-04-27 21:40:47","url":"http://authors.library.caltech.edu/77016/2/1609.00098.pdf"}],"eprintid":77016,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1609.00098.pdf","content":"submitted"}],"note":"© 2017 Elsevier Inc. \n\nReceived 5 September 2016, Revised 21 December 2016, Accepted 29 December 2016, Available online 5 January 2017. \n\nWe acknowledge helpful discussions with Sebastiano Bernuzzi, Bernd Brügmann, Marcus Bugner, Mani Chandra, Roland Haas, Daniel Hemberger, Jan Hesthaven, Cameron Hummels, Fraser Hutchison, Jonathan Lifflander, Geoffrey Lovelace, Phil Miller, Harald Pfeiffer, David Radice, and Christian Reisswig. We thank the anonymous referee for detailed comments and suggestions which helped to improve the manuscript. Support for F. Foucart was provided by NASA through Einstein Postdoctoral Fellowship grant numbered PF4-150122 awarded by the Chandra X-ray Center, which is operated by the Smithsonian Astrophysical Observatory for NASA under contract NAS8-03060. Authors at Cornell were partially supported by NSF under award Nos. TCAN AST-1333129 and PHY-1306125, and by the Sherman Fairchild Foundation. Authors at Caltech were partially supported by NSF under award Nos. TCAN AST-1333520, CAREER PHY-1151197, and PHY-1404569, and by the Sherman Fairchild Foundation. ES acknowledges support from NSF award OCI-0905046. ES and JM were supported by an NSERC Discovery grant. Research at the Perimeter Institute is supported by the Government of Canada through Industry Canada and by the Province of Ontario through the Ministry of Research \u0026 Innovation. Computations were performed on NSF/NCSA Blue Waters under allocation PRAC ACI-1440083, on the NSF XSEDE network under allocations TG-PHY100033 and TG-PHY990007, and on the Caltech compute cluster Zwicky (NSF MRI-R2 award No. PHY-0960291).","id":77016,"rev_number":17,"userid":772,"eprint_dir":"disk0/00/07/70/16","datestamp":"2017-04-27 21:47:19","lastmod":"2017-04-27 21:47:19","status_changed":"2017-04-27 21:47:19","type":"article","metadata_visibility":"show","creators":[{"given":"Lawrence E.","family":"Kidder","id":"Kidder-L-E","orcid":""},{"given":"Scott E.","family":"Field","id":"Field-S-E","orcid":""},{"given":"Francois","family":"Foucart","id":"Foucart-F","orcid":""},{"given":"Erik","family":"Schnetter","id":"Schnetter-E","orcid":""},{"given":"Saul A.","family":"Teukolsky","id":"Teukolsky-S-A","orcid":""},{"given":"Andy","family":"Bohn","id":"Bohn-A","orcid":""},{"given":"Nils","family":"Deppe","id":"Deppe-N","orcid":""},{"given":"Peter","family":"Diener","id":"Diener-P","orcid":""},{"given":"François","family":"Hébert","id":"Hébert-F","orcid":""},{"given":"Jonas","family":"Lippuner","id":"Lippuner-J","orcid":"0000-0002-5936-3485"},{"given":"Jonah","family":"Miller","id":"Miller-J","orcid":""},{"given":"Christian D.","family":"Ott","id":"Ott-C-D","orcid":"0000-0003-4993-2055"},{"given":"Mark A.","family":"Scheel","id":"Scheel-M-A","orcid":""},{"given":"Trevor","family":"Vincent","id":"Vincent-T","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Discontinuous Galerkin; Hydrodynamics; Magnetohydrodynamics; Task-based parallelism","date":"2017-04-15","date_type":"published","publication":"Journal of Computational Physics","volume":"335","number":"","pagerange":"84-114","id_number":"CaltechAUTHORS:20170427-142549072","refereed":true,"issn":"0021-9991","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170427-142549072","related_url":[{"url":"https://doi.org/10.1016/j.jcp.2016.12.059","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0021999117300098","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1609.00098","type":"arxiv","description":"Discussion Paper"}],"referencetext":["References\n[1]D. Eichler, M. Livio, T. Piran, D.N. Schramm, Nucleosynthesis, neutrino bursts and gamma-rays from coalescing neutron stars, Nature 340 (1989) 126, http://dx.doi.org/10.1038/340126a0.\n[2]R. Narayan, B. Paczynski, T. Piran, Gamma-ray bursts as the death throes of massive binary stars, Astrophys. J. Lett. 395 (1992) L83, http://dx.doi.org/10.1086/186493, arXiv:astro-ph/9204001.\n[3]R. Mochkovitch, M. Hernanz, J. Isern, X. Martin, Gamma-ray bursts as collimated jets from neutron star/black hole mergers, Nature 361 (1993) 236, http://dx.doi.org/10.1038/361236a0.\n[4]H.-T. Janka, Explosion mechanisms of core-collapse supernovae, Annu. Rev. Nucl. Part. Sci. 62 (2012) 407, http://dx.doi.org/10.1146/annurev-nucl-102711-094901, arXiv:1206.2503.\n[5]A. Burrows, Colloquium: perspectives on core-collapse supernova theory, Rev. Mod. Phys. 85 (2013) 245, http://dx.doi.org/10.1103/RevModPhys.85.245, arXiv:1210.4921.\n[6]C.D. Ott, Massive computation for understanding core-collapse supernova explosions, Comput. Sci. Eng. 18(5) (2016) 78, http://dx.doi.org/10.1109/MCSE.2016.81, arXiv:1608.08069.\n[7]Fermi Gamma-Ray Telescope, http://fermi.gsfc.nasa.gov.\n[8]http://www.ligo.caltech.edu.\n[9]B. Fryxell, K. Olson, P. Ricker, F. Timmes, M. Zingale, et al., FLASH: an adaptive mesh hydrodynamics code for modeling astrophysical thermonuclear flashes, Astrophys. J. Suppl. Ser. 131 (2000) 273, http://dx.doi.org/10.1086/317361.\n[10]G.L. Bryan, M.L. Norman, B.W. O’Shea, T. Abel, J.H. Wise, M.J. Turk, D.R. Reynolds, D.C. Collins, P. Wang, S.W. Skillman, B. Smith, R.P. Harkness, J. Bordner, J.-h. Kim, M. Kuhlen, H. Xu, N. Goldbaum, C. Hummels, A.G. Kritsuk, E. Tasker, S. Skory, C.M. Simpson, O. Hahn, J.S. Oishi, G.C. So, F. Zhao, R. Cen, Y. Li, Enzo Collaboration, ENZO: an adaptive mesh refinement code for astrophysics, Astrophys. J. Suppl. Ser. 211 (2014) 19, http://dx.doi.org/10.1088/0067-0049/211/2/19, arXiv:1307.2265.\n[11]A. Mignone, C. Zanni, P. Tzeferacos, B. van Straalen, P. Colella, G. Bodo, The PLUTO code for adaptive mesh computations in astrophysical fluid dynamics, Astrophys. J. Suppl. Ser. 198 (2012) 7, http://dx.doi.org/10.1088/0067-0049/198/1/7, arXiv:1110.0740.\n[12]A.S. Almgren, V.E. Beckner, J.B. Bell, M.S. Day, L.H. Howell, C.C. Joggerst, M.J. Lijewski, A. Nonaka, M. Singer, M. Zingale, CASTRO: a new compressible as-trophysical solver, I: hydrodynamics and self-gravity, Astrophys. J. 715 (2010) 1221, http://dx.doi.org/10.1088/0004-637X/715/2/1221, arXiv:1005.0114.\n[13]F. Löffler, J. Faber, E. Bentivegna, T. Bode, P. Diener, R. Haas, I. Hinder, B.C. Mundim, C.D. Ott, E. Schnetter, G. Allen, M. Campanelli, P. Laguna, The Einstein Toolkit: a community computational infrastructure for relativistic astrophysics, Class. Quantum Gravity 29(11) (2012) 115001, http://dx.doi.org/10.1088/0264-9381/29/11/115001, arXiv:1111.3344.\n[14]http://www.black-holes.org/SpEC.html.\n[15]P.R. Woodward, J. Jayaraj, P.-H. Lin, M. Knox, S.D. Hammond, J. Greensky, S.E. Anderson, Scaling the multifluid PPM code on Blue Waters and Intel MIC, in: 2013 Extreme Scaling Workshop, xsw 2013, IEEE, 2013, pp.64–72.\n[16]W. Reed, T. Hill, Triangular mesh methods for the neutron transport equation, in: Conference: National Topical Meeting on Mathematical Mod-els and Computational Techniques for Analysis of Nuclear Systems, Ann Arbor, Michigan, USA, 8 Apr. 1973, 1973, LA-UR-73-479, CONF-730414-2, http://www.osti.gov/scitech/servlets/purl/4491151, 1973.\n[17]J. Hesthaven, T. Warburton, Nodal Discontinuous Galerkin Methods: Algorithms, Analysis, and Applications, Springer, Berlin, New York, 2008.\n[18]B. Cockburn, Devising discontinuous Galerkin methods for non-linear hyperbolic conservation laws, J. Comput. Appl. Math. 128 (2001) 187, http://dx.doi.org/10.1016/S0377-0427(00)00512-4.\n[19]B. Cockburn, C.-W. Shu, The Runge–Kutta discontinuous Galerkin method for conservation laws, V: vultidimensional systems, J. Comput. Phys. 141 (1998) 199, http://dx.doi.org/10.1006/jcph.1998.5892.\n[20]B. Cockburn, An introduction to the discontinuous Galerkin method for convection-dominated problems, in: Advanced Numerical Approximation of Nonlinear Hyperbolic Equations: Lectures Given at the 2nd Session of the Centro Internazionale Matematico Estivo (C.I.M.E.) Held in Cetraro, Italy, June 23–28, 1997, in: Lecture Notes in Physics, Springer, Berlin, New York, 1998, pp.150–268.\n[21]B. Cockburn, G.E. Karniadakis, C.-W. Shu, The development of discontinuous Galerkin methods, in: B. Cockburn, G.E. Karniadakis, C.-W. Shu (Eds.), Discontinuous Galerkin Methods: Theory, Computation and Applications, in: Lecture Notes in Computational Science and Engineering, Springer, Berlin, New York, 2000, pp.3–50.\n[22]X. Zhang, C.-W. Shu, On positivity-preserving high order discontinuous Galerkin schemes for compressible Eulerequations on rectangular meshes, J. Comput. Phys. 229(23) (2010) 8918–8934.\n[23]D.S. Balsara, J. Kim, A subluminal relativistic magnetohydrodynamics scheme with ADER–WENO predictor and multidimensional Riemann solver-based corrector, J. Comput. Phys. 312 (2016) 357–384.\n[24]D.S. Balsara, Self-adjusting, positivity preserving high order schemes for hydrodynamics and magnetohydrodynamics, J. Comput. Phys. 231(22) (2012) 7504–7517.\n[25]C.D. Muhlberger, F.H. Nouri, M.D. Duez, F. Foucart, L.E. Kidder, C.D. Ott, M.A. Scheel, B. Szilágyi, S.A. Teukolsky, Magnetic effects on the low-T/|W|instability in differentially rotating neutron stars, Phys. Rev. D 90(10) (2014) 104014, http://dx.doi.org/10.1103/PhysRevD.90.104014, arXiv:1405.2144.\n[26]S.E. Field, J.S. Hesthaven, S.R. Lau, A.H. Mroue, Discontinuous Galerkin method for the spherically reduced BSSN system with second-order operators, Phys. Rev. D 82 (2010) 104051, http://dx.doi.org/10.1103/PhysRevD.82.104051, arXiv:1008.1820.\n[27]J.D. Brown, P. Diener, S.E. Field, J.S. Hesthaven, F. Herrmann, A.H. Mroué, O. Sarbach, E. Schnetter, M. Tiglio, M. Wagman, Numerical simulations with a first-order BSSN formulation of Einstein’s field equations, Phys. Rev. D 85 (2012) 084004, http://dx.doi.org/10.1103/PhysRevD.85.084004, arXiv:1202.1038.\n[28]S.E. Field, J.S. Hesthaven, S.R. Lau, Discontinuous Galerkin method for computing gravitational waveforms from extreme mass ratio binaries, Class. Quantum Gravity 26 (2009) 165010, http://dx.doi.org/10.1088/0264-9381/26/16/165010, arXiv:0902.1287.\n[29]G. Zumbusch, Finite element, discontinuous Galerkin, and finite difference evolution schemes in spacetime, Class. Quantum Gravity 26 (2009) 175011.\n[30]D. Radice, L. Rezzolla, Discontinuous Galerkin methods for general-relativistic hydrodynamics: formulation and application to spherically symmetric spacetimes, Phys. Rev. D 84 (2011) 024010, http://dx.doi.org/10.1103/PhysRevD.84.024010, arXiv:1103.2426.\n[31]P. Mocz, M. Vogelsberger, D. Sijacki, R. Pakmor, L. Hernquist, A discontinuous Galerkin method for solving the fluid and magnetohydrodynamic equations in astrophysical simulations, Mon. Not. R. Astron. Soc. Lett. 437 (2014) 397–414, http://dx.doi.org/10.1093/mnras/stt1890, arXiv:1305.5536\n[32]O. Zanotti, M. Dumbser, A. Hidalgo, D. Balsara, An ADER–WENO finite volume AMR code for astrophysics, in: N.V. Pogorelov, E. Audit, G.P. Zank (Eds.), 8th International Conference of Numerical Modeling of Space Plasma Flows, ASTRONUM 2013, in: Astronomical Society of the Pacific Conference Series, vol.488, 2014, pp.285–290, arXiv:1401.6448.\n[33]E. Endeve, C.D. Hauck, Y. Xing, A. Mezzacappa, Bound-preserving discontinuous Galerkin methods for conservative phase space advection in curvilinear coordinates, J. Comput. Phys. 287 (2015) 151–183.\n[34]K. Schaal, A. Bauer, P. Chandrashekar, R. Pakmor, C. Klingenberg, V. Springel, Astrophysical hydrodynamics with a high-order discontinuous Galerkin scheme and adaptive mesh refinement, Mon. Not. R. Astron. Soc. Lett. 453 (2015) 4278, http://dx.doi.org/10.1093/mnras/stv1859, arXiv:1506.06140.\n[35]S.A. Teukolsky, Formulation of discontinuous Galerkin methods for relativistic astrophysics, J. Comput. Phys. 312 (2016) 333, http://dx.doi.org/10.1016/j.jcp.2016.02.031, arXiv:1510.01190.\n[36]M. Bugner, T. Dietrich, S. Bernuzzi, A. Weyhausen, B. Brügmann, Solving 3D relativistic hydrodynamical problems with weighted essentially nonoscil-latory discontinuous Galerkin methods, Phys. Rev. D 94(8) (2016) 084004, http://dx.doi.org/10.1103/PhysRevD.94.084004, arXiv:1508.07147.\n[37]O. Zanotti, F. Fambri, M. Dumbser, Solving the relativistic magnetohydrodynamics equations with ADER discontinuous Galerkin methods, a posteriori subcell limiting and adaptive mesh refinement, Mon. Not. R. Astron. Soc. 452(3) (2015) 3010–3029.\n[38]J.M. Miller, E. Schnetter, An operator-based local discontinuous Galerkin method compatible with the BSSN formulation of the Einstein equations, Phys. Rev. D (2017), http://dx.doi.org/10.1088/1361-6382/34/1/015003, in press, arXiv:1604.00075.\n[39]M. Schaller, P. Gonnet, A.B.G. Chalk, P.W. Draper, SWIFT: using task-based parallelism, fully asynchronous communication, and graph partition-based domain decomposition for strong scaling on more than 100,000 cores, in: Proceedings of the Platform for Advanced Scientific Computing Conference, Lausanne, Switzerland, 2016, 2016, pp.2:1–2:10, arXiv:1606.02738.\n[40]J.C. Phillips, R. Braun, W. Wang, J. Gumbart, E. Tajkhorshid, E. Villa, C. Chipot, R.D. Skeel, L. Kalé, K. Schulten, Scalable molecular dynamics with NAMD, J. Comput. Chem. 26 (2005) 1781, http://dx.doi.org/10.1002/jcc.20289.\n[41]http://charm.cs.illinois.edu/OpenAtom/.\n[42]P. Jetley, F. Gioachin, C. Mendes, L.V. Kale, T. Quinn, Massively parallel cosmological simulations with ChaNGa, in: Parallel and Distributed Processing: IEEE International Symposium on Parallel \u0026 Distributed Processing, IPDPS 2008, 2008, pp.1–12.\n[43]http://uintah.utah.edu.\n[44]M. Berzins, J. Luitjens, Q. Meng, T. Harman, C.A. Wight, J.R. Peterson, Uintah: a scalable framework for hazard analysis, in: Proceedings of the 2010 TeraGrid Conference, TG ’10, ACM, New York, NY, USA, 2010, pp.3:1–3:8.\n[45]G. Martyna, E. Bohm, R. Venkataraman, A. Arya, L.V. Kalé, A. Bhatele, OpenAtom: Ab Initio Molecular Dynamics for Petascale Platforms, Tech. Rep. LLNL-BOOK-608553, Lawrence Livermore National Laboratory (LLNL), Livermore, CA, 2012, https://e-reports-ext.llnl.gov/pdf/708673.pdf.\n[46]http://charm.cs.illinois.edu/research/charm.\n[47]L.V. Kalé, S. Krishnan, CHARM++: a portable concurrent object oriented system based on C++, in: Proceedings of the Eighth Annual Conference on Object-Oriented Programming Systems, Languages, and Applications, OOPSLA ’93, ACM, New York, NY, USA, 1993, pp.91–108.\n[48]W. Shu, L.V. Kalé, Chare kernel – a runtime support system for parallel computations, J. Parallel Distrib. Comput. 11 (1991) 198, http://dx.doi.org/10.1016/0743-7315(91)90044-A.\n[49]L.V. Kalé, A. Bhatele, Parallel Science and Engineering Applications: The Charm++ Approach, CRC Press, Boca Raton, 2016.\n[50]T.W. Baumgarte, S.L. Shapiro, Numerical Relativity: Solving Einstein’s Equations on the Computer, Cambridge University Press, New York, 2010.\n[51]L. Rezzolla, O. Zanotti, Relativistic Hydrodynamics, Oxford University Press, New York, 2013.\n[52]J.A. Font, Numerical hydrodynamics and magnetohydrodynamics in general relativity, Living Rev. Relativ. 11(7) (2008), http://dx.doi.org/10.12942/lrr-2008-7.\n[53]F. Galeazzi, W. Kastaun, L. Rezzolla, J.A. Font, Implementation of a simplified approach to radiative transfer in general relativity, Phys. Rev. D 88 (2013) 064009, http://dx.doi.org/10.1103/PhysRevD.88.064009, arXiv:1306.4953.\n[54]A. Dedner, F. Kemm, D. Kröner, C.-D. Munz, T. Schnitzer, M. Wesenberg, Hyperbolic divergence cleaning for the MHD equations, J. Comput. Phys. 175(2) (2002) 645, http://dx.doi.org/10.1006/jcph.2001.6961.\n[55]C. Palenzuela, L. Lehner, O. Reula, L. Rezzolla, Beyond ideal MHD: towards a more realistic modelling of relativistic astrophysical plasmas, Mon. Not. R. Astron. Soc. Lett. 394 (2009) 1727, http://dx.doi.org/10.1111/j.1365-2966.2009.14454.x, arXiv:0810.1838.\n[56]A.J. Penner, General relativistic magnetohydrodynamic Bondi–Hoyle accretion, Mon. Not. R. Astron. Soc. Lett. 414 (2011) 1467, http://dx.doi.org/10.1111/j.1365-2966.2011.18480.x, arXiv:1011.2976.\n[57]P. Mösta, B.C. Mundim, J.A. Faber, R. Haas, S.C. Noble, T. Bode, F. Löffler, C.D. Ott, C. Reisswig, E. Schnetter, GRHydro: a new open-source general-relativistic magnetohydrodynamics code for the Einstein toolkit, Class. Quantum Gravity 31 (2014) 015005, http://dx.doi.org/10.1088/0264-9381/31/1/015005, arXiv:1304.5544.\n[58]W.I. Newman, N.D. Hamlin, Primitive variable determination in conservative relativistic magnetohydrodynamic simulations, SIAM J. Sci. Comput. 36(4) (2014) B661, http://dx.doi.org/10.1137/140956749.\n[59]D.A. Kopriva, Implementing Spectral Methods for Partial Differential Equations: Algorithms for Scientists and Engineers, Springer, Berlin, New York, 2009.\n[60]A.G. Kulikovskii, N.V. Pogorelov, A.Y. Semenov, Mathematical Aspects of Numerical Solution of Hyperbolic Systems, CRC Press, Boca Raton, 2000.\n[61]M. Alcubierre, Introduction to 3 +1Numerical Relativity, Oxford University Press, New York, 2008.\n[62]C.F. Gammie, J.C. McKinney, G. Tóth, HARM: a numerical scheme for general relativistic magnetohydrodynamics, Astrophys. J. 589 (2003) 444, http://dx.doi.org/10.1086/374594, arXiv:astro-ph/0301509.\n[63]L. Del Zanna, O. Zanotti, N. Bucciantini, P. Londrillo, ECHO: a Eulerian conservative high-order scheme for general relativistic magnetohydrodynamics and magnetodynamics, Astron. Astrophys. 473 (2007) 11, http://dx.doi.org/10.1051/0004-6361:20077093, arXiv:0704.3206.\n[64]A. Harten, P.D. Lax, B. van Leer, On upstream differencing and Godunov-type schemes for hyperbolic conservation laws, SIAM Rev. 25 (1983) 35, http://dx.doi.org/10.1137/1025002.\n[65]E.F. Toro, Riemann Solvers and Numerical Methods for Fluid Dynamics: A Practical Introduction, Springer, Berlin, New York, 2013.\n[66]S.F. Davis, Simplified second-order Godunov-type methods, SIAM J. Sci. Stat. Comput. 9 (1988) 445, http://dx.doi.org/10.1137/0909030.\n[67]P. Roe, Approximate Riemann solvers, parameter vectors, and difference schemes, J. Comput. Phys. 43 (1981) 357, http://dx.doi.org/10.1016/0021-9991(81)90128-5.\n[68]P.L. Roe, J. Pike, Efficient construction and utilisation of approximate Riemann solutions, in: Proc. of the Sixth Int’l Symposium on Computing Methods in Applied Sciences and Engineering, VI, North-Holland Publishing Co., Amsterdam, 1985, pp.499–518.\n[69]P. Glaister, An approximate linearised Riemann solver for the Euler equations for real gases, J. Comput. Phys. 74 (1988) 382, http://dx.doi.org/10.1016/0021-9991(88)90084-8.\n[70]F. Eulderink, G. Mellema, General relativistic hydrodynamics with a roe solver, preprint, arXiv:astro-ph/9411056.\n[71]R. Donat, A. Marquina, Capturing shock reflections: an improved flux formula, J. Comput. Phys. 125 (1996) 42, http://dx.doi.org/10.1006/jcph.1996.0078.\n[72]J.M. Ibáñez, M.A. Aloy, J.A. Font, J.M. Martí, J.A. Miralles, J.A. Pons, Riemann Solvers in General Relativistic Hydrodynamics, Springer US, Berlin, New York, 2001, pp.485–496, arXiv:astro-ph/9911034\n","[73]B. Punsly, D. Balsara, J. Kim, S. Garain, Riemann solvers and Alfvenwaves in black hole magnetospheres, Comput. Astrophys. Cosmol. 3(1) (2016) 5.\n[74]M. Dumbser, D.S. Balsara, A new efficient formulation of the HLLEM Riemannsolver for general conservative and non-conservative hyperbolic systems, J. Comput. Phys. 304 (2016) 275–319.\n[75]S.A. Moe, J.A. Rossmanith, D.C. Seal, A simple and effective high-order shock-capturing limiter for discontinuous Galerkin methods, e-prints arXiv:1507.03024.\n[76]J. Qiu, C.-W. Shu, A comparison of troubled-cell indicators for Runge–Kutta discontinuous Galerkin methods using weighted essentially nonoscillatory limiters, SIAM J. Sci. Comput. 27 (2005) 995, http://dx.doi.org/10.1137/04061372X.\n[77]B. Cockburn, Discontinuous Galerkin methods for convection-dominated problems, in: High-Order Methods for Computational Physics, Springer, Berlin, New York, 1999, pp.69–224.\n[78]B. Van Leer, Towards the ultimate conservative difference scheme, II: monotonicity and conservation combined in a second-order scheme, J. Comput. Phys. 14 (1974) 361, http://dx.doi.org/10.1016/0021-9991(74)90019-9.\n[79]B. Van Leer, Towards the ultimate conservative difference scheme, V: a second-order sequel to Godunov’s method, J. Comput. Phys. 32 (1979) 101, http://dx.doi.org/10.1016/0021-9991(79)90145-1.\n[80]S. Gottlieb, C.-W. Shu, Total variation diminishing Runge–Kutta schemes, Math. Comput. 67 (1998) 73, http://dx.doi.org/10.1090/S0025-5718-98-00913-2.\n[81]S. Gottlieb, C.-W. Shu, E. Tadmor, Strong stability-preserving high-order time discretization methods, SIAM Rev. 43 (2001) 89, http://dx.doi.org/10.1137/S003614450036757X.\n[82]H. Kaiser, M. Brodowicz, T. Sterling, ParalleX: an advanced parallel execution model for scaling-impaired applications, in: International Conference on Parallel Processing Workshops, Los Alamos, California, 2009, 2009, pp.394–401.\n[83]T. Sterling, D. Kogler, M. Anderson, M. Brodowicz, SLOWER: a performance model for Exascale computing, Supercomp. Front. Innov. 1 (2014) 42–57.\n[84]A. Gürsoy, L.V. Kalé, Performance and modularity benefits of message-driven execution, J. Parallel Distrib. Comput. 64 (2004) 461, http://dx.doi.org/10.1016/j.jpdc.2004.03.006.\n[85]G. Zheng, E. Meneses, A. Bhatele, L.V. Kalé, Hierarchical load balancing for Charm++ applications on large supercomputers, in: 39th International Conference on Parallel Processing Workshops, IEEE, 2010, p.436.\n[86]M. Bhandarkar, L.V. Kalé, E. de Sturler, J. Hoeflinger, Adaptive load balancing for MPI programs, in: International Conference on Computational Science, Proceedings, Part II, San Francisco, CA, USA, May 28—30, 2001, Springer, Berlin, New York, 2001, pp.108–117.\n[87]R. Alverson, D. Roweth, L. Kaplan, The Gemini system interconnect, in: 18th IEEE Symposium on High Performance Interconnects, 2010, pp.83–87.\n[88]Y. Sun, G. Zheng, L.V. Kalé, T.R. Jones, R. Olson, A uGNI-based asynchronous message-driven runtime system for cray supercomputers with Gemini interconnect, in: IEEE 26th International Parallel Distributed Processing Symposium, IPDPS, 2012, pp.751–762.\n[89]L.V. Kalé, G. Zheng, C.W. Lee, S. Kumar, Scaling applications to massively parallel machines using projections performance analysis tool, Future Gener. Comput. Syst. 22 (2006) 347, http://dx.doi.org/10.1016/j.future.2004.11.020.\n[90]M. Bugner, 2016, private communication.\n[91]C. Gheller, A High Resolution Hydrodynamical Code for the Study of Cosmological Structures, Ph.D. Thesis, SISSA, Trieste, Italy, 1997, http://hdl.handle.net/1963/5607.\n[92]F. Lora-Clavijo, J. Cruz-Perez, F.S. Guzmán, J. Gonzalez, Exact solution of the 1D Riemann problem in Newtonian and relativistic hydrodynamics, Rev. Mex. Fis. E 59 (2013) 28.\n[93]L. Rezzolla, O. Zanotti, An improved exact Riemann solver for relativistic hydrodynamics, J. Fluid Mech. 449 (2001) 395, http://dx.doi.org/10.1017/S0022112001006450, arXiv:gr-qc/0103005.\n[94]A. Lucas-Serrano, J.A. Font, J.M. Ibáñez, J.M. Martí, Assessment of a high-resolution central scheme for the solution of the relativistic hydrodynamics equations, Astron. Astrophys. 428 (2004) 703, http://dx.doi.org/10.1051/0004-6361:20035731, arXiv:astro-ph/0407541.\n[95]W. Zhang, A.I. MacFadyen RAM, A relativistic adaptive mesh refinement hydrodynamics code, Astrophys. J. Suppl. Ser. 164 (2006) 255, http://dx.doi.org/10.1086/500792, arXiv:astro-ph/0505481.\n[96]S.S. Komissarov, A Godunov-type scheme for relativistic magnetohydrodynamics, Mon. Not. R. Astron. Soc. 303 (1999) 343, http://dx.doi.org/10.1046/j.1365-8711.1999.02244.x.\n[97]D. Balsara, Total variation diminishing scheme for relativistic magnetohydrodynamics, Astrophys. J. Suppl. Ser. 132 (2001) 83–101, http://dx.doi.org/10.1086/318941.\n[98]H. Yee, N. Sandham, M. Djomehri, Low-dissipative high-order shock-capturing methods using characteristic-based filters, J. Comput. Phys. 150 (1999) 199, http://dx.doi.org/10.1006/jcph.1998.6177.\n[99]G.-S. Jiang, C.-W. Shu, Efficient implementation of weighted ENOschemes, J. Comput. Phys. 126(1) (1996) 202–228, http://dx.doi.org/10.1006/jcph.1996.0130.\n[100]Z. Xu, Y. Liu, C.-W. Shu, Hierarchical reconstruction for discontinuous Galerkin methods on unstructured grids with a WENO-type linear reconstruction and partial neighboring cells, J. Comput. Phys. 228 (2009) 2194, http://dx.doi.org/10.1016/j.jcp.2008.11.025.\n[101]S.A. Orszag, C.-M. Tang, Small-scale structure of two-dimensional magnetohydrodynamic turbulence, J. Fluid Mech. 90 (1979) 129, http://dx.doi.org/10.1017/S002211207900210X.\n[102]D. Ryu, T.W. Jones, A. Frank, Numerical magnetohydrodynamics in astrophysics: algorithm and tests for multidimensional flow, Astrophys. J. 452 (1995) 785, http://dx.doi.org/10.1086/176347, arXiv:astro-ph/9505073.\n[103]W. Dai, P.R. Woodward, On the divergence-free condition and conservation laws in numerical simulations for supersonic magnetohydrodynamical flows, Astrophys. J. 494 (1998) 317, http://dx.doi.org/10.1086/305176.\n[104]P. Londrillo, L. Del Zanna, High-order upwind schemes for multidimensional magnetohydrodynamics, Astrophys. J. 530 (2000) 508, http://dx.doi.org/10.1086/308344, arXiv:astro-ph/9910086.\n[105]K. Beckwith, J.M. Stone, A second-order Godunovmethod for multi-dimensional relativistic magnetohydrodynamics, Astrophys. J. Suppl. Ser. 193 (2011) 6, http://dx.doi.org/10.1088/0067-0049/193/1/6, arXiv:1101.3573.\n[106]F.C. Michel, Accretion of matter by condensed objects, Astrophys. Space Sci. 15 (1972) 153, http://dx.doi.org/10.1007/BF00649949.\n[107]F. Pretorius, Numerical relativity using a generalized harmonic decomposition, Class. Quantum Gravity 22 (2005) 425, http://dx.doi.org/10.1088/0264-9381/22/2/014, arXiv:gr-qc/0407110.\n[108]C. Gundlach, J.M. Martin-Garcia, G. Calabrese, I. Hinder, Constraint damping in the Z4 formulation and harmonic gauge, Class. Quantum Gravity 22 (2005) 3767, http://dx.doi.org/10.1088/0264-9381/22/17/025, arXiv:gr-qc/0504114.\n[109]L. Lindblom, M.A. Scheel, L.E. Kidder, R. Owen, O. Rinne, A new generalized harmonic evolution system, Class. Quantum Gravity 23 (2006) S447, http://dx.doi.org/10.1088/0264-9381/23/16/S09, arXiv:gr-qc/0512093v3.\n[110]R. Haas, C.D. Ott, B. Szilágyi, J.D. Kaplan, J. Lippuner, M.A. Scheel, K. Barkett, C.D. Muhlberger, T. Dietrich, M.D. Duez, F. Foucart, H.P. Pfeiffer, L.E. Kidder, S.A. Teukolsky, Simulations of inspiraling and merging double neutron stars using the spectral Einstein code, Phys. Rev. D 93(12) (2016) 124062, http://dx.doi.org/10.1103/PhysRevD.93.124062, arXiv:1604.00782.\n[111]A. Dubey, A. Almgren, J. Bell, M. Berzins, S. Brandt, G. Bryan, P. Colella, D. Graves, M. Lijewski, F. Löffler, B. O’Shea, E. Schnetter, B.V. Straalen, K. Weide, A survey of high level frameworks in block-structured adaptive mesh refinement packages, J. Parallel Distrib. Comput. 74 (2014) 3217, http://dx.doi.org/10.1016/j.jpdc.2014.07.001.\n[112]G. Gassner, D.A. Kopriva, A comparison of the dispersion and dissipation errors of Gauss and Gauss–Lobatto discontinuous Galerkin spectral element methods, SIAM J. Sci. Comput. 33 (2011) 2560, http://dx.doi.org/10.1137/100807211.\n[113]S.A. Teukolsky, Short note on the mass matrix for Gauss–Lobatto grid points, J. Comput. Phys. 283 (2015) 408, http://dx.doi.org/10.1016/j.jcp.2014.12.012, arXiv:1412.2276."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Lawrence E. Kidder, Scott E. Field, Francois Foucart, Erik Schnetter, Saul A. Teukolsky, Andy Bohn, Nils Deppe, Peter Diener, François Hébert, Jonas Lippuner, Jonah Miller, Christian D. Ott, Mark A. Scheel, Trevor Vincent, SpECTRE: A task-based discontinuous Galerkin code for relativistic astrophysics, Journal of Computational Physics, Volume 335, 15 April 2017, Pages 84-114, ISSN 0021-9991, https://doi.org/10.1016/j.jcp.2016.12.059.\n(http://www.sciencedirect.com/science/article/pii/S0021999117300098)","other_numbering_system":null,"funders":[{"agency":"NASA Einstein Fellowship","grant_number":"PF4-150122"},{"agency":"NASA","grant_number":"NAS8-03060"},{"agency":"NSF","grant_number":"AST-1333129 "},{"agency":"NSF","grant_number":"PHY-1306125"},{"agency":"Sherman Fairchild Foundation","grant_number":""},{"agency":"NSF","grant_number":"AST-1333520"},{"agency":"NSF","grant_number":"PHY-1151197"},{"agency":"NSF","grant_number":"PHY-1404569"},{"agency":"NSF","grant_number":"OCI-0905046"},{"agency":"Natural Sciences and Engineering Research Council of Canada (NSERC)","grant_number":""},{"agency":"Industry Canada ","grant_number":""},{"agency":"Ontario Ministry of Research and Innovation","grant_number":""},{"agency":"NSF","grant_number":"PRAC ACI-1440083"},{"agency":"NSF","grant_number":"TG-PHY100033"},{"agency":"NSF ","grant_number":"TG-PHY990007N "},{"agency":"NSF","grant_number":"PHY-0960291"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}