{"title":"A Data-Driven Assessment of Biosphere-Atmosphere Interaction Impact on Seasonal Cycle Patterns of XCO_2 Using GOSAT and MODIS Observations","uri":"","abstract":"Using measurements of the column-averaged CO_2 dry air mole fraction (XCO_2) from GOSAT and biosphere parameters, including normalized difference vegetation index (NDVI), enhanced vegetation index (EVI), leaf area index (LAI), gross primary production (GPP), and land surface temperature (LST) from MODIS, this study proposes a data-driven approach to assess the impacts of terrestrial biosphere activities on the seasonal cycle pattern of XCO_2. A unique global land mapping dataset of XCO_2 with a resolution of 1° by 1° in space, and three days in time, from June 2009 to May 2014, which facilitates the assessment at a fine scale, is first produced from GOSAT XCO_2 retrievals. We then conduct a statistical fitting method to obtain the global map of seasonal cycle amplitudes (SCA) of XCO_2 and NDVI, and implement correlation analyses of seasonal variation between XCO_2 and the vegetation parameters. As a result, the spatial distribution of XCO_2 SCA decreases globally with latitude from north to south, which is in good agreement with that of simulated XCO_2 from CarbonTracker. The spatial pattern of XCO_2 SCA corresponds well to the vegetation seasonal activity revealed by NDVI, with a strong correlation coefficient of 0.74 in the northern hemisphere (NH). Some hotspots in the subtropical areas, including Northern India (with SCA of 8.68 ± 0.49 ppm on average) and Central Africa (with SCA of 8.33 ± 0.25 ppm on average), shown by satellite measurements, but missed by model simulations, demonstrate the advantage of satellites in observing the biosphere–atmosphere interactions at local scales. Results from correlation analyses between XCO_2 and NDVI, EVI, LAI, or GPP show a consistent spatial distribution, and NDVI and EVI have stronger negative correlations over all latitudes. This may suggest that NDVI and EVI can be better vegetation parameters in characterizing the seasonal variations of XCO_2 and its driving terrestrial biosphere activities. We, furthermore, present the global distribution of phase lags of XCO_2 compared to NDVI in seasonal variation, which, to our knowledge, is the first such map derived from a completely data-driven approach using satellite observations. The impact of retrieval error of GOSAT data on the mapping data, especially over high-latitude areas, is further discussed. Results from this study provide reference for better understanding the distribution of the strength of carbon sink by terrestrial ecosystems and utilizing remote sensing data in assessing the impact of biosphere–atmosphere interactions on the seasonal cycle pattern of atmospheric CO_2 columns.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251437","docid":251437,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250620","fileid":1250620,"datasetid":"document","objectid":251437,"filename":"remotesensing-09-00251-v2.pdf","mime_type":"application/pdf","hash":"0c120fc987800b21c5f3ffd6257e4b9b","hash_type":"MD5","filesize":6865657,"mtime":"2017-04-28 15:24:56","url":"http://authors.library.caltech.edu/77043/1/remotesensing-09-00251-v2.pdf"}],"eprintid":77043,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"remotesensing-09-00251-v2.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251439","docid":251439,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250631","fileid":1250631,"datasetid":"document","objectid":251439,"filename":"remotesensing-09-00251-s001.pdf","mime_type":"application/pdf","hash":"65733d5f82a47b8a0c53255e54865db9","hash_type":"MD5","filesize":1215883,"mtime":"2017-04-28 15:30:16","url":"http://authors.library.caltech.edu/77043/2/remotesensing-09-00251-s001.pdf"}],"eprintid":77043,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"remotesensing-09-00251-s001.pdf","content":"supplemental"}],"note":"© 2017 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (http://creativecommons.org/licenses/by/4.0/). \n\nReceived: 20 October 2016; Accepted: 6 March 2017; Published: 8 March 2017. \n\nThis research was supported by the National Research Program on Global Changes and Adaptation: “Big data on global changes: data sharing platform and recognition” (Grant No. 2016YFA0600303, Grant No. 2016YFA0600304). We acknowledge The ACOS-GOSAT v3.5 data were produced by the ACOS/OCO-2 project at the Jet Propulsion Laboratory, California Institute of Technology, and obtained from the ACOS/OCO-2 data archive maintained at the NASA Goddard Earth Science Data and Information Services Center. We also acknowledge the GOSAT Project for acquiring the spectra. CarbonTracker CT2015 results are provided by NOAA ESRL, Boulder, Colorado, USA from the website at http://carbontracker.noaa.gov. Terra MODIS GPP/NPP Product MOD17A2 was downloaded from the University of Montana and Aqua or Terra MODIS NDVI/EVI, LAI products (MYD13C2, MOD11C3) were download from USGS websites (http://e4ftl01.cr.usgs.gov). Land cover products were downloaded from ESA (http://www.esa-ghg-cci.org/). And TCCON data were obtained from the TCCON Data Archive website at http://tccon.ornl.gov/. Bottom-up estimation of fossil fuel emissions (FFCO2) is obtained from ODIAC (Open-source Data Inventory for Anthropogenic CO2: http://www.odiac.org/index.html) and CDIAC (Carbon Dioxide information Analysis Center: http://cdiac.ornl.gov/). \n\nAuthor Contributions: L.L., Z.H., and Z.-C.Z. conceived and designed the experiments; Z.H. performed the experiments; Z.-C.Z. analyzed the data; N.B., S.Y., and Z.-C.Z. contributed analysis tools; Z.H., L.L., and Z.-C.Z. wrote the paper. \n\nThe authors declare no conflict of interest.","id":77043,"rev_number":11,"userid":18,"eprint_dir":"disk0/00/07/70/43","datestamp":"2017-04-28 16:10:40","lastmod":"2017-04-28 16:10:40","status_changed":"2017-04-28 16:10:40","type":"article","metadata_visibility":"show","creators":[{"given":"Zhonghua","family":"He","id":"He-Zhonghua","orcid":""},{"given":"Zhao-Cheng","family":"Zeng","id":"Zeng-Zhao-Cheng","orcid":""},{"given":"Liping","family":"Lei","id":"Lei-Liping","orcid":""},{"given":"Nian","family":"Bie","id":"Bie-Nian","orcid":""},{"given":"Shaoyuan","family":"Yang","id":"Yang-Shaoyuan","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"GOSAT; MODIS; XCO2; seasonal cycle pattern; biosphere absorption","date":"2017-03-08","date_type":"published","publication":"Remote Sensing","volume":"9","number":"3","pagerange":"Art. No. 251","id_number":"CaltechAUTHORS:20170428-082449561","refereed":true,"issn":"2072-4292","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-082449561","related_url":[{"url":"http://dx.doi.org/10.3390/rs9030251","type":"doi","description":"Article"},{"url":"http://www.mdpi.com/2072-4292/9/3/251","type":"pub","description":"Article"},{"url":"http://www.mdpi.com/2072-4292/9/3/251/s1","type":"pub","description":"Supplementary Material"}],"referencetext":["1.Pan, Y.; Birdsey, R.A.; Fang, J.; Houghton, R.; Kauppi, P.E.; Kurz, W.A.; Phillips, O.L.; Shvidenko, A.; Lewis, S.L.; Canadell, J.G.; et al. A large and persistent carbon sink in the world’s forests. Science 2011, 333, 988–993. [Google Scholar] [CrossRef] [PubMed]\n2.Quéré, C.L.; Andres, R.J.; Boden, T.; Conway, T.; Houghton, R.; House, J.I.; Marland, G.; Peters, G.P.; Van der Werf, G.; Ahlström, A. The global carbon budget 1959–2011. Earth Syst. Sci. Data 2013, 5, 165–185. [Google Scholar] [CrossRef]\n3.Stocker, T.; Qin, D.; Plattner, G.; Tignor, M.; Allen, S.; Boschung, J.; Nauels, A.; Xia, Y.; Bex, B.; Midgley, B. Contribution of working group I to the fifth assessment report of the intergovernmental panel on climate change. In Climate Change 2013: The Physical Science Basis; Cambridge University Press: Cambridge, UK, 2013. [Google Scholar]\n4.Doney, S.C.; Lima, I.; Feely, R.A.; Glover, D.M.; Lindsay, K.; Mahowald, N.; Moore, J.K.; Wanninkhof, R. Mechanisms governing interannual variability in upper-ocean inorganic carbon system and air–sea CO2 fluxes: Physical climate and atmospheric dust. Deep Sea Res. Part II Top. Stud. Oceanogr. 2009, 56, 640–655. [Google Scholar] [CrossRef]\n5.Zeng, N.; Zhao, F.; Collatz, G.J.; Kalnay, E.; Salawitch, R.J.; West, T.O.; Guanter, L. Agricultural green revolution as a driver of increasing atmospheric CO2 seasonal amplitude. Nature 2014, 515, 394–397. [Google Scholar] [CrossRef] [PubMed]\n6.Keeling, R.F.; Piper, S.C.; Heimann, M. Global and hemispheric CO2 sinks deduced from changes in atmospheric concentration. Nature 1996, 381, 218–221. [Google Scholar] [CrossRef]\n7.Buermann, W.; Lintner, B.R.; Koven, C.D.; Angert, A.; Pinzon, J.E.; Tucker, C.J.; Fung, I.Y. The changing carbon cycle at Mauna Loa Observatory. Proc. Natl. Acad. Sci. USA 2007, 104, 4249–4254. [Google Scholar] [CrossRef] [PubMed]\n8.Forkel, M.; Carvalhais, N.; Rodenbeck, C.; Keeling, R.; Heimann, M.; Thonicke, K.; Zaehle, S.; Reichstein, M. Enhanced seasonal CO2 exchange caused by amplified plant productivity in northern ecosystems. Science 2016, 351, 696–699. [Google Scholar] [CrossRef] [PubMed]\n9.Graven, H.D.; Keeling, R.F.; Piper, S.C.; Patra, P.K.; Stephens, B.B.; Wofsy, S.C.; Welp, L.R.; Sweeney, C.; Tans, P.P.; Kelley, J.J. Enhanced seasonal exchange of CO2 by northern ecosystems since 1960. Science 2013, 341, 1085–1089. [Google Scholar] [CrossRef] [PubMed]\n10.Randerson, J.T.; Thompson, M.V.; Conway, T.J.; Fung, I.Y.; Field, C.B. The contribution of terrestrial sources and sinks to trends in the seasonal cycle of atmospheric carbon dioxide. Glob. Biogeochem. Cycles 1997, 11, 535–560. [Google Scholar] [CrossRef]\n11.Schneising, O.; Reuter, M.; Buchwitz, M.; Heymann, J.; Bovensmann, H.; Burrows, J.P. Terrestrial carbon sink observed from space: Variation of growth rates and seasonal cycle amplitudes in response to interannual surface temperature variability. Atmos. Chem. Phys. 2014, 14, 133–141. [Google Scholar] [CrossRef]\n12.Welp, L.R.; Patra, P.K.; Rödenbeck, C.; Nemani, R.; Bi, J.; Piper, S.C.; Keeling, R.F. Increasing summer net CO2 uptake in high northern ecosystems inferred from atmospheric inversions and comparisons to remote-sensing NDVI. Atmos. Chem. Phys. 2016, 16, 9047–9066. [Google Scholar] [CrossRef]\n13.Wunch, D.; Wennberg, P.O.; Messerschmidt, J.; Parazoo, N.C.; Toon, G.C.; Deutscher, N.M.; Aleks, G.K.; Roehl, C.M.; Randerson, J.T.; Warneke, T.; et al. The covariation of northern hemisphere summertime CO2 with surface temperature in boreal regions. Atmos. Chem. Phys. 2013, 13, 9447–9459. [Google Scholar] [CrossRef]\n14.Lindqvist, H.; O’Dell, C.W.; Basu, S.; Boesch, H.; Chevallier, F.; Deutscher, N.; Feng, L.; Fisher, B.; Hase, F.; Inoue, M.; et al. Does gosat capture the true seasonal cycle of carbon dioxide? Atmos. Chem. Phys. 2015, 15, 13023–13040. [Google Scholar] [CrossRef]\n15.Kulawik, S.; Wunch, D.; O'Dell, C.; Frankenberg, C.; Reuter, M.; Oda, T.; Chevallier, F.; Sherlock, V.; Buchwitz, M.; Osterman, G.; et al. Consistent evaluation of ACOS-GOSAT, BESD-SCIAMACHY, CarbonTracker, and MACC through comparisons to TCCON. Atmos. Meas. Tech. 2016, 9, 683–709. [Google Scholar] [CrossRef]\n16.Aleks, G.K.; Wennberg, P.O.; Washenfelder, R.A.; Wunch, D.; Schneider, T.; Toon, G.C.; Andres, R.J.; Blavier, J.F.; Connor, B.; Davis, K.J.; et al. The imprint of surface fluxes and transport on variations in total column carbon dioxide. Biogeosciences 2012, 9, 875–891. [Google Scholar] [CrossRef]\n17.Ciais, P.; Dolman, A.J.; Bombelli, A.; Duren, R.; Peregon, A.; Rayner, P.J.; Miller, C.; Gobron, N.; Kinderman, G.; Marland, G.; et al. Current systematic carbon-cycle observations and the need for implementing a policy-relevant carbon observing system. Biogeosciences 2014, 11, 3547–3602. [Google Scholar] [CrossRef]\n18.Schimel, D.; Pavlick, R.; Fisher, J.B.; Asner, G.P.; Saatchi, S.; Townsend, P.; Miller, C.; Frankenberg, C.; Hibbard, K.; Cox, P. Observing terrestrial ecosystems and the carbon cycle from space. Glob. Chang. Biol. 2015, 21, 1762–1776. [Google Scholar] [CrossRef] [PubMed]\n19.Zeng, Z.; Lei, L.; Hou, S.; Ru, F.; Guan, X.; Zhang, B. A regional gap-filling method based on spatiotemporal variogram model of columns. IEEE Trans. Geosci. Remote Sens. 2014, 52, 3594–3603. [Google Scholar] [CrossRef]\n20.Zeng, Z.C.; Lei, L.; Strong, K.; Jones, D.B.A.; Guo, L.; Liu, M.; Deng, F.; Deutscher, N.M.; Dubey, M.K.; Griffith, D.W.T.; et al. Global land mapping of satellite-observed CO2 total columns using spatio-temporal geostatistics. Int. J. Digit. Earth 2017, 10. [Google Scholar] [CrossRef]\n21.Chen, B.; Xu, G.; Coops, N.C.; Ciais, P.; Innes, J.L.; Wang, G.; Myneni, R.B.; Wang, T.; Krzyzanowski, J.; Li, Q.; et al. Changes in vegetation photosynthetic activity trends across the Asia-Pacific region over the last three decades. Remote Sens. Environ. 2014, 144, 28–41. [Google Scholar] [CrossRef]\n22.Inoue, Y.; Peñuelas, J.; Miyata, A.; Mano, M. Normalized difference spectral indices for estimating photosynthetic efficiency and capacity at a canopy scale derived from hyperspectral and CO2 flux measurements in rice. Remote Sens. Environ. 2008, 112, 156–172. [Google Scholar] [CrossRef]\n23.Vetter, P.; Schmid, W.; Schwarze, R. Spatio-temporal statistical analysis of the carbon budget of the terrestrial ecosystem. Stat. Methods Appl. 2016, 25, 1–19. [Google Scholar] [CrossRef]\n24.Huang, N.; Gu, L.; Black, T.A.; Wang, L.; Niu, Z. Remote sensing-based estimation of annual soil respiration at two contrasting forest sites. J. Geophys. Res. Biogeosci. 2015, 120, 2306–2325. [Google Scholar] [CrossRef]\n25.ESA. Available online: http://www.esa-landcover-cci.org/ (accessed on 15 October 2016).\n26.O’Dell, C.W.; Connor, B.; Bösch, H.; O’Brien, D.; Frankenberg, C.; Castano, R.; Christi, M.; Eldering, D.; Fisher, B.; Gunson, M.; et al. The ACOS CO2 retrieval algorithm—Part 1: Description and validation against synthetic observations. Atmos. Meas. Tech. 2012, 5, 99–121. [Google Scholar] [CrossRef]\n27.Peters, W.; Jacobson, A.R.; Sweeney, C.; Andrews, A.E.; Conway, T.J.; Masarie, K.; Miller, J.B.; Bruhwiler, L.M.; Petron, G.; Hirsch, A.I.; et al. An atmospheric perspective on North American carbon dioxide exchange: CarbonTracker. Proc. Natl. Acad. Sci. USA 2007, 104, 18925–18930. [Google Scholar] [CrossRef] [PubMed]\n28.Huete, A.; Didan, K.; van Leeuwen, W.; Miura, T.; Glenn, E. MODIS vegetation indices. In Land Remote Sensing and Global Environmental Change; Springer: Berlin/Heidelberg, Germany, 2011; pp. 579–602. [Google Scholar]\n29.Heinsch, F.A.; Reeves, M.; Votava, P.; Kang, S.; Milesi, C.; Zhao, M.; Glassy, J.; Jolly, W.M.; Loehman, R.; Bowker, C.F. GPP and NPP (MOD17A2/A3) products NASA MODIS land algorithm. In MOD17 User’s Guide; MODIS Land Team: Washington, DC, USA, 2003; pp. 1–57. [Google Scholar]\n30.Yang, W.; Tan, B.; Huang, D.; Rautiainen, M.; Shabanov, N.V.; Wang, Y.; Privette, J.L.; Huemmrich, K.F.; Fensholt, R.; Sandholt, I. MODIS leaf area index products: From validation to algorithm improvement. IEEE Trans. Geosci. Remote Sens. 2006, 44, 1885–1898. [Google Scholar] [CrossRef]\n31.Wan, Z. Collection-5 MODIS Land Surface Temperature Products Users’ Guide; ICESS, University of California: Santa Barbara, CA, USA, 2007. [Google Scholar]\n32.National Aeronautics and Space Administration (NASA). Available online: http://CO2web.jpl.nasa.gov (accessed on 15 October 2016).\n33.Doughty, C.E.; Goulden, M.L. Are tropical forests near a high temperature threshold? J. Geophys. Res. Biogeosci. 2008, 113, 1–12. [Google Scholar] [CrossRef]\n34.Cox, P.M.; Pearson, D.; Booth, B.B.; Friedlingstein, P.; Huntingford, C.; Jones, C.D.; Luke, C.M. Sensitivity of tropical carbon to climate change constrained by carbon dioxide variability. Nature 2013, 494, 341–344. [Google Scholar] [CrossRef] [PubMed]\n35.Wunch, D.; Wennberg, P.O.; Toon, G.C.; Connor, B.J.; Fisher, B.; Osterman, G.B.; Frankenberg, C.; Mandrake, L.; O’Dell, C.; Ahonen, P.; et al. A method for evaluating bias in global measurements of CO2 total columns from space. Atmos. Chem. Phys. 2011, 11, 12317–12337. [Google Scholar] [CrossRef]\n36.Wunch, D.; Toon, G.C.; Blavier, J.F.; Washenfelder, R.A.; Notholt, J.; Connor, B.J.; Griffith, D.W.; Sherlock, V.; Wennberg, P.O. The total carbon column observing network. Philos. Trans. Ser. A Math. Phys. Eng. Sci. 2011, 369, 2087–2112. [Google Scholar] [CrossRef] [PubMed]\n37.Washenfelder, R.A.; Toon, G.C.; Blavier, J.F.; Yang, Z.; Allen, N.T.; Wennberg, P.O.; Vay, S.A.; Matross, D.M.; Daube, B.C. Carbon dioxide column abundances at the Wisconsin tall tower site. J. Geophys. Res. 2006, 111. [Google Scholar] [CrossRef]\n38.Wennberg, P.O.; Roehl, C.; Wunch, D.; Toon, G.C.; Blavier, J.F.; Washenfelder, R.; Aleks, G.K.; Allen, N.; Ayers, J. TCCON Data from Park Falls, Wisconsin, USA, Release GGG2014R0; Carbon Dioxide Information Analysis Center: Oak Ridge, TN, USA, 2014.\n39.Warneke, T.; Messerschmidt, J.; Notholt, J.; Weinzierl, C.; Deutscher, N.; Petri, C.; Grupe, P.; Vuillemin, C.; Truong, F.; Schmidt, M.; et al. TCCON Data from Orleans, France, Release GGG2014R0; Carbon Dioxide Information Analysis Center: Oak Ridge, TN, USA, 2014.\n40.Sussmann, R.; Rettinger, M. TCCON Data from Garmisch, Germany, Release GGG2014R0; Carbon Dioxide Information Analysis Center: Oak Ridge, TN, USA, 2014.\n41.Hase, F.; Blumenstock, T.; Dohe, S.; Gross, J.; Kiel, M. TCCON Data from Karlsruhe, Germany, Release GGG2014R1; Carbon Dioxide Information Analysis Center: Oak Ridge, TN, USA, 2014.\n42.Notholt, J.; Petri, C.; Warneke, T.; Deutscher, N.; Buschmann, M.; Weinzierl, C.; Macatangay, R.; Grupe, P. TCCON Data from Bremen, Germany, Release GGG2014R0; Carbon Dioxide Information Analysis Center: Oak Ridge, TN, USA, 2014.\n43.Messerschmidt, J.; Chen, H.; Deutscher, N.M.; Gerbig, C.; Grupe, P.; Katrynski, K.; Koch, F.T.; Lavrič, J.V.; Notholt, J.; Rödenbeck, C.; et al. Automated ground-based remote sensing measurements of greenhouse gases at the Białystok site in comparison with collocated in situ measurements and model data. Atmos. Chem. Phys. 2012, 12, 6741–6755. [Google Scholar] [CrossRef]\n44.Deutscher, N.; Notholt, J.; Messerschmidt, J.; Weinzierl, C.; Warneke, T.; Petri, C.; Grupe, P.; Katrynski, K. TCCON Data from Bialystok, Poland, Release GGG2014R1; Carbon Dioxide Information Analysis Center: Oak Ridge, TN, USA, 2014.\n45.Ohyama, H.; Morino, I.; Nagahama, T.; Machida, T.; Suto, H.; Oguma, H.; Sawa, Y.; Matsueda, H.; Sugimoto, N.; Nakane, H.; et al. Column-averaged volume mixing ratio of CO2 measured with ground-based fourier transform spectrometer at Tsukuba. J. Geophys. Res. 2009, 114. [Google Scholar] [CrossRef]\n46.Morino, I.; Matsuzaki, T.; Shishime, A. TCCON Data from Tsukuba, Ibaraki, Japan, 125hr, Release GGG2014R1; Carbon Dioxide Information Analysis Center: Oak Ridge, TN, USA, 2014.\n47.Wennberg, P.O.; Wunch, D.; Roehl, C.; Blavier, J.F.; Toon, G.C.; Allen, N.; Dowell, P.; Teske, K.; Martin, C.; Martin, J. TCCON Data from Lamont, Oklahoma, USA, Release GGG2014R0; Carbon Dioxide Information Analysis Center: Oak Ridge, TN, USA, 2014.\n48.Wennberg, P.O.; Roehl, C.; Blavier, J.F.; Wunch, D.; Landeros, J.; Allen, N. TCCON Data from Jet Propulsion Laboratory, Pasadena, California, USA, Release GGG2014R0; Carbon Dioxide Information Analysis Center: Oak Ridge, TN, USA, 2014.\n49.Kawakami, S.; Ohyama, H.; Arai, K.; Okumura, H.; Taura, C.; Fukamachi, T.; Sakashita, M. TCCON Data from Saga, Japan, Release GGG2014R0; Carbon Dioxide Information Analysis Center: Oak Ridge, TN, USA, 2014.\n50.Griffith, D.W.T.; Deutscher, N.; Velazco, V.A.; Wennberg, P.O.; Yavin, Y.; Aleks, G.K.; Washenfelder, R.; Toon, G.C.; Blavier, J.F.; Murphy, C.; et al. TCCON Data from Darwin, Australia, Release GGG2014R0; Carbon Dioxide Information Analysis Center: Oak Ridge, TN, USA, 2014.\n51.Griffith, D.W.T.; Velazco, V.A.; Deutscher, N.; Murphy, C.; Jones, N.; Wilson, S.; Macatangay, R.; Kettlewell, G.; Buchholz, R.R.; Riggenbach, M. TCCON Data from Wollongong, Australia, Release GGG2014R0; Carbon Dioxide Information Analysis Center: Oak Ridge, TN, USA, 2014.\n52.Connor, B.J.; Boesch, H.; Toon, G.; Sen, B.; Miller, C.; Crisp, D. Orbiting carbon observatory: Inverse method and prospective error analysis. J. Geophys. Res. Atmos. 2008, 113, 1–14. [Google Scholar] [CrossRef]\n53.Cogan, A.J.; Boesch, H.; Parker, R.J.; Feng, L.; Palmer, P.I.; Blavier, J.F.L.; Deutscher, N.M.; Macatangay, R.; Notholt, J.; Roehl, C.; et al. Atmospheric carbon dioxide retrieved from the greenhouse gases observing satellite (GOSAT): Comparison with ground-based TCCON observations and GEOS-Chem model calculations. J. Geophys. Res. Atmos. 2012, 117, 1–17. [Google Scholar] [CrossRef]\n54.Keeling, C.D.; Bacastow, R.B.; Bainbridge, A.E.; Ekdahl, C.A.; Guenther, P.R.; Waterman, L.S.; Chin, J.F.S. Atmospheric carbon dioxide variations at Mauna Loa Observatory, Hawaii. Tellus 1976, 28, 538–551. [Google Scholar]\n55.Thoning, K.W.; Tans, P.P.; Komhyr, W.D. Atmospheric carbon dioxide at Mauna Loa Observatory: 2. Analysis of the NOAA GMCC data, 1974–1985. J. Geophys. Res. Atmos. 1989, 94, 8549–8565. [Google Scholar] [CrossRef]\n56.Jiang, X.; Chahine, M.T.; Li, Q.; Liang, M.; Olsen, E.T.; Chen, L.L.; Wang, J.; Yung, Y.L. CO2 semiannual oscillation in the middle troposphere and at the surface. Glob. Biogeochem. Cycles 2012, 26. [Google Scholar] [CrossRef]\n57.Schneising, O.; Buchwitz, M.; Reuter, M.; Heymann, J.; Bovensmann, H.; Burrows, J.P. Long-term analysis of carbon dioxide and methane column-averaged mole fractions retrieved from SCIAMACHY. Atmos. Chem. Phys. 2011, 11, 2863–2880. [Google Scholar] [CrossRef]\n58.Aleks, G.K.; Wennberg, P.O.; Schneider, T. Sources of variations in total column carbon dioxide. Atmos. Chem. Phys. 2011, 11, 3581–3593. [Google Scholar] [CrossRef]\n59.Gitelson, A.A.; Peng, Y.; Arkebauer, T.J.; Schepers, J. Relationships between gross primary production, green LAI, and canopy chlorophyll content in maize: Implications for remote sensing of primary production. Remote Sens. Environ. 2014, 144, 65–72. [Google Scholar] [CrossRef]\n60.Lausch, A.; Pause, M.; Schmidt, A.; Salbach, C.; Gwillymmargianto, S.; Merbach, I. Temporal hyperspectral monitoring of chlorophyll, LAI, and water content of barley during a growing season. Can. J. Remote Sens. 2013, 39, 191–207. [Google Scholar] [CrossRef]\n61.Huete, A.; Didan, K.; Miura, T.; Rodriguez, E.P.; Gao, X.; Ferreira, L.G. Overview of the radiometric and biophysical performance of the MODIS vegetation indices. Remote Sens. Environ. 2002, 83, 195–213. [Google Scholar] [CrossRef]\n62.Olsen, S.C.; Randerson, J.T. Differences between surface and column atmospheric CO2 and implications for carbon cycle research. J. Geophys. Res. 2004, 109. [Google Scholar] [CrossRef]\n63.Rayner, P.J.; Law, R.M. A Comparison of Modelled Responses to Prescribed CO2 Sources. In CSIRO Division of Atmospheric Research Technical Paper; CSIRO: Canberra, Australia, 1995. [Google Scholar]\n64.Huang, J.; McElroy, M.B. Contributions of the hadley and ferrel circulations to the energetics of the atmosphere over the past 32 years. J. Clim. 2014, 27, 2656–2666. [Google Scholar] [CrossRef]\n65.Aleks, G.K.; Wennberg, P.O.; O’Dell, C.W.; Wunch, D. Towards constraints on fossil fuel emissions from total column carbon dioxide. Atmos. Chem. Phys. 2013, 13, 4349–4357. [Google Scholar] [CrossRef]\n66.Liu, M.; Lei, L.; Liu, D.; Zeng, Z.C. Geostatistical analysis of CH4 columns over monsoon Asia using five years of GOSAT observations. Remote Sens. 2016, 8. [Google Scholar] [CrossRef]\n67.Nguyen, H.; Osterman, G.; Wunch, D.; O’Dell, C.; Mandrake, L.; Wennberg, P.; Fisher, B.; Castano, R. A method for colocating satellite XCO2 data to ground-based data and its application to ACOS-GOSAT and TCCON. Atmos. Meas. Tech. 2014, 7, 2631–2644. [Google Scholar] [CrossRef]\n68.Chevallier, F. On the statistical optimality of CO2 atmospheric inversions assimilating CO2 column retrievals. Atmos. Chem. Phys. 2015, 15, 11133–11145. [Google Scholar] [CrossRef]\n69.Heymann, J.; Schneising, O.; Reuter, M.; Buchwitz, M.; Rozanov, V.V.; Velazco, V.A.; Bovensmann, H.; Burrows, J.P. SCIAMACHY WFM-DOAS XCO2: Comparison with CarbonTracker XCO2 focusing on aerosols and thin clouds. Atmos. Meas. Tech. 2012, 5, 2887–2931. [Google Scholar] [CrossRef]\n70.Chandra, N.; Lal, S.; Venkataramani, S.; Patra, P.K.; Sheel, V. Temporal variations of atmospheric CO2 and CO at Ahmedabad in western India. Atmos. Chem. Phys. 2016, 16, 6153–6173. [Google Scholar] [CrossRef]\n71.Hammerling, D.M.; Michalak, A.M.; O’Dell, C.; Kawa, S.R. Global CO2 distributions over land from the greenhouse gases observing satellite (GOSAT). Geophys. Res. Lett. 2012, 39, 1–6. [Google Scholar] [CrossRef]\n72.Raich, J.W.; Potter, C. Global patterns of carbon dioxide emission from soils. Glob. Biogeochem. Cycles 1995, 9, 23–36. [Google Scholar] [CrossRef]\n73.Raich, J.W.; Potter, C.; Bhagawati, D. Interannual variability in global soil respiration, 1980–94. Glob. Chang. Biol. 2002, 8, 800–812. [Google Scholar] [CrossRef]\n74.Huang, N.; Gu, L.; Niu, Z. Estimating soil respiration using spatial data products: A case study in a deciduous broadleaf forest in the Midwest USA. J. Geophys. Res. Atmos. 2014, 119, 6393–6408. [Google Scholar] [CrossRef]\n75.Sreenivas, G.; Mahesh, P.; Subin, J.; Kanchana, A.L.; Rao, P.V.N.; Dadhwal, V.K. Influence of meteorology and interrelationship with greenhouse gases (CO2 and CH4) at a suburban site of India. Atmos. Chem. Phys. 2016, 16, 3953–3967. [Google Scholar] [CrossRef]\n76.Oda, T.; Maksyutov, S. A very high-resolution (1 km×1 km) global fossil fuel CO2 emission inventory derived using a point source database and satellite observations of nighttime lights. Atmos. Chem. Phys. 2011, 11, 543–556. [Google Scholar] [CrossRef]\n77.Andres, R.J.; Gregg, J.S.; Losey, L.; Marland, G.; Boden, T.A. Monthly, global emissions of carbon dioxide from fossil fuel consumption. Tellus B 2011, 63, 309–327. [Google Scholar] [CrossRef]\n78.Frank, A.B.; Karn, J.F. Vegetation indices, CO2 flux, and biomass for northern plains grasslands. J. Range Manag. 2003, 56, 382–387. [Google Scholar] [CrossRef]\n79.Aalto, T.; Ciais, P.; Chevillard, A.; Moulin, C. Optimal determination of the parameters controlling biospheric CO2 fluxes over Europe using eddy covariance fluxes and satellite NDVI measurements. Tellus B 2004, 56, 93–104. [Google Scholar] [CrossRef]\n80.Liu, Y.; Yang, D.; Cai, Z. A retrieval algorithm for Tansat XCO2 observation: Retrieval experiments using GOSAT data. Chin. Sci. Bull. 2013, 58, 1520–1523. [Google Scholar] [CrossRef]\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"He, Z.; Zeng, Z.-C.; Lei, L.; Bie, N.; Yang, S. A Data-Driven Assessment of Biosphere-Atmosphere Interaction Impact on Seasonal Cycle Patterns of XCO2 Using GOSAT and MODIS Observations. Remote Sens. 2017, 9, 251","other_numbering_system":null,"funders":[{"agency":"National Research Program on Global Changes and Adaptation","grant_number":"2016YFA0600303"},{"agency":"National Research Program on Global Changes and Adaptation","grant_number":"2016YFA0600304"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}