{"title":"The age of 47 Tuc from self-consistent isochrone fits to colour–magnitude diagrams and the eclipsing member V69","uri":"","abstract":"Our aim is to derive a self-consistent age, distance and composition for the globular cluster 47 Tucanae (47 Tuc; NGC104). First, we re-evaluate the reddening towards the cluster resulting in a nominal E(B − V) = 0.03 ± 0.01 as the best estimate. The Teff of the components of the eclipsing binary member V69 is found to be 5900 ± 72 K from both photometric and spectroscopic evidence. This yields a true distance modulus (m − M)0 = 13.21 ± 0.06(random) ±0.03(systematic) to 47 Tuc when combined with existing measurements of V69 radii and luminosity ratio. We then present a new completely self-consistent isochrone fitting method to ground-based and Hubble Space Telescope cluster colour–magnitude diagrams and the eclipsing binary member V69. The analysis suggests that the composition of V69, and by extension one of the populations of 47 Tuc, is given by [Fe/H] ∼ −0.70, [O/Fe] ∼ +0.60 and Y ∼ 0.250 on the solar abundance scale of Asplund, Grevesse \u0026 Sauval. However, this depends on the accuracy of the model Teff scale that is 50–75 K cooler than our best estimate but within measurement uncertainties. Our best estimate of the age of 47 Tuc is 11.8 Gyr, with firm (3σ) lower and upper limits of 10.4 and 13.4 Gyr, respectively, in satisfactory agreement with the age derived from the white dwarf cooling sequence if our determination of the distance modulus is adopted.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251478","docid":251478,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250966","fileid":1250966,"datasetid":"document","objectid":251478,"filename":"stx378.pdf","mime_type":"application/pdf","hash":"40d24145db031d25fe8ddb07357d8386","hash_type":"MD5","filesize":1884779,"mtime":"2017-04-28 20:01:07","url":"http://authors.library.caltech.edu/77059/1/stx378.pdf"}],"eprintid":77059,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"stx378.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251479","docid":251479,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250986","fileid":1250986,"datasetid":"document","objectid":251479,"filename":"1702.03421.pdf","mime_type":"application/pdf","hash":"2107a27970d9834d55016ed76357b58a","hash_type":"MD5","filesize":3717552,"mtime":"2017-04-28 20:01:44","url":"http://authors.library.caltech.edu/77059/2/1702.03421.pdf"}],"eprintid":77059,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1702.03421.pdf","content":"submitted"}],"note":"© 2017 The Authors Published by Oxford University Press on behalf of the Royal Astronomical Society. \n\nReceived 14 November 2016; revision received 07 February 2017; accepted 09 February 2017; published 14 February 2017. \n\nWe wish to thank Luca Casagrande for useful discussions on interstellar reddening. We thank P. Stetson, J. Kaluzny and E. Garcia-Berro for quick and useful responses to inquiries related to this work. \n\nFunding for the Stellar Astrophysics Centre is provided by The Danish National Research Foundation (grant DNRF106). The research was supported by the ASTERISK project (ASTERoseismic Investigations with SONG and Kepler) funded by the European Research Council (grant agreement no.: 267864). KB acknowledges support from the Villum Foundation and the Carlsberg Foundation. A Discovery Grant from the Natural Sciences and Engineering Council of Canada supported the contribution to this project by DAV. APM acknowledges support by the Australian Research Council through the Discovery Early Career Researcher Awards DE150101816. \n\nSome of the data presented in this paper were obtained from the Mikulski Archive for Space Telescopes (MAST). STScI is operated by the Association of Universities for Research in Astronomy, Inc., under NASA contract NAS5-26555. Support for MAST for non-HST data is provided by the NASA Office of Space Science via grant NNX09AF08G and by other grants and contracts. \n\nThe Digitized Sky Surveys were produced at the Space Telescope Science Institute under U.S. Government grant NAG W-2166. The images of these surveys are based on photographic data obtained using the Oschin Schmidt Telescope on Palomar Mountain and the UK Schmidt Telescope. The plates were processed into the present compressed digital form with the permission of these institutions.","id":77059,"rev_number":13,"userid":5483,"eprint_dir":"disk0/00/07/70/59","datestamp":"2017-04-28 20:14:19","lastmod":"2017-05-04 17:40:59","status_changed":"2017-04-28 20:14:19","type":"article","metadata_visibility":"show","creators":[{"given":"K.","family":"Brogaard","id":"Brogaard-K","orcid":""},{"given":"D. A.","family":"VandenBerg","id":"VandenBerg-D-A","orcid":""},{"given":"L. R.","family":"Bedin","id":"Bedin-L-R","orcid":""},{"given":"A. P.","family":"Milone","id":"Milone-A-P","orcid":""},{"given":"A.","family":"Thygesen","id":"Thygesen-A-O","orcid":""},{"given":"F.","family":"Grundahl","id":"Grundahl-F","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Binaries: eclipsing; Hertzsprung–Russell and colour–magnitude diagrams; Globular clusters: individual: 47 Tuc (NGC104)","date":"2017-02-14","date_type":"published","publication":"Monthly Notices of the Royal Astronomical Society","volume":"468","number":"1","pagerange":"645-661","id_number":"CaltechAUTHORS:20170428-124454978","refereed":true,"issn":"0035-8711","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-124454978","related_url":[{"url":"http://dx.doi.org/10.1093/mnras/stx378","type":"doi","description":"Article"},{"url":"https://academic.oup.com/mnras/article-lookup/doi/10.1093/mnras/stx378","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1702.03421","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Alves-Brito A. et al., 2005, A\u0026A, 435, 657\nAnderson J., 2007, Technical report, Instrument Science Report for ACS/WFC 2007-08, STScI, Baltimore\nAnderson J., Bedin L. R., 2010, PASP, 122, 1035\nAnderson J., King I. R., 2006, Technical report, PSFs, Photometry, and Astronomy for the ACS/WFC, STScI, Baltimore\nAnderson J. et al., 2008, AJ, 135, 2055\nAnderson J., Piotto G., King I. R., Bedin L. R., Guhathakurta P., 2009, ApJ, 697, L58\nAsplund M., Grevesse N., Sauval A. J., Scott P., 2009, ARA\u0026A, 47, 481\nBedin L. R., Cassisi S., Castelli F., Piotto G., Anderson J., Salaris M., Momany Y., Pietrinferni A., 2005, MNRAS, 357, 1038\nBedin L. R. et al., 2013, Astron. Nachr., 334, 1062\nBergbusch P. A., Stetson P. B., 2009, AJ, 138, 1455\nBrogaard K., Bruntt H., Grundahl F., Clausen J. V., Frandsen S., Vandenberg D. A., Bedin L. R., 2011, A\u0026A, 525, A2\nBrogaard K. et al., 2012, A\u0026A, 543, A106\nCampos F. et al., 2016, MNRAS, 456, 3729\nCannon R. D., 1974, MNRAS, 167, 551\nCarretta E., Gratton R. G., Bragaglia A., Bonifacio P., Pasquini L., 2004, A\u0026A, 416, 925\nCarretta E., Bragaglia A., Gratton R., D’Orazi V., Lucatello S., 2009, A\u0026A, 508, 695\nCasagrande L., VandenBerg D. A., 2014, MNRAS, 444, 392\nCasagrande L., Ram´ırez I., Meléndez J., Bessell M., Asplund M., 2010, A\u0026A, 512, A54\nCayrel R. et al., 2004, A\u0026A, 416, 1117\nCordero M. J., Pilachowski C. A., Johnson C. I., McDonald I., Zijlstra A. A., Simmerer J., 2014, ApJ, 780, 94\nCrawford D. L., Snowden M. S., 1975, PASP, 87, 561\ndi Criscienzo M., Ventura P., D’Antona F., Milone A., Piotto G., 2010, MNRAS, 408, 999\nDobrovolskas V. et al., 2014, A\u0026A, 565, A121\nGaia Collaboration et al., 2016, A\u0026A, 595, A1\nGarcía-Berro E., Torres S., Althaus L. G., Miller Bertolami M. M., 2014, A\u0026A, 571, A56\nGratton R. G. et al., 2013, A\u0026A, 549, A41\nGrevesse N., Sauval A. J., 1998, Space Sci. Rev., 85, 161\nHansen B. M. S. et al., 2013, Nature, 500, 51\nHarris W. E., 1996, AJ, 112, 1487\nHartwick F. D. A., Hesser J. E., 1974, ApJ, 194, L129\nHesser J. E., Philip A. G. D., 1976, PASP, 88, 89\nHesser J. E., Harris W. E., Vandenberg D. A., Allwright J. W. B., Shott P., Stetson P. B., 1987, PASP, 99, 739\nJohnson C. I. et al., 2015, AJ, 149, 71\nKaluzny J., Kubiak M., Szymanski M., Udalski A., Krzeminski W., Mateo M., Stanek K. Z., 1998, A\u0026AS, 128, 19\nKaluzny J., Rozyczka M., Pych W., Krzeminski W., Zloczewski K., Narloch W., Thompson I. B., 2013, Acta Astron., 63, 309\nKaluzny J., Thompson I. B., Dotter A., Rozyczka M., Schwarzenberg-Czerny A., 2015, AJ, 150, 155\nKoch A., McWilliam A., 2008, AJ, 135, 1551\nLapenna E., Mucciarelli A., Lanzoni B., Ferraro F. R., Dalessandro E., Origlia L., Massari D., 2014, ApJ, 797, 124\nLeaman R., VandenBerg D. A., Mendel J. T., 2013, MNRAS, 436, 122\nLee S.-W., 1977, A\u0026AS, 27, 381\nLucatello S., Sollima A., Gratton R., Vesperini E., D’Orazi V., Carretta E., Bragaglia A., 2015, A\u0026A, 584, A52\nMagic Z., Weiss A., Asplund M., 2015, A\u0026A, 573, A89\nMarino A. F. et al., 2016, MNRAS, 459, 610\nMilone A. P. et al., 2012, ApJ, 744, 58\nMolenda- Żakowicz J., Brogaard K., Niemczura E., Bergemann M., Frasca A., Arentoft T., Grundahl F., 2014, MNRAS, 445, 2446\nMosumgaard J., Aguirre V. S., Weiss A., Christensen-Dalsgaard J., Trampedach R., 2016, preprint (arXiv:1610.07323)\nMunari U., Zwitter T., 1997, A\u0026A, 318, 269\nOriglia L., Rood R. T., Fabbri S., Ferraro F. R., Fusi Pecci F., Rich R. M., 2007, ApJ, 667, L85\nPancino E., Bellazzini M., Marinoni S., 2013, Mem. Soc. Astron. Ital., 84, 83\nPancino E., Bellazzini M., Giuffrida G., Marinoni S., 2017, MNRAS, preprint (arXiv:1701.03003)\nPereira T.M. D., Asplund M., Collet R., Thaler I., Trampedach R., Leenaarts J., 2013, A\u0026A, 554, A118\nRood R. T., Crocker D. A., 1985, in Danziger I. J., Matteucci F., Kjar K., eds, Eur. South. Obs. Conf. Workshop Proc. Vol. 21. European Southern Observatory, Garching, p. 61\nSalaris M., Cassisi S., Pietrinferni A., 2016, A\u0026A, 590, A64\nSarajedini A. et al., 2007, AJ, 133, 1658\nSchlafly E. F., Finkbeiner D. P., 2011, ApJ, 737, 103\nSchlegel D. J., Finkbeiner D. P., Davis M., 1998, ApJ, 500, 525\nStetson P. B., 2000, PASP, 112, 925\nThompson I. B.,Kaluzny J., Rucinski S.M., Krzeminski W., Pych W.,Dotter A., Burley G. S., 2010, AJ, 139, 329\nThygesen A. O. et al., 2014, A\u0026A, 572, A108\nTorres G., 2010, AJ, 140, 1158\nUbeda L., Kozhurina-Platais V., Bedin L. R., 2013, Technical report, ACS/WFC Geometric Distortion: a Time Dependency Study. STScI, Baltimore\nVandenBerg D. A., Edvardsson B., Eriksson K., Gustafsson B., 2008, ApJ, 675, 746\nVandenBerg D. A., Bergbusch P. A., Dotter A., Ferguson J.W.,Michaud G., Richer J., Proffitt C. R., 2012, ApJ, 755, 15\nVandenBerg D. A., Brogaard K., Leaman R., Casagrande L., 2013, ApJ, 775, 134 (VBLC13)\nVandenBerg D. A., Bergbusch P. A., Ferguson J. W., Edvardsson B., 2014, ApJ, 794, 72\nVandenBerg D. A., Denissenkov P. A., Catelan M., 2016, ApJ, 827, 2\nWatkins L. L., van der Marel R. P., Bellini A., Anderson J., 2015, ApJ, 812, 149\nWeldrake D. T. F., Sackett P. D., Bridges T. J., Freeman K. C., 2004, AJ, 128, 736\nWoodley K. A. et al., 2012, AJ, 143, 50\nWylie E. C., Cottrell P. L., Sneden C. A., Lattanzio J. C., 2006, ApJ, 649, 248"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"K. Brogaard, D. A. VandenBerg, L. R. Bedin, A. P. Milone, A. Thygesen, F. Grundahl; The age of 47 Tuc from self-consistent isochrone fits to colour–magnitude diagrams and the eclipsing member V69. Mon Not R Astron Soc 2017; 468 (1): 645-661. doi: 10.1093/mnras/stx378","other_numbering_system":null,"funders":[{"agency":"Danish National Research Foundation","grant_number":"DNRF106"},{"agency":"European Research Council (ERC)","grant_number":"267864"},{"agency":"Villum Foundation","grant_number":""},{"agency":"Carlsberg Foundation","grant_number":""},{"agency":"Natural Sciences and Engineering Research Council of Canada (NSERC)","grant_number":""},{"agency":"Australian Research Council","grant_number":"DE150101816"},{"agency":"NASA","grant_number":"NAS5-26555"},{"agency":"NASA","grant_number":"NNX09AF08G"},{"agency":"NASA","grant_number":"NAG W-2166"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}