{"title":"Hierarchical star formation across the grand-design spiral NGC 1566","uri":"","abstract":"We investigate how star formation is spatially organized in the grand-design spiral NGC 1566 from deep Hubble Space Telescope photometry with the Legacy ExtraGalactic UV Survey. Our contour-based clustering analysis reveals 890 distinct stellar conglomerations at various levels of significance. These star-forming complexes are organized in a hierarchical fashion with the larger congregations consisting of smaller structures, which themselves fragment into even smaller and more compact stellar groupings. Their size distribution, covering a wide range in length-scales, shows a power law as expected from scale-free processes. We explain this shape with a simple ‘fragmentation and enrichment’ model. The hierarchical morphology of the complexes is confirmed by their mass–size relation that can be represented by a power law with a fractional exponent, analogous to that determined for fractal molecular clouds. The surface stellar density distribution of the complexes shows a lognormal shape similar to that for supersonic non-gravitating turbulent gas. Between 50 and 65 per cent of the recently formed stars, as well as about 90 per cent of the young star clusters, are found inside the stellar complexes, located along the spiral arms. We find an age difference between young stars inside the complexes and those in their direct vicinity in the arms of at least 10 Myr. This time-scale may relate to the minimum time for stellar evaporation, although we cannot exclude the in situ formation of stars. As expected, star formation preferentially occurs in spiral arms. Our findings reveal turbulent-driven hierarchical star formation along the arms of a grand-design galaxy.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251460","docid":251460,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250862","fileid":1250862,"datasetid":"document","objectid":251460,"filename":"stx445.pdf","mime_type":"application/pdf","hash":"8e7162e1bac02c3a2116c142ed43b775","hash_type":"MD5","filesize":7801768,"mtime":"2017-04-28 18:24:28","url":"http://authors.library.caltech.edu/77055/1/stx445.pdf"}],"eprintid":77055,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"stx445.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251461","docid":251461,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250864","fileid":1250864,"datasetid":"document","objectid":251461,"filename":"1702.06006.pdf","mime_type":"application/pdf","hash":"7168b03a9e58f49636236560376530c7","hash_type":"MD5","filesize":4333814,"mtime":"2017-04-28 18:24:36","url":"http://authors.library.caltech.edu/77055/2/1702.06006.pdf"}],"eprintid":77055,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1702.06006.pdf","content":"submitted"}],"note":"© 2017 The Authors Published by Oxford University Press on behalf of the Royal Astronomical Society. \n\nReceived 11 January 2017; revision received 09 February 2017; accepted 17 February 2017; published 21 February 2017. \n\nDAG kindly acknowledges financial support by the German Research Foundation (DFG) through programme GO 1659/3-2. He would also like to thank S. Hony for the long discussions (and debates) on star formation and the derived MF. This research has made use of the NASA/IPAC Extragalactic Database (NED), which is operated by the Jet Propulsion Laboratory, California Institute of Technology, under contract with the National Aeronautics and Space Administration. This research has also made use of the SIMBAD data base (Wenger et al. 2000), operated at CDS, Strasbourg, France. Based on observations made with the NASA/ESA Hubble Space Telescope, obtained from the data archive at the Space Telescope Science Institute (STScI). STScI is operated by the Association of Universities for Research in Astronomy, Inc. under NASA contract NAS 5-26555. These observations are associated with programme GO-13364. Support for programme 13364 was provided by NASA through grants from STScI. This research made use of the topcat application (Taylor 2005), the r environment for statistical computing and graphics (R Core Team 2015) and NASA Astrophysics Data System (ADS) bibliographic services.","id":77055,"rev_number":11,"userid":5483,"eprint_dir":"disk0/00/07/70/55","datestamp":"2017-04-28 18:35:01","lastmod":"2017-04-28 18:35:01","status_changed":"2017-04-28 18:35:01","type":"article","metadata_visibility":"show","creators":[{"given":"Dimitrios A.","family":"Gouliermis","id":"Gouliermis-D-A","orcid":""},{"given":"Bruce G.","family":"Elmegreen","id":"Elmegreen-B-G","orcid":""},{"given":"Debra M.","family":"Elmegreen","id":"Elmegreen-D-M","orcid":""},{"given":"Daniela","family":"Calzetti","id":"Calzetti-D","orcid":""},{"given":"Michele","family":"Cignoni","id":"Cignoni-M","orcid":""},{"given":"John S., III","family":"Gallagher","id":"Gallagher-J-S-III","orcid":""},{"given":"Robert C.","family":"Kennicutt","id":"Kennicutt-R-C","orcid":""},{"given":"Ralf S.","family":"Klessen","id":"Klessen-R-C","orcid":""},{"given":"Elena","family":"Sabbi","id":"Sabbi-E","orcid":""},{"given":"David","family":"Thilker","id":"Thilker-D","orcid":""},{"given":"Leonardo","family":"Ubeda","id":"Ubeda-L","orcid":""},{"given":"Alessandra","family":"Aloisi","id":"Aloisi-A","orcid":""},{"given":"Angela","family":"Adamo","id":"Adamo-A","orcid":""},{"given":"David O.","family":"Cook","id":"Cook-D-O","orcid":""},{"given":"Daniel","family":"Dale","id":"Dale-D-A","orcid":""},{"given":"Kathryn","family":"Grasha","id":"Grasha-K","orcid":""},{"given":"Eva K.","family":"Grebel","id":"Grebel-E-K","orcid":""},{"given":"Kelsey E.","family":"Johnson","id":"Johnson-K-E","orcid":""},{"given":"Elena","family":"Sacchi","id":"Sacchi-E","orcid":""},{"given":"Fayezeh","family":"Shabani","id":"Shabani-F","orcid":""},{"given":"Linda J.","family":"Smith","id":"Smith-L-J","orcid":""},{"given":"Aida","family":"Wofford","id":"Wofford-A","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Methods: statistical; Stars: formation; Galaxies: individual: NGC 1566; Galaxies: spiral; Galaxies: stellar content; Galaxies: structure","date":"2017-02-21","date_type":"published","publication":"Monthly Notices of the Royal Astronomical Society","volume":"468","number":"1","pagerange":"509-530","id_number":"CaltechAUTHORS:20170428-105356377","refereed":true,"issn":"0035-8711","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-105356377","related_url":[{"url":"http://dx.doi.org/10.1093/mnras/stx445","type":"doi","description":"Article"},{"url":"https://academic.oup.com/mnras/article-lookup/doi/10.1093/mnras/stx445","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1702.06006","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Agϋero E. L., Dίaz R. J., Bajaja E., 2004, A\u0026A, 414, 453\nBastian N., Ercolano B., Gieles M., Rosolowsky E., Scheepmaker R. A., Gutermuth R., Efremov Yu., 2007, MNRAS, 379, 1302\nBastian N., Gieles M., Ercolano B., Gutermuth R., 2009, MNRAS, 392, 868\nBinney J., Tremaine S., 2008, Galactic Dynamics, 2nd edn. Princeton Univ. Press, Princeton, NJ\nBlaauw A., 1964, ARA\u0026A, 2, 213\nBok B. J., 1934, Harv. Coll. Obs. Circ., 384, 1\nBolatto A. D., Leroy A. K., Rosolowsky E., Walter F., Blitz L., 2008, ApJ, 686, 948\nBosma A., 1992, in Longo G., Capaccioli M., Busarello G., eds, Astrophysics and Space Science Library, Vol. 178, Morphological and Physical Classification of Galaxies. Kluwer, Dordrecht, p. 207\nBressan A., Marigo P., Girardi L., Salasnich B., Dal Cero C., Rubele S., Nanni A., 2012, MNRAS, 427, 127\nBressert E. et al., 2010, MNRAS, 409, L54\nButa R. J. et al., 2015, ApJS, 217, 32\nCalzetti D. et al., 2015, AJ, 149, 51\nCarpenter J. M., 2000, AJ, 120, 3139\nChen Y., Bressan A., Girardi L., Marigo P., Kong X., Lanza A., 2015, MNRAS, 452, 1068\nCollins D. C., Kritsuk A. G., Padoan P., Li H., Xu H., Ustyugov S. D., Norman M. L., 2012, ApJ, 750, 13\nCombes F. et al., 2014, A\u0026A, 565, A97\nComte G., Duquennoy A., 1982, A\u0026A, 114, 7\nCox A. N., 2000, Allen’s Astrophysical Quantities, 4th edn. Am. Inst. Phys., New York\nde Vaucouleurs G., de Vaucouleurs A., 1961, Mem. RAS, 68, 69\nde Vaucouleurs G., de Vaucouleurs A., Corwin H. G., Jr, Buta R. J., Paturel G., Fouqué P., 1991, Third Reference Catalogue of Bright Galaxies, Vols I–III. Springer-Verlag, New York\nDobbs C. L., Pringle J. E., 2009, MNRAS, 396, 1579\nDobbs C. L., Pringle J. E., 2013, MNRAS, 432, 653\nDolphin A. E., 2000, PASP, 112, 1383\nEasley D., and Kleinberg J., 2010, Networks, Crowds, and Markets: Reasoning About a Highly Connected World. Cambridge Univ. Press, Cambridge\nEfremov Y. N., 1989, Astrophys. Space Phys. Rev., 7, 107\nEfremov Y. N., Elmegreen B. G., 1998, MNRAS, 299, 588\nEfremov I. N., Ivanov G. R., Nikolov N. S., 1987, Ap\u0026SS, 135, 119\nElmegreen B. G., 2011a, in Charbonnel C., Montmerle T., eds, EAS Publ. Ser. Vol. 51, Star Formation in the Local Universe – EES2010. EDP Sciences, Les Ulis, p. 19\nElmegreen B. G., 2011b, ApJ, 731, 61\nElmegreen B. G., Elmegreen D. M., 1987, ApJ, 320, 182\nElmegreen B. G., Falgarone E., 1996, ApJ, 471, 816\nElmegreen B. G., Scalo J., 2006, ApJ, 636, 149\nElmegreen B. G., Efremov Y., Pudritz R. E., Zinnecker H., 2000, Protostars and Planets IV. Univ. Arizona Press, Tucson, p. 179\nElmegreen D. M. et al., 2014a, ApJ, 780, 32\nElmegreen D. M. et al., 2014b, ApJ, 787, L15\nFederrath C., Roman-Duval J., Klessen R. S., Schmidt W., Mac Low M., 2010, A\u0026A, 512, A81\nFitzpatrick E. L., 1999, PASP, 111, 63\nGao Y., Solomon P. M., 2004, ApJ, 606, 271\nGieles M., Bastian N., Ercolano B., 2008, MNRAS, 391, L93\nGirardi L. et al., 2010, ApJ, 724, 1030\nGirichidis P., Konstandin L., Whitworth A. P., Klessen R. S., 2014, ApJ, 781, 91\nGouliermis D. A., 2011, Phys. Scr., 84, 048401\nGouliermis D.,Kontizas M., Korakitis R., MorganD. H.,Kontizas E.,Dapergolas A., 2000, AJ, 119, 1737\nGouliermis D., Keller S. C., de Boer K. S., Kontizas M., Kontizas E., 2002, A\u0026A, 381, 862\nGouliermis D., Kontizas M., Kontizas E., Korakitis R., 2003, A\u0026A, 405, 111\nGouliermis D., Brandner W., Henning T., 2006, ApJ, 641, 838\nGouliermis D. A., Schmeja S., Klessen R. S., de Blok W. J. G., Walter F., 2010, ApJ, 725, 1717\nGouliermis D. A. et al., 2015a, MNRAS, 452, 3508\nGouliermis D. A. et al., 2015b, in Freeman K. C., Elmegreen B. G., Block D. L.,Woolway M., eds, Lessons from the Local Group. Springer-Verlag, New York, p. 289\nGrabelsky D. A., Cohen R. S., Bronfman L., Thaddeus P., May J., 1987, ApJ, 315, 122\nGrasha K. et al., 2015, ApJ, 815, 93\nHeyer M., Dame T. M., 2015, ARA\u0026A, 53, 583\nHopkins P. F., 2013, MNRAS, 430, 1653\nHughes A. et al., 2013, ApJ, 779, 44\nIvanov G. R., 1996, A\u0026A, 305, 708\nKennicutt R. C., Evans N. J., 2012, ARA\u0026A, 50, 531\nKennicutt R. C., Jr, et al., 2003, PASP, 115, 928\nKlessen R. S., 2000, ApJ, 535, 869\nKnapen J. H., Beckman J. E., Cepa J., van der Hulst T., Rand R. J., 1992, ApJ, 385, L37\nKnapen J. H., Beckman J. E., Cepa J., Nakai N., 1996, A\u0026A, 308, 27\nKonstandin L., Girichidis P., Federrath C., Klessen R. S., 2012, ApJ, 761, 149\nKontizas E., Kontizas M., Gouliermis D., Dapergolas A., Korakitis R., Morgan D. H., 1999, in Chu Y.-H., Suntzeff N., Hesser J., Bohlender D., eds, Proc. IAU Symp. 190, New Views of the Magellanic Clouds. Astron. Soc. Pac., San Francisco, p. 410\nKroupa P., 2002, Science, 295, 82\nKroupa P., 2008, Lecture Notes in Physics,Vol. 760, TheCambridge N-Body Lectures. Springer-Verlag, Berlin, p. 181\nKroupa P., 2014, in Stamatellos D., Goodwin S., Ward-Thompson D., eds, Astrophysics and Space Science Proceedings, Vol. 36, The Labyrinth of Star Formation. Springer-Verlag, Berlin, p. 335\nLada C. J., Lada E. A., 1991, in Janes K., ed., ASP Conf. Ser. Vol. 13, The Formation and Evolution of Star Clusters. Astron. Soc. Pac., San Francisco, p. 3\nLin C. C., Shu F. H., 1964, ApJ, 140, 646\nLombardi M., Lada C. J., Alves J., 2010, A\u0026A, 512, A67\nMac Low M.-M., Klessen R. S., 2004, Rev. Mod. Phys., 76, 125\nMarigo P., Girardi L., Bressan A., Groenewegen M. A. T., Silva L., Granato G. L., 2008, A\u0026A, 482, 883\nMassey P., 2003, ARA\u0026A, 41, 15\nMathewson D. S., Ford V. L., Buchhorn M., 1992, ApJS, 81, 413\nNewman M. E. J., 2005, Contemp. Phys., 46, 323\nPadoan P., Nordlund A., Jones B. J. T., 1997, MNRAS, 288, 145\nPellerin A., Meyer M., Harris J., Calzetti D., 2007, ApJ, 658, L87\nPellerin A., Meyer M. M., Calzetti D., Harris J., 2012, AJ, 144, 182\nPortegies Zwart S. F., McMillan S. L. W., Gieles M., 2010, ARA\u0026A, 48, 431\nR Core Team, 2015, R: A Language and Environment for Statistical Computing. R Foundation for Statistical Computing, Vienna, Austria\nRomán-Zúñiga C. G., Elston R., Ferreira B., Lada E. A., 2008, ApJ, 672, 861\nSalo H., Laurikainen E., Buta R., Knapen J. H., 2010, ApJ, 715, L56\nSalpeter E. E., 1955, ApJ, 121, 161\nSánchez N., Alfaro E. J., P´erez E., 2005, ApJ, 625, 849\nScalo J. M., 1986, Fundam. Cosm. Phys., 11, 1\nSchlafly E. F., Finkbeiner D. P., Schlegel D. J., Jurić M., Ivezić Ž., Gibson R. R., Knapp G. R., Weaver B. A., 2010, ApJ, 725, 1175\nSchneider N. et al., 2012, A\u0026A, 540, L11\nSimon H. A., 1955, Biometrika, 42, 425\nSorce J. G., Tully R. B., Courtois H. M., Jarrett T. H., Neill J. D., Shaya E. J., 2014, MNRAS, 444, 527\nSornette D., 2004, Springer Series in Synergetics, Critical Phenomena in Natural Sciences: Chaos, Fractals, Self-organization and Disorder: Concepts and Tools, 2nd edn. Springer-Verlag, Heidelberg \nSpitzer L., 1987, Dynamical Evolution of Globular Clusters. Princeton Univ. Press, Princeton, NJ\nSpitzer L., Jr, 1958, ApJ, 127, 17\nSun N.-C. et al., 2017, ApJ, 835, 171\nTaylor M. B., 2005, in Shopbell P., Britton M., Ebert R., eds, ASP Conf. Ser. Vol. 347, Astronomical Data Analysis Software and Systems XIV. Astron. Soc. Pac., San Francisco, p. 29\nTheureau G., Hanski M. O., Coudreau N., Hallet N., Martin J.-M., 2007, A\u0026A, 465, 71\nTielens A. G. G. M., 2005, The Physics and Chemistry of the Interstellar Medium. Cambridge Univ. Press, Cambridge\nTsigaridi L., Patsis P. A., 2013, MNRAS, 434, 2922\nTully R. B., 1988, Nearby Galaxies Catalogue. Cambridge Univ. Press, Cambridge, p. 221\nTully R. B. et al., 2013, AJ, 146, 86\nTurcotte D. L., 1986, J. Geophys. Res., 91, 1921\nvan den Bergh S., 1964, ApJS, 9, 65\nVázquez-Semadeni E., 1994, ApJ, 423, 681\nVázquez-Semadeni E., Gonz´alez R. F., Ballesteros-Paredes J., Gazol A.,\nKim J., 2008, MNRAS, 390, 769\nWeidner C., Kroupa P., Bonnell I. A. D., 2010, MNRAS, 401, 275\nWenger M. et al., 2000, A\u0026AS, 143, 9\nWillick J. A., Courteau S., Faber S. M., Burstein D., Dekel A., Strauss M. A., 1997, ApJS, 109, 333\nWillis J. C., Yule G. U., 1922, Nature, 109, 177\nWofford A. et al., 2016, MNRAS, 457, 4296\nYule G. U., 1925, Phil. Trans. R. Soc. B, 213, 21\nZhou Z.-M., Cao C., Wu H., 2015, AJ, 149, 1"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Dimitrios A. Gouliermis, Bruce G. Elmegreen, Debra M. Elmegreen, Daniela Calzetti, Michele Cignoni, John S. Gallagher, III, Robert C. Kennicutt, Ralf S. Klessen, Elena Sabbi, David Thilker, Leonardo Ubeda, Alessandra Aloisi, Angela Adamo, David O. Cook, Daniel Dale, Kathryn Grasha, Eva K. Grebel, Kelsey E. Johnson, Elena Sacchi, Fayezeh Shabani, Linda J. Smith, Aida Wofford; Hierarchical star formation across the grand-design spiral NGC 1566. Mon Not R Astron Soc 2017; 468 (1): 509-530. doi: 10.1093/mnras/stx445","other_numbering_system":null,"funders":[{"agency":"Deutsche Forschungsgemeinschaft (DFG)","grant_number":"GO 1659/3-2"},{"agency":"NASA","grant_number":"NAS 5-26555"},{"agency":"Space Telescope Science Institute (STScI)","grant_number":""},{"agency":"NASA/JPL/Caltech","grant_number":""},{"agency":"NASA","grant_number":"GO-13364"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Infrared Processing and Analysis Center (IPAC)"]}