{"title":"Clustering on very small scales from a large sample of confirmed quasar pairs: does quasar clustering track from Mpc to kpc scales?","uri":"","abstract":"We present the most precise estimate to date of the clustering of quasars on very small scales, based on a sample of 47 binary quasars with magnitudes of g \u003c 20.85 and proper transverse separations of ∼25 h^(−1) kpc. Our sample of binary quasars, which is about six times larger than any previous spectroscopically confirmed sample on these scales, is targeted using a kernel density estimation (KDE) technique applied to Sloan Digital Sky Survey (SDSS) imaging over most of the SDSS area. Our sample is ‘complete’ in that all of the KDE target pairs with 17.0 ≲ R ≲ 36.2 h^(−1) kpc in our area of interest have been spectroscopically confirmed from a combination of previous surveys and our own long-slit observational campaign. We catalogue 230 candidate quasar pairs with angular separations of \u003c8 arcsec, from which our binary quasars were identified. We determine the projected correlation function of quasars (W-bar_p) in four bins of proper transverse scale over the range 17.0 ≲ R ≲ 36.2 h^(−1) kpc. The implied small-scale quasar clustering amplitude from the projected correlation function, integrated across our entire redshift range, is A = 24.1 ± 3.6 at ∼26.6 h^(−1) kpc. Our sample is the first spectroscopically confirmed sample of quasar pairs that is sufficiently large to study how quasar clustering evolves with redshift at ∼25 h^(−1) kpc. We find that empirical descriptions of how quasar clustering evolves with redshift at ∼25 h^(−1) Mpc also adequately describe the evolution of quasar clustering at ∼25 h^(−1) kpc.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251466","docid":251466,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250896","fileid":1250896,"datasetid":"document","objectid":251466,"filename":"stx412.pdf","mime_type":"application/pdf","hash":"3dc9c2553bd7d84d319cfe062455ae68","hash_type":"MD5","filesize":1954210,"mtime":"2017-04-28 19:05:47","url":"http://authors.library.caltech.edu/77057/1/stx412.pdf"}],"eprintid":77057,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"stx412.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251467","docid":251467,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250898","fileid":1250898,"datasetid":"document","objectid":251467,"filename":"stx412_Supp.zip","mime_type":"application/zip","hash":"9c1a8920d900b6323566239fbaaa1f20","hash_type":"MD5","filesize":11531,"mtime":"2017-04-28 19:05:54","url":"http://authors.library.caltech.edu/77057/2/stx412_Supp.zip"}],"eprintid":77057,"pos":2,"placement":2,"mime_type":"application/zip","format":"application/zip","language":"en","security":"public","license":"other","main":"stx412_Supp.zip","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/251468","docid":251468,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250900","fileid":1250900,"datasetid":"document","objectid":251468,"filename":"1702.03491.pdf","mime_type":"application/pdf","hash":"98e8ecf39b8635d2eed3eb404f673d07","hash_type":"MD5","filesize":2042890,"mtime":"2017-04-28 19:06:06","url":"http://authors.library.caltech.edu/77057/3/1702.03491.pdf"}],"eprintid":77057,"pos":3,"placement":3,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1702.03491.pdf","content":"submitted"}],"note":"© 2017 The Authors Published by Oxford University Press on behalf of the Royal Astronomical Society. \n\nReceived 29 January 2017; revision received 09 February 2017; accepted 14 February 2017; published 17 February 2017. \n\nSE and ADM were partially supported by the National Science Foundation (NSF) through grant number 1515404. SGD, AAM and MJG acknowledge partial support from NSF grants AST-1313422, AST-1413600 and AST-1518308. We thank the staff of Palomar Observatory for their assistance during our observing runs. Observations reported here were obtained at (1) the MMT Observatory, a joint facility of the Smithsonian Institution and the University of Arizona; (2) the Hale Telescope, Palomar Observatory, as part of a continuing collaboration between the California Institute of Technology, NASA/JPL, Oxford University, Yale University and the National Astronomical Observatories of China; and (3) the Mayall telescope at Kitt Peak National Observatory, National Optical Astronomy Observatory (NOAO Prop. ID: 2008A-0127; PI: Myers), which is operated by the Association of Universities for Research in Astronomy (AURA) under cooperative agreement with the National Science Foundation. The authors are honoured to be permitted to conduct astronomical research on Iolkam Du'ag (Kitt Peak), a mountain with particular significance to the Tohono O'odham. This work used the facilities of The Advanced Research Computing Center at the University of Wyoming (Advanced Research Computing Center. 2012. Mount Moran: IBM System X cluster. Laramie, WY: University of Wyoming. http://n2t.net/ark:/85786/m4159c).","id":77057,"rev_number":10,"userid":5483,"eprint_dir":"disk0/00/07/70/57","datestamp":"2017-04-28 19:23:18","lastmod":"2017-04-28 19:23:18","status_changed":"2017-04-28 19:23:18","type":"article","metadata_visibility":"show","creators":[{"given":"S.","family":"Eftekharzadeh","id":"Eftekharzadeh-S","orcid":""},{"given":"A. D.","family":"Myers","id":"Myers-A-D","orcid":""},{"given":"J. F.","family":"Hennawi","id":"Hennawi-J-F","orcid":""},{"given":"S. G.","family":"Djorgovski","id":"Djorgovski-S-G","orcid":"0000-0002-0603-3087"},{"given":"G. T.","family":"Richards","id":"Richards-G-T","orcid":""},{"given":"A. A.","family":"Mahabal","id":"Mahabal-A-A","orcid":""},{"given":"M. J.","family":"Graham","id":"Graham-M-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Surveys; Quasars: general; Cosmology: observations; Large-scale structure of universe","date":"2017-02-17","date_type":"published","publication":"Monthly Notices of the Royal Astronomical Society","volume":"468","number":"1","pagerange":"77-90","id_number":"CaltechAUTHORS:20170428-114834477","refereed":true,"issn":"0035-8711","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-114834477","related_url":[{"url":"http://dx.doi.org/10.1093/mnras/stx412","type":"doi","description":"Article"},{"url":"https://academic.oup.com/mnras/article-lookup/doi/10.1093/mnras/stx412","type":"","description":"Article"},{"url":"https://arxiv.org/abs/1702.03491","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Abazajian K. et al., 2003, AJ, 126, 2081\nAdelman-McCarthy J. K. et al., 2008, ApJS, 175, 297\nBerlind A. A., Weinberg D. H., 2002, ApJ, 575, 587\nBlanton M. R., Lin H., Lupton R. H., Maley F. M., Young N., Zehavi I., Loveday J., 2003, AJ, 125, 2276\nChatterjee S., Degraf C., Richardson J., Zheng Z., Nagai D., Di Matteo T., 2012, MNRAS, 419, 2657\nChatterjee S., Nguyen M. L., Myers A. D., Zheng Z., 2013, ApJ, 779, 147\nCoil A. L., Hennawi J. F., Newman J. A., Cooper M. C., Davis M., 2007, ApJ, 654, 115\nCoil A. L., Mendez A. J., Eisenstein D. J., Moustakas J., 2016, preprint (arXiv:1609.09090)\nCole S., Kaiser N., 1989, MNRAS, 237, 1127\nCrampton D., Cowley A. P., Hickson P., Kindl E., Wagner R. M., Tyson J. A., Gullixson C., 1988, ApJ, 330, 184\nCroom S. M., Shanks T., 1996, MNRAS, 281, 893\nCroom S. M., Smith R. J., Boyle B. J., Shanks T., Miller L., Outram P. J., Loaring N. S., 2004, MNRAS, 349, 1397\nCroom S. M. et al., 2005, MNRAS, 356, 415\nCroom S. M. et al., 2009, MNRAS, 399, 1755\nDawson K. S. et al., 2013, AJ, 145, 10\nDi Matteo T., Springel V., Hernquist L., 2005, Nature, 433, 604\nDjorgovski S., 1991, in Crampton D., ed., ASP Conf. Ser. Vol. 21, The Space Distribution of Quasars. Astron. Soc. Pac., San Francisco, p. 349\nDjorgovski S., Spinrad H., 1984, ApJ, 282, L1\nDjorgovski S., Perley R., Meylan G., McCarthy P., 1987, ApJ, 321, L17\nEftekharzadeh S. et al., 2015, MNRAS, 453, 2779\nEllison S. L., Patton D. R., Mendel J. T., Scudder J. M., 2011, MNRAS, 418, 2043\nEllison S. L., Mendel J. T., Scudder J. M., Patton D. R., Palmer M. J. D., 2013, MNRAS, 430, 3128\nFan X. et al., 1999, ApJ, 526, L57\nFan X. et al., 2006, AJ, 131, 1203\nFavole G. et al., 2016, MNRAS, 461, 3421\nGehrels N., 1986, ApJ, 303, 336\nGreen P. J., Myers A. D., Barkhouse W. A., Aldcroft T. L., Trichas M., Richards G. T., Ruiz Á., Hopkins P. F., 2011, ApJ, 743, 81\nGregg M. D., Becker R. H., White R. L., Richards G. T., Chaffee F. H., Fan X., 2002, ApJ, 573, L85\nHagen H.-J., Hopp U., Engels D., Reimers D., 1996, A\u0026A, 308, L25\nHennawi J. F., Prochaska J. X., 2013, ApJ, 766, 58\nHennawi J. F. et al., 2006a, AJ, 131, 1\nHennawi J. F. et al., 2006b, ApJ, 651, 61\nHennawi J. F. et al., 2010, ApJ, 719, 1672\nHewett P. C., Webster R. L., Harding M. E., Jedrzejewski R. J., Foltz C. B., Chaffee F. H., Irwin M. J., Le Fevre O., 1989, ApJ, 346, L61\nHewett P. C., Foltz C. B., Harding M. E., Lewis G. F., 1998, AJ, 115, 383\nHopkins P. F., Somerville R. S., Hernquist L., Cox T. J., Robertson B., Li Y., 2006, ApJ, 652, 864\nHopkins P. F., Lidz A., Hernquist L., Coil A. L., Myers A. D., Cox T. J., Spergel D. N., 2007, ApJ, 662, 110\nHopkins P. F., Hernquist L., Cox T. J., Kereš D., 2008, ApJS, 175, 356\nInada N. et al., 2008, AJ, 135, 496\nInada N. et al., 2010, AJ, 140, 403\nInada N. et al., 2012, AJ, 143, 119\nJiang N., Wang H., Mo H., Dong X., Wang T., Zhou H., 2016, ApJ, 832, 111\nKaiser N., 1984, ApJ, 284, L9\nKayo I., Oguri M., 2012, MNRAS, 424, 1363\nKochanek C. S., Falco E. E., Muñoz J. A., 1999, ApJ, 510, 590\nLacey C., Cole S., 1993, MNRAS, 262, 627\nMcCarthy P. J., Dickinson M., Filippenko A. V., Spinrad H., van Breugel W. J. M., 1988, ApJ, 328, L29\nMcGreer I. D., Eftekharzadeh S., Myers A. D., Fan X., 2016, AJ, 151, 61\nMasjedi M. et al., 2006, ApJ, 644, 54\nMeylan G., Djorgovski S., 1989, ApJ, 338, L1\nMeylan G., Djorgovski S.,Weir N., Shaver P., 1990, The Messenger, 59, 47\nMiller L., Lopes A. M., Smith R. J., Croom S. M., Boyle B. J., Shanks T., Outram P., 2004, MNRAS, 348, 395\nMoore B., Katz N., Lake G., Dressler A., Oemler A., 1996, Nature, 379, 613\nMortlock D. J., Webster R. L., Francis P. J., 1999, MNRAS, 309, 836\nMuñoz J. A., Falco E. E., Kochanek C. S., Lehár J., Herold L. K., Fletcher A. B., Burke B. F., 1998, ApJ, 492, L9\nMyers A. D. et al., 2006, ApJ, 638, 622\nMyers A. D., Brunner R. J., Nichol R. C., Richards G. T., Schneider D. P., Bahcall N. A., 2007a, ApJ, 658, 85\nMyers A. D., Brunner R. J., Richards G. T., Nichol R. C., Schneider D. P., Bahcall N. A., 2007b, ApJ, 658, 99\nMyers A. D., Richards G. T., Brunner R. J., Schneider D. P., Strand N. E., Hall P. B., Blomquist J. A., York D. G., 2008, ApJ, 678, 635\nNavarro J. F., Frenk C. S., White S. D. M., 1997, ApJ, 490, 493\nOguri M. et al., 2006, AJ, 132, 999\nOguri M. et al., 2008, AJ, 135, 512\nOguri M. et al., 2012, AJ, 143, 120\nOke J. B., Gunn J. E., 1983, ApJ, 266, 713\nPadmanabhan N., White M., Norberg P., Porciani C., 2009, MNRAS, 397, 1862\nPâris I. et al., 2016, A\u0026A, 597, A79\nPeebles P. J. E., 1973, ApJ, 185, 413\nPindor B., Turner E. L., Lupton R. H., Brinkmann J., 2003, AJ, 125, 2325\nPindor B. et al., 2006, AJ, 131, 41\nPlanck Collaboration XIII, 2016, A\u0026A, 594, A13\nPorciani C., Norberg P., 2006, MNRAS, 371, 1824\nPorciani C., Magliocchetti M., Norberg P., 2004, MNRAS, 355, 1010\nProchaska J. X. et al., 2013, ApJ, 776, 136\nProchaska J. X., Lau M. W., Hennawi J. F., 2014, ApJ, 796, 140\nRichards G. T. et al., 2002, AJ, 123, 2945\nRichards G. T. et al., 2004, ApJS, 155, 257\nRichards G. T. et al., 2009, ApJS, 180, 67\nRichardson J., Zheng Z., Chatterjee S., Nagai D., Shen Y., 2012, ApJ, 755, 30\nRichardson J., Chatterjee S., Zheng Z., Myers A. D., Hickox R., 2013, ApJ, 774, 143\nRoss N. P. et al., 2009, ApJ, 697, 1634\nSchlegel D. J., Finkbeiner D. P., Davis M., 1998, ApJ, 500, 525\nSchneider D. P., Schmidt M., Gunn J. E., 1994, AJ, 107, 1245\nSchneider D. P. et al., 2000, AJ, 120, 2183\nSchneider D. P. et al., 2005, AJ, 130, 367\nSchneider D. P. et al., 2007, AJ, 134, 102\nSchneider D. P. et al., 2010, AJ, 139, 2360\nShanks T., Boyle B. J., 1994, MNRAS, 271, 753\nShanks T., Fong R., Boyle B. J., Peterson B. A., 1987, MNRAS, 227, 739\nSheinis A. I., Bolte M., Epps H. W., Kibrick R. I., Miller J. S., Radovan M. V., Bigelow B. C., Sutin B. M., 2002, PASP, 114, 851\nShen Y. et al., 2007, AJ, 133, 2222\nShen Y. et al., 2009, ApJ, 697, 1656\nSmith R. E. et al., 2003, MNRAS, 341, 1311\nSramek R. A., Weedman D. W., 1978, ApJ, 221, 468\nStoughton C. et al., 2002, AJ, 123, 485\nSwanson M. E. C., Tegmark M., Blanton M., Zehavi I., 2008, MNRAS, 385, 1635\nTegmark M. et al., 2004, ApJ, 606, 702\nWatson D. F., Berlind A. A., McBride C. K., Masjedi M., 2010, ApJ, 709, 115\nWeedman D. W., Weymann R. J., Green R. F., Heckman T. M., 1982, ApJ, 255, L5\nWetzel A. R., Cohn J. D., White M., 2009, MNRAS, 394, 2182\nWhite M. et al., 2012, MNRAS, 424, 933\nWyithe J. S. B., Loeb A., 2005, ApJ, 621, 95\nZehavi I. et al., 2011, ApJ, 736, 59\nZhai Z. et al., 2016, preprint (arXiv:1607.05383)\nZhdanov V. I., Surdej J., 2001, A\u0026A, 372, 1"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"S. Eftekharzadeh, A. D. Myers, J. F. Hennawi, S. G. Djorgovski, G. T. Richards, A. A. Mahabal, M. J. Graham; Clustering on very small scales from a large sample of confirmed quasar pairs: does quasar clustering track from Mpc to kpc scales?. Mon Not R Astron Soc 2017; 468 (1): 77-90. doi: 10.1093/mnras/stx412","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"AST-1515404"},{"agency":"NSF","grant_number":"AST-1313422"},{"agency":"NSF","grant_number":"AST-1413600"},{"agency":"NSF","grant_number":"AST-1518308"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}