{"title":"New ATCA, ALMA and VISIR observations of the candidate LBV SK -67 266 (S61): the nebular mass from modelling 3D density distributions","uri":"","abstract":"We present new observations of the nebula around the Magellanic candidate Luminous Blue Variable S61. These comprise high-resolution data acquired with the Australia Telescope Compact Array (ATCA), the Atacama Large Millimetre/Submillimetre Array (ALMA), and the VLT Imager and Spectrometer for mid Infrared (VISIR) at the Very Large Telescope. The nebula was detected only in the radio, up to 17 GHz. The 17 GHz ATCA map, with 0.8 arcsec resolution, allowed a morphological comparison with the \nHα Hubble Space Telescope image. The radio nebula resembles a spherical shell, as in the optical. The spectral index map indicates that the radio emission is due to free–free transitions in the ionized, optically thin gas, but there are hints of inhomogeneities. We present our new public code Rhocube to model 3D density distributions and determine via Bayesian inference the nebula's geometric parameters. We applied the code to model the electron density distribution in the S61 nebula. We found that different distributions fit the data, but all of them converge to the same ionized mass, ∼ 0.1 M_⊙, which is an order of magnitude smaller than previous estimates. We show how the nebula models can be used to derive the mass-loss history with high-temporal resolution. The nebula was probably formed through stellar winds, rather than eruptions. From the ALMA and VISIR non-detections, plus the derived extinction map, we deduce that the infrared emission observed by space telescopes must arise from extended, diffuse dust within the ionized region.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251452","docid":251452,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1250779","fileid":1250779,"datasetid":"document","objectid":251452,"filename":"stw2986.pdf","mime_type":"application/pdf","hash":"e23d8bb8d2fcf1504430182517bb5075","hash_type":"MD5","filesize":2881992,"mtime":"2017-04-28 17:31:18","url":"http://authors.library.caltech.edu/77054/1/stw2986.pdf"}],"eprintid":77054,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"stw2986.pdf","content":"published"}],"note":"© 2016 The Authors. Published by Oxford University Press on behalf of the Royal Astronomical Society. \n\nAccepted 2016 November 15. Received 2016 November 14; in original form 2016 October 13. \n\nThe authors wish to thank the referee for their valuable suggestions that helped to improve the presentation of this work. We acknowledge support from FONDECYT grant No. 3150463 (CA) and FONDECYT grant No. 3140436 (RN), and from the Ministry of Economy, Development, and Tourism's Millennium Science Initiative through grant IC120009, awarded to The Millennium Institute of Astrophysics, MAS (CA and GP). We wish to thank the ESO Operations Support Center for the support received for the VISIR data reduction. \n\nThis paper makes use of the following ALMA data: ADS/JAO.ALMA #2013.1.00450.S. ALMA is a partnership of ESO (representing its member states), NSF (USA) and NINS (Japan), together with NRC (Canada) and NSC and ASIAA (Taiwan) and KASI (Republic of Korea), in cooperation with the Republic of Chile. The Joint ALMA Observatory is operated by ESO, AUI/NRAO and NAOJ. \n\nIn addition, this research is based on observations made with ESO telescopes at the La Silla Paranal Observatory under programme ID 095.D-0433; makes use of data products from the Wide-field Infrared Survey Explorer, which is a joint project of the University of California, Los Angeles, and the Jet Propulsion Laboratory/California Institute of Technology, funded by the National Aeronautics and Space Administration; made use of the VizieR catalogue access tool, CDS, Strasbourg, France; made use of the NASA/ IPAC Infrared Science Archive (IRSA) that is operated by the Jet Propulsion Laboratory, California Institute of Technology, under contract with the National Aeronautics and Space Administration; made use of the SIMBAD data base, operated at CDS, Strasbourg, France; made use of Montage, funded by the National Aeronautics and Space Administration's Earth Science Technology Office, Computation Technologies Project, under Cooperative Agreement Number NCC5-626 between NASA and the California Institute of Technology. Montage is maintained by IRSA.","id":77054,"rev_number":9,"userid":772,"eprint_dir":"disk0/00/07/70/54","datestamp":"2017-04-28 23:38:10","lastmod":"2017-04-28 23:38:10","status_changed":"2017-04-28 23:38:10","type":"article","metadata_visibility":"show","creators":[{"given":"C.","family":"Agliozzo","id":"Agliozzo-C","orcid":""},{"given":"R.","family":"Nikutta","id":"Nikutta-T","orcid":""},{"given":"G.","family":"Pignata","id":"Pignata-G","orcid":""},{"given":"N. M.","family":"Phillips","id":"Phillips-N-M","orcid":""},{"given":"A.","family":"Ingallinera","id":"Ingallinera-A","orcid":""},{"given":"C.","family":"Buemi","id":"Buemi-C","orcid":""},{"given":"G.","family":"Umana","id":"Umana-G","orcid":""},{"given":"P.","family":"Leto","id":"Leto-P","orcid":""},{"given":"C.","family":"Trigilio","id":"Trigilio-C","orcid":""},{"given":"A.","family":"Noriega-Crespo","id":"Noriega-Crespo-A","orcid":""},{"given":"R.","family":"Paladini","id":"Paladini-R","orcid":""},{"given":"F.","family":"Bufano","id":"Bufano-F","orcid":""},{"given":"F.","family":"Cavallaro","id":"Cavallaro-F","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-04","date_type":"published","publication":"Monthly Notices of the Royal Astronomical Society","volume":"466","number":"1","pagerange":"213-227","id_number":"CaltechAUTHORS:20170428-103108890","refereed":true,"issn":"0035-8711","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-103108890","related_url":[{"url":"https://doi.org/10.1093/mnras/stw2986","type":"doi","description":"Article"},{"url":"https://academic.oup.com/mnras/article/466/1/213/2544389/New-ATCA-ALMA-and-VISIR-observations-of-the","type":"pub","description":"Article"}],"referencetext":["Abbott D. C., Bieging J. H., Churchwell E., 1981, ApJ , 250, 645\nCrossRefSearch ADS open URL link  \nAgliozzo C., Umana G., Trigilio C., Buemi C., Leto P., Ingallinera A., Franzen T., Noriega-Crespo A., 2012, MNRAS , 426, 181 (Paper I)\nCrossRefSearch ADS open URL link  \nAgliozzo C., Noriega-Crespo A., Umana G., Flagey N., Buemi C., Ingallinera A., Trigilio C., Leto P., 2014, MNRAS , 440, 1391\nCrossRefSearch ADS open URL link  \nAgliozzo C.et al, in press\nArdila D. R.et al, 2010a, ApJS , 191, 301\nCrossRefSearch ADS open URL link  \nArdila D. R.et al, 2010b, VizieR Online Data Catalog , 219\nBackman D. E., Paresce F., 1993, in Levy E. H., Lunine J. I., eds, Protostars and Planets III . Univ. Arizona Press, Tucson, p. 1253\nBentley J. L., 1975, Commun. ACM , 18, 9\nCrossRefSearch ADS open URL link  \nBohannan B., Walborn N. R., 1989, PASP , 101, 520\nCrossRefSearch ADS open URL link  \nBuemi C. S., Umana G., Trigilio C., Leto P., Hora J. L., 2010, ApJ , 721, 1404\nCrossRefSearch ADS open URL link  \nBuemi C. S.et al, 2017, MNRAS , 465, 4147\nCrossRefSearch ADS open URL link  \nClark B. G., 1980, A\u0026A , 89, 377\nClark J. S., Larionov V. M., Arkharov A., 2005, A\u0026A , 435, 239\nCrossRefSearch ADS open URL link  \nConti P. S., Frost S. A., 1976, BAAS , 8, 340\nCrowther P. A., Smith L. J., 1997, A\u0026A , 320, 500\nCutri R. M.et al, 2012a, Explanatory Supplement to the WISE All-Sky Data Release Products \nCutri R. M.et al, 2012b, VizieR Online Data Catalog , 2311\nDavidson K., Humphreys R. M., 2012, Astrophysics and Space Science Library, Vol. 384, Eta Carinae and the Supernova Impostors . Springer-Verlag, Berlin\nDuncan R. A., White S. M., 2002, MNRAS , 330, 63\nCrossRefSearch ADS open URL link  \nFullerton A. W., Massa D. L., Prinja R. K., 2006, ApJ , 637, 1025\nCrossRefSearch ADS open URL link  \nGvaramadze V. V., Kniazev A. Y., Fabrika S., 2010, MNRAS , 405, 1047\nHastings W. K., 1970, Biometrika , 57, 97-109\nCrossRefSearch ADS open URL link  \nHiggs L. A., Wendker H. J., Landecker T. L., 1994, A\u0026A , 291, 295\nHumphreys R. M., Davidson K., 1994, PASP , 106, 1025\nCrossRefSearch ADS open URL link  \nHumphreys R. M., Weis K., Davidson K., Gordon M. S., 2016, ApJ , 825, 64\nCrossRefSearch ADS open URL link  \nHutsemekers D., 1997, in Nota A., Lamers H., eds, ASP Conf. Ser. Vol. 120, Luminous Blue Variables: Massive Stars in Transition . Astron. Soc. pac., San Francisco, p. 316\nIshihara D.et al, 2010a, A\u0026A , 514, A1\nCrossRefSearch ADS open URL link  \nIshihara D.et al, 2010b, VizieR On-line Data Catalog , 2297\nJiménez-Esteban F. M., Rizzo J. R., Palau A., 2010, ApJ , 713, 429\nCrossRefSearch ADS open URL link  \nKraemer K. E.et al, 2010, AJ , 139, 2319\nCrossRefSearch ADS open URL link  \nLamers H. J. G. L. M., Snow T. P., Lindholm D. M., 1995, ApJ , 455, 269\nCrossRefSearch ADS open URL link  \nLang C. C., Johnson K. E., Goss W. M., Rodríguez L. F., 2005, AJ , 130, 2185\nCrossRefSearch ADS open URL link  \nMcMullin J. P., Waters B., Schiebel D., Young W., Golap K., 2007, in Shaw R. A., Hill F., Bell D. J., eds, ASP Conf. Ser. Vol 376, Astronomical Data Analysis Software and Systems XVI . Astron. Soc. Pac., San Francisco, p. 127\nMeixner M.et al, 2013, AJ , 146, 62\nCrossRefSearch ADS open URL link  \nMetropolis N.et al, 1953, J. Chem. Phys. , 21, 6\nCrossRefSearch ADS open URL link  \nNazé Y., Rauw G., Hutsemékers D., 2012, A\u0026A , 538, A47\nCrossRefSearch ADS open URL link  \nNikutta R., 2012, PhD thesis , Univ. Kentucky. Available at: http://uknowledge.uky.edu/physastron_etds/8/\nNikutta R., Agliozzo C., 2016, rnikutta/rhocube: 1.0.1 . Available at: https://doi.org/10.5281/zenodo.160465\nOchsenbein F., Bauer P., Marcout J., 2000, A\u0026AS , 143, 23\nCrossRefSearch ADS open URL link  \nOskinova L. M., Hamann W.-R., Feldmeier A., 2007, A\u0026A , 476, 1331\nCrossRefSearch ADS open URL link  \nPanagia N., Felli M., 1975, A\u0026A , 39, 1\nParon S., Combi J. A., Petriella A., Giacani E., 2012, A\u0026A , 543, A23\nCrossRefSearch ADS open URL link  \nPasquali A., Langer N., Schmutz W., Leitherer C., Nota A., Hubeny I., Moffat A. F. J., 1997, ApJ , 478, 340\nCrossRefSearch ADS open URL link  \nPasquali A., Nota A., Clampin M., 1999, A\u0026A , 343, 536\nPauldrach A. W. A., Puls J., 1990, A\u0026A , 237, 409\nPottasch S. R., 1984, Astrophys. Space Sci. Libr. , 107, 335\nSault R. J., Teuben P. J., Wright M. C. H., 1995, in Shaw R. A., Payne H. E., Hayes J.J.E., ASP Conf. Ser. Vol. 77, Astronomical Data Analysis Software and Systems IV . Astron. Soc. Pac., San Francisco, p. 433\nSchaller G., Schaerer D., Meynet G., Maeder A., 1992, A\u0026AS , 96, 269\nSmith N., Owocki S. P., 2006, ApJ , 645, L45\nCrossRefSearch ADS open URL link  \nSmith L. J., Nota A., Pasquali A., Leitherer C., Clampin M., Crowther P. A., 1998, ApJ , 503, 278\nCrossRefSearch ADS open URL link  \nStahl O., 1986, A\u0026A , 164, 321\nTrotta R., 2008, Contemp. Phys. , 49, 71\nCrossRefSearch ADS open URL link  \nUeta T., Meixner M., Dayal A., Deutsch L. K., Fazio G. G., Hora J. L., Hoffmann W. F., 2001, ApJ , 548, 1020\nCrossRefSearch ADS open URL link  \nUmana G., Buemi C. S., Trigilio C., Leto P., 2005, A\u0026A , 437, L1\nCrossRefSearch ADS open URL link  \nUmana G., Buemi C. S., Trigilio C., Leto P., Hora J. L., 2010, ApJ , 718, 1036\nCrossRefSearch ADS open URL link  \nUmana G., Buemi C. S., Trigilio C., Leto P., Hora J. L., Fazio G., 2011a, Bull. Soc. R. Sci. Liege , 80, 335\nUmana G., Buemi C. S., Trigilio C., Leto P., Agliozzo C., Ingallinera A., Noriega-Crespo A., Hora J. L., 2011b, ApJ , 739, L11\nCrossRefSearch ADS open URL link  \nUmana G.et al, 2012, MNRAS , 427, 2975\nCrossRefSearch ADS open URL link  \nVamvatira-Nakou C., Hutsemékers D., Royer P., Nazé Y., Magain P., Exter K., Waelkens C., Groenewegen M. A. T., 2013, A\u0026A , 557, A20\nCrossRefSearch ADS open URL link  \nVamvatira-Nakou C., Hutsemékers D., Royer P., Cox N. L. J., Nazé Y., Rauw G., Waelkens C., Groenewegen M. A. T., 2015, A\u0026A , 578, A108\nCrossRefSearch ADS open URL link  \nvan Genderen A. M., 2001, A\u0026A , 366, 508\nCrossRefSearch ADS open URL link  \nVink J. S., de Koter A., 2002, A\u0026A , 393, 543\nCrossRefSearch ADS open URL link  \nVink J. S., Gräfener G., 2012, ApJ , 751, L34\nCrossRefSearch ADS open URL link  \nVink J. S., de Koter A., Lamers H. J. G. L. M., 1999, A\u0026A , 350, 181\nVink J. S., de Koter A., Lamers H. J. G. L. M., 2000, A\u0026A , 362, 295\nWachter S., Mauerhan J., van Dyk S., Hoard D. W., Morris P., 2011, Bull. Soc. R. Sci. Liege , 80, 291\nWalborn N. R., 1977, ApJ , 215, 53\nCrossRefSearch ADS open URL link  \nWalborn N. R., 1982, ApJ , 256, 452\nCrossRefSearch ADS open URL link  \nWeis K., 2003, A\u0026A , 408, 205\nCrossRefSearch ADS open URL link  \nWeis K., 2008, in Hamann W.-R., Feldmeier A., Oskinova L. M., eds, Clumping in hot-star Winds . Universitatsverlag Potsdam, Potsdam, p. 183\nZacharias N., McCallon H. L., Kopan E., Cutri R. M., 2005, in Engvold O., ed., Highlights of Astronomy, Vol. 13 . Astron. Soc. Pac., San Francisco, p. 603"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"C. Agliozzo, R. Nikutta, G. Pignata, N. M. Phillips, A. Ingallinera, C. Buemi, G. Umana, P. Leto, C. Trigilio, A. Noriega-Crespo, R. Paladini, F. Bufano, F. Cavallaro; New ATCA, ALMA and VISIR observations of the candidate LBV SK -67 266 (S61): the nebular mass from modelling 3D density distributions. Mon Not R Astron Soc 2017; 466 (1): 213-227. doi: 10.1093/mnras/stw2986","other_numbering_system":null,"funders":[{"agency":"Fondo Nacional de Desarrollo Científico y Tecnológico (FONDECYT)","grant_number":"3150463"},{"agency":"Fondo Nacional de Desarrollo Científico y Tecnológico (FONDECYT)","grant_number":"3140436"},{"agency":"Iniciativa Científica Milenio del Ministerio de Economía, Fomento y Turismo Millennium Institute of Astrophysics (MAS)","grant_number":"IC120009"},{"agency":"Alma DataADS/JAO.ALMA","grant_number":"2013.1.00450.S"},{"agency":"NASA/JPL/Caltech","grant_number":""},{"agency":"NASA","grant_number":"NCC5-626"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Infrared Processing and Analysis Center (IPAC)"]}