{"title":"The engine behind (wall) turbulence: perspectives on scale interactions","uri":"","abstract":"Known structures and self-sustaining mechanisms of wall turbulence are reviewed and explored in the context of the scale interactions implied by the nonlinear advective term in the Navier–Stokes equations. The viewpoint is shaped by the systems approach provided by the resolvent framework for wall turbulence proposed by McKeon \u0026 Sharma (J. Fluid Mech., vol. 658, 2010, pp. 336–382), in which the nonlinearity is interpreted as providing the forcing to the linear Navier–Stokes operator (the resolvent). Elements of the structure of wall turbulence that can be uncovered as the treatment of the nonlinearity ranges from data-informed approximation to analysis of exact solutions of the Navier–Stokes equations (so-called exact coherent states) are discussed. The article concludes with an outline of the feasibility of extending this kind of approach to high-Reynolds-number wall turbulence in canonical flows and beyond.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251482","docid":251482,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1251036","fileid":1251036,"datasetid":"document","objectid":251482,"filename":"engine_behind_wall_turbulence_perspectives_on_scale_interactions.pdf","mime_type":"application/pdf","hash":"b0eda359a0ab7bb428f4276e789731f5","hash_type":"MD5","filesize":5206642,"mtime":"2017-04-28 20:28:04","url":"http://authors.library.caltech.edu/77061/1/engine_behind_wall_turbulence_perspectives_on_scale_interactions.pdf"}],"eprintid":77061,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"engine_behind_wall_turbulence_perspectives_on_scale_interactions.pdf","content":"published"}],"note":"© 2017 Cambridge University Press. \n\nPublished online: 24 March 2017. \n\nMany students and collaborators have contributed to the development of the approach to scale interactions that has been described here, and it is a pleasure to acknowledge them. The framework for resolvent analysis for turbulent flow was conceived in equal part by the author and A. Sharma of the University of Southampton, whose long-time and ongoing collaboration is gratefully acknowledged. Current and former group members D. Chung, S. Duvvuri, I. Jacobi, M. Luhar, R. Moarref, K. Rosenberg and T. Saxton-Fox advanced the development, as have collaborations and discussions with many colleagues and friends, most notably H. Blackburn, D. Goldstein, F. Gómez-Carrasco, M. Jovanovic, M. Rudman, P. Schmid and J. Tropp. I have particularly appreciated the input of the distinguished reviewers, which has significantly improved this article. The funding support of AFOSR and ONR for our work described herein is gratefully acknowledged.","id":77061,"rev_number":15,"userid":18,"eprint_dir":"disk0/00/07/70/61","datestamp":"2017-04-28 23:47:35","lastmod":"2017-06-01 20:29:17","status_changed":"2017-04-28 23:47:35","type":"article","metadata_visibility":"show","creators":[{"given":"B. J.","family":"McKeon","id":"McKeon-B-J","orcid":"0000-0003-4220-1583"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"turbulence modelling, turbulent boundary layers, turbulent flows","date":"2017-04","date_type":"published","publication":"Journal of Fluid Mechanics","volume":"817","number":"","pagerange":"Art. No. P1","id_number":"CaltechAUTHORS:20170428-132759772","refereed":true,"issn":"0022-1120","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-132759772","related_url":[{"url":"https://doi.org/10.1017/jfm.2017.115","type":"doi","description":"Article"}],"referencetext":["References\n\nAdrian, R. J. 2007 Vortex organization in wall turbulence. Phys. Fluids 19, 041301.\nAfzal, N. 1984 Mesolayer theory for turbulent flows. AIAA J. 22, 437–439.\ndel Álamo, J. C.  \u0026 Jiménez, J. 2006 Linear energy amplification in turbulent channels. J. Fluid Mech. 559, 205–213.\nBaars, W. J. , Talluru, K. M. , Hutchins, N.  \u0026 Marusic, I. 2015 Wavelet analysis of wall turbulence to study large-scale modulation of small scales. Exp. Fluids 56, 188.\nBeneddine, S. , Sipp, D. , Arnault, A. , Dandois, J.  \u0026 Lesshafft, L. 2016 Conditions for validity of mean flow stability analysis and application to the determination of coherent structures in a turbulent backward facing step flow. J. Fluid Mech. 798, 485–504.\nBourguignon, J.-L. 2013 Models of turbulent pipe flow. PhD thesis, California Institute of Technology.\nBourguignon, J.-L. , Sharma, A. S. , Tropp, J. A.  \u0026 McKeon, B. J. 2014 Compact representation of wall-bounded turbulence using compressive sampling. Phys. Fluids 26, 015109.\nBradshaw, P.  \u0026 Koh, Y. M. 1981 A note on Poisson’s equation for pressure in a turbulent flow. Phys. Fluids 24 (771), 241–258.\nBrandt, L. 2014 The lift-up effect: the linear mechanism behind transition and turbulence in shear flows. Eur. J. Mech. (B/Fluids) 47, 80–96.\nButler, K.  \u0026 Farrell, B. 1993 Optimal perturbations and streak spacing in wall-bounded turbulent shear flow. Phys. Fluids A 5, 774–777.\nCandes, E. J.  \u0026 Wakin, M. B. 2008 An introduction to compressive sampling. IEEE Signal Process. Mag. 25, 21–30.\nCess, R. D. 1958 A study of the literature on heat transfer in turbulent tube flow. Tech. Rep. 8-0529-R24. Westinghouse Research.\nChakraborty, P. , Balachandar, S.  \u0026 Adrian, R. J. 2005 On the relationships between local vortex identification schemes. J. Fluid Mech. 535, 189–214.\nChernyshenko, S. I.  \u0026 Baig, M. F. 2005 The mechanism of streak formation in near-wall turbulence. J. Fluid Mech. 544, 99–131.\nChernyshenko, S. I. , Cicca, G. M. , Iollo, A. , Smirnov, A. V. , Sandham, N. D.  \u0026 Hu, Z. W. 2006 Analysis of data on the relation between eddies and streaky structures in turbulent flows using the placebo method. Fluid Dyn. 41 (5), 772–783.\nCheung, L. C.  \u0026 Zaki, T. 2014 An exact representation of the nonlinear triad interaction terms in spectral space. J. Fluid Mech. 748, 175–188.\nChung, D.  \u0026 McKeon, B. J. 2010 Large-eddy simulation investigation of large-scale structures in a long channel flow. J. Fluid Mech. 661, 341–364.\nCossu, C. , Pujals, G.  \u0026 Depardon, S. 2009 Optimal transient growth and very large scale structures in turbulent boundary layers. J. Fluid Mech. 619, 79–94.\nDennis, D.  \u0026 Nickels, T. 2011a Experimental measurement of large-scale three-dimensional structures in a turbulent boundary layer. Part 1. Vortex packets. J. Fluid Mech. 673, 180–217.\nDennis, D.  \u0026 Nickels, T. 2011b Experimental measurement of large-scale three-dimensional structures in a turbulent boundary layer. Part 2. Long structures. J. Fluid Mech. 673, 218–244.\nDrazin, P. G.  \u0026 Reid, W. H. 2004 Hydrodynamic Stability, 2nd edn, Cambridge Mathematical Libraries. Cambridge University Press.\nDuggleby, A. , Ball, K. S. , Pail, M. R.  \u0026 Fischer, P. F. 2007 Dynamical eigenfunction decomposition of turbulent pipe flow. J. Turbul. 8 (43), 1–24.\nDuvvuri, S. 2016 Non-linear scale interactions in a forced turbulent boundary layer. PhD thesis, California Institute of Technology.\nDuvvuri, S.  \u0026 McKeon, B. J. 2015 Triadic scale interactions in a turbulent boundary layer. J. Fluid Mech. 767, R4.\nDuvvuri, S.  \u0026 McKeon, B. J. 2016 Non-linear interactions isolated through scale synthesis in experimental wall turbulence. Phys. Rev. Fluids 1 (3), 032401(R).\nEckhardt, B. , Faisst, H. , Schmiegel, A.  \u0026 Scheider, T. M. 2008 Dynamical systems and the transition to turbulence in linearly stable shear flows. Phil. Trans. R. Soc. Lond. A 366, 1297–1315.\nEllingsen, T.  \u0026 Palm, E. 1975 Stability of linear flow. Phys. Fluids 18, 487–488.\nFarrell, B.  \u0026 Ioannou, J. 1993 Stochastic forcing of the linearized Navier–Stokes equations. Phys. Fluids 5 (11), 2600–2609.\nFarrell, B. F.  \u0026 Ioannou, P. J. 1998 Perturbation structure and spectra in turbulent channel flow. Theor. Comput. Fluid Dyn. 11, 237–250.\nFarrell, B. F.  \u0026 Ioannou, P. J. 2012 Dynamics of streamwise rolls and streaks in turbulent wall-bounded shear flow. J. Fluid Mech. 708, 149–196.\nFarrell, B. F.  \u0026 Ioannou, P. J. 2014 Statistical state dynamics: a new perspective on turbulence in shear flow. arXiv:1412.8290v1.\nFarrell, B. F. , Ioannou, P. J. , Jiménez, J. , Constantinou, N. C. , Lozano-Duran, A.  \u0026 Nikolaidis, M. A. 2016 A statistical state dynamics-based study of the structure and mechanism of large-scale motions in plane Poiseuille flow. J. Fluid Mech. 809, 290–315.\nFlores, O.  \u0026 Jiménez, J. 2010 Hierarchy of minimal flow units in the logarithmic layer. Phys. Fluids 22, 071704.\nFosas de Pando, M. , Schmid, P. J.  \u0026 Sipp, D. 2015 Nonlinear model-order reduction for oscillator flows using POD-DEIM. In Proc. IUTAM 14, pp. 329–336. Elsevier.\nGanapathisubramani, B. , Hutchins, N. , Monty, J. O. , Chung, D.  \u0026 Marusic, I. 2012 Amplitude and frequency modulation in wall turbulence. J. Fluid Mech. 712, 61–91.\nGayme, D. F. , McKeon, B. J. , Papachristodolou, A. , Bamieh, B.  \u0026 Doyle, J. C. 2010 Streamwise constant model of turbulence in plane Couette flow. J. Fluid Mech. 665, 99–119.\nGibson, J. F. , Halcrow, J.  \u0026 Cvitanović, P. 2008 Visualizing the geometry of state space in plane Couette flow. J. Fluid Mech. 611, 107–130.\nGómez Carrasco, F. , Blackburn, H. , Rudman, M. , McKeon, B. , Luhar, M. , Moarref, R.  \u0026 Sharma, A. 2014 On the origin of frequency sparsity in direct numerical simulations of turbulent pipe flow. Phys. Fluids 26, 101703.\nGómez Carrasco, F. , Blackburn, H. , Rudman, M. , Sharma, A.  \u0026 McKeon, B. 2016a A reduced-order model of three-dimensional unsteady flow in a cavity based on the resolvent operator. J. Fluid Mech. 798, R2.\nGómez Carrasco, F. , Blackburn, H. , Rudman, M. , Sharma, A.  \u0026 McKeon, B. 2016b Streamwise-varying steady transpiration control in turbulent pipe flow. J. Fluid Mech. 796, 588–616.\nHalko, N. , Martinsson, P. G.  \u0026 Tropp, J. A. 2011 Finding structure with randomness: probabilistic algorithms for constructing approximate matrix decompositions. SIAM Rev. 53 (2), 217–288.\nHall, P.  \u0026 Sherwin, S. J. 2010 Streamwise vortices in shear flows: harbingers of transition and the skeleton of coherent structures. J. Fluid Mech. 661, 178–205.\nHall, P.  \u0026 Smith, F. T. 1991 On strongly nonlinear vortex/wave interactions in boundary-layer transition. J. Fluid Mech. 227, 641–666.\nHamilton, J. M. , Kim, J.  \u0026 Waleffe, F. 1995 Regeneration mechanisms of near-wall turbulence structures. J. Fluid Mech. 287, 317–348.\nHolmes, P. , Lumley, J. L.  \u0026 Berkooz, G. 1996 Turbulence, Coherent Structures, Dynamical Systems and Symmetry. Cambridge University Press.\nHoyas, S.  \u0026 Jiménez, J. 2006 Scaling of the velocity fluctuations in turbulent channels up to Ret  = 2003. Phys. Fluids 18 (1), 011702.\nHussain, A. K. M. F.  \u0026 Reynolds, W. C. 1970 The mechanics of an organized wave in turbulent shear flow. J. Fluid Mech. 41, 241–258.\nHutchins, N.  \u0026 Marusic, I. 2007 Large-scale influences in near-wall turbulence. Phil. Trans. R. Soc. Lond. A 365, 647–664.\nHwang, Y. 2015 Statistical structure of self-sustaining attached eddies in turbulent channel flow. J. Fluid Mech. 767, 254–289.\nHwang, Y.  \u0026 Cossu, C. 2010a Amplification of coherent streaks in the turbulent Couette flow: an input–output analysis at low Reynolds number. J. Fluid Mech. 643, 333–348.\nHwang, Y.  \u0026 Cossu, C. 2010b Linear non-normal energy amplification of harmonic and stochastic forcing in the turbulent channel flow. J. Fluid Mech. 664, 51–73.\nJacobi, I. 2012 Structure of the turbulent boundary layer under static and dynamic roughness perturbation. PhD thesis, California Institute of Technology.\nJacobi, I.  \u0026 McKeon, B. J. 2011 Dynamic roughness-perturbation of a turbulent boundary layer. J. Fluid Mech. 688, 258–296.\nJacobi, I.  \u0026 McKeon, B. J. 2013 Phase relationships between large and small scales in the turbulent boundary layer. Exp. Fluids 54, 1481.\nJeun, J. , Nichols, J. W.  \u0026 Jovanović, M. R. 2016 Input–output analysis of high-speed axisymmetric isothermal jet noise. Phys. Fluids 28 (4), 047101.\nJiménez, J. 2012 Cascades in wall-bounded turbulence. Annu. Rev. Fluid Mech. 44, 27–45.\nJiménez, J. 2015 Direct detection of linearized bursts in turbulence. Phys. Fluids 27, 065102.\nJiménez, J. , Kawahara, G. , Simens, M. P. , Nagata, M.  \u0026 Shiba, M. 2005 Characterization of near-wall turbulence in terms of equilibrium and ‘bursting’ solutions. Phys. Fluids 17, 015105.\nJiménez, J.  \u0026 Moin, P. 1991 The minimal flow unit in near-wall turbulence. J. Fluid Mech. 225, 213–240.\nJovanović, M. R.  \u0026 Bamieh, B. 2005 Componentwise energy amplification in channel flows. J. Fluid Mech. 534, 145–183.\nKawahara, G. , Uhlmann, M.  \u0026 van Veen, L. 2012 The significance of simple invariant solutions in turbulent flows. Annu. Rev. Fluid Mech. 44, 203–225.\nKim, J.  \u0026 Lim, J. 2000 A linear process in wall-bounded turbulent shear flows. Phys. Fluids 12 (8), 1885–1888.\nKlewicki, J. C. 2010 Reynolds number dependence, scaling, and dynamics of turbulent boundary layers. Trans. ASME J. Fluids Engng 132, 094001.\nKlewicki, J. C. , Fife, P. , Wei, T.  \u0026 McMurtry, P. 2007 A physical model of the turbulent boundary layer consonant with the mean momentum balance structure. Phil. Trans. R. Soc. Lond. A 365, 823–839.\nLandahl, M. 1967 A wave-guide model for turbulent shear flow. J. Fluid Mech. 29 (3), 441–459.\nLehew, J. , Guala, M.  \u0026 McKeon, B. J. 2011 A study of the three-dimensional spectral energy distribution in a zero pressure gradient turbulent boundary layer. Exp. Fluids 51 (4), 997–1012.\nLu, L.  \u0026 Papadakis, G. 2014 An iterative method for the computation of the response of linearised Navier–Stokes equations to harmonic forcing and application to forced cylinder wakes. Intl J. Numer. Meth. Fluids 74 (11), 794–817.\nLuhar, M. , Sharma, A. S.  \u0026 McKeon, B. J. 2014a On the structure and origin of pressure fluctuations in wall turbulence: predictions based on the resolvent analysis. J. Fluid Mech. 751, 38–70.\nLuhar, M. , Sharma, A. S.  \u0026 McKeon, B. J. 2014b Opposition control within the resolvent analysis framework. J. Fluid Mech. 749, 597–626.\nLuhar, M. , Sharma, A. S.  \u0026 McKeon, B. J. 2015 A framework for studying the effect of compliant surfaces on wall turbulence. J. Fluid Mech. 768, 415–441.\nMarston, J. B. , Chini, G. P.  \u0026 Tobias, S. M. 2016 Generalized quasilinear approximation: application to zonal jets. Phys. Rev. Lett. 116, 214501.\nMarusic, I. , Mathis, R.  \u0026 Hutchins, N. 2010 Predictive model for wall-bounded turbulent flow. Science 329, 193–196.\nMarusic, I. , Monty, J. P. , Hultmark, M.  \u0026 Smits, A. J. 2012 On the logarithmic region in wall turbulence. J. Fluid Mech. 716, R3.\nMaslowe, S. A. 1986 Critical layers in shear flows. Annu. Rev. Fluid Mech. 18 (1), 405–432.\nMathis, R. , Hutchins, N.  \u0026 Marusic, I. 2009 Large-scale amplitude modulation of the small-scale structures of turbulent boundary layers. J. Fluid Mech. 628, 311–337.\nMcKeon, B. J.  \u0026 Sharma, A. S. 2010 A critical layer model for turbulent pipe flow. J. Fluid Mech. 658, 336–382.\nMcKeon, B. J. , Sharma, A. S.  \u0026 Jacobi, I. 2010 Predicting structural and statistical features of wall turbulence. arXiv:1012-0426.\nMcKeon, B. J. , Sharma, A. S.  \u0026 Jacobi, I. 2013 Experimental manipulation of wall turbulence: a systems approach. Phys. Fluids 25, 031301.\nMeseguer, A.  \u0026 Trefethen, L. N. 2003 Linearized pipe flow to Reynolds number 107 . J. Comput. Phys. 186, 178–197.\nMetzger, M. M.  \u0026 Klewicki, J. C. 2001 A comparative study of near-wall turbulence in high and low Reynolds number boundary layers. Phys. Fluids 13, 692–701.\nMoarref, R. , Jovanović, M. R. , Sharma, A. S. , Tropp, J. A.  \u0026 McKeon, B. J. 2014 A low-order decomposition of turbulent channel flow via resolvent analysis and convex optimization. Phys. Fluids 26, 051701.\nMoarref, R. , Park, J. S. , Sharma, A. S. , Willis, A. P. , Graham, M.  \u0026 McKeon, B. J. 2015 Approximation of the exact traveling wave solutions in wall-bounded flows using resolvent modes. In International Symposium on Turbulence and Shear Flow Phenomena (TSFP-9), p. 3A–5, 1–6.\nMoarref, R. , Sharma, A. S. , Tropp, J. A.  \u0026 McKeon, B. J. 2013 Model-based scaling and prediction of the streamwise energy intensity in high-Reynolds number turbulent channels. J. Fluid Mech. 734, 275–316.\nMonty, J. P. , Hutchins, N. , Ng, H. C. H. , Marusic, I.  \u0026 Chong, M. S. 2009 A comparison of turbulent pipe, channel and boundary layer flows. J. Fluid Mech. 632, 431–442.\nNagata, M. 1990 Three-dimensional finite-amplitude solutions in plane Couette flow: bifurcation from infinity. J. Fluid Mech. 217, 519–527.\nNatrajan, V. K. , Wu, Y.  \u0026 Christensen, K. T. 2007 Spatial signatures of retrograde spanwise vortices in wall turbulence. J. Fluid Mech. 574, 155–167.\nPark, J. S.  \u0026 Graham, M. D. 2015 Exact coherent states and connections to turbulent dynamics in minimal channel flow. J. Fluid Mech. 782, 430–454.\nPerry, A. E. , Henbest, S.  \u0026 Chong, M. S. 1986 A theoretical and experimental study of wall turbulence. J. Fluid Mech. 195, 163–199.\nPope, S. B. 2000 Turbulent Flows. Cambridge University Press.\nReynolds, O. 1883 An experimental investigation of the circumstances which determine whether the motion of water shall be direct or sinuous, and the law of resistance in parallel channels. Phil. Trans. R. Soc. Lond. 174, 935–982.\nReynolds, W. C.  \u0026 Hussain, A. K. M. F. 1972 The mechanics of an organized wave in shear flow. Part 3. Theoretical models and comparisons with experiment. J. Fluid Mech. 54, 263–288.\nRosenberg, K. , Duvvuri, S. , Luhar, M. , McKeon, B. J. , Barnard, C. , Meloy, J.  \u0026 Sheplak, M. 2016 Deterministic wall turbulence? Phase relationships between velocity, wall-pressure, and wall-shear-stress in a forced turbulent boundary layer. AIAA Paper 2016-4396.\nRosenberg, K.  \u0026 McKeon, B. J. 2016 Modeling turbulent channel flow via the resolvent framework and optimization. In Proceedings of the XXIV International Conference on Theoretical and Applied Mechanics, 21–26 August 2016, Montreal, Canada.\nSaxton-Fox, T.  \u0026 McKeon, B. J. 2016 Scale interactions and 3D critical layers in wall-bounded turbulent flows. In Proceedings of the XXIV International Conference on Theoretical and Applied Mechanics, 21–26 August 2016, Montreal, Canada.\nSchmid, P. J. 2007 Nonmodal stability theory. Annu. Rev. Fluid Mech. 39, 129–162.\nSchmid, P. J.  \u0026 Henningson, D. S. 2001 Stability and Transition in Shear Flows. Springer.\nSchoppa, W.  \u0026 Hussain, F. 2002 Coherent structure generation in near-wall turbulence. J. Fluid Mech. 453, 57–108.\nSharma, A. , Moarref, R. , Luhar, M. , Goldstein, D.  \u0026 McKeon, B. J. 2014 Effects of a gain-based optimal forcing on turbulent channel flow. AIAA Paper 2014-1450.\nSharma, A. S.  \u0026 McKeon, B. J. 2013a Closing the loop: an explicit calculation of the nonlinearity in the resolvent formulation of wall turbulence. In 43rd AIAA Fluid Dynamics Conference. AIAA 2013-3118.\nSharma, A. S.  \u0026 McKeon, B. J. 2013b On coherent structure in wall turbulence. J. Fluid Mech. 728, 196–238.\nSharma, A. S. , Mezić, I.  \u0026 McKeon, B. J. 2016a On the correspondence between Koopman mode decomposition, resolvent mode decomposition, and invariant solutions of the Navier–Stokes equations. Phys. Rev. Fluids 1 (3), 032402(R).\nSharma, A. S. , Moarref, R.  \u0026 McKeon, B. J. 2089 Scaling and interaction of self-similar modes in models of high-Reynolds number wall turbulence. Phil. Trans. R. Soc. Lond. A 375, 20160089.\nSharma, A. S. , Moarref, R. , McKeon, B. J. , Park, J. S. , Graham, M.  \u0026 Willis, A. P. 2016b Low-dimensional representations of exact coherent states of the Navier–Stokes equations from the resolvent model of wall turbulence. Phys. Rev. E 93, 021102(R).\nde Silva, C. M. , Hutchins, N.  \u0026 Marusic, I. 2016 Uniform momentum zones in turbulent boundary layers. J. Fluid Mech. 786, 309–331.\nSirovich, L. , Ball, K. S.  \u0026 Keefe, L. R. 1990 Plane waves and structures in turbulent channel flow. Phys. Fluids A 2 (12), 2217–2226.\nSmits, A. J. , McKeon, B. J.  \u0026 Marusic, I. 2011 High Reynolds number wall turbulence. Annu. Rev. Fluid Mech. 43, 353–375.\nSreenivasan, K. R. 1988 A unified view of the origin and morphology of the turbulent boundary layer structure. In Turbulence Management and Relaminarisation; Proceedings of the IUTAM Symposium, Bangalore, India, January 13–23, 1987 (A89-10154 01-34), pp. 37–61. Springer.\nTalluru, K. M. , Baidya, R. , Hutchins, N.  \u0026 Marusic, I. 2014 Amplitude modulation of all three velocity components in turbulent boundary layers. J. Fluid Mech. 746, R1.\nTennekes, H.  \u0026 Lumley, J. L. 1999 A First Course in Turbulence. MIT.\nTheodorsen, T. 1952 Mechanism of turbulence. In Proc. 2nd Midwestern Conference on Fluid Mech., pp. 1–19. Ohio State University.\nThomas, V. L. , Farrell, B. F. , Ioannou, P. J.  \u0026 Gayme, D. F. 2015 A minimal model of self-sustaining turbulence. Phys. Fluids 27, 105104.\nTowne, A. , Colonius, T. , Jordan, P. , Cavalieri, A. V.  \u0026 Bres, G, A. 2015 Stochastic and nonlinear forcing of wavepackets in a Mach 0.9 jet. AIAA Paper 2015-2217.\nTownsend, A. A. 1956 The Structure of Turbulent Shear Flow. Cambridge University Press.\nTownsend, A. A. 1961 Equilibrium layers and wall turbulence. J. Fluid Mech. 11, 97–120.\nTownsend, A. A. 1976 The Structure of Turbulent Shear Flow. Cambridge University Press.\nTrefethen, L. N.  \u0026 Embree, M. 2005 Spectra and Pseudospectra: the Behavior of Nonnormal Matrices and Operators. Princeton University Press.\nTrefethen, L. N. , Trefethen, A. E. , Reddy, S.  \u0026 Driscoll, T. A. 1993 Hydrodynamic stability without eigenvalues. Science 261, 5121.\nWaleffe, F. 1991 The nature of triad interactions in homogeneous turbulence. Phys. Fluids 4 (2), 350–363.\nWaleffe, F. 1995 Transition in shear flows: non-linear normality versus non-normal linearity. Phys. Fluids 7, 3060–3066.\nWaleffe, F. 1997 On a self-sustaining process in shear flows. Phys. Fluids 9 (4), 883–900.\nWaleffe, F. 2001 Exact coherent structures in channel flow. J. Fluid Mech. 435, 93–102.\nWaleffe, F. 2003 Homotopy of exact coherent structures in plane shear flows. Phys. Fluids 15 (6), 1517–1534.\nWu, X.  \u0026 Moin, P. 2008 A direct numerical simulation study on the mean velocity characteristics in pipe flow. J. Fluid Mech. 608, 81–112.\nZare, A. , Jovanović, M. R.  \u0026 Georgiou, T. T. 2017 Colour of turbulence. J. Fluid Mech. 812, 636–680."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Air Force Office of Scientific Research (AFOSR)","grant_number":""},{"agency":"Office of Naval Research (ONR)","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}