{"title":"Kepler-1649b: An Exo-Venus in the Solar Neighborhood","uri":"","abstract":"The Kepler mission has revealed that Earth-sized planets are common, and dozens have been discovered to orbit in or near their host star's habitable zone. A major focus in astronomy is to determine which of these exoplanets are likely to have Earth-like properties that are amenable to follow-up with both ground- and future space-based surveys, with an ultimate goal of probing their atmospheres to look for signs of life. Venus-like atmospheres will be of particular interest in these surveys. While Earth and Venus evolved to have similar sizes and densities, it remains unclear what factors led to the dramatic divergence of their atmospheres. Studying analogs to both Earth and Venus can thus shed light on the limits of habitability and the potential for life on known exoplanets. Here, we present the discovery and confirmation of Kepler-1649b, an Earth-sized planet orbiting a nearby M5V star that receives incident flux at a level similar to that of Venus. We present our methods for characterizing the star, using a combination of point-spread function photometry, ground-based spectroscopy, and imaging, to confirm the planetary nature of Kepler-1649b. Planets like Kepler-1649b will be prime candidates for atmospheric and habitability studies in the next generation of space missions.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251484","docid":251484,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1251059","fileid":1251059,"datasetid":"document","objectid":251484,"filename":"Angelo_2017_AJ_153_162.pdf","mime_type":"application/pdf","hash":"961ea3d5e4a8842594abeea7e579f234","hash_type":"MD5","filesize":1930404,"mtime":"2017-04-28 20:52:39","url":"http://authors.library.caltech.edu/77063/1/Angelo_2017_AJ_153_162.pdf"}],"eprintid":77063,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Angelo_2017_AJ_153_162.pdf","content":"published"}],"note":"© 2017 The American Astronomical Society. \n\nReceived 2016 October 25; revised 2017 February 13; accepted 2017 February 15; published 2017 March 17. \n\nJ.F.R. acknowledges NASA grants NNX12AD21G and NNX14AB82G issued through the Kepler Participating Scientist Program. The research presented in this paper includes data collected by the Kepler mission. This research has made use of the NASA Exoplanet Archive, which is operated by the California Institute of Technology, under contract with the National Aeronautics and Space Administration under the Exoplanet Exploration Program. Data from the Mikulski Archive for Space Telescopes (MAST) were used for this research as well. Data reduction was done using Image Reduction and Analysis Facility (IRAF) routines. E.V.Q. was supported by an appointment to a NASA Postdoctoral Program Senior Fellowship at NASA Ames Research Center, administered by Universities Space Research Association under contract with NASA. B.B. acknowledges financial support from the European Commission in the form of a Marie Curie International Outgoing Fellowship (PIOF-GA-2013-629435). Some of the data presented herein were obtained at the W. M. Keck Observatory, which is operated as a scientific partnership among the California Institute of Technology, the University of California, and the National Aeronautics and Space Administration. The Observatory was made possible by the generous financial support of the W. M. Keck Foundation. The authors wish to recognize and acknowledge the very significant cultural role and reverence that the summit of MaunaKea has always had within the indigenous Hawaiian community. We are most fortunate to have the opportunity to conduct observations from this mountain.","id":77063,"rev_number":7,"userid":18,"eprint_dir":"disk0/00/07/70/63","datestamp":"2017-04-28 20:58:51","lastmod":"2017-04-28 20:58:51","status_changed":"2017-04-28 20:58:51","type":"article","metadata_visibility":"show","creators":[{"given":"Isabel","family":"Angelo","id":"Angelo-I","orcid":""},{"given":"Jason F.","family":"Rowe","id":"Rowe-J-F","orcid":""},{"given":"Steve B.","family":"Howell","id":"Howell-S-B","orcid":""},{"given":"Elisa V.","family":"Quintana","id":"Quintana-E-V","orcid":""},{"given":"Martin","family":"Still","id":"Still-M","orcid":""},{"given":"Andrew W.","family":"Mann","id":"Mann-A-W","orcid":""},{"given":"Ben","family":"Burningham","id":"Burningham-B","orcid":""},{"given":"Thomas","family":"Barclay","id":"Barclay-T","orcid":""},{"given":"David R.","family":"Ciardi","id":"Ciardi-D-R","orcid":"0000-0002-5741-3047"},{"given":"Daniel","family":"Huber","id":"Huber-D","orcid":""},{"given":"Stephen R.","family":"Kane","id":"Kane-S-R","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"planets and satellites: terrestrial planets","date":"2017-04","date_type":"published","publication":"Astronomical Journal","volume":"153","number":"4","pagerange":"Art. No. 162","id_number":"CaltechAUTHORS:20170428-135234891","refereed":true,"issn":"1538-3881","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-135234891","related_url":[{"url":"https://doi.org/10.3847/1538-3881/aa615f","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-3881/aa615f/meta","type":"pub","description":"Article"}],"referencetext":["Allard F., Homeier D. and Freytag B. 2011 ASP Conf. Ser. 448, 16th Cambridge Workshop on Cool Stars, Stellar Systems, and the Sun ed C. Johns-Krull, M. K. Browning and A. A. West (San Francisco, CA: ASP) 91\nADS  \n\n\nBaraffe I., Chabrier G., Barman T. S., Allard F. and Hauschildt P. H. 2003 A\u0026A 402 701\nCrossrefADS  \n\n\nBarclay T., Burke C. J., Howell S. B. et al 2013a ApJ 768 101\nIOPscienceADS  \n\n\nBarclay T., Rowe J. F., Lissauer J. J. et al 2013b Natur 494 452\nCrossrefADS  \n\n\nBarnes R., Mullins K., Goldblatt C. et al 2013 AsBio 13 225\nCrossrefADS  \n\n\nBarstow J. K., Aigrain S., Irwin P. G. J., Kendrew S. and Fletcher L. N. 2016 MNRAS arXiv:1602.08277\nPreprint  \n\n\nBatalha N. M., Borucki W. J., Koch D. G. et al 2010 ApJL 713 L109\nIOPscienceADS  \n\n\nBatalha N. M., Rowe J. F., Bryson S. T. et al 2013 ApJS 204 24\nIOPscienceADS  \n\n\nBerta Z. K., Irwin J. and Charbonneau D. 2013 ApJ 775 91\nIOPscienceADS  \n\n\nBorucki W. J., Agol E., Fressin F. et al 2013 Sci 340 587\nCrossrefADS  \n\n\nBorucki W. J., Koch D., Basri G. et al 2010 Sci 327 977\nCrossrefADS  \n\n\nBoyajian T. S., von Braun K., van Belle G. et al 2012 ApJ 757 112\nIOPscienceADS  \n\n\nBrown T. M., Latham D. W., Everett M. E. and Esquerdo G. A. 2011 arXiv:1102.0342\nPreprint\n\n\nBryson S. T., Jenkins J. M., Gilliland R. L. et al 2013 PASP 125 889\nIOPscienceADS  \n\n\nBryson S. T., Jenkins J. M., Klaus T. C. et al 2010 Proc. SPIE 7740 77401D\nCrossrefADS  \n\n\nBurke C. J., Bryson S. T., Mullally F. et al 2014 ApJS 210 19\nIOPscienceADS  \n\n\nChaplin W. J., Sanchis-Ojeda R., Campante T. L. et al 2013 ApJ 766 101\nIOPscienceADS  \n\n\nChristiansen J. L., Jenkins J. M., Caldwell D. A. et al 2012 PASP 124 1279\nIOPscienceADS  \n\n\nDemory B.-O., Queloz D., Alibert Y., Gillen E. and Gillon M. 2016 ApJL 825 L25\nIOPscienceADS  \n\n\ndi Stefano R. 2012 ApJS 201 20\nIOPscienceADS  \n\n\nDotter A., Chaboyer B., Jevremovič D. et al 2008 ApJS 178 89\nIOPscienceADS  \n\n\nEhrenreich D., Vidal-Madjar A., Widemann T. et al 2012 A\u0026A 537 L2\nCrossrefADS  \n\n\nEverett M. E., Howell S. B. and Kinemuchi K. 2012 PASP 124 316\nIOPscienceADS  \n\n\nEverett M. E., Howell S. B., Silva D. R. and Szkody P. 2013 ApJ 771 107\nIOPscienceADS  \n\n\nFord E. B. 2005 AJ 129 1706\nIOPscienceADS  \n\n\nGaidos E., Mann A. W., Kraus A. L. and Ireland M. 2016 MNRAS 457 2877\nCrossrefADS  \n\n\nGreene T. P., Line M. R., Montero C. et al 2016 ApJ 817 17\nIOPscienceADS  \n\n\nGregory P. C. 2011 MNRAS 410 94\nCrossrefADS  \n\n\nGreiss S., Steeghs D., Gänsicke B. T. et al 2012 AJ 144 24\nIOPscienceADS  \n\n\nHorch E. P., Howell S. B., Everett M. E. and Ciardi D. R. 2012 AJ 144 165\nIOPscienceADS  \n\n\nHorch E. P., Howell S. B., Everett M. E. and Ciardi D. R. 2014 ApJ 795 60\nIOPscienceADS  \n\n\nHowell S. B., Rowe J. F., Bryson S. T. et al 2012 ApJ 746 123\nIOPscienceADS  \n\n\nHuber D., Chaplin W. J., Christensen-Dalsgaard J. et al 2013 ApJ 767 127\nIOPscienceADS  \n\n\nHuber D., Silva Aguirre V., Matthews J. M. et al 2014 ApJS 211 2\nIOPscienceADS  \n\n\nJenkins J. M., Caldwell D. A. and Borucki W. J. 2002 ApJ 564 495\nIOPscienceADS  \n\n\nKane S. R., Barclay T. and Gelino D. M. 2013 ApJL 770 L20\nIOPscienceADS  \n\n\nKane S. R. and Gelino D. M. 2013 ApJ 762 129\nIOPscienceADS  \n\n\nKane S. R., Kopparapu R. K. and Domagal-Goldman S. D. 2014 ApJL 794 L5\nIOPscienceADS  \n\n\nLépine S. and Shara M. M. 2005 AJ 129 1483\nIOPscienceADS  \n\n\nMandel K. and Agol E. 2002 ApJL 580 L171\nIOPscienceADS  \n\n\nMann A. W., Brewer J. M., Gaidos E., Lépine S. and Hilton E. J. 2013a AJ 145 52\nIOPscienceADS  \n\n\nMann A. W., Feiden G. A., Gaidos E., Boyajian T. and von Braun K. 2015 ApJ 804 64\nIOPscienceADS  \n\n\nMann A. W., Gaidos E. and Ansdell M. 2013b ApJ 779 188\nIOPscienceADS  \n\n\nQuintana E. V., Barclay T., Raymond S. N. et al 2014 Sci 344 277\nCrossrefADS  \n\n\nRappaport S., Barclay T., DeVore J. et al 2014 ApJ 784 40\nIOPscienceADS  \n\n\nReid I. N., Brewer C., Brucato R. J. et al 1991 PASP 103 661\nIOPscienceADS  \n\n\nRicker G. R., Winn J. N., Vanderspek R. et al 2014 Proc. SPIE 9143 914320\nCrossrefADS  \n\n\nRogers L. A. 2015 ApJ 801 41\nIOPscienceADS  \n\n\nRowe J. F., Bryson S. T., Marcy G. W. et al 2014 ApJ 784 45\nIOPscienceADS  \n\n\nRowe J. F., Coughlin J. L., Antoci V. et al 2015 arXiv:1501.07286\nPreprint\n\n\nSmith J. C., Stumpe M. C., van Cleve J. E. et al 2012 PASP 124 1000\nIOPscienceADS  \n\n\nStassun K. G., Collins K. A. and Gaudi B. S. 2016 arXiv:1609.04389\nPreprint\n\n\nStill M. and Barclay T. 2012 Astrophysics Source Code Library PyKE: Reduction and analysis of Kepler Simple Aperture Photometry data, ascl:1208.004\n  \n\n\nStumpe M. C., Smith J. C., Catanzarite J. H. et al 2014 PASP 126 100\nIOPscienceADS  \n\n\nStumpe M. C., Smith J. C., van Cleve J. E. et al 2012 PASP 124 985\nIOPscienceADS  \n\n\nTeske J. K., Ghezzi L., Cunha K. et al 2015 ApJL 801 L10\nIOPscienceADS  \n\n\nTorres G., Kipping D. M., Fressin F. et al 2015 ApJ 800 99\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Isabel Angelo et al 2017 AJ 153 162","other_numbering_system":null,"funders":[{"agency":"NASA","grant_number":"NNX12AD21G"},{"agency":"NASA","grant_number":"NNX14AB82G"},{"agency":"NASA Postdoctoral Program","grant_number":""},{"agency":"Marie Curie Fellowship","grant_number":"PIOF-GA-2013-629435"},{"agency":"W. M. Keck Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Infrared Processing and Analysis Center (IPAC)"]}