{"title":"Sharp constants in several inequalities on the Heisenberg group","uri":"","abstract":"We derive the sharp constants for the inequalities on the Heisenberg group H^n whose analogues on Euclidean space R^n are the well known Hardy-Littlewood-Sobolev inequalities. Only one special case had been known previously, due to Jerison-Lee more than twenty years ago. From these inequalities we obtain the sharp constants for their duals, which are the Sobolev inequalities for the Laplacian and conformally invariant fractional Laplacians. By considering limiting cases of these inequalities sharp constants for the analogues of the Onofri and log-Sobolev inequalities on H^n are obtained. The methodology is completely different from that used to obtain the R^n inequalities and can be (and has been) used to give a new, rearrangement free, proof of the HLS inequalities.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251504","docid":251504,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1251221","fileid":1251221,"datasetid":"document","objectid":251504,"filename":"1009.1410.pdf","mime_type":"application/pdf","hash":"ad823838aa1172ef5187d29b1e5328e3","hash_type":"MD5","filesize":371412,"mtime":"2017-05-01 13:44:21","url":"http://authors.library.caltech.edu/77077/1/1009.1410.pdf"}],"eprintid":77077,"pos":1,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1009.1410.pdf","content":"submitted"},{"id":"http://authors.library.caltech.edu/id/document/251550","docid":251550,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1251580","fileid":1251580,"datasetid":"document","objectid":251550,"filename":"annals-v176-n1-p06-p.pdf","mime_type":"application/pdf","hash":"91a924b3c3a6358f065e4dffab6926b5","hash_type":"MD5","filesize":567542,"mtime":"2017-05-01 19:55:11","url":"http://authors.library.caltech.edu/77077/2/annals-v176-n1-p06-p.pdf"}],"eprintid":77077,"pos":2,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"annals-v176-n1-p06-p.pdf","content":"published"}],"note":"© 2011 by the authors. This paper may be reproduced, in its entirety, for non-commercial purposes. \n\nReceived: 8 March 2010; Accepted: 16 November 2011; Published online: 1 July 2012. \n\nSupport by U.S. NSF grant PHY 1068285 (R.L.F.) and PHY 0965859 (E.H.L.) is gratefully acknowledged.","id":77077,"rev_number":19,"userid":772,"eprint_dir":"disk0/00/07/70/77","datestamp":"2017-05-01 16:25:08","lastmod":"2017-05-01 20:02:08","status_changed":"2017-05-01 20:02:08","type":"article","metadata_visibility":"show","creators":[{"given":"Rupert L.","family":"Frank","id":"Frank-R-L","orcid":""},{"given":"Elliott H.","family":"Lieb","id":"Lieb-E-H","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Hardy-Littlewood-Sobolev inequality, Heisenberg group, sharp constants\t","date":"2012-01","date_type":"published","publication":"Annals of Mathematics","volume":"176","number":"1","pagerange":"349-381","id_number":"CaltechAUTHORS:20170501-064349426","refereed":true,"issn":"0003-486X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170501-064349426","related_url":[{"url":"http://dx.doi.org/10.4007/annals.2012.176.1.6","type":"doi","description":"Article"},{"url":"http://annals.math.princeton.edu/2012/176-1/p06","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1009.1410","type":"arxiv","description":"Discussion Paper"}],"referencetext":["\n[AbSt] Handbook of Mathematical Functions with Formulas, Graphs, and Mathematical Tables, Abramowitz, M. and Stegun, I. A., Eds., New York: Dover Publications, 1992.\nShow bibtex\n[BaGa]  Go to document H. Bahouri and I. Gallagher, \"The heat kernel and frequency localized functions on the Heisenberg group,\" in Advances in Phase Space Analysis of Partial Differential Equations, Boston, MA: Birkhäuser, 2009, vol. 78, pp. 17-35.\nShow bibtex\n[BaGeXu]  Go to document H. Bahouri, P. Gérard, and C. Xu, \"Espaces de Besov et estimations de Strichartz généralisées sur le groupe de Heisenberg,\" J. Anal. Math., vol. 82, pp. 93-118, 2000.\nShow bibtex\n[Be1]  Go to document W. Beckner, \"Sobolev inequalities, the Poisson semigroup, and analysis on the sphere SnSn,\" Proc. Nat. Acad. Sci. U.S.A., vol. 89, iss. 11, pp. 4816-4819, 1992.\nShow bibtex\n[Be2]  Go to document W. Beckner, \"Sharp Sobolev inequalities on the sphere and the Moser-Trudinger inequality,\" Ann. of Math., vol. 138, iss. 1, pp. 213-242, 1993.\nShow bibtex\n[BiVe]  Go to document M. Bidaut-Véron and L. Véron, \"Nonlinear elliptic equations on compact Riemannian manifolds and asymptotics of Emden equations,\" Invent. Math., vol. 106, iss. 3, pp. 489-539, 1991.\nShow bibtex\n[BrFoMo] T. P. Branson, L. Fontana, and C. Morpurgo, Moser-Trudinger and Beckner-Onofri’s inequalities on the CR sphere, 2007.\nShow bibtex\n[BrLi]  Go to document H. Brézis and E. Lieb, \"A relation between pointwise convergence of functions and convergence of functionals,\" Proc. Amer. Math. Soc., vol. 88, iss. 3, pp. 486-490, 1983.\nShow bibtex\n[CaDaPaTy] L. Capogna, D. Danielli, S. D. Pauls, and J. T. Tyson, An Introduction to the Heisenberg Group and the Sub-Riemannian Isoperimetric Problem, Basel: Birkhäuser, 2007, vol. 259.\nShow bibtex\n[CaLo]  Go to document E. A. Carlen and M. Loss, \"Extremals of functionals with competing symmetries,\" J. Funct. Anal., vol. 88, iss. 2, pp. 437-456, 1990.\nShow bibtex\n[CaLo2]  Go to document E. A. Carlen and M. Loss, \"Competing symmetries, the logarithmic HLS inequality and Onofri’s inequality on SnSn,\" Geom. Funct. Anal., vol. 2, iss. 1, pp. 90-104, 1992.\nShow bibtex\n[ChYa]  Go to document S. A. Chang and P. C. Yang, \"Prescribing Gaussian curvature on S2S2,\" Acta Math., vol. 159, iss. 3-4, pp. 215-259, 1987.\nShow bibtex\n[CoLu1]  Go to document W. S. Cohn and G. Lu, \"Best constants for Moser-Trudinger inequalities on the Heisenberg group,\" Indiana Univ. Math. J., vol. 50, iss. 4, pp. 1567-1591, 2001.\nShow bibtex\n[CoLu2]  Go to document W. S. Cohn and G. Lu, \"Sharp constants for Moser-Trudinger inequalities on spheres in complex space ℂnCn,\" Comm. Pure Appl. Math., vol. 57, iss. 11, pp. 1458-1493, 2004.\nShow bibtex\n[Co]  Go to document M. Cowling, \"Unitary and uniformly bounded representations of some simple Lie groups,\" in Harmonic Analysis and Group Representations, Naples: Liguori, 1982, pp. 49-128.\nShow bibtex\n[Fo] G. B. Folland, \"Spherical harmonic expansion of the Poisson-Szegő kernel for the ball,\" Proc. Amer. Math. Soc., vol. 47, pp. 401-408, 1975.\nShow bibtex\n[FoSt]  Go to document G. B. Folland and E. M. Stein, \"Estimates for the ∂¯b∂¯b complex and analysis on the Heisenberg group,\" Comm. Pure Appl. Math., vol. 27, pp. 429-522, 1974.\nShow bibtex\n[FrLi]  Go to document R. L. Frank and E. H. Lieb, \"Inversion positivity and the sharp Hardy-Littlewood-Sobolev inequality,\" Calc. Var. Partial Differential Equations, vol. 39, iss. 1-2, pp. 85-99, 2010.\nShow bibtex\n[FrLi2]  Go to document R. L. Frank and E. H. Lieb, \"A new, rearrangement-free proof of the sharp Hardy-Littlewood-Sobolev inequality,\" in Spectral Theory, Function Spaces and Inequalities, et al. Brown, B. M., Ed., Basel: Birkhäuser, 2012, vol. 219, pp. 55-67.\nShow bibtex\n[GaVa]  Go to document N. Garofalo and D. Vassilev, \"Symmetry properties of positive entire solutions of Yamabe-type equations on groups of Heisenberg type,\" Duke Math. J., vol. 106, iss. 3, pp. 411-448, 2001.\nShow bibtex\n[Ga]  Go to document B. Gaveau, \"Principe de moindre action, propagation de la chaleur et estimées sous elliptiques sur certains groupes nilpotents,\" Acta Math., vol. 139, iss. 1-2, pp. 95-153, 1977.\nShow bibtex\n[Ge]  Go to document P. Gérard, \"Description du défaut de compacité de l’injection de Sobolev,\" ESAIM Control Optim. Calc. Var., vol. 3, pp. 213-233, 1998.\nShow bibtex\n[HaLi1]  Go to document G. H. Hardy and J. E. Littlewood, \"Some properties of fractional integrals. I,\" Math. Z., vol. 27, iss. 1, pp. 565-606, 1928.\nShow bibtex\n[HaLi2]  Go to document G. H. Hardy and J. E. Littlewood, \"Notes on the theory of series (XII): On certain inequalities connected with the calculus of variations,\" J. London Math. Soc., vol. 5, pp. 34-39, 1930.\nShow bibtex\n[He] J. Hersch, \"Quatre propriétés isopérimétriques de membranes sphériques homogènes,\" C. R. Acad. Sci. Paris Sér. A-B, vol. 270, p. a1645-a1648, 1970.\nShow bibtex\n[Hu] A. Hulanicki, \"The distribution of energy in the Brownian motion in the Gaussian field and analytic-hypoellipticity of certain subelliptic operators on the Heisenberg group,\" Studia Math., vol. 56, iss. 2, pp. 165-173, 1976.\nShow bibtex\n[JeLe1]  Go to document D. Jerison and J. M. Lee, \"The Yamabe problem on CR manifolds,\" J. Differential Geom., vol. 25, iss. 2, pp. 167-197, 1987.\nShow bibtex\n[JeLe]  Go to document D. Jerison and J. M. Lee, \"Extremals for the Sobolev inequality on the Heisenberg group and the CR Yamabe problem,\" J. Amer. Math. Soc., vol. 1, iss. 1, pp. 1-13, 1988.\nShow bibtex\n[JoWa]  Go to document K. D. Johnson and N. R. Wallach, \"Composition series and intertwining operators for the spherical principal series. I,\" Trans. Amer. Math. Soc., vol. 229, pp. 137-173, 1977.\nShow bibtex\n[KiVi]  Go to document R. Killip and M. Visan, Nonlinear Schrödinger equations at critical regularity.\nShow bibtex\n[Li]  Go to document E. H. Lieb, \"Sharp constants in the Hardy-Littlewood-Sobolev and related inequalities,\" Ann. of Math., vol. 118, iss. 2, pp. 349-374, 1983.\nShow bibtex\n[LiLo] E. H. Lieb and M. Loss, Analysis, Second ed., Providence, RI: Amer. Math. Soc., 2001, vol. 14.\nShow bibtex\n[GeMeOr] P. Gerard, Y. Meyer, and F. Oru, \"Inégalités de Sobolev précisées,\" in Séminaire sur les Équations aux Dérivées Partielles, 1996–1997, Palaiseau: École Polytech., 1997, p. x.\nShow bibtex\n[MuRiSt]  Go to document D. Müller, F. Ricci, and E. M. Stein, \"Marcinkiewicz multipliers and multi-parameter structure on Heisenberg (-type) groups. I,\" Invent. Math., vol. 119, iss. 2, pp. 199-233, 1995.\nShow bibtex\n[On]  Go to document E. Onofri, \"On the positivity of the effective action in a theory of random surfaces,\" Comm. Math. Phys., vol. 86, iss. 3, pp. 321-326, 1982.\nShow bibtex\n[OsPhSa]  Go to document B. Osgood, R. Phillips, and P. Sarnak, \"Extremals of determinants of Laplacians,\" J. Funct. Anal., vol. 80, iss. 1, pp. 148-211, 1988.\nShow bibtex\n[So] S. L. Sobolev, \"On a theorem of functional analysis,\" Mat. Sb. (N.S.), vol. 4, pp. 471-479, 1938.\nShow bibtex\n[St] E. M. Stein, Harmonic Analysis: Real-Variable Methods, Orthogonality, and Oscillatory Integrals, Princeton, NJ: Princeton Univ. Press, 1993.\nShow bibtex\n[StWe] E. M. Stein and G. Weiss, Introduction to Fourier Analysis on Euclidean Spaces, Princeton, N.J.: Princeton Univ. Press, 1971, vol. 32.\nShow bibtex\n[ViKl] J. N. Vilenkin and A. U. Klimyk, Representation of Lie Groups and Special Functions. Vol. 2, Class I representations, special functions, and integral transforms,, Dordrecht: Kluwer Academic Publishers Group, 1993, vol. 74."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"PHY-1068285"},{"agency":"NSF","grant_number":"PHY-0965859"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}