{"title":"Spectral cluster bounds for orthonormal systems and oscillatory integral operators in Schatten spaces","uri":"","abstract":"We generalize the L^p spectral cluster bounds of Sogge for the Laplace-Beltrami operator on compact Riemannian manifolds to systems of orthonormal functions. The optimality of these new bounds is also discussed. These spectral cluster bounds follow from Schatten-type bounds on oscillatory integral operators.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251499","docid":251499,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1251157","fileid":1251157,"datasetid":"document","objectid":251499,"filename":"1608.08299.pdf","mime_type":"application/pdf","hash":"8e43a0d7bed401747ff5c641dcf70881","hash_type":"MD5","filesize":379169,"mtime":"2017-04-28 22:52:22","url":"http://authors.library.caltech.edu/77072/1/1608.08299.pdf"}],"eprintid":77072,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1608.08299.pdf","content":"submitted"}],"note":"Partial support by U.S. National Science Foundation DMS-1363432 (R.L.F.) is acknowledged. J.S. would like to thank Nicolas Burq and Bernard Helffer for useful discussions.","id":77072,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/70/72","datestamp":"2017-04-28 23:46:56","lastmod":"2017-04-28 23:46:56","status_changed":"2017-04-28 23:46:56","type":"monograph","metadata_visibility":"show","creators":[{"given":"Rupert L.","family":"Frank","id":"Frank-R-L","orcid":""},{"given":"Julien","family":"Sabin","id":"Sabin-J","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2016-08-30","date_type":"submitted","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170428-155217715","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170428-155217715","related_url":[{"url":"https://arxiv.org/abs/1608.08299","type":"arxiv","description":"Discussion Paper"}],"referencetext":["[1] M. Abramowitz and I. A. Stegun, Handbook of mathematical functions with formulas, graphs, and\nmathematical tables, vol. 55 of National Bureau of Standards Applied Mathematics Series, For sale by\nthe Superintendent of Documents, U.S. Government Printing Office, Washington, D.C., 1964.\n[2] V. G. Avakumovi´c, ¨Uber die Eigenfunktionen auf geschlossenen Riemannschen Mannigfaltigkeiten,\nMath. Z., 65 (1956), pp. 327–344.\n[3] N. Burq, P. G´erard, and N. Tzvetkov, Restrictions of the Laplace-Beltrami eigenfunctions to\nsubmanifolds, Duke Math. J., 138 (2007), pp. 445–486.\n[4] L. Carleson and P. Sj¨olin, Oscillatory integrals and a multiplier problem for the disc, Studia Math.,\n44 (1972), pp. 287–299. (errata insert). Collection of articles honoring the completion by Antoni Zyg-\nmund of 50 years of scientific activity, III.\n[5] D. Dos Santos Ferreira, C. E. Kenig, and M. Salo, On Lp resolvent estimates for Laplace-\nBeltrami operators on compact manifolds, Forum Math., 26 (2014), pp. 815–849.\n[6] M. V. Fedoryuk, Asymptotic analysis, Springer-Verlag, Berlin, 1993. Linear ordinary differential\nequations, Translated from the Russian by Andrew Rodick.\n[7] R. L. Frank, M. Lewin, E. H. Lieb, and R. Seiringer, Strichartz inequality for orthonormal\nfunctions, J. Eur. Math. Soc. (JEMS), 16 (2014), pp. 1507–1526.\n[8] R. L. Frank and J. Sabin, Restriction theorems for orthonormal functions, Strichartz inequalities,\nand uniform Sobolev estimates, Amer. J. Math, (2016). To appear.\n[9] J. Fr¨ohlich, E. H. Lieb, and M. Loss, Stability of Coulomb systems with magnetic fields. I. The\none-electron atom, Comm. Math. Phys., 104 (1986), pp. 251–270.\n[10] S. W. Graham and G. Kolesnik, van der Corput’s method of exponential sums, vol. 126 of London\nMathematical Society Lecture Note Series, Cambridge University Press, Cambridge, 1991.\n[11] L. H¨ormander, The spectral function of an elliptic operator, Acta Math., 121 (1968), pp. 193–218.\n[12] , Oscillatory integrals and multipliers on FLp, Ark. Mat., 11 (1973), pp. 1–11.\n[13] , The analysis of linear partial differential operators. III, Classics in Mathematics, Springer, Berlin,\n2007. Pseudo-differential operators, Reprint of the 1994 edition.\n[14] B. M. Levitan, On the asymptotic behavior of the spectral function of a self-adjoint differential equation\nof the second order, Izvestiya Akad. Nauk SSSR. Ser. Mat., 16 (1952), pp. 325–352.\n[15] E. H. Lieb, An Lp bound for the Riesz and Bessel potentials of orthonormal functions, J. Funct. Anal.,\n51 (1983), pp. 159–165.\n[16] E. H. Lieb and W. E. Thirring, Bound on kinetic energy of fermions which proves stability of matter,\nPhys. Rev. Lett., 35 (1975), pp. 687–689.\n[17] E. H. Lieb and W. E. Thirring, Inequalities for the moments of the eigenvalues of the Schr¨odinger\nhamiltonian and their relation to Sobolev inequalities, Studies in Mathematical Physics, Princeton Uni-\nversity Press, 1976, pp. 269–303.\n[18] L. J. Mordell, On the Kusmin-Landau inequality for exponential sums, Acta Arith., 4 (1958), pp. 3–9.\n[19] F. W. J. Olver, Legendre functions with both parameters large, Philos. Trans. Roy. Soc. London Ser.\nA, 278 (1975), pp. 175–185.\n[20] B. Simon, Trace ideals and Their Applications. Second edition. Mathematical Surveys and Monographs\n120. American Mathematical Society, Providence, RI, 2005.\n[21] C. D. Sogge, Oscillatory integrals and spherical harmonics, Duke Math. J., 53 (1986), pp. 43–65.\n[22] , On the convergence of Riesz means on compact manifolds, Ann. of Math. (2), 126 (1987), pp. 439–\n447.\n[23] , Concerning the Lp norm of spectral clusters for second-order elliptic operators on compact manifolds\n, J. Funct. Anal., 77 (1988), pp. 123–138.\n[24] , Remarks on L2 restriction theorems for Riemannian manifolds, in Analysis at Urbana, Vol. I\n(Urbana, IL, 1986–1987), vol. 137 of London Math. Soc. Lecture Note Ser., Cambridge Univ. Press,\nCambridge, 1989, pp. 416–422.\n[25] , Fourier integrals in classical analysis, vol. 105 of Cambridge Tracts in Mathematics, Cambridge\nUniversity Press, Cambridge, 1993.\n[26] , Hangzhou lectures on eigenfunctions of the Laplacian, vol. 188 of Annals of Mathematics Studies,\nPrinceton University Press, Princeton, NJ, 2014.\n[27] E. M. Stein, Oscillatory integrals in Fourier analysis, in Beijing lectures in harmonic analysis (Beijing,\n1984), vol. 112 of Ann. of Math. Stud., Princeton Univ. Press, Princeton, NJ, 1986, pp. 307–355.\n[28] , Oscillatory integrals in Fourier analysis, in Beijing lectures in harmonic analysis (Beijing, 1984),\nvol. 112 of Ann. of Math. Stud., Princeton Univ. Press, Princeton, NJ, 1986, pp. 307–355.\n[29] , Harmonic analysis: real-variable methods, orthogonality, and oscillatory integrals, vol. 43 of\nPrinceton Mathematical Series, Princeton University Press, Princeton, NJ, 1993. With the assistance\nof Timothy S. Murphy, Monographs in Harmonic Analysis, III.\n[30] P. A. Tomas, A restriction theorem for the Fourier transform, Bull. Amer. Math. Soc., 81 (1975),\npp. 477–478."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"DMS-1363432"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}