{"title":"Simple, Large-Scale Fabrication of Uniform Raman-Enhancing Substrate with Enhancement Saturation","uri":"","abstract":"It is well known that gold nanoparticle (AuNP) clusters generate strong surface-enhanced Raman scattering (SERS). In order to produce spatially uniform Raman-enhancing substrates at a large scale, we synthesized vertically perforated three-dimensional (3D) AuNP stacks. The 3D stacks were fabricated by first hydrothermally synthesizing ZnO nanowires perpendicular to silicon wafers followed by repetitively performing liquid-phase deposition of AuNPs on the tops and side surfaces of the nanowires. During the deposition process, the nanowires were shown to gradually dissolve away, leaving hollow vestiges or perforations surrounded by stacks of AuNPs. Simulation studies and experimental measurements reveal these nanoscale perforations serve as “light-breathing holes” that allow the excitation light to utilize deeper regions of the 3D stacks for stronger Raman emission. Combined with properly sized nanoparticles, this feature maximizes and saturates the Raman enhancement at 1-pM sensitivity across the entire wafer-scale substrate, and the saturation improves the wafer-scale uniformity by a factor of six when compared to nanoparticle layers deposited directly on a silicon wafer substrate. Using the 3D-stacked substrates, quantitative sensing of adenine molecules yielded concentrations measurements within 10% of the known value. Understanding the enhancing mechanisms and engineering the 3D stacks have opened a new method of harnessing the intense SERS observed in nanoparticle clusters and realize practical SERS substrates with significantly improved uniformity suitable for quantitative chemical sensing.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251523","docid":251523,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1251361","fileid":1251361,"datasetid":"document","objectid":251523,"filename":"acsami%2E7b03239.pdf","mime_type":"application/pdf","hash":"79975cf083078935a3f5b9cea89b6ca9","hash_type":"MD5","filesize":4260302,"mtime":"2017-05-01 16:09:13","url":"http://authors.library.caltech.edu/77094/1/acsami%252E7b03239.pdf"}],"eprintid":77094,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"acsami%2E7b03239.pdf","content":"accepted"}],"note":"© 2017 American Chemical Society.\n\nPublication Date (Web): April 28, 2017.\n\nThe research was funded by Samsung Grand Research Opportunity and Heritage Medical Research Institute Inaugural Principle Investigator Program. The authors also thank Professor Inkyu Park for helpful discussion on the AuNP synthesis. \n\nAuthor Contributions: The manuscript was written through contributions of all authors. All authors have given approval to the final version of the manuscript. \n\nThe authors declare no competing financial interest.","id":77094,"rev_number":6,"userid":18,"eprint_dir":"disk0/00/07/70/94","datestamp":"2017-05-01 16:21:20","lastmod":"2017-05-01 16:21:20","status_changed":"2017-05-01 16:21:20","type":"article","metadata_visibility":"show","creators":[{"given":"Daejong","family":"Yang","id":"Yang-Daejong","orcid":""},{"given":"Hyunjun","family":"Cho","id":"Cho-Hyunjun","orcid":""},{"given":"Sukmo","family":"Koo","id":"Koo-Sukmo","orcid":""},{"given":"Sagar R.","family":"Vaidyanathan","id":"Vaidyanathan-S-R","orcid":""},{"given":"Kelly","family":"Woo","id":"Woo-Kelly-Y","orcid":""},{"given":"Youngzoon","family":"Yoon","id":"Yoon-Youngzoon","orcid":""},{"given":"Hyuck","family":"Choo","id":"Choo-Hyuck","orcid":"0000-0002-8903-7939"}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-04-28","date_type":"inpress","publication":"ACS Applied Materials \u0026 Interfaces","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170501-090908942","refereed":true,"issn":"1944-8244","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170501-090908942","related_url":[{"url":"http://dx.doi.org/10.1021/acsami.7b03239","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/acsami.7b03239","type":"pub","description":"Article"}],"referencetext":["1. Nie, S. M.; Emery, S. R. Probing Single Molecules and Single Nanoparticles by Surface-\nEnhanced Raman Scattering. Science 1997, 275, 1102-1106.\n2. Fleischmann, M.; Hendra, P. J.; McQuilla. A.J. Raman Spectra of Pyridine Adsorbed at a\nSilver Electrode. Chem. Phys. Lett. 1974, 26, 163-166.\n3. White, P. L.; Hibbitts, S. J.; Perry, M. D.; Green, J.; Stirling, E.; Woodford, L.; McNay,\nG.; Stevenson, R.; Barnes, R. A. Evaluation of a Commercially Developed Semiautomated PCRSurface-\nEnhanced Raman Scattering Assay for Diagnosis of Invasive Fungal Disease. J. Clin.\nMicrobiol. 2014, 52, 3536-3543.\n4. Campion, A.; Kambhampati, P. Surface-Enhanced Raman Scattering. Chem. Soc. Rev.\n1998, 27, 241-250.\n5. Schlucker, S. Surface-Enhanced Raman Spectroscopy: Concepts and Chemical\nApplications. Angew. Chem. Int. Ed. 2014, 53, 4756-4795.\n6. Kambhampati, P.; Child, C. M.; Foster, M. C.; Campion, A. On the Chemical Mechanism\nof Surface Enhanced Raman Scattering: Experiment and Theory. J. Chem. Phys. 1998, 108,\n5013-5026.\n7. Alonso-Gonzalez, P.; Albella, P.; Schnell, M.; Chen, J.; Huth, F.; Garcia-Etxarri, A.;\nCasanova, F.; Golmar, F.; Arzubiaga, L.; Hueso, L. E.; Aizpurua, J.; Hillenbrand, R. Resolving\nthe Electromagnetic Mechanism of Surface-Enhanced Light Scattering at Single Hot Spots. Nat.\nComm. 2012, 3, 7.\n8. Tong, L. M.; Zhu, T.; Liu, Z. F. Approaching the Electromagnetic Mechanism of\nSurface-Enhanced Raman Scattering: from Self-Assembled Arrays to Individual Gold\nNanoparticles. Chem. Soc. Rev. 2011, 40, 1296-1304.\n9. Sun, M. T.; Wan, B. S.; Liu, Y. J.; Jia, Y.; Xu, H. X. Chemical Mechanism of Surface-\nEnhanced Resonance Raman Scattering via Charge Transfer in Pyridine-Ag-2 Complex. J.\nRaman Spectrosc. 2008, 39, 402-408.\n10. Zayak, A. T.; Hu, Y. S.; Choo, H.; Bokor, J.; Cabrini, S.; Schuck, P. J.; Neaton, J. B.\nChemical Raman Enhancement of Organic Adsorbates on Metal Surfaces. Phys. Rev. Lett. 2011,\n106, 083003.\n11. Zayak, A. T.; Choo, H.; Hu, Y. S.; Gargas, D. J.; Cabrini, S.; Bokor, J.; Schuck, P. J.;\nNeaton, J. B. Harnessing Chemical Raman Enhancement for Understanding Organic Adsorbate\nBinding on Metal Surfaces. J. Phys. Chem. Lett. 2012, 3, 1357-1362.\n12. Fang, J. X.; Yi, Y.; Ding, B. J.; Song, X. P. A Route to Increase the Enhancement Factor\nof Surface Enhanced Raman Scattering (SERS) via a High Density Ag Flower-Like Pattern.\nApplied Phys. Lett. 2008, 92, 131115.\n13. Braun, G.; Lee, S. J.; Dante, M.; Nguyen, T. Q.; Moskovits, M.; Reich, N. Surface-\nEnhanced Raman Spectroscopy for DNA Detection by Nanoparticle Assembly onto Smooth\nMetal Films. J. Am. Chem. Soc. 2007, 129, 6378-6379.\n14. Tang, H. B.; Meng, G. W.; Huang, Q.; Zhang, Z.; Huang, Z. L.; Zhu, C. H. Arrays of\nCone-Shaped ZnO Nanorods Decorated with Ag Nanoparticles as 3D Surface-Enhanced Raman\nScattering Substrates for Rapid Detection of Trace Polychlorinated Biphenyls. Adv. Funct.\nMater. 2012, 22, 218-224.\n15. Liu, Y.; Zhang, X. H.; Su, J.; Li, H. X.; Zhang, Q.; Gao, Y. H. Ag Nanoparticles@ZnO\nNanowire Composite Arrays: an Absorption Enhanced UV Photodetector. Opt. Express, 2014,\n22, 30148-30155.\n16. Dai, Z. G.; Wang, G. M.; Xiao, X. H.; Wu, W.; Li, W. Q.; Ying, J. J.; Zheng, J. F.; Mei,\nF.; Fu, L.; Wang, J.; Jiang, C. Z. Obviously Angular, Cuboid-Shaped TiO2 Nanowire Arrays\nDecorated with Ag Nanoparticle as Ultrasensitive 3D Surface-Enhanced Raman Scattering\nSubstrates. J. Phys. Chem. C 2014, 118, 22711-22718.\n17. Bai, F.; Li, M. C.; Fu, P. F.; Li, R. K.; Gu, T. S.; Huang, R.; Chen, Z.; Jiang, B.; Li, Y. F.\nSilicon Nanowire Arrays Coated with Electroless Ag for Increased Surface-Enhanced Raman\nScattering. APL Mater. 2015, 3, 056101.\n18. Fu, S. Y.; Hsu, Y. K.; Chen, M. H.; Chuang, C. J.; Chen, Y. C.; Lin, Y. G. Silver-\nDecorated Hierarchical Cuprous Oxide Micro/Nanospheres as Highly Effective Surface-\nEnhanced Raman Scattering Substrates. Opt. Express 2014, 22, 14617-14624.\n19. Zhou, Q. T.; Meng, G. W.; Huang, Q.; Zhu, C. H.; Tang, H. B.; Qian, Y. W.; Chen, B.;\nChen, B. S. Ag-Nanoparticles-Decorated NiO-Nanoflakes Grafted Ni-Nanorod Arrays Stuck out\nof Porous AAO as Effective SERS Substrates. Phys. Chem. Chem. Phys. 2014, 16, 3686-3692.\n20. Zhu, W. Q.; Banaee, M. G.; Wang, D. X.; Chu, Y. Z.; Crozier, K. B. Lithographically\nFabricated Optical Antennas with Gaps Well Below 10 nm. Small 2011, 7, 1761-1766.\n21. Zhang, P.; Yang, S.; Wang, L.; Zhao, J.; Zhu, Z.; Liu, B.; Zhong, J.; Sun, X. Large-Scale\nUniform Au Nanodisk Arrays Fabricated via X-Ray Interference Lithography for Reproducible\nand Sensitive SERS Substrate. Nanotechnology 2014, 25 245301.\n22. Tang, X.; Cai, W.; Yang, L.; Liu, J. Highly Uniform and Optical Visualization of SERS\nSubstrate for Pesticide Analysis Based on Au Nanoparticles Grafted on Dendritic Alpha-Fe2O3.\nNanoscale 2013, 5, 11193-11199.\n23. Pazos-Perez, N.; Ni, W.; Schweikart, A.; Alvarez-Puebla, R. A.; Fery, A.; Liz-Marzan, L.\nM. Highly Uniform SERS Substrates Formed by Wrinkle-Confined Drying of Gold Colloids.\nChem. Sci. 2010, 1, 174-178.\n24. Acosta, B.; Smolentseva, E.; Beloshapkin, S.; Rangel, R.; Estrada, M.; Fuentes, S.;\nSimakov, A. Gold Supported on Ceria Nanoparticles and Nanotubes. Appl. Catal. A-Gen. 2012,\n449, 96-104.\n25. Wei, S.; Zheng, M.; Xiang, Q.; Hu, H.; Duan, H.; Optimization of the Particle Density to\nMaximize the SERS Enhancement Factor of Periodic Plasmonic Nanostructure Array. Opt.\nExpress 2016, 24, 20613-20620.\n26. Law, M.; Greene, L. E.; Johnson, J. C.; Saykally, R.; Yang, P. D. Nanowire Dye-\nSensitized Solar Cells. Nat. Mat. 2005, 4, 455-459.\n27. La Mer, V.K.; Nucleation in Phase Transitions. Ind. Eng. Chem. 1952, 44, 1270-1277.\n28. La Mer, V.K.; Dinegar, R.H.; Theory, Production and Mechanism of Formation of\nMonodispersed Hydrosols, J. Am. Chem. Soc. 1950, 72, 4847-4854.\n29. Derjaguin, B.; A Theory of Interaction of Particles in Presence of Electric Double-Layers\nand the Stability of Lyophobe Colloids and Disperse Systems. Acta Phys. Chim. 1939, 10, 333-\n346.\n30. Derjaguin, B.; Landau, L.D.; Theory of the Stability of Strongly Charged Lyophobic Sols\nand of the Adhesion of Strongly Charged Particles in Solutions of Electrolytes. Acta Phys. Chim.\n1941, 14, 633-662.\n31. Verwey, E.J.W.; Theory of the Stability of Lyophobic Colloids. J. Phys. Chem. 1947, 51,\n631-636.\n32. Moreau, F.; Bond, G. C.; Taylor, A. O. Gold on Titania Catalysts for the Oxidation of\nCarbon Monoxide: Control of pH During Preparation with Various Gold Contents. J. Cataly.\n2005, 231, 105-114.\n33. Lim, M. A.; Lee, Y. W.; Han, S. W.; Park, I. Novel Fabrication Method of Diverse One-\nDimensional Pt/ZnO Hybrid Nanostructures and Its Sensor Application. Nanotechnology 2011,\n22, 035601.\n34. Haruta, M. Nanoparticulate Gold Catalysts for Low-Temperature CO Oxidation. J. New\nMater. Electrochem. Syst. 2004, 7, 163-172.\n35. Polte, J.; Fundamental Growth Principles of Colloidal Metal Nanoparticles - A New\nPerspective. CrystEngComm. 2015, 17, 6809-6830.\n36. Piella, J.; Bastus, N.G.; Puntes,V.; Size-Controlled Synthesis of Sub-10-nanometer\nCitrate-Stabilized Gold Nanoparticles and Related Optical Properties. Chem. Mater. 2016, 28,\n1066-1075.\n37. Zhao, L. L.; Jiang, D.; Cai, Y.; Ji, X. H.; Xie, R. U.; Yang, W. S. Tuning the Size of Gold\nNanoparticles in the Citrate Reduction by Chloride Ions. Nanoscale 2012, 4, 5071-5076.\n38. Castillo, F.; Perez, E.; de la Rosa, E., Adsorption of Gold Nanoparticles on Silicon\nSubstrate and Their Application in Surface Enhancement Raman Scattering. Rev. Mex. Fis. 2011,\n57, 61-65.\n39. Joo, T. H.; Kim, M. S.; Kim, K. Surface-Enhanced Raman-Scattering of Benzenethiol in\nSilver Sol. J. Raman Spectrosc. 1987, 18, 57-60.\n40. Zang, J.; Li, C. M.; Cui, X.; Wang, J.; Sun, X.; Dong, H.; Sun, C. Q. Tailoring Zinc\nOxide Nanowires for High Performance Amperometric Glucose Sensor. Electroanalysis 2007,\n19, 1008-1014.\n41. Huang, J.-A.; Zhao, Y.-Q.; Zhang, X.-J.; He, L.-F.; Wong, T.-L.; Chui, Y.-S.; Zhang, W.-\nJ.; Lee, S.-T.; Ordered Ag/Si Nanowires Array: Wide-Range Surface-Enhanced Raman\nSpectroscopy for Reproducible Biomolecule Detection. Nano Lett. 2013, 13, 5039-5045.\n42. Akin, M.S.; Yilmaz, M.; Babur, E.; Ozdemir, B.; Erdogan, H.; Tamer, U.; Demirel, G.;\nLarge Area Uniform Deposition of Silver Nanoparticles Through Bio-Inspired Polydopamine\nCoating on Silicon Nanowire Arrays for Practical SERS Applications. J. Mater. Chem. B 2014,\n2, 4894-4900.\n43. Yang, X.; Zhong, H.; Zhu, Y.; Shen, J.; Li. C.; Ultrasensitive and Recyclable SERS\nSubstrate Based on Au-Decorated Si Nanowire Arrays. Dalton Trans., 2013, 42, 14324-14330.\n44. Zhang, L.; Guan, C. R.; Wang, Y.; Liao, J. H. Highly Effective and Uniform SERS\nSubstrates Fabricated by Etching Multi-Layered gold Nanoparticle Arrays. Nanoscale 2016, 8,\n5928-5937.\n45. Kanipe, K. N.; Chidester, P. P. F.; Stucky, G. D.; Moskovits, M. Large Format Surface-\nEnhanced Raman Spectroscopy Substrate Optimized for Enhancement and Uniformity. ACS\nNano 2016, 10, 7566-7571.\n46. Xu, Z. D.; Jiang, J.; Wang, X. H.; Han, K.; Ameen, A.; Khan, I.; Chang, T. W.; Liu, G.\nL., Large-area, Uniform and Low-Cost Dual-Mode Plasmonic Naked-Eye Colorimetry and\nSERS Sensor with Handheld Raman Spectrometer. Nanoscale 2016, 8, 6162-6172.\n47. Zhu, C. H.; Meng, G. W.; Zheng, P.; Huang, Q.; Li, Z. B.; Hu, X. Y.; Wang, X. J.;\nHuang, Z. L.; Li, F. D.; Wu, N. Q. A Hierarchically Ordered Array of Silver-Nanorod Bundles for Surface-Enhanced Raman Scattering Detection of Phenolic Pollutants. Adv. Mater. 2016, 28,\n4871-4876.\n48. Zhou, J. H.; Zhu, F.; Wang, Y.; Wang, T. One-Step Green Synthesis of High Uniform\nSERS Substrate Based on Au Nanoparticles Grown on Ge Wafer. Chem. Phys. Lett. 2015, 627,\n96-100.\n49. Wang, Y. W.; Kao, K. C.; Wang, J. K.; Mou, C. Y. Large-Scale Uniform Two-\nDimensional Hexagonal Arrays of Gold Nanoparticles Templated from Mesoporous Silica Film\nfor Surface-Enhanced Raman Spectroscopy. J. Phys. Chem. C 2016, 120, 24382-24388.\n50. Chen, D. Z.; Song, Z. X.; Chen, F.; Huang, J.; Wei, J.; Zhao, Y. X. Simply Controllable\nGrowth of Single Crystal Plasmonic Au-Ag Nano-Spines with Anisotropic Multiple Sites for\nHighly Sensitive and Uniform Surface-Enhanced Raman Scattering Sensing. RSC Adv. 2016, 6,\n66056-66065.\n51. Hsu, K. C.; Chen, D. H. Highly Sensitive, Uniform, and Reusable Surface-Enhanced\nRaman Scattering Substrate with TiO2 Interlayer between Ag Nanoparticles and Reduced\nGraphene Oxide. ACS Appl. Mater. Interfaces 2015, 7, 27571-27579.\n52. Liu, J.; Meng, G. W.; Li, Z. B.; Huang, Z. L.; Li, X. D. Ag-NP@Ge-nanotaper/Si-\nMicropillar Ordered Arrays as Ultrasensitive and Uniform Surface Enhanced Raman Scattering\nSubstrates. Nanoscale 2015, 7, 18218-18224.\n53. Liu, X.; Shao, Y.; Tang, Y.; Yao, K. F. Highly Uniform and Reproducible Surface\nEnhanced Raman Scattering on Air-stable Metallic Glassy Nanowire Array. Sci. Rep. 2014, 4,\n5835.\n54. Liu, Z.; Yang, Z. B.; Peng, B.; Cao, C.; Zhang, C.; You, H. J.; Xiong, Q. H.; Li, Z. Y.;\nFang, J. X. Highly Sensitive, Uniform, and Reproducible Surface-Enhanced Raman\nSpectroscopy from Hollow Au-Ag Alloy Nanourchins. Adv. Mater. 2014, 26, 2431-2439.\n55. Wang, X.; Li, M. H.; Meng, L. Y.; Lin, K. Q.; Feng, J. M.; Huang, T. X.; Yang, Z. L.;\nRen, B. Probing the Location of Hot Spots by Surface-Enhanced Raman Spectroscopy: Toward\nUniform Substrates. ACS Nano 2014, 8, 528-536.\n56. Li, D. W.; Pan, L. J.; Li, S.; Liu, K.; Wu, S. F.; Peng, W. Controlled Preparation of\nUniform TiO2-Catalyzed Silver Nanoparticle Films for Surface-Enhanced Raman Scattering. J.\nPhys. Chem. C 2013, 117, 6861-6871.\n57. Chen, H. P. M.; Pang, L.; King, A.; Hwang, G. M.; Fainman, Y. Plasmonic Coupled\nNanotorch Structures Leading to Uniform Surface Enhanced Raman Scattering Detection.\nNanoscale 2012, 4, 7664-7669.\n58. Li, W. D.; Ding, F.; Hu, J.; Chou, S. Y. Three-Dimensional Cavity Nanoantenna Coupled\nPlasmonic Nanodots for Ultrahigh and Uniform Surface-Enhanced Raman Scattering Over Large\nArea. Opt. Express 2011, 19, 3925-3936.\n59. Greene, L. E.; Law, M.; Tan, D. H.; Montano, M.; Goldberger, J.; Somorjai, G.; Yang, P.\nD. General Route to Vertical ZnO Nanowire Arrays Using Textured ZnO Seeds. Nano Lett.\n2005, 5, 1231-1236.\n60. Taflove, A.; Hagness, S. C. Electrodynamics Entering the 21st Century. In\nComputational electrodynamics: the finite-difference time-domain method; Artech House:\nBoston, 2000; pp 1-34.\n61. Palik, E. D. Comments on the Optical Constants of Metals and an Introduction to the\nData for Several Metals. In Handbook of optical constants of solids; Lynch, D. W., Hunter, W.\nR., Eds.; Academic Press: San Diego, 1998; pp 275-367."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Simple, Large-Scale Fabrication of Uniform Raman-Enhancing Substrate with Enhancement Saturation\nDaejong Yang, Hyunjun Cho, Sukmo Koo, Sagar R Vaidyanathan, Kelly Woo, Youngzoon Yoon, and Hyuck Choo\nACS Applied Materials \u0026 Interfaces Just Accepted Manuscript \nDOI: 10.1021/acsami.7b03239","other_numbering_system":null,"funders":[{"agency":"Samsung Grand Research Opportunity","grant_number":""},{"agency":"Heritage Medical Research Institute","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Heritage Medical Research Institute"]}