{"title":"Binding of Polarons and Atoms at Threshold","uri":"","abstract":"If the polaron coupling constant α is large enough, bipolarons or multi-polarons will form. When passing through the critical α_c from above, does the radius of the system simply get arbitrarily large or does it reach a maximum and then explodes? We prove that it is always the latter. We also prove the analogous statement for the Pekar-Tomasevich (PT) approximation to the energy, in which case there is a solution to the PT equation at α_c. Similarly, we show that the same phenomenon occurs for atoms, e.g., helium, at the critical value of the nuclear charge. Our proofs rely only on energy estimates, not on a detailed analysis of the Schrödinger equation, and are very general. They use the fact that the Coulomb repulsion decays like 1/r, while 'uncertainty principle' localization energies decay more rapidly, as 1/r^2. ","documents":[{"id":"http://authors.library.caltech.edu/id/document/251524","docid":251524,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1251376","fileid":1251376,"datasetid":"document","objectid":251524,"filename":"1106.0729.pdf","mime_type":"application/pdf","hash":"ae8690d6dc29f6bf897ec7bb44976e6d","hash_type":"MD5","filesize":260015,"mtime":"2017-05-01 16:18:58","url":"http://authors.library.caltech.edu/77095/1/1106.0729.pdf"}],"eprintid":77095,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1106.0729.pdf","content":"submitted"}],"note":"© 2011 by the authors. This paper may be reproduced, in its entirety, for non-commercial purposes. \n\n(Submitted on 3 Jun 2011) \n\nWe are grateful to Herbert Spohn for making us aware of\nthis problem. Partial financial support from the U.S. National Science Foundation through grant PHY-0965859 (E.L.) and the NSERC (R.S.) is gratefully acknowledged.","id":77095,"rev_number":8,"userid":772,"eprint_dir":"disk0/00/07/70/95","datestamp":"2017-05-01 16:28:30","lastmod":"2017-05-01 16:28:30","status_changed":"2017-05-01 16:28:30","type":"monograph","metadata_visibility":"show","creators":[{"given":"Rupert L.","family":"Frank","id":"Frank-R-L","orcid":""},{"given":"Elliott H.","family":"Lieb","id":"Lieb-E-H","orcid":""},{"given":"Robert","family":"Seiringer","id":"Seiringer-R","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2011-06-03","date_type":"submitted","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170501-091837793","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170501-091837793","related_url":[{"url":"https://arxiv.org/abs/1106.0729","type":"arxiv","description":"Discussion paper"}],"referencetext":["[1] R. D. Benguria, G. A. Bley, Exact asymptotic behavior of the Pekar-Tomasevich functional,\nJ. Math. Phys. 52 (2011), 052110.\n[2] R. D. Benguria, R. L. Frank, E. H. Lieb, in preparation.\n[3] H. A. Bethe, Berechnung der Elektronenaffinit¨at des Wasserstoffs, Z. Physik 57 (1929), 815.\n[4] M. Donsker, S. R. S. Varadhan, Asymptotics for the polaron. Comm. Pure Appl. Math. 36\n(1983), 505–528.\n[5] R. L. Frank, E. H. Lieb, R. Seiringer, L. E. Thomas, Bi-polaron and N-polaron binding\nenergies. Phys. Rev. Lett. 104, 210402 (2010). Stability and Absence of Binding for Multi-\nPolaron Systems, Publ. Math. IHES 113 (2011), no. 1, 39–67.\n[6] H. Fr¨ohlich, Theory of electrical breakdown in ionic crystals. Proc. R. Soc. Lond. A 160\n(1937), 230–241.\n[7] B. Gerlach, H. L¨owen, Absence of phonon-induced localization for the free optical polaron\nand the corresponding Wannier exciton-phonon system. Phys. Rev. B 37 (1988), 8042–8047.\n[8] M. Griesemer, J. S. Møller, Bounds on the minimal energy of translation invariant N-polaron\nsystems. Comm. Math. Phys. 297, 283–297 (2010).\n[9] M. Hoffmann-Ostenhof, T. Hoffmann-Ostenhof, B. Simon, A multiparticle Coulomb system\nwith bound state at threshold, J. Phys. A 16, 1125–1131 (1983).\n[10] M. Lewin, Geometric methods for nonlinear many-body quantum systems, J. Funct. Anal.\n260, 3535–3595 (2011).\n[11] E. H. Lieb, Existence and uniqueness of the minimizing solution of Choquard’s nonlinear\nequation. Studies in Appl. Math. 57 (1976/77), no. 2, 93–105.\n[12] E. H. Lieb, M. Loss, Analysis, volume 14 of Graduate Studies in Mathematics. Amer. Math.\nSoc., Providence, RI, second edition, 2001.\n[13] E. H. Lieb, R. Seiringer, The stability of matter in quantum mechanics. Cambridge (2010).\n[14] E. H. Lieb, L. E. Thomas, Exact ground state energy of the strong-coupling polaron. Comm.\nMath. Phys. 183, no. 3, 511–519 (1997). Erratum: ibid. 188, no. 2, 499–500 (1997).\n[15] S. J. Miyake, Strong coupling limit of the polaron ground state. J. Phys. Soc. Jpn. 38 (1975),\n181–182.\n[16] T. Miyao, H. Spohn, The bipolaron in the strong coupling limit. Ann. Henri Poincar´e 8 (2007),\n1333–1370.\n[17] S. I. Pekar, Research in electron theory of crystals. United States Atomic Energy Commission,\nWashington, DC, 1963.\n[18] S. I. Pekar, O. F. Tomasevich, Theory of F centers. Zh. Eksp. Teor. Fys. 21 (1951), 1218–\n1222.\n[19] M. A. Smondyrev, V.M. Fomin, Pekar-Fr¨ohlich bipolarons. In: Polarons and applications,\nProceedings in Nonlinear Science, V.D. Lakhno, ed., Wiley (1994).\n[20] M. A. Smondyrev, G. Verbist, F. M. Peeters, J. T. Devreese, Stability of multi polaron matter,\nPhys. Rev. B 47 (1993), 2596–2601.\n[21] S. G. Suprun, B. Ya. Moizhes, Fiz. Tverd. Tela 24 (1982), 1571; Sov. Physc. Semicond. 16\n(1982), 700.\n[22] G. Verbist, F. M. Peeters, J. T. Devreese, Large bipolarons in two and three dimensions.\nPhys. Rev. B 43 (1991), 2712–2720.\n[23] G. Verbist, M. A. Smondyrev, F. M. Peeters, J. T. Devreese, Strong-coupling analysis of\nlarge bipolarons in two and three dimensions. Phys. Rev. B 45 (1992), 5262–5269.\n[24] G. M. Zhislin, A study of the spectrum of the Schr¨odinger operator for a system of several\nparticles. (Russian) Trudy Moskov. Mat. Obsc. 9 (1960) 81–120.\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"PHY-0965859"},{"agency":"Natural Sciences and Engineering Research Council of Canada (NSERC)","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}