{"title":"Tunnel transport and interlayer excitons in bilayer fractional quantum Hall systems","uri":"","abstract":"In a bilayer system consisting of a composite-fermion Fermi sea in each layer, the tunnel current is exponentially suppressed at zero bias, followed by a strong peak at a finite bias voltage V_(max). This behavior, which is qualitatively different from that observed for the electron Fermi sea, provides fundamental insight into the strongly correlated non-Fermi liquid nature of the CF Fermi sea and, in particular, offers a window into the short-distance high-energy physics of this state. We identify the exciton responsible for the peak current and provide a quantitative account of the value of V_(max). The excitonic attraction is shown to be quantitatively significant, and its variation accounts for the increase of V_(max) with the application of an in-plane magnetic field. We also estimate the critical Zeeman energy where transition occurs from a fully spin polarized composite fermion Fermi sea to a partially spin polarized one, carefully incorporating corrections due to finite width and Landau level mixing, and find it to be in satisfactory agreement with the Zeeman energy where a qualitative change has been observed for the onset bias voltage [Eisenstein et al., Phys. Rev. B 94, 125409 (2016)]. For fractional quantum Hall states, we predict a substantial discontinuous jump in V_(max) when the system undergoes a transition from a fully spin polarized state to a spin singlet or a partially spin polarized state.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251657","docid":251657,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1252889","fileid":1252889,"datasetid":"document","objectid":251657,"filename":"PhysRevB.95.195105.pdf","mime_type":"application/pdf","hash":"d47b7e883074dc4db1027421e549cea6","hash_type":"MD5","filesize":1488838,"mtime":"2017-05-03 17:54:21","url":"http://authors.library.caltech.edu/77155/1/PhysRevB.95.195105.pdf"}],"eprintid":77155,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"PhysRevB.95.195105.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251658","docid":251658,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1252891","fileid":1252891,"datasetid":"document","objectid":251658,"filename":"1702.08595.pdf","mime_type":"application/pdf","hash":"dead0f72e1b9627fb14cf498b096df3a","hash_type":"MD5","filesize":1208703,"mtime":"2017-05-03 17:54:27","url":"http://authors.library.caltech.edu/77155/2/1702.08595.pdf"}],"eprintid":77155,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1702.08595.pdf","content":"submitted"}],"note":"© 2017 American Physical Society. \n\nReceived 27 February 2017; published 3 May 2017. \n\nThe work at Penn State was supported in part by the U.S. Department of Energy under Grant No. DE-SC0005042. The Caltech portion of this work was supported in part by the Institute for Quantum Information and Matter, an NSF Physics Frontiers Center with support of the Gordon and Betty Moore Foundation through Grant No. GBMF1250.","id":77155,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/71/55","datestamp":"2017-05-03 18:04:41","lastmod":"2017-05-03 18:04:41","status_changed":"2017-05-03 18:04:41","type":"article","metadata_visibility":"show","creators":[{"given":"Yuhe","family":"Zhang","id":"Zhang-Yuhe","orcid":""},{"given":"J. K.","family":"Jain","id":"Jain-J-K","orcid":""},{"given":"J. P.","family":"Eisenstein","id":"Eisenstein-J-P","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-15","date_type":"published","publication":"Physical Review B","volume":"95","number":"19","pagerange":"Art. No. 195105","id_number":"CaltechAUTHORS:20170503-105416560","refereed":true,"issn":"2469-9950","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170503-105416560","related_url":[{"url":"https://doi.org/10.1103/PhysRevB.95.195105","type":"doi","description":"Article"},{"url":"https://journals.aps.org/prb/abstract/10.1103/PhysRevB.95.195105","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1702.08595","type":"arxiv","description":"Discussion Paper"}],"referencetext":["J. Eisenstein, Annu. Rev. Condens. Matter Phys. 5, 159 (2014).\nI. B. Spielman, J. P. Eisenstein, L. N. Pfeiffer, and K. W. West, Phys. Rev. Lett. 84, 5808 (2000).\nM. Kellogg, I. B. Spielman, J. P. Eisenstein, L. N. Pfeiffer, and K. W. West, Phys. Rev. Lett. 88, 126804 (2002).\nM. Kellogg, J. P. Eisenstein, L. N. Pfeiffer, and K. W. West, Phys. Rev. Lett. 93, 036801 (2004).\nE. Tutuc, M. Shayegan, and D. A. Huse, Phys. Rev. Lett. 93, 036802 (2004).\nR. D. Wiersma, J. G. S. Lok, S. Kraus, W. Dietsche, K. von Klitzing, D. Schuh, M. Bichler, H.-P. Tranitz, and W. Wegscheider, Phys. Rev. Lett. 93, 266805 (2004).\nB. I. Halperin, Helv. Phys. Acta 56, 75 (1983).\nA. H. MacDonald and E. H. Rezayi, Phys. Rev. B 42, 3224 (1990).\nX.-G. Wen and A. Zee, Phys. Rev. Lett. 69, 1811 (1992).\nJ. K. Jain, Phys. Rev. Lett. 63, 199 (1989).\nB. I. Halperin, P. A. Lee, and N. Read, Phys. Rev. B 47, 7312 (1993).\nJ. K. Jain, Composite Fermions (Cambridge University Press, 2007).\nR. C. Ashoori, J. A. Lebens, N. P. Bigelow, and R. H. Silsbee, Phys. Rev. Lett. 64, 681 (1990).\nJ. P. Eisenstein, L. N. Pfeiffer, and K. W. West, Phys. Rev. Lett. 69, 3804 (1992).\nK. M. Brown, N. Turner, J. T. Nicholls, E. H. Linfield, M. Pepper, D. A. Ritchie, and G. A. C. Jones, Phys. Rev. B 50, 15465 (1994).\nJ. P. Eisenstein, L. N. Pfeiffer, and K. W. West, Phys. Rev. Lett. 74, 1419 (1995).\nJ. Eisenstein, L. Pfeiffer, and K. West, Solid State Commun. 149, 1867 (2009).\nJ. P. Eisenstein, T. Khaire, D. Nandi, A. D. K. Finck, L. N. Pfeiffer, and K. W. West, Phys. Rev. B 94, 125409 (2016).\nS. He, P. M. Platzman, and B. I. Halperin, Phys. Rev. Lett. 71, 777 (1993).\nR. Haussmann, H. Mori, and A. H. MacDonald, Phys. Rev. Lett. 76, 979 (1996).\nY. Hatsugai, P.-A. Bares, and X. G. Wen, Phys. Rev. Lett. 71, 424 (1993).\nA. L. Efros and F. G. Pikus, Phys. Rev. B 48, 14694 (1993).\nS. Levitov and A. V. Shytov, J. Exp. Theor. Phys. Lett. 66, 214 (1997).\nP. Johansson and J. M. Kinaret, Phys. Rev. Lett. 71, 1435 (1993).\nA. D. K. Finck, J. P. Eisenstein, L. N. Pfeiffer, and K. W. West, Phys. Rev. Lett. 104, 016801 (2010).\nP. Giudici, K. Muraki, N. Kumada, Y. Hirayama, and T. Fujisawa, Phys. Rev. Lett. 100, 106803 (2008).\nK. Park and J. K. Jain, Phys. Rev. Lett. 80, 4237 (1998).\nG. Giuliani and G. Vignale, Quantum Theory of the Electron Liquid (Cambridge University Press, 2008).\nG. D. Mahan, Many Particle Physics (Kluwer, 2000).\nV. W. Scarola and J. K. Jain, Phys. Rev. B 64, 085313 (2001).\nF. D. M. Haldane, Phys. Rev. Lett. 51, 605 (1983).\nX. G. Wu, G. Dev, and J. K. Jain, Phys. Rev. Lett. 71, 153 (1993).\nJ. K. Jain and R. K. Kamilla, Int. J. Mod. Phys. B 11, 2621 (1997).\nJ. K. Jain and R. K. Kamilla, Phys. Rev. B 55, R4895 (1997).\nW. M. C. Foulkes, L. Mitas, R. J. Needs, and G. Rajagopal, Rev. Mod. Phys. 73, 33 (2001).\nJ. K. Jain and M. R. Peterson, Phys. Rev. Lett. 94, 186808 (2005).\nM. W. Ortalano, S. He, and S. Das Sarma, Phys. Rev. B 55, 7702 (1997).\nM. A. Mueed, D. Kamburov, M. Shayegan, L. N. Pfeiffer, K. W. West, K. W. Baldwin, and R. Winkler, Phys. Rev. Lett. 114, 236404 (2015).\nD. Kamburov, M. A. Mueed, M. Shayegan, L. N. Pfeiffer, K. W. West, K. W. Baldwin, J. J. D. Lee, and R. Winkler, Phys. Rev. B 89, 085304 (2014).\nA. C. Balram and J. K. Jain, Phys. Rev. B 93, 075121 (2016).\nV. Melik-Alaverdian and N. E. Bonesteel, Phys. Rev. B 52, R17032 (1995).\nV. Melik-Alaverdian, N. E. Bonesteel, and G. Ortiz, Phys. Rev. Lett. 79, 5286 (1997).\nV. W. Scarola, K. Park, and J. K. Jain, Phys. Rev. B 61, 13064 (2000).\nY. Zhang, A. Wójs, and J. K. Jain, Phys. Rev. Lett. 117, 116803 (2016).\nJ. P. Eisenstein, H. L. Stormer, L. Pfeiffer, and K. W. West, Phys. Rev. Lett. 62, 1540 (1989).\nJ. P. Eisenstein, H. L. Stormer, L. N. Pfeiffer, and K. W. West, Phys. Rev. B 41, 7910 (1990).\nL. W. Engel, S. W. Hwang, T. Sajoto, D. C. Tsui, and M. Shayegan, Phys. Rev. B 45, 3418 (1992).\nR. R. Du, A. S. Yeh, H. L. Stormer, D. C. Tsui, L. N. Pfeiffer, and K. W. West, Phys. Rev. Lett. 75, 3926 (1995).\nW. Kang, J. B. Young, S. T. Hannahs, E. Palm, K. L. Campman, and A. C. Gossard, Phys. Rev. B 56, R12776 (1997).\nI. V. Kukushkin, K. v. Klitzing, and K. Eberl, Phys. Rev. Lett. 82, 3665 (1999).\nA. S. Yeh, H. L. Stormer, D. C. Tsui, L. N. Pfeiffer, K. W. Baldwin, and K. W. West, Phys. Rev. Lett. 82, 592 (1999).\nI. V. Kukushkin, J. H. Smet, K. von Klitzing, and K. Eberl, Phys. Rev. Lett. 85, 3688 (2000).\nS. Melinte, N. Freytag, M. Horvatic, C. Berthier, L. P. Lévy, V. Bayot, and M. Shayegan, Phys. Rev. Lett. 84, 354 (2000).\nN. Freytag, Y. Tokunaga, M. Horvatić, C. Berthier, M. Shayegan, and L. P. Lévy, Phys. Rev. Lett. 87, 136801 (2001).\nN. Freytag, M. Horvatic, C. Berthier, M. Shayegan, and L. P. Lévy, Phys. Rev. Lett. 89, 246804 (2002).\nL. A. Tracy, J. P. Eisenstein, L. N. Pfeiffer, and K. W. West, Phys. Rev. Lett. 98, 086801 (2007).\nL. Tiemann, G. Gamez, N. Kumada, and K. Muraki, Science 335, 828 (2012).\nB. E. Feldman, A. J. Levin, B. Krauss, D. A. Abanin, B. I. Halperin, J. H. Smet, and A. Yacoby, Phys. Rev. Lett. 111, 076802 (2013).\nY. Liu, S. Hasdemir, A. Wójs, J. K. Jain, L. N. Pfeiffer, K. W. West, K. W. Baldwin, and M. Shayegan, Phys. Rev. B 90, 085301 (2014).\nA. C. Balram, C. Töke, A. Wójs, and J. K. Jain, Phys. Rev. B 92, 075410 (2015).\nG. Ortiz, D. M. Ceperley, and R. M. Martin, Phys. Rev. Lett. 71, 2777 (1993)."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0005042"},{"agency":"Gordon and Betty Moore Foundation","grant_number":"GBMF1250"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["IQIM","Institute for Quantum Information and Matter"]}