{"title":"The long noncoding RNA SPRIGHTLY acts as an intranuclear organizing hub for pre-mRNA molecules","uri":"","abstract":"Molecular mechanisms by which long noncoding RNA (lncRNA) molecules may influence cancerous condition are poorly understood. The aberrant expression of SPRIGHTLY lncRNA, encoded within the drosophila gene homolog Sprouty-4 intron, is correlated with a variety of cancers, including human melanomas. We demonstrate by SHAPE-seq and dChIRP that SPRIGHTLY RNA secondary structure has a core pseudoknotted domain. This lncRNA interacts with the intronic regions of six pre-mRNAs: SOX5, SMYD3, SND1, MEOX2, DCTN6, and RASAL2, all of which have cancer-related functions. Hemizygous knockout of SPRIGHTLY by CRISPR (clustered regularly interspaced short palindromic repeats)/Cas9 in melanoma cells significantly decreases SPRIGHTLY lncRNA levels, simultaneously decreases the levels of its interacting pre-mRNA molecules, and decreases anchorage-independent growth rate of cells and the rate of in vivo tumor growth in mouse xenografts. These results provide the first demonstration of an lncRNA’s three-dimensional coordinating role in facilitating cancer-related gene expression in human melanomas.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251671","docid":251671,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253054","fileid":1253054,"datasetid":"document","objectid":251671,"filename":"e1602505.full.pdf","mime_type":"application/pdf","hash":"9a26063e44f2d2fd302157c0db89d423","hash_type":"MD5","filesize":2125262,"mtime":"2017-05-03 20:03:34","url":"http://authors.library.caltech.edu/77160/1/e1602505.full.pdf"}],"eprintid":77160,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc","main":"e1602505.full.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251672","docid":251672,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253071","fileid":1253071,"datasetid":"document","objectid":251672,"filename":"1602505_SM.pdf","mime_type":"application/pdf","hash":"e02a144d7b8fc073daaa35a2ead43438","hash_type":"MD5","filesize":775674,"mtime":"2017-05-03 20:14:42","url":"http://authors.library.caltech.edu/77160/2/1602505_SM.pdf"}],"eprintid":77160,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc","main":"1602505_SM.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/251673","docid":251673,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253093","fileid":1253093,"datasetid":"document","objectid":251673,"filename":"1602505_TableS1.xlsx","mime_type":"application/vnd.openxmlformats-officedocument.spreadsheetml.sheet","hash":"a72c23f8e76deb00f3550aa71baaa736","hash_type":"MD5","filesize":33077,"mtime":"2017-05-03 20:40:44","url":"http://authors.library.caltech.edu/77160/3/1602505_TableS1.xlsx"}],"eprintid":77160,"pos":3,"placement":3,"mime_type":"application/vnd.openxmlformats-officedocument.spreadsheetml.sheet","format":"application/vnd.ms-excel","language":"en","security":"public","license":"cc_by_nc","main":"1602505_TableS1.xlsx","content":"supplemental"}],"note":"© 2017 The Authors, some rights reserved; exclusive licensee\nAmerican Association for the Advancement of Science. Distributed under a Creative Commons Attribution\nNoncommercial License 4.0 (CC BY-NC). \n\nSubmitted 14 October 2016; Accepted 3 March 2017; Published 3 May 2017. \n\nWe thank Sanford Burnham Prebys Medical Discovery Institute Analytical Genomics Core Facility for deep sequencing, Bioinformatics Core for data analysis support, Histology Core, and Microscope Facility for immunohistochemistry studies, and D. McFadden (Sanford Burnham Prebys Medical Discovery Institute) for formatting the manuscript. \n\nThis work was supported by NIH grants CA165184 and NCI 5P30CA030199 and Florida Department of Health, Bankhead-Coley Cancer Research Program 5BC08 to R.J.P. and NIH grant DP5 OD012160 to M.B. A.R. is funded by the U.S. Department of Defense (CDMRP #LC150653). \n\nAuthor contributions: B.L., A.R., and R.J.P. incepted the idea, planned the experiment, analyzed data, and wrote the manuscript. A.S. provided support in mouse xenograft studies. E.H., X.C., J.-L.L., S.J.L., T.S., and S.Z. were involved in dChIRP data analysis, SHAPE-seq data analysis, and building of SPRIGHTLY-interacting networks and pathways. J.M. and S.S.G. provided support in generating RNA-seq and SHAPE-seq data. F.B.M. conducted the RNA-FISH experiment. M.B. conducted the RNA-FISH experiment and data analysis. \n\nThe authors declare that they have no competing interests. \n \nData and materials availability: All data needed to evaluate the conclusions in the paper are present in the paper and/or the Supplementary Materials. Additional data related to this paper may be requested from the authors. We do not have any materials obtained through a material transfer agreement. Cell lines and mice were purchased. Data are archived (GSE95597).","id":77160,"rev_number":19,"userid":18,"eprint_dir":"disk0/00/07/71/60","datestamp":"2017-05-03 20:55:27","lastmod":"2017-05-03 20:55:27","status_changed":"2017-05-03 20:55:27","type":"article","metadata_visibility":"show","creators":[{"given":"Bongyong","family":"Lee","id":"Lee-Bongyong","orcid":""},{"given":"Anupama","family":"Sahoo","id":"Sahoo-A","orcid":""},{"given":"John","family":"Marchica","id":"Marchica-J","orcid":""},{"given":"Erwin","family":"Holzhauser","id":"Holzhauser-E","orcid":""},{"given":"Xiaoli","family":"Chen","id":"Chen-Xiaoli","orcid":""},{"given":"Jian-Liang","family":"Li","id":"Li-Jian-Liang","orcid":""},{"given":"Tatsuya","family":"Seki","id":"Seki-T","orcid":""},{"given":"Subramaniam Shyamala","family":"Govindarajan","id":"Govindarajan-S-S","orcid":""},{"given":"Fatu Badiane","family":"Markey","id":"Markey-F-B","orcid":""},{"given":"Mona","family":"Batish","id":"Batish-M","orcid":""},{"given":"Sonali J.","family":"Lokhande","id":"Lokhande-S-J","orcid":""},{"given":"Shaojie","family":"Zhang","id":"Zhang-Shaojie","orcid":""},{"given":"Animesh","family":"Ray","id":"Ray-Animesh","orcid":""},{"given":"Ranjan J.","family":"Perera","id":"Perera-R-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"long noncoding RNA; melanoma; gene regulation; pre-mRNA","date":"2017-05-03","date_type":"published","publication":"Science Advances","volume":"3","number":"5","pagerange":"Art. No. e1602505","id_number":"CaltechAUTHORS:20170503-130329482","refereed":true,"issn":"2375-2548","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170503-130329482","related_url":[{"url":"http://dx.doi.org/10.1126/sciadv.1602505","type":"doi","description":"Article"},{"url":"http://advances.sciencemag.org/content/3/5/e1602505","type":"pub","description":"Article"},{"url":"http://advances.sciencemag.org/cgi/content/full/3/5/e1602505/DC1","type":"pub","description":"Supplemental Materials"}],"referencetext":["S. Djebali, C. A. Davis, A. Merkel, A. Dobin, T. Lassmann, A. Mortazavi, A. Tanzer, J. Lagarde, W. Lin, F. Schlesinger, C. Xue, G. K. Marinov, J. Khatun, B. A. Williams, C. Zaleski, J. Rozowsky, M. Roder, F. Kokocinski, R. F. Abdelhamid, T. Alioto, I. Antoshechkin, M. T. Baer, N. S. Bar, P. Batut, K. Bell, I. Bell, S. Chakrabortty, X. Chen, J. Chrast, J. Curado, T. Derrien, J. Drenkow, E. Dumais, J. Dumais, R. Duttagupta, E. Falconnet, M. Fastuca, K. Fejes-Toth, P. Ferreira, S. Foissac, M. J. Fullwood, H. Gao, D. Gonzalez, A. Gordon, H. Gunawardena, C. Howald, S. Jha, R. Johnson, P. Kapranov, B. King, C. Kingswood, O. J. Luo, E. Park, K. Persaud, J. B. Preall, P. Ribeca, B. Risk, D. Robyr, M. Sammeth, L. Schaffer, L.-H. See, A. Shahab, J. Skancke, A. M. Suzuki, H. Takahashi, H. Tilgner, D. Trout, N. Walters, H. Wang, J. Wrobel, Y. Yu, X. Ruan, Y. Hayashizaki, J. Harrow, M. Gerstein, T. Hubbard, A. Reymond, S. E. Antonarakis, G. Hannon, M. C. Giddings, Y. Ruan, B. Wold, P. Carninci, R. Guigo, T. R. Gingeras, Landscape of transcription in human cells. Nature 489, 101–108 (2012).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ C. M. Croce, Causes and consequences of microRNA dysregulation in cancer. Nat. Rev. Genet. 10, 704–714 (2009).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ A. Lujambio, S. W. Lowe, The microcosmos of cancer. Nature 482, 347–355 (2012).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ M. Huarte, The emerging role of lncRNAs in cancer. Nat. Med. 21, 1253–1261 (2015).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ J. J. Quinn, I. A. Ilik, K. Qu, P. Georgiev, C. Chu, A. Akhtar, H. Y. Chang, Revealing long noncoding RNA architecture and functions using domain-specific chromatin isolation by RNA purification. Nat. Biotechnol. 32, 933–940 (2014).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ C. Chu, K. Qu, F. L. Zhong, S. E. Artandi, H. Y. Chang, Genomic maps of long noncoding RNA occupancy reveal principles of RNA-chromatin interactions. Mol. Cell 44, 667–678 (2011).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ J. M. Engreitz, K. Sirokman, P. McDonel, A. A. Shishkin, C. Surka, P. Russell, S. R. Grossman, A. Y. Chow, M. Guttman, E. S. Lander, RNA-RNA interactions enable specific targeting of noncoding RNAs to nascent Pre-mRNAs and chromatin sites. Cell 159, 188–199 (2014).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ M. K. Iyer, Y. S. Niknafs, R. Malik, U. Singhal, A. Sahu, Y. Hosono, T. R. Barrette, J. R. Prensner, J. R. Evans, S. Zhao, A. Poliakov, X. Cao, S. M. Dhanasekaran, Y.-M. Wu, D. R. Robinson, D. G. Beer, F. Y. Feng, H. K. Iyer, A. M. Chinnaiyan, The landscape of long noncoding RNAs in the human transcriptome. Nat. Genet. 47, 199–208 (2015).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ J. L. Rinn, H. Y. Chang, Genome regulation by long noncoding RNAs. Annu. Rev. Biochem. 81, 145–166 (2012).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\nS. Geisler, J. Coller, RNA in unexpected places: Long non-coding RNA functions in diverse cellular contexts. Nat. Rev. Mol. Cell Biol. 14, 699–712 (2013).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ K. W. Vance, C. P. Ponting, Transcriptional regulatory functions of nuclear long noncoding RNAs. Trends Genet. 30, 348–355 (2014).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ C. Chu, Q. C. Zhang, S. T. da Rocha, R. A. Flynn, M. Bharadwaj, J. M. Calabrese, T. Magnuson, E. Heard, H. Y. Chang, Systematic discovery of Xist RNA binding proteins. Cell 161, 404–416 (2015).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ X. L. Zhao, Z. H. Zhao, W. C. Xu, J. Q. Hou, X. Y. Du, Increased expression of SPRY4-IT1 predicts poor prognosis and promotes tumor growth and metastasis in bladder cancer. Int. J. Clin. Exp. Pathol. 8, 1954–1960 (2015).Caltech ConnectPubMedGoogle Scholar\nY. Shi, J. Li, Y. Liu, J. Ding, Y. Fan, Y. Tian, L. Wang, Y. Lian, K. Wang, Y. Shu, The long noncoding RNA SPRY4-IT1 increases the proliferation of human breast cancer cells by upregulating ZNF703 expression. Mol. Cancer 14, 51 (2015).Caltech ConnectCrossRefPubMedGoogle Scholar\nL. Zhang, J. Huang, N. Yang, J. Greshock, M. S. Megraw, A. Giannakakis, S. Liang, T. L. Naylor, A. Barchetti, M. R. Ward, G. Yao, A. Medina, A. O’Brien-Jenkins, D. Katsaros, A. Hatzigeorgiou, P. A. Gimotty, B. L. Weber, G. Coukos, microRNAs exhibit high frequency genomic alterations in human cancer. Proc. Natl. Acad. Sci. U.S.A. 103, 9136–9141 (2006).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\nH. W. Xie, Q. Q. Wu, B. Zhu, F. J. Chen, L. Ji, S. Q. Li, C. M. Wang, Y. S. Tong, L. Tuo, M. Wu, Z. H. Liu, J. Lv, W. H. Shi, X. F. Cao, Long noncoding RNA SPRY4-IT1 is upregulated in esophageal squamous cell carcinoma and associated with poor prognosis. Tumour Biol. 35, 7743–7754 (2014).Caltech ConnectCrossRefPubMedGoogle Scholar\nW. Peng, G. Wu, H. Fan, J. Wu, J. Feng, Long noncoding RNA SPRY4-IT1 predicts poor patient prognosis and promotes tumorigenesis in gastric cancer. Tumour Biol. 36, 6751–6758 (2015).Caltech ConnectCrossRefPubMedGoogle Scholar\nJ. Mazar, W. Zhao, A. M. Khalil, B. Lee, J. Shelley, S. S. Govindarajan, F. Yamamoto, M. Ratnam, M. N. Aftab, S. Collins, B. N. Finck, X. Han, J. S. Mattick, M. E. Dinger, R. J. Perera, The functional characterization of long noncoding RNA SPRY4-IT1 in human melanoma cells. Oncotarget 5, 8959–8969 (2014).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ J. E. Wilusz, S. M. Freier, D. L. Spector, 3′ End processing of a long nuclear-retained noncoding RNA yields a tRNA-like cytoplasmic RNA. Cell 135, 919–932 (2008).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ D. Khaitan, M. E. Dinger, J. Mazar, J. Crawford, M. A. Smith, J. S. Mattick, R. J. Perera, The melanoma-upregulated long noncoding RNA SPRY4-IT1 modulates apoptosis and invasion. Cancer Res. 71, 3852–3862 (2011).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ B. Lee, J. Mazar, M. N. Aftab, F. Qi, J. Shelley, J.-L. Li, S. Govindarajan, F. Valerio, I. Rivera, T. Thurn, T. A. Tran, D. Kameh, V. Patel, R. J. Perera, Long noncoding RNAs as putative biomarkers for prostate cancer detection. J. Mol. Diagn. 16, 615–626 (2014).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ J. J. Quinn, H. Y. Chang, In situ dissection of RNA functional subunits by domain-specific chromatin isolation by RNA purification (dChIRP). Methods Mol. Biol. 1262, 199–213 (2015).Caltech ConnectGoogle Scholar\n↵ M. D. Simon, C. I. Wang, P. V. Kharchenko, J. A. West, B. A. Chapman, A. A. Alekseyenko, M. L. Borowsky, M. I. Kuroda, R. E. Kingston, The genomic binding sites of a noncoding RNA. Proc. Natl. Acad. Sci. U.S.A. 108, 20497–20502 (2011).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ J. M. Engreitz, A. Pandya-Jones, P. McDonel, A. Shishkin, K. Sirokman, C. Surka, S. Kadri, J. Xing, A. Goren, E. S. Lander, K. Plath, M. Guttman, The Xist lncRNA exploits three-dimensional genome architecture to spread across the X chromosome. Science 341, 1237973 (2013).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ D. Loughrey, K. E. Watters, A. H. Settle, J. B. Lucks, SHAPE-Seq 2.0: Systematic optimization and extension of high-throughput chemical probing of RNA secondary structure with next generation sequencing. Nucleic Acids Res. 42, e165 (2014).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ C. Braeutigam, L. Rago, A. Rolke, L. Waldmeier, G. Christofori, J. Winter, The RNA-binding protein Rbfox2: An essential regulator of EMT-driven alternative splicing and a mediator of cellular invasion. Oncogene 33, 1082–1092 (2014).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ S. Fransson, T. Martinsson, K. Ejeskär, Neuroblastoma tumors with favorable and unfavorable outcomes: Significant differences in mRNA expression of genes mapped at 1p36.2. Genes Chromosomes Cancer 46, 45–52 (2007).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ A. Subramanian, P. Tamayo, V. K. Mootha, S. Mukherjee, B. L. Ebert, M. A. Gillette, A. Paulovich, S. L. Pomeroy, T. R. Golub, E. S. Lander, J. P. Mesirov, Gene set enrichment analysis: A knowledge-based approach for interpreting genome-wide expression profiles. Proc. Natl. Acad. Sci. U.S.A. 102, 15545–15550 (2005).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ C. C. Stolt, P. Lommes, S. Hillgartner, M. Wegner, The transcription factor Sox5 modulates Sox10 function during melanocyte development. Nucleic Acids Res. 36, 5427–5440 (2008).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ G. S. Van Aller, N. Reynoird, O. Barbash, M. Huddleston, S. Liu, A.-F. Zmoos, P. McDevitt, R. Sinnamon, B. Le, G. Mas, R. Annan, J. Sage, B. A. Garcia, P. J. Tummino, O. Gozani, R. G. Kruger, Smyd3 regulates cancer cell phenotypes and catalyzes histone H4 lysine 5 methylation. Epigenetics 7, 340–343 (2012).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ R. Hamamoto, Y. Furukawa, M. Morita, Y. Iimura, F. P. Silva, M. Li, R. Yagyu, Y. Nakamura, SMYD3 encodes a histone methyltransferase involved in the proliferation of cancer cells. Nat. Cell Biol. 6, 731–740 (2004).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ B. Dai, W. Wan, P. Zhang, Y. Zhang, C. Pan, G. Meng, X. Xiao, Z. Wu, W. Jia, J. Zhang, L. Zhang, SET and MYND domain-containing protein 3 is overexpressed in human glioma and contributes to tumorigenicity. Oncol. Rep. 34, 2722–2730 (2015).Caltech ConnectPubMedGoogle Scholar\nR. Hamamoto, F. P. Silva, M. Tsuge, T. Nishidate, T. Katagiri, Y. Nakamura, Y. Furukawa, Enhanced SMYD3 expression is essential for the growth of breast cancer cells. Cancer Sci. 97, 113–118 (2006).Caltech ConnectCrossRefPubMedGoogle Scholar\nC. Liu, C. Wang, K. Wang, L. Liu, Q. Shen, K. Yan, X. Sun, J. Chen, J. Liu, H. Ren, H. Liu, Z. Xu, S. Hu, D. Xu, Y. Fan, SMYD3 as an oncogenic driver in prostate cancer by stimulation of androgen receptor transcription. J. Natl. Cancer Inst. 105, 1719–1728 (2013).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ F. Q. Vieira, P. Costa-Pinheiro, D. Almeida-Rios, I. Graca, S. Monteiro-Reis, S. Simões-Sousa, I. Carneiro, E. J. Sousa, M. I. Godinho, F. Baltazar, R. Henrique, C. Jeronimo, SMYD3 contributes to a more aggressive phenotype of prostate cancer and targets Cyclin D2 through H4K20me3. Oncotarget 6, 13644–13657 (2015).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ B. K. Yoo, P. K. Santhekadur, R. Gredler, D. Chen, L. Emdad, S. Bhutia, L. Pannell, P. B. Fisher, D. Sarkar, Increased RNA-induced silencing complex (RISC) activity contributes to hepatocellular carcinoma. Hepatology 53, 1538–1548 (2011).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ M. A. Blanco, M. Aleckovic, Y. Hua, T. Li, Y. Wei, Z. Xu, I. M. Cristea, Y. Kang, Identification of staphylococcal nuclease domain-containing 1 (SND1) as a Metadherin-interacting protein with metastasis-promoting functions. J. Biol. Chem. 286, 19982–19992 (2011).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ H. Kuruma, Y. Kamata, H. Takahashi, K. Igarashi, T. Kimura, K. Miki, J. Miki, H. Sasaki, N. Hayashi, S. Egawa, Staphylococcal nuclease domain-containing protein 1 as a potential tissue marker for prostate cancer. Am. J. Pathol. 174, 2044–2050 (2009).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ N. Wang, X. Du, L. Zang, N. Song, T. Yang, R. Dong, T. Wu, X. He, J. Lu, Prognostic impact of Metadherin–SND1 interaction in colon cancer. Mol. Biol. Rep. 39, 10497–10504 (2012).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ L. Emdad, A. Janjic, M. A. Alzubi, B. Hu, P. K. Santhekadur, M. E. Menezes, X.-N. Shen, S. K. Das, D. Sarkar, P. B. Fisher, Suppression of miR-184 in malignant gliomas upregulates SND1 and promotes tumor aggressiveness. Neuro Oncol. 17, 419–429 (2015).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ J. J. Raizer, W.-J. Hwu, K. S. Panageas, A. Wilton, D. E. Baldwin, E. Bailey, C. von Althann, L. A. Lamb, G. Alvarado, M. H. Bilsky, P. H. Gutin, Brain and leptomeningeal metastases from cutaneous melanoma: Survival outcomes based on clinical features. Neuro Oncol. 10, 199–207 (2008).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ J. Mazar, K. DeYoung, D. Khaitan, E. Meister, A. Almodovar, J. Goydos, A. Ray, R. J. Perera, The regulation of miRNA-211 expression and its role in melanoma cell invasiveness. PLOS ONE 5, e13779 (2011).Caltech ConnectGoogle Scholar\n↵ Y. Zhang, T. Liu, C. A. Meyer, J. Eeckhoute, D. S. Johnson, B. E. Bernstein, C. Nusbaum, R. M. Myers, M. Brown, W. Li, X. S. Liu, Model-based analysis of ChIP-Seq (MACS). Genome Biol. 9, R137 (2008).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ M. Martin, Cutadapt removes adapter sequences from high-throughput sequencing reads. EMBnet.journal 17, 10–12 (2011).Caltech ConnectGoogle Scholar\n↵ B. Langmead, C. Trapnell, M. Pop, S. L. Salzberg, Ultrafast and memory-efficient alignment of short DNA sequences to the human genome. Genome Biol. 10, R25 (2009).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ S. Aviran, C. Trapnell, J. B. Lucks, S. A. Mortimer, S. Luo, G. P. Schroth, J. A. Doudna, A. P. Arkin, L. Pachter, Modeling and automation of sequencing-based characterization of RNA structure. Proc. Natl. Acad. Sci. U.S.A. 108, 11069–11074 (2011).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ K. Darty, A. Denise, Y. Ponty, VARNA: Interactive drawing and editing of the RNA secondary structure. Bioinformatics 25, 1974–1975 (2009).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ M. Batish, P. van den Bogaard, F. R. Kramer, S. Tyagi, Neuronal mRNAs travel singly into dendrites. Proc. Natl. Acad. Sci. U.S.A. 109, 4645–4650 (2012).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ F. B. Markey, W. Ruezinsky, S. Tyagi, M. Batish, Fusion FISH imaging: Single-molecule detection of gene fusion transcripts in situ. PLOS ONE 9, e93488 (2014).Caltech ConnectGoogle Scholar\n↵ M. N. Cabili, M. C. Dunagin, P. D. McClanahan, A. Biaesch, O. Padovan-Merhar, A. Regev, J. L. Rinn, A. Raj, Localization and abundance analysis of human lncRNAs at single-cell and single-molecule resolution. Genome Biol. 16, 20 (2015).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ A. Lin, R. T. Wang, S. Ahn, C. C. Park, D. J. Smith, A genome-wide map of human genetic interactions inferred from radiation hybrid genotypes. Genome Res. 20, 1122–1132 (2010).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ W. Ritchie, S. Flamant, J. E. J. Rasko, Predicting microRNA targets and functions: Traps for the unwary. Nat. Methods 6, 397–398 (2009)."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"B. Lee, A. Sahoo, J. Marchica, E. Holzhauser, X. Chen, J.-L. Li, T. Seki, S. S. Govindarajan, F. B. Markey, M. Batish, S. J. Lokhande, S. Zhang, A. Ray, R. J. Perera, The long noncoding RNA\nSPRIGHTLY acts as an intranuclear organizing hub for pre-mRNA molecules. Sci. Adv. 3, e1602505 (2017)","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":"CA165184"},{"agency":"NIH","grant_number":"NCI 5P30CA030199"},{"agency":"Florida Department of Health","grant_number":""},{"agency":"Bankhead-Coley Cancer Research Program","grant_number":"5BC08"},{"agency":"NIH","grant_number":"DP5 OD012160"},{"agency":"Department of Defense","grant_number":"LC150653"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}