{"title":"Complex natural products as a driving force for discovery in organic chemistry","uri":"","abstract":"Our lab. is deeply interested in the discovery and development of new reaction methodol. en route to the chem. synthesis of complex bioactive mols. Over the course of the past ten years, research in our group at the California Institute of Technol. has been initiated in the general area of synthetic chem., with a focus on the development of new strategies for the prepn. of complex mols., including natural products that possess interesting structural, biol., and phys. properties. Concurrent to this program of target driven synthesis is a strong effort directed toward the development of new techniques and reaction methods, which will be useful for a range of applications. Typically, the complex target structure is used as an inspiration for the discovery of new reactions and technologies that may eventually be regarded as general synthetic methodol. Consequently, this approach provides access to a) novel, medicinally relevant structures, b) a general method for their synthesis, and c) new synthetic methods that will be beneficial for a host of applications. Our group has been heavily involved in the synthesis of complex natural products such as the cyanthiwigins, quinocarcin, lemonomycin, and the dragmacidins. These naturally occurring mols. possess promising biol. properties ranging from activity against antibiotic-resistant bacteria, to antiproliferative, to anti-HIV action. Furthermore, they are structurally novel and are inherently a challenge to the state-of-the-art in synthetic\nchem. In the process of completing the synthesis of these important compds., we have developed a no. of new methods that enabled their access. These topics will be discussed in the lecture.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251688","docid":251688,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253221","fileid":1253221,"datasetid":"document","objectid":251688,"filename":"Stoltz_2017pORGN-280.pdf","mime_type":"application/pdf","hash":"c7921987232cb937f660d20f2082a2e6","hash_type":"MD5","filesize":87722,"mtime":"2017-05-03 22:29:31","url":"http://authors.library.caltech.edu/77175/1/Stoltz_2017pORGN-280.pdf"}],"eprintid":77175,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"Stoltz_2017pORGN-280.pdf","content":"published"}],"note":"© 2017 American Chemical Society.","id":77175,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/71/75","datestamp":"2017-05-04 01:14:56","lastmod":"2017-05-04 01:14:56","status_changed":"2017-05-04 01:14:56","type":"conference_item","metadata_visibility":"show","creators":[{"given":"Brian M.","family":"Stoltz","id":"Stoltz-B-M","orcid":"0000-0001-9837-1528"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-04","date_type":"published","publication":"","volume":"","number":"","pagerange":"ORGN-280","id_number":"CaltechAUTHORS:20170503-152924409","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170503-152924409","related_url":[{"url":"https://www.acs.org/content/acs/en/meetings/spring-2017.html","type":"org","description":"Conference Website"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}