{"title":"Low activity microstates during sleep","uri":"","abstract":"Study Objectives: To better understand the distinct activity patterns of the brain during sleep, we observed and investigated periods of diminished oscillatory and population spiking activity lasting for seconds during non-REM sleep, which we call “LOW” activity sleep. \n\nMethods: We analyzed spiking and local field potential (LFP) activity of hippocampal CA1 region alongside neocortical electroencephalogram (EEG) and electromyogram (EMG) in 19 sessions from four male Long-Evans rats (262-363g) during natural wake/sleep across the 24-hr cycle, as well as data from other brain regions obtained from http://crcns.org. \n\nResults: LOW states lasted longer than OFF/DOWN states and were distinguished by a subset of “LOW-active” cells. LOW activity sleep was preceded and followed by increased sharp-wave ripple (SWR) activity. We also observed decreased slow-wave activity (SWA) and sleep spindles in the hippocampal LFP and neocortical EEG upon LOW onset, with a partial rebound immediately after LOW. LOW states demonstrated activity patterns consistent with sleep, but frequently transitioned into microarousals (MAs) and showed EMG and LFP differences from small-amplitude irregular activity (SIA) during quiet waking. Their likelihood decreased within individual non-REM epochs, yet increased over the course of sleep. By analyzing data from the entorhinal cortex of rats1, as well as the hippocampus, the medial prefrontal cortex the postsubiculum and the anterior thalamus of mice2, obtained from http://crcns.org, we confirmed that LOW states corresponded to markedly diminished activity simultaneously in all of these regions. \n\nConclusions: We propose that LOW states are an important microstate within non-REM sleep that provide respite from high-activity sleep, and may serve a restorative function.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251707","docid":251707,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253402","fileid":1253402,"datasetid":"document","objectid":251707,"filename":"zsx066.pdf","mime_type":"application/pdf","hash":"5f04501332f6a2ddd88d7c6bff8fc341","hash_type":"MD5","filesize":6618738,"mtime":"2017-05-04 15:44:55","url":"http://authors.library.caltech.edu/77186/1/zsx066.pdf"}],"eprintid":77186,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc","main":"zsx066.pdf","content":"accepted"},{"id":"http://authors.library.caltech.edu/id/document/251708","docid":251708,"rev_number":4,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253410","fileid":1253410,"datasetid":"document","objectid":251708,"filename":"067892.full.pdf","mime_type":"application/pdf","hash":"22990c3b2e17703a6c3917a0f46a7d89","hash_type":"MD5","filesize":2904231,"mtime":"2017-05-04 15:50:47","url":"http://authors.library.caltech.edu/77186/2/067892.full.pdf"}],"eprintid":77186,"pos":2,"placement":7,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"067892.full.pdf","content":"submitted"},{"id":"http://authors.library.caltech.edu/id/document/251709","docid":251709,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253412","fileid":1253412,"datasetid":"document","objectid":251709,"filename":"zsx066_suppl_LowFigS1.pdf","mime_type":"application/pdf","hash":"41c9378f83a13442de098e1f45528c60","hash_type":"MD5","filesize":720127,"mtime":"2017-05-04 15:50:57","url":"http://authors.library.caltech.edu/77186/3/zsx066_suppl_LowFigS1.pdf"}],"eprintid":77186,"pos":3,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc","main":"zsx066_suppl_LowFigS1.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/251710","docid":251710,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253414","fileid":1253414,"datasetid":"document","objectid":251710,"filename":"zsx066_suppl_LowFigS2.pdf","mime_type":"application/pdf","hash":"1e58cf9b07e177f5bd1bc318e0bbfdaa","hash_type":"MD5","filesize":3616402,"mtime":"2017-05-04 15:50:59","url":"http://authors.library.caltech.edu/77186/4/zsx066_suppl_LowFigS2.pdf"}],"eprintid":77186,"pos":4,"placement":3,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc","main":"zsx066_suppl_LowFigS2.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/251711","docid":251711,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253416","fileid":1253416,"datasetid":"document","objectid":251711,"filename":"zsx066_suppl_LowFigS3.pdf","mime_type":"application/pdf","hash":"f3a30e6d23b5c7fd2956f73600308ff1","hash_type":"MD5","filesize":382178,"mtime":"2017-05-04 15:51:06","url":"http://authors.library.caltech.edu/77186/5/zsx066_suppl_LowFigS3.pdf"}],"eprintid":77186,"pos":5,"placement":4,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc","main":"zsx066_suppl_LowFigS3.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/251712","docid":251712,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253418","fileid":1253418,"datasetid":"document","objectid":251712,"filename":"zsx066_suppl_LowFigS4.pdf","mime_type":"application/pdf","hash":"9d5b24420896caef01ce964d050a8147","hash_type":"MD5","filesize":677242,"mtime":"2017-05-04 15:51:09","url":"http://authors.library.caltech.edu/77186/6/zsx066_suppl_LowFigS4.pdf"}],"eprintid":77186,"pos":6,"placement":5,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc","main":"zsx066_suppl_LowFigS4.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/251713","docid":251713,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253420","fileid":1253420,"datasetid":"document","objectid":251713,"filename":"zsx066_suppl_LowFigS5.pdf","mime_type":"application/pdf","hash":"8747982c074f722a43018a893a165707","hash_type":"MD5","filesize":186399,"mtime":"2017-05-04 15:51:16","url":"http://authors.library.caltech.edu/77186/7/zsx066_suppl_LowFigS5.pdf"}],"eprintid":77186,"pos":7,"placement":6,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc","main":"zsx066_suppl_LowFigS5.pdf","content":"supplemental"}],"note":"© 2017 Sleep Research Society. Published by Oxford University Press [on behalf of the Sleep Research Society].\nThis is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited. \n\nWe are grateful to Adrien Peyrache, Kenji Mizuseki, and crcns.org for making their data readily available, and Christof Koch, Markus Schmidt, and Brendon O. Watson for valuable comments. This work was supported by NIH R01MH109170. \n\nAuthor Contributions: H.M. performed research. Y.N.B. performed analyses identifying LOW-active cells. H.M. and K.D. designed research and wrote the manuscript, with comments from Y.N.B. \n\nThe authors disclose that there are no off-label or investigational use, no conflicts of interest, and no clinical trials. A previous version of this paper was published in BioRXiv.","id":77186,"rev_number":17,"userid":18,"eprint_dir":"disk0/00/07/71/86","datestamp":"2017-05-04 15:57:35","lastmod":"2017-05-04 15:57:35","status_changed":"2017-05-04 15:57:35","type":"article","metadata_visibility":"show","creators":[{"given":"Hiroyuki","family":"Miyawaki","id":"Miyawaki-Hiroyuki","orcid":""},{"given":"Yazan N.","family":"Billeh","id":"Billeh-Y-N","orcid":""},{"given":"Kamran","family":"Diba","id":"Diba-K","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"Slow Wave Sleep, EEG Spectral Analysis, Microarousals, Infra-slow, SIA, NREM Sleep","date":"2017-04-18","date_type":"inpress","publication":"Sleep","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170504-084450190","refereed":true,"issn":"0161-8105","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170504-084450190","related_url":[{"url":"https://doi.org/10.1093/sleep/zsx066","type":"doi","description":"Article"},{"url":"https://academic.oup.com/sleep/article-lookup/doi/10.1093/sleep/zsx066","type":"pub","description":"Article"},{"url":"http://www.biorxiv.org/content/early/2016/10/28/067892","type":"org","description":"Discussion Paper"}],"referencetext":["1. Mizuseki K, Diba K, Pastalkova E, Teeters J, Sirota A, Buzsaki G. Neurosharing:\nlarge-scale data sets (spike, LFP) recorded from the hippocampal-entorhinal system in\nbehaving rats. F1000Res 2014;3:98. doi: 10.12688/f1000research.3895.1.\n2. Peyrache A, Buzsáki G. Extracellular recordings from multi-site silicon probes in the\nanterior thalamus and subicular formation of freely moving mice. CRCNS.org; 2015. doi:\n10.6080/K0G15XS1.\n3. Rechtschaffen A. Current perspectives on the function of sleep. Perspect Biol Med\n1998;41:359-90.\n4. Tononi G, Cirelli C. Sleep and the price of plasticity: from synaptic and cellular\nhomeostasis to memory consolidation and integration. Neuron 2014;81:12-34. doi:\n10.1016/j.neuron.2013.12.025.\n5. Rasch B, Born J. About sleep's role in memory. Physiol Rev 2013;93:681-766. doi:\n10.1152/physrev.00032.2012.\n6. Steriade M, Nunez A, Amzica F. A novel slow (\u003c 1 Hz) oscillation of neocortical\nneurons in vivo: depolarizing and hyperpolarizing components. J Neurosci 1993;13:3252-\n65.\n7. Buzsaki G. Hippocampal sharp wave-ripple: A cognitive biomarker for episodic\nmemory and planning. Hippocampus 2015;25:1073-188. doi: 10.1002/hipo.22488.\n8. Vyazovskiy VV, Olcese U, Lazimy YM, et al. Cortical firing and sleep homeostasis.\nNeuron 2009;63:865-78. doi: 10.1016/j.neuron.2009.08.024.\n9. Sirota A, Buzsaki G. Interaction between neocortical and hippocampal networks via\nslow oscillations. Thalamus Relat Syst 2005;3:245-59. doi:\n10.1017/S1472928807000258.\n10. Vyazovskiy VV, Harris KD. Sleep and the single neuron: the role of global slow\noscillations in individual cell rest. Nat Rev Neurosci 2013;14:443-51. doi:\n10.1038/nrn3494.\n11. Chan AW, Mohajerani MH, LeDue JM, Wang YT, Murphy TH. Mesoscale infraslow\nspontaneous membrane potential fluctuations recapitulate high-frequency activity cortical\nmotifs. Nat Commun 2015;6:7738. doi: 10.1038/ncomms8738.\n12. Aladjalova NA. Infra-slow rhythmic oscillations of the steady potential of the\ncerebral cortex. Nature 1957;179:957-9.\n13. Hiltunen T, Kantola J, Abou Elseoud A, et al. Infra-slow EEG fluctuations are\ncorrelated with resting-state network dynamics in fMRI. J Neurosci 2014;34:356-62. doi:\n10.1523/JNEUROSCI.0276-13.2014.\n14. Lorincz ML, Geall F, Bao Y, Crunelli V, Hughes SW. ATP-dependent infra-slow\n(\u003c0.1 Hz) oscillations in thalamic networks. PloS One 2009;4:e4447. doi:\n10.1371/journal.pone.0004447.\n15. Filippov IV, Williams WC, Krebs AA, Pugachev KS. Dynamics of infraslow\npotentials in the primary auditory cortex: component analysis and contribution of specific\nthalamic-cortical and non-specific brainstem-cortical influences. Brain Res\n2008;1219:66-77. doi: 10.1016/j.brainres.2008.04.011.\n16. He B, Raichle M. The fMRI signal, slow cortical potential and consciousness. Trends\nCogn Sci 2009;13:302-9. doi: citeulike-article-id:4886034\ndoi: 10.1016/j.tics.2009.04.004.\n17. Logothetis NK, Wandell BA. Interpreting the BOLD signal. Annu Rev Physiol\n2004;66:735-69. doi: 10.1146/annurev.physiol.66.082602.092845.\n18. Pickenhain L, Klingberg F. Hippocampal slow wave activity as a correlate of basic\nbehavioral mechanisms in the rat. Prog Brain Res 1967;27:218-27. doi: 10.1016/S0079-\n6123(08)63101-5.\n19. Bergmann BM, Winter JB, Rosenberg RS, Rechtschaffen A. NREM sleep with lowvoltage\nEEG in the rat. Sleep 1987;10:1-11.\n20. Jarosiewicz B, McNaughton BL, Skaggs WE. Hippocampal population activity\nduring the small-amplitude irregular activity state in the rat. J Neurosci 2002;22:1373-84.\n21. Vanderwolf CH. Limbic-diencephalic mechanisms of voluntary movement. Psychol\nRev 1971;78:83-113.\n22. Miyawaki H, Diba K. Regulation of Hippocampal Firing by Network Oscillations\nduring Sleep. Curr Biol 2016;26:893-902. doi: 10.1016/j.cub.2016.02.024.\n23. Schomburg EW, Fernandez-Ruiz A, Mizuseki K, et al. Theta phase segregation of\ninput-specific gamma patterns in entorhinal-hippocampal networks. Neuron 2014;84:470-\n85. doi: 10.1016/j.neuron.2014.08.051.\n24. Watson BO, Levenstein D, Greene JP, Gelinas JN, Buzsaki G. Network Homeostasis\nand State Dynamics of Neocortical Sleep. Neuron 2016;90:839-52. doi:\n10.1016/j.neuron.2016.03.036.\n25. Diba K, Buzsaki G. Hippocampal network dynamics constrain the time lag between\npyramidal cells across modified environments. J Neurosci 2008;28:13448-56.\n26. Csicsvari J, Hirase H, Czurko A, Buzsaki G. Reliability and state dependence of\npyramidal cell-interneuron synapses in the hippocampus: an ensemble approach in the\nbehaving rat. Neuron 1998;21:179-89.\n27. Sirota A, Montgomery S, Fujisawa S, Isomura Y, Zugaro M, Buzsaki G. Entrainment\nof neocortical neurons and gamma oscillations by the hippocampal theta rhythm. Neuron\n2008;60:683-97. doi: 10.1016/j.neuron.2008.09.014.\n28. Bartho P, Hirase H, Monconduit L, Zugaro M, Harris KD, Buzsaki G.\nCharacterization of neocortical principal cells and interneurons by network interactions\nand extracellular features. J Neurophysiol 2004;92:600-8. doi: 10.1152/jn.01170.2003.\n29. Schmitzer-Torbert N, Jackson J, Henze D, Harris K, Redish AD. Quantitative\nmeasures of cluster quality for use in extracellular recordings. Neuroscience 2005;131:1-\n11.\n30. Hazan L, Zugaro M, Buzsaki G. Klusters, NeuroScope, NDManager: a free software\nsuite for neurophysiological data processing and visualization. J Neurosci Methods\n2006;155:207-16.\n31. Bokil H, Andrews P, Kulkarni JE, Mehta S, Mitra PP. Chronux: a platform for\nanalyzing neural signals. J Neurosci Methods 2010;192:146-51. doi:\n10.1016/j.jneumeth.2010.06.020.\n32. Robinson TE, Kramis RC, Vanderwolf CH. Two types of cerebral activation during\nactive sleep: relations to behavior. Brain Res 1977;124:544-9.\n33. Buzsaki G. Theta oscillations in the hippocampus. Neuron 2002;33:325-40.\n34. Diba K, Amarasingham A, Mizuseki K, Buzsáki G. Millisecond timescale synchrony\namong hippocampal neurons. J Neurosci 2014;34:14984 –94.\n35. Sullivan D, Mizuseki K, Sorgi A, Buzsaki G. Comparison of sleep spindles and theta\noscillations in the hippocampus. J Neurosci 2014;34:662-74. doi:\n10.1523/JNEUROSCI.0552-13.2014.\n36. Isomura Y, Sirota A, Ozen S, et al. Integration and segregation of activity in\nentorhinal-hippocampal subregions by neocortical slow oscillations. Neuron\n2006;52:871-82.\n37. Hahn TT, Sakmann B, Mehta MR. Phase-locking of hippocampal interneurons'\nmembrane potential to neocortical up-down states. Nat Neurosci 2006;9:1359-61. doi:\n10.1038/nn1788.\n38. Hahn TT, McFarland JM, Berberich S, Sakmann B, Mehta MR. Spontaneous\npersistent activity in entorhinal cortex modulates cortico-hippocampal interaction in vivo.\nNat Neurosci 2012;15:1531-8. doi: 10.1038/nn.3236.\n39. Grosmark AD, Mizuseki K, Pastalkova E, Diba K, Buzsaki G. REM sleep\nreorganizes hippocampal excitability. Neuron 2012;75:1001-7. doi:\n10.1016/j.neuron.2012.08.015.\n40. Johnson LA, Euston DR, Tatsuno M, McNaughton BL. Stored-trace reactivation in\nrat prefrontal cortex is correlated with down-to-up state fluctuation density. J Neurosci\n2010;30:2650-61. doi: 30/7/2650 [pii]\n10.1523/JNEUROSCI.1617-09.2010.\n41. Luczak A, Bartho P, Marguet SL, Buzsaki G, Harris KD. Sequential structure of\nneocortical spontaneous activity in vivo. Proc Natl Acad Sci U S A 2007;104:347-52.\ndoi: 0605643104 [pii]\n10.1073/pnas.0605643104.\n42. Ji D, Wilson MA. Coordinated memory replay in the visual cortex and hippocampus\nduring sleep. Nat Neurosci 2007;10:100-7.\n43. Billeh YN, Schaub MT, Anastassiou CA, Barahona M, Koch C. Revealing cell\nassemblies at multiple levels of granularity. J Neurosci Methods 2014;236:92-106. doi:\n10.1016/j.jneumeth.2014.08.011.\n44. Jarosiewicz B, Skaggs WE. Hippocampal place cells are not controlled by visual\ninput during the small irregular activity state in the rat. J Neurosci 2004;24:5070-7. doi:\n10.1523/JNEUROSCI.5650-03.2004.\n45. Kay K, Sosa M, Chung JE, Karlsson MP, Larkin MC, Frank LM. A hippocampal\nnetwork for spatial coding during immobility and sleep. Nature 2016;531:185-90. doi:\n10.1038/nature17144.\n46. Massimini M, Huber R, Ferrarelli F, Hill S, Tononi G. The sleep slow oscillation as a\ntraveling wave. J Neurosci 2004;24:6862-70. doi: 10.1523/JNEUROSCI.1318-04.2004.\n47. Achermann P, Dijk DJ, Brunner DP, Borbely AA. A model of human sleep\nhomeostasis based on EEG slow-wave activity: quantitative comparison of data and\nsimulations. Brain Res Bull 1993;31:97-113.\n48. Hulse BK, Lubenov EV, Siapas AG. Brain State Dependence of Hippocampal\nSubthreshold Activity in Awake Mice. Cell Rep 2017;18:136-47. doi:\n10.1016/j.celrep.2016.11.084.\n49. Halasz P, Terzano M, Parrino L, Bodizs R. The nature of arousal in sleep. J Sleep Res\n2004;13:1-23.\n50. Jarosiewicz B, Skaggs WE. Level of arousal during the small irregular activity state\nin the rat hippocampal EEG. J Neurophysiol 2004;91:2649-57. doi:\n10.1152/jn.01082.2003.\n51. Roldan E, Weiss T, Fifkova E. Excitability Changes during the Sleep Cycle of the\nRat. Electroencephalogr Clin Neurophysiol 1963;15:775-85.\n52. Terzano MG, Mancia D, Salati MR, Costani G, Decembrino A, Parrino L. The cyclic\nalternating pattern as a physiologic component of normal NREM sleep. Sleep\n1985;8:137-45.\n53. Girardeau G, Cei A, Zugaro M. Learning-induced plasticity regulates hippocampal\nsharp wave-ripple drive. J Neurosci 2014;34:5176-83. doi: 10.1523/JNEUROSCI.4288-\n13.2014.\n54. Penttonen M, Nurminen N, Miettinen R, et al. Ultra-slow oscillation (0.025 Hz)\ntriggers hippocampal afterdischarges in Wistar rats. Neuroscience 1999;94:735-43.\n55. Vanhatalo S, Palva JM, Holmes MD, Miller JW, Voipio J, Kaila K. Infraslow\noscillations modulate excitability and interictal epileptic activity in the human cortex\nduring sleep. PNAS 2004;101:5053-7. doi: 10.1073/pnas.0305375101.\n56. Compte A, Sanchez-Vives MV, McCormick DA, Wang XJ. Cellular and network\nmechanisms of slow oscillatory activity (\u003c1 Hz) and wave propagations in a cortical\nnetwork model. J Neurophysiol 2003;89:2707-25. doi: 10.1152/jn.00845.2002.\n57. Kudrimoti HS, Barnes CA, McNaughton BL. Reactivation of hippocampal cell\nassemblies: effects of behavioral state, experience, and EEG dynamics. J Neurosci\n1999;19:4090-101.\n58. Genzel L, Kroes MC, Dresler M, Battaglia FP. Light sleep versus slow wave sleep in\nmemory consolidation: a question of global versus local processes? Trends Neurosci\n2014;37:10-9. doi: 10.1016/j.tins.2013.10.002.\n59. Halasz P. Hierarchy of micro-arousals and the microstructure of sleep. Neurophysiol\nClin 1998;28:461-75.\n60. Kuga N, Sasaki T, Takahara Y, Matsuki N, Ikegaya Y. Large-scale calcium waves\ntraveling through astrocytic networks in vivo. J Neurosci 2011;31:2607-14. doi:\n10.1523/JNEUROSCI.5319-10.2011.\n61. Chen Y, Swanson RA. Astrocytes and brain injury. J Cereb Blood Flow Metab\n2003;23:137-49.\n62. Porkka-Heiskanen T, Kalinchuk AV. Adenosine, energy metabolism and sleep\nhomeostasis. Sleep Med Rev 2011;15:123-35. doi: 10.1016/j.smrv.2010.06.005.\n63. Halassa MM, Florian C, Fellin T, et al. Astrocytic modulation of sleep homeostasis\nand cognitive consequences of sleep loss. Neuron 2009;61:213-9. doi:\n10.1016/j.neuron.2008.11.024."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Hiroyuki Miyawaki, Yazan N. Billeh, Kamran Diba; Low activity microstates during sleep. Sleep 2017 zsx066. doi: 10.1093/sleep/zsx066","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":"R01MH109170"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}