{"title":"An optically-gated AuNP–DNA protonic transistor","uri":"","abstract":"Bio-interface transistors, which manipulate the transportation of ions (i.e. protons), play an important role in bridging physical devices with biological functionalities, because electrical signals are carried by ions/protons in biological systems. All available ionic transistors use electrostatic gates to tune the ionic carrier density, which requires complicated interconnect wires. In contrast, an optical gate, which offers the advantages of remote control as well as multiple light wavelength selections, has never been explored for ionic devices. Here, we demonstrate a light-gated protonic transistor fabricated from an Au nanoparticle and DNA (AuNP–DNA) hybrid membrane. The device can be turned on and off completely by using light, with a high on/off current ratio of up to 2 orders of magnitude. Moreover, the device only responds to specific light wavelengths due to the plasmonic effect from the AuNPs, which enables the capability of wavelength selectivity. Our results open up new avenues for exploring remotely controlled ionic circuits, in vivo protonic switches, and other biomedical applications.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251696","docid":251696,"rev_number":4,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253342","fileid":1253342,"datasetid":"document","objectid":251696,"filename":"c6nr08944e.pdf","mime_type":"application/pdf","hash":"8649e71d4f837077f63baebb42deddcc","hash_type":"MD5","filesize":1651161,"mtime":"2017-05-04 14:43:00","url":"http://authors.library.caltech.edu/77182/1/c6nr08944e.pdf"}],"eprintid":77182,"pos":1,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"c6nr08944e.pdf","content":"inpress"},{"id":"http://authors.library.caltech.edu/id/document/251697","docid":251697,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253347","fileid":1253347,"datasetid":"document","objectid":251697,"filename":"c6nr08944e1.pdf","mime_type":"application/pdf","hash":"242875703d29ba50aabc5ae7d4b04e3a","hash_type":"MD5","filesize":374042,"mtime":"2017-05-04 14:44:09","url":"http://authors.library.caltech.edu/77182/2/c6nr08944e1.pdf"}],"eprintid":77182,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"c6nr08944e1.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/253167","docid":253167,"rev_number":4,"files":[{"id":"http://authors.library.caltech.edu/id/file/1266669","fileid":1266669,"datasetid":"document","objectid":253167,"filename":"c6nr08944e.pdf","mime_type":"application/pdf","hash":"0c5826286ce1bacb238325ab2756cda0","hash_type":"MD5","filesize":1655471,"mtime":"2017-06-05 18:09:25","url":"http://authors.library.caltech.edu/77182/3/c6nr08944e.pdf"}],"eprintid":77182,"pos":3,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"c6nr08944e.pdf","content":"published"}],"note":"© 2017 The Royal Society of Chemistry. \n\nReceived 16th November 2016, Accepted 10th April 2017, First published on 12th April 2017. \n\nThis work made use of the Cornell Center for Materials Research Shared Facilities which are supported through the NSF MRSEC program (DMR-1120296). \n\nThe authors declare no competing financial interest.","id":77182,"rev_number":16,"userid":18,"eprint_dir":"disk0/00/07/71/82","datestamp":"2017-05-04 16:21:24","lastmod":"2017-06-05 18:10:58","status_changed":"2017-05-04 16:21:24","type":"article","metadata_visibility":"show","creators":[{"given":"Songming","family":"Peng","id":"Peng-Songming","orcid":"0000-0002-2742-6584"},{"given":"Amit","family":"Lal","id":"Lal-Amit","orcid":""},{"given":"Dan","family":"Luo","id":"Luo-Dan","orcid":""},{"given":"Yuerui","family":"Lu","id":"Lu-Yuerui","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-06-07","date_type":"published","publication":"Nanoscale","volume":"9","number":"21","pagerange":"6953-6958","id_number":"CaltechAUTHORS:20170504-074254764","refereed":true,"issn":"2040-3364","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170504-074254764","related_url":[{"url":"http://dx.doi.org/10.1039/c6nr08944e","type":"doi","description":"Article"},{"url":"http://pubs.rsc.org/en/Content/ArticleLanding/2017/NR/C6NR08944E","type":"pub","description":"Article"},{"url":"http://www.rsc.org/suppdata/c6/nr/c6nr08944e/c6nr08944e1.pdf","type":"pub","description":"Supplementary Information"}],"referencetext":["1.J. Magee, D. Hoffman, C. Colbert and D. Johnston, Electrical and calcium signaling in dendrites of hippocampal pyramidal neurons, Annu. Rev. Physiol., 1998, 60, 327–346 CrossRef CAS PubMed .\n2.M. Forgac, Vacuolar ATPases: rotary proton pumps in physiology and pathophysiology, Nat. Rev. Mol. Cell Biol., 2007, 8, 917–929 CrossRef CAS PubMed .\n3.D. Morgan, et al., Voltage-gated proton channels maintain pH in human neutrophils during phagocytosis, Proc. Natl. Acad. Sci. U. S. A., 2009, 106, 18022–18027 CrossRef CAS PubMed .\n4.J. W. Ho and E. S. M. Po, Light-induced proton transport through chloroplast membranes, Biochem. Educ., 1996, 24, 179–180 CrossRef CAS .\n5.S. Subramaniam and R. Henderson, Molecular mechanism of vectorial proton translocation by bacteriorhodopsin, Nature, 2000, 406, 653–657 CrossRef CAS PubMed .\n6.T. J. M. Luo, R. Soong, E. Lan, B. Dunn and C. Montemagno, Photo-induced proton gradients and ATP biosynthesis produced by vesicles encapsulated in a silica matrix, Nat. Mater., 2005, 4, 220–224 CrossRef CAS PubMed .\n7.M. Irimia-Vladu, E. D. Glowacki, G. Voss, S. Bauer and N. S. Sariciftci, Green and biodegradable electronics, Mater. Today, 2012, 15, 340–346 CrossRef CAS .\n8.M. Irimia-Vladu, “Green” electronics: biodegradable and biocompatible materials and devices for sustainable future, Chem. Soc. Rev., 2014, 43, 588–610 RSC .\n9.C. Z. Liao, et al., Flexible Organic Electronics in Biology: Materials and Devices, Adv. Mater., 2015, 27, 7493–7527 CrossRef CAS PubMed .\n10.G. Tarabella, et al., New opportunities for organic electronics and bioelectronics: ions in action, Chem. Sci., 2013, 4, 1395–1409 RSC .\n11.K. Tybrandt, K. C. Larsson, A. Richter-Dahlfors and M. Berggren, Ion bipolar junction transistors, Proc. Natl. Acad. Sci. U. S. A., 2010, 107, 9929–9932 CrossRef CAS PubMed .\n12.C. Zhong, et al., A polysaccharide bioprotonic field-effect transistor, Nat. Commun., 2011, 2, 476 CrossRef PubMed .\n13.K. Tybrandt, R. Forchheimer and M. Berggren, Logic gates based on ion transistors, Nat. Commun., 2012, 3, 871 CrossRef PubMed .\n14.M. Magliulo, et al., Electrolyte-Gated Organic Field-Effect Transistor Sensors Based on Supported Biotinylated Phospholipid Bilayer, Adv. Mater., 2013, 25, 2090–2094 CrossRef CAS PubMed .\n15.G. Sun, S. Senapati and H. C. Chang, High-flux ionic diodes, ionic transistors and ionic amplifiers based on external ion concentration polarization by an ion exchange membrane: a new scalable ionic circuit platform, Lab Chip, 2016, 16, 1171–1177 RSC .\n16.J. Isaksson, et al., Electronic control of Ca2+ signalling in neuronal cells using an organic electronic ion pump, Nat. Mater., 2007, 6, 673–679 CrossRef CAS PubMed .\n17.Y. A. Song, et al., Electrochemical activation and inhibition of neuromuscular systems through modulation of ion concentrations with ion-selective membranes, Nat. Mater., 2011, 10, 980–986 CrossRef CAS PubMed .\n18.D. Khodagholy, et al., In vivo recordings of brain activity using organic transistors, Nat. Commun., 2013, 4, 1575 CrossRef PubMed .\n19.L. V. Wang and J. Yao, A practical guide to photoacoustic tomography in the life sciences, Nat. Meth., 2016, 13, 627–638 CAS .\n20.T.-M. Liu, J. Conde, T. Lipinski, A. Bednarkiewicz and C.-C. Huang, Revisiting the classification of NIR-absorbing/emitting nanomaterials for in vivo bioapplications, NPG Asia Mater., 2016, 8, e295 CrossRef CAS .\n21.D. Tischer and O. D. Weiner, Illuminating cell signalling with optogenetic tools, Nat. Rev. Mol. Cell Biol., 2014, 15, 551–558 CrossRef CAS PubMed .\n22.Z. Nie, A. Petukhova and E. Kumacheva, Properties and emerging applications of self-assembled structures made from inorganic nanoparticles, Nat. Nano, 2010, 5, 15–25 CrossRef CAS PubMed .\n23.S. Eustis and M. A. El-Sayed, Why gold nanoparticles are more precious than pretty gold: Noble metal surface plasmon resonance and its enhancement of the radiative and nonradiative properties of nanocrystals of different shapes, Chem. Soc. Rev., 2006, 35, 209–217 RSC .\n24.C. J. Murphy, et al., Anisotropic metal nanoparticles: Synthesis, assembly, and optical applications, J. Phys. Chem. B, 2005, 109, 13857–13870 CrossRef CAS PubMed .\n25.M. R. Jones, K. D. Osberg, R. J. Macfarlane, M. R. Langille and C. A. Mirkin, Templated Techniques for the Synthesis and Assembly of Plasmonic Nanostructures, Chem. Rev., 2011, 111, 3736–3827 CrossRef CAS PubMed .\n26.H. H. Richardson, M. T. Carlson, P. J. Tandler, P. Hernandez and A. O. Govorov, Experimental and Theoretical Studies of Light-to-Heat Conversion and Collective Heating Effects in Metal Nanoparticle Solutions, Nano Lett., 2009, 9, 1139–1146 CrossRef CAS PubMed .\n27.W. D. Kumler and J. J. Eiler, The acid strength of mono and diesters of phosphoric acid. The n-alkyl esters from methyl to butyl, the esters of biological importance, and the natural guanidine phosphoric acids, J. Am. Chem. Soc., 1943, 65, 2355–2361 CrossRef CAS .\n28.S. I. Chamberlin, E. J. Merino and K. M. Weeks, Catalysis of amide synthesis by RNA phosphodiester and hydroxyl groups, Proc. Natl. Acad. Sci. U. S. A., 2002, 99, 14688–14693 CrossRef CAS PubMed .\n29.J. F. Nagle, M. Mille and H. J. Morowitz, Theory of Hydrogen-Bonded Chains in Bioenergetics, J. Chem. Phys., 1980, 72, 3959–3971 CrossRef CAS .\n30.B. Schneider, D. Cohen and H. M. Berman, Hydration of DNA Bases - Analysis of Crystallographic Data, Biopolymers, 1992, 32, 725–750 CrossRef CAS PubMed .\n31.B. Schneider, K. Patel and H. M. Berman, Hydration of the phosphate group in double-helical DNA, Biophys. J., 1998, 75, 2422–2434 CrossRef CAS PubMed .\n32.A. A. Gorodetsky, M. C. Buzzeo and J. K. Barton, DNA-Mediated Electrochemistry, Bioconjugate Chem., 2008, 19, 2285–2296 CrossRef CAS PubMed .\n33.J. K. Barton, E. D. Olmon and P. A. Sontz, Metal complexes for DNA-mediated charge transport, Coord. Chem. Rev., 2011, 255, 619–634 CrossRef CAS PubMed .\n34.H. Morgan, R. Pethig and G. T. Stevens, A Proton-Injecting Technique for the Measurement of Hydration-Dependent Protonic Conductivity, J. Phys. E: Sci. Instrum., 1986, 19, 80–82 CrossRef CAS .\n35.D. D. Ordinario, L. Phan, J. M. Jocson, T. Nguyen and A. A. Gorodetsky, Protonic transistors from thin reflectin films, APL Mater., 2015, 3, 014907 CrossRef .\n36.Y. X. Deng, et al., H+-type and OH–type biological protonic semiconductors and complementary devices, Sci. Rep., 2013, 3, 2481 CrossRef PubMed .\n37.W. L. Cheng, N. Y. Park, M. T. Walter, M. R. Hartman and D. Luo, Nanopatterning self-assembled nanoparticle superlattices by moulding microdroplets, Nat. Nanotechnol., 2008, 3, 682–690 CrossRef CAS PubMed .\n38.T. B. Flanagan and W. A. Oates, The Palladium-Hydrogen System, Annu. Rev. Mater. Sci., 1991, 21, 269–304 CrossRef CAS .\n39.W. L. Cheng, et al., Free-standing nanoparticle superlattice sheets controlled by DNA, Nat. Mater., 2009, 8, 519–525 CrossRef CAS PubMed .\n40.D. D. Ordinario, et al., Photochemical Doping of Protonic Transistors from a Cephalopod Protein, Chem. Mater., 2016, 28, 3703–3710 \n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"DMR-1120296"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}