{"title":"Productivity patterns in the Equatorial Pacific over the last 30,000 years","uri":"","abstract":"The Equatorial Pacific traverses a number of productivity regimes, from the highly productive coastal upwelling along Peru to the near gyre-like productivity lows along the international dateline, making it an ideal target for investigating how biogeochemical systems respond to changing oceanographic conditions over time. However, conflicting reconstructions of productivity during periods of rapid climate change, like the last deglaciation, render the spatio-temporal response of Equatorial Pacific productivity ambiguous. In this study, surface productivity since the last glacial period (30,000 years ago) is reconstructed from seven cores near the Line Islands, Central Equatorial Pacific, and integrated with productivity records from across the Equatorial Pacific. Three coherent deglacial patterns in productivity are identified: 1) a monotonic glacial-Holocene increase in productivity, primarily along the Equator, associated with increasing nutrient concentrations over time, 2) a deglacial peak in productivity ~15,000 years ago due to transient entrainment of nutrient rich southern-sourced deep waters and 3) possible precessional cycles in productivity in the Eastern Equatorial Pacific that may be related to ITCZ migration and potential interactions with ENSO dynamics. These findings suggest that productivity was generally lower during the glacial period, a trend observed zonally across the Equatorial Pacific, while deglacial peaks in productivity may be prominent only in the East.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251706","docid":251706,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253396","fileid":1253396,"datasetid":"document","objectid":251706,"filename":"gbc20543.pdf","mime_type":"application/pdf","hash":"ac2aca2448f5183f2cec2b44935ad7d9","hash_type":"MD5","filesize":1272593,"mtime":"2017-05-04 15:39:07","url":"http://authors.library.caltech.edu/77185/1/gbc20543.pdf"}],"eprintid":77185,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"gbc20543.pdf","content":"accepted"}],"note":"© 2017 American Geophysical Union. \n\nAccepted manuscript online: 4 May 2017; Manuscript Accepted: 1 May 2017; Manuscript Revised: 28 April 2017; Manuscript Received: 10 November 2016. \n\nThe authors thank Martin Fleisher for technical assistance with U-Th-Pa chemistry and ICP-MS analysis at LDEO. The authors also appreciate valuable reviews from Patrick Rafter and one anonymous reviewer that helped to improve this manuscript. The new data presented here is publically available in the NOAA Paleoclimate repository upon acceptance. This research was funded in part by NSF-AGS 1502889 to J.F.M. and G.W. and a NSF Graduate Research Fellowship to K.M.C.","id":77185,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/71/85","datestamp":"2017-05-04 15:52:14","lastmod":"2017-05-04 15:52:14","status_changed":"2017-05-04 15:52:14","type":"article","metadata_visibility":"show","creators":[{"given":"Kassandra M.","family":"Costa","id":"Costa-K-M","orcid":""},{"given":"Allison W.","family":"Jacobel","id":"Jacobel-A-W","orcid":""},{"given":"Jerry F.","family":"McManus","id":"McManus-J-F","orcid":""},{"given":"Robert F.","family":"Anderson","id":"Anderson-R-F","orcid":""},{"given":"Gisela","family":"Winckler","id":"Winckler-G","orcid":""},{"given":"Nivedita","family":"Thiagarajan","id":"Thiagarajan-N","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"Equatorial Pacific; productivity; deglaciation","date":"2017-05-04","date_type":"inpress","publication":"Global Biogeochemical Cycles","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170504-083902931","refereed":true,"issn":"0886-6236","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170504-083902931","related_url":[{"url":"http://dx.doi.org/10.1002/2016GB005579","type":"doi","description":"Article"},{"url":"http://onlinelibrary.wiley.com/doi/10.1002/2016GB005579/abstract","type":"pub","description":"Article"}],"referencetext":["Allen, K. A., E. L. Sikes, B. H??nisch, A. C. Elmore, T. P. Guilderson, Y. Rosenthal, and R. F. Anderson (2015), Southwest Pacific deep water carbonate chemistry linked to high southern latitude climate and atmospheric CO2 during the Last Glacial Termination, Quat. Sci. Rev., 122, 180–191, doi:10.1016/j.quascirev.2015.05.007.\nAltabet, M. A. (2001), Nitrogen Isotopic Evidence for Micronutrient Control of Fractional NO- 3 Utilization in the Equatorial Pacific, Limnol. Oceanogr., 46(2), 368–380.\nAnderson, D. M. (2001), Attenuation of millennial-scale events by bioturbation in marine sediments, Paleoceanography, 16(4), 352–357, doi:10.1029/2000PA000530.\nAnderson, R., M. Fleisher, and Y. Lao (2006), Glacial–interglacial variability in the delivery of dust to the central equatorial Pacific Ocean, Earth Planet. Sci. Lett., 242(3–4), 406–414, doi:10.1016/j.epsl.2005.11.061.\nAnderson, R. F., M. P. Bacon, and P. G. Brewer (1983), Removal of 230Th and 231Pa at ocean margins, Earth Planet. Sci. Lett., 66, 73–90.\nAnderson, R. F., Y. Lao, W. S. Broecker, S. E. Trumbore, H. J. Hofmann, and W. Wolfli (1990), Boundary scavenging in the Pacific Ocean: a comparison of 10Be and 231Pa, Earth Planet. Sci. Lett., 96, 287–304.\nAnderson, R. F., M. Q. Fleisher, Y. Lao, and G. Winckler (2008), Modern CaCO3 preservation in equatorial Pacific sediments in the context of late-Pleistocene glacial cycles, Mar. Chem., 111(1–2), 30–46, doi:10.1016/j.marchem.2007.11.011.\nAnderson, R. F., S. Ali, L. Bradtmiller, S. H. H. Nielson, M. Q. Fleisher, B. E. Anderson, and L. H. Burckle (2009), Wind-driven upwelling in the Southern Ocean and the deglacial rise in atmospheric CO2, Science (80-. )., 323(March), 1443–1448.\nAyers, J. M., and P. G. Strutton (2013), Nutrient variability in Subantarctic Mode Waters forced by the Southern Annular Mode and ENSO, Geophys. Res. Lett., 40(13), 3419–3423, doi:10.1002/grl.50638.\nBacon, M. P. (1988), Tracers of chemical scavenging in the ocean: boundary effects and large-scale chemical fractionation, Philos. Trans. R. Soc. London, 325, 147–160.\nBaines, S. B., B. S. Twining, S. Vogt, W. M. Balch, N. S. Fisher, and D. M. Nelson (2011), Elemental composition of equatorial Pacific diatoms exposed to additions of silicic acid and iron, Deep Sea Res. Part II Top. Stud. Oceanogr., 58(3–4), 512–523, doi:10.1016/j.dsr2.2010.08.003.\nBarber, R. T., and F. P. Chavez (1991), Regulation of primary productivity rate in the equatorial Pacific, Limnol. Oceanogr., 36(8), 1803–1815, doi:10.4319/lo.1991.36.8.1803.\nBeaufort, L., T. De Garidel-Thoron, and A. C. Mix (2001), ENSO-like Forcing on Oceanic Primary Production During the Late Pleistocene, Science (80-. )., 293(September), 2440–2445.\nBerelson, W. M. et al. (1998), Biogenic budgets of particle rain, benthic remineralization and sediment accumulation in the equatorial Pacific, Deep Sea Res. Part II Top. Stud. Oceanogr., 44(9), 2251–2282.\nBerke, M. A., T. C. Johnson, J. P. Werne, S. Schouten, and J. S. Sinninghe Damsté (2012), A mid-Holocene thermal maximum at the end of the African Humid Period, Earth Planet. Sci. Lett., 351–352, 95–104.\nBradtmiller, L. I., R. F. Anderson, M. Q. Fleisher, and L. H. Burckle (2006), Diatom productivity in the equatorial Pacific Ocean from the last glacial period to the present: A test of the silicic acid leakage hypothesis, Paleoceanography, 21(4), PA4201, doi:10.1029/2006PA001282.\nBradtmiller, L. I., J. F. McManus, and L. F. Robinson (2014), 231Pa/230Th evidence for a weakened but persistent Atlantic meridional overturning circulation during Heinrich Stadial 1, Nat. Commun., 5, 5817, doi:10.1038/ncomms6817.\nBroccoli, A. J., K. A. Dahl, and R. J. Stouffer (2006), Response of the ITCZ to Northern Hemisphere cooling, Geophys. Res. Lett., 33, 1–4, doi:10.1029/2005GL024546.\nBrzezinski, M. A. et al. (2011), Co-limitation of diatoms by iron and silicic acid in the equatorial Pacific, Deep Sea Res. Part II Top. Stud. Oceanogr., 58(3–4), 493–511, doi:10.1016/j.dsr2.2010.08.005.\nBurke, A., and L. F. Robinson (2012), The Southern Ocean’s Role in Carbon Exchange During the Last Deglaciation, Science (80-. )., 335(6068), 557–561, doi:10.1126/science.1208163.\nCarolin, S. A., K. M. Cobb, J. F. Adkins, B. Clark, J. L. Conroy, S. Lejau, J. Malang, and a. a. Tuen (2013), Varied Response of Western Pacific Hydrology to Climate Forcings over the Last Glacial Period, Science (80-. )., 1564, doi:10.1126/science.1233797.\nChase, Z., R. F. Anderson, M. Q. Fleisher, and P. W. Kubik (2002), The influence of particle composition and particle flux on scavenging of Th, Pa and Be in the ocean, Earth Planet. Sci. Lett., 204, 215–229.\nChase, Z., R. F. Anderson, M. Q. Fleisher, and P. W. Kubik (2003), Scavenging of 230Th, 231Pa and 10Be in the Southern Ocean (SW Pacific sector): The importance of particle flux and advection, Deep Sea Res. Part II Top. Stud. Oceanogr., 50, 739–768.\nChavez, F. P., P. G. Strutton, G. Friederich, R. A. Feely, G. C. Feldman, D. G. Foley, and M. J. McPhaden (1999), Biological and Chemical Response of the Equatorial Pacific Ocean to the 1997-98 El Niño, Science (80-. )., 286(5447), 2126–2131.\nChiang, J. C. H. (2009), The Tropics in Paleoclimate, Annu. Rev. Earth Planet. Sci., 37, 263–297, doi:10.1146/annurev.earth.031208.100217.\nClement, A. C., R. Seager, and M. A. Cane (1999), Orbital controls on the El Niño/Southern Oscillation and the tropical climate, Paleoceanography, 14(4), 441–456.\nCoale, K. H., S. E. Fitzwater, R. M. Gordon, K. Johnson, and R. T. Barber (1996), Control of community growth and export production by upwelled iron in the equatorial Pacific Ocean, Nature, 379, 621–624.\nCosta, K., and J. McManus (2017), Efficacy of 230Th normalization in sediments from the Juan de Fuca Ridge, northeast Pacific Ocean, Geochim. Cosmochim. Acta, 197, 215–225, doi:10.1016/j.gca.2016.10.034.\nCosta, K. M., J. F. McManus, R. F. Anderson, H. Ren, D. M. Sigman, G. Winckler, M. Q. Fleisher, F. Marcantonio, and A. C. Ravelo (2016), No iron fertilization in the equatorial Pacific Ocean during the last ice age, Nature, 529(7587), 519–522, doi:10.1038/nature16453.\nDandonneau, Y., P. Y. Deschamps, J. M. Nicolas, H. Loisel, J. Blanchot, Y. Montel, F. Thieuleux, and G. Bécu (2004), Seasonal and interannual variability of ocean color and composition of phytoplankton communities in the North Atlantic, equatorial Pacific and South Pacific, Deep. Res. II, 51(1–3), 303–318, doi:doi:10.1016/j.dsr2.2003.07.018.\ndeMenocal, P. B., J. Ortiz, T. Guilderson, and M. Sarnthein (2000), Coherent High- and Low-Latitude Climate Variability During the Holocene Warm Period, Science (80-. )., 288, 2198–2202, doi:10.1126/science.288.5474.2198.\nDenton, G. H., R. F. Anderson, J. R. Toggweiler, R. L. Edwards, J. M. Schaefer, and A. E. Putnam (2010), The Last Glacial Termination, Science (80-. )., 328(June), 1652–1656.\nDinezio, P. N., A. Clement, G. A. Vecchi, B. Soden, A. J. Broccoli, B. L. O. Bliesner, and P. Braconnot (2011), The response of the Walker circulation to Last Glacial Maximum forcing: Implications for detection in proxies, Paleoceanography, 26, 1–21, doi:10.1029/2010PA002083.\nDoering, K., Z. Erdem, C. Ehlert, S. Fleury, M. Frank, and R. Schneider (2016), Changes in diatom productivity and upwelling intensity since the Last Glacial Maximum: Response to basin-scale atmospheric and oceanic forcing, Paleoceanography, doi:10.1002/2016PA002936.\nDubois, N., M. Kienast, S. Kienast, S. E. Calvert, R. Franois, and R. F. Anderson (2010), Sedimentary opal records in the eastern equatorial Pacific: It is not all about leakage, Global Biogeochem. Cycles, 24(4), 1–15, doi:10.1029/2010GB003821.\nDubois, N., M. Kienast, S. S. Kienast, and A. Timmermann (2014), Millennial-scale Atlantic/East Pacific sea surface temperature linkages during the last 100,000 years, Earth Planet. Sci. Lett., 396, 134–142, doi:10.1016/j.epsl.2014.04.008.\nEhlert, C., P. Grasse, and M. Frank (2013), Changes in silicate utilisation and upwelling intensity off Peru since the Last Glacial Maximum - insights from silicon and neodymium isotopes, Quat. Sci. Rev., 72, 18–35, doi:10.1016/j.quascirev.2013.04.013.\nFiedler, P. C., and L. D. Talley (2006), Hydrography of the eastern tropical Pacific: A review, Prog. Oceanogr., 69(2–4), 143–180, doi:10.1016/j.pocean.2006.03.008.\nFleisher, M. Q., and R. F. Anderson (2003), Assessing the collection efficiency of Ross Sea sediment traps using 230Th and 231Pa, Deep Sea Res. Part II Top. Stud. Oceanogr., 50, 693–712.\nFleitmann, D. et al. (2007), Holocene ITCZ and Indian monsoon dynamics recorded in stalagmites from Oman and Yemen (Socotra), Quat. Sci. Rev., 26, 170–188.\nFord, H. L., A. C. Ravelo, and P. J. Polissar (2015), Reduced El Niño – Southern Oscillation during the Last Glacial Maximum, Science (80-. )., 347, 255–258.\nFrancois, R. et al. (2007), Comment on “Do geochemical estimates of sediment focusing pass the sediment test in the equatorial Pacific?” by M. Lyle et al., Paleoceanography, 22(1), PA1216, doi:10.1029/2005PA001235.\nFuckar, N. S., S. Xie, R. Farneti, E. Maroon, and D. M. W. Frierson (2013), Influence of the extratropical ocean circulation on the intertropical convergence zone in an idealized coupled general circulation model, J. Clim., 26, 4612–4629.\nGalbraith, E. D., and S. L. Jaccard (2015), Deglacial weakening of the oceanic soft tissue pump: Global constraints from sedimentary nitrogen isotopes and oxygenation proxies, Quat. Sci. Rev., 109, 38–48, doi:10.1016/j.quascirev.2014.11.012.\nGasse, F. (2000), Hydrological changes in the African tropics since the Last Glacial Maximum, Quat. Sci. Rev., 19(1–5), 189–211, doi:10.1016/S0277-3791(99)00061-X.\nGeibert, W., and R. Usbeck (2004), Adsorption of thorium and protactinium onto different particle types: Experimental findings, Geochim. Cosmochim. Acta, 68(7), 1489–1501, doi:10.1016/j.gca.2003.10.011.\nHain, M. P., D. M. Sigman, and G. H. Haug (2014), Distinct roles of the Southern Ocean and North Atlantic in the deglacial atmospheric radiocarbon decline, Earth Planet. Sci. Lett., 394, 198–208, doi:10.1016/j.epsl.2014.03.020.\nHayes, C. T., R. F. Anderson, and M. Q. Fleisher (2011), Opal accumulation rates in the equatorial Pacific and mechanisms of deglaciation, Paleoceanography, 26(1), PA1207, doi:10.1029/2010PA002008.\nHayes, C. T., R. F. Anderson, S. L. Jaccard, R. François, M. Q. Fleisher, M. Soon, and R. Gersonde (2013), A new perspective on boundary scavenging in the North Pacific Ocean, Earth Planet. Sci. Lett., 369–370, 86–97, doi:10.1016/j.epsl.2013.03.008.\nHenderson, G. M., and R. F. Anderson (2003), The U-series Toolbox for Paleoceanography, Rev. Mineral. Geochemistry, 52, 493–531.\nHo, T.-Y., A. Quigg, Z. V. Finkel, A. J. Milligan, K. Wyman, P. G. Falkowski, and F. M. M. Morel (2003), The elemental composition of some marine phytoplankton, J. Phycol., 39, 1145–1159. \nHolte, J. W., L. D. Talley, T. K. Chereskin, and B. M. Sloyan (2012), The role of air-sea fluxes in Subantarctic Mode Water formation, J. Geophys. Res. Ocean., 117(3), 1–17, doi:10.1029/2011JC007798.\nHolte, J. W., L. D. Talley, T. K. Chereskin, and B. M. Sloyan (2013), Subantarctic mode water in the southeast pacific: Effect of exchange across the subantarctic front, J. Geophys. Res. Ocean., 118(4), 2052–2066, doi:10.1002/jgrc.20144.\nIvanova, E. V., L. Beaufort, L. Vidal, and M. Kucera (2012), Precession forcing of productivity in the Eastern Equatorial Pacific during the last glacial cycle, Quat. Sci. Rev., 40, 64–77, doi:10.1016/j.quascirev.2012.02.020.\nJacobel, A. W., J. F. McManus, R. F. Anderson, and G. Winckler (2016a), Climate-related response of dust flux to the central equatorial Pacific over the past 150 kyr, Earth Planet. Sci. Lett.\nJacobel, A. W., J. F. McManus, R. F. Anderson, and G. Winckler (2016b), Large deglacial shifts of the Pacific Intertropical Convergence Zone, Nat. Commun., 7, 10449, doi:10.1038/ncomms10449.\nKang, S. M., I. M. Held, D. M. W. Frierson, and M. Zhao (2008), The Response of the ITCZ to Extratropical Thermal Forcing: Idealized Slab-Ocean Experiments with a GCM, J. Clim., 21(14), 3521–3532, doi:10.1175/2007JCLI2146.1.\nKienast, M., S. S. Kienast, S. E. Calvert, T. I. Eglinton, G. Mollenhauer, R. Francois, and A. C. Mix (2006), Eastern Pacific cooling and Atlantic overturning circulation during the last deglaciation, Nature, 443, 846–849, doi:10.1038/nature05222.\nKienast, S. S., M. Kienast, A. C. Mix, S. E. Calvert, and R. François (2007), Thorium-230 normalized particle flux and sediment focusing in the Panama Basin region during the last 30,000 years, Paleoceanography, 22(2), n/a-n/a, doi:10.1029/2006PA001357.\nKienast, S. S., T. Friedrich, N. Dubois, P. S. Hill, A. Timmermann, A. C. Mix, and M. Kienast (2013), Near collapse of the meridional SST gradient in the eastern equatorial Pacific during Heinrich Stadial 1, Paleoceanography, 28(4), 663–674, doi:10.1002/2013PA002499.\nKohfeld, K. E., R. M. Graham, A. M. de Boer, L. C. Sime, E. W. Wolff, C. Le Quéré, and L. Bopp (2013), Southern Hemisphere westerly wind changes during the Last Glacial Maximum: Paleo-data synthesis, Quat. Sci. Rev., 68, 76–95, doi:10.1016/j.quascirev.2013.01.017.\nKoutavas, A., and J. Lynch-Stieglitz (2005), Variability of the marine ITCZ over the Eastern Pacific during the past 30,000 years, in The Hadley Circulation: Present, Past, and Future, edited by H. F. Diaz and R. S. Bradley, pp. 347–369, Kluwer Academic Publishers.\nKoutavas, A., J. Lynch-Stieglitz, T. M. Marchitto, and J. P. Sachs (2002), El Niño-like pattern in ice age tropical Pacific sea surface temperature., Science, 297(5579), 226–30, doi:10.1126/science.1072376.\nKretschmer, S., W. Geibert, M. M. Rutgers van der Loeff, C. Schnabel, S. Xu, and G. Mollenhauer (2011), Fractionation of 230Th, 231Pa, and 10Be induced by particle size and composition within an opal-rich sediment of the Atlantic Southern Ocean, Geochim. Cosmochim. Acta, 75(22), 6971–6987, doi:10.1016/j.gca.2011.09.012.\nLabatut, M., F. Lacan, C. Pradoux, J. Chmeleff, A. Radic, J. W. Murray, F. Poitrasson, A. M. Johansen, and F. Thil (2014), Iron sources and dissolved-particulate interactions in the seawater of the Western Equatorial Pacific, iron isotope perspectives, Global Biogeochem. Cycles, 28, doi:10.1002/2014GB004928, doi:10.1002/2014GB004928.Received.\nLiu, Z., and M. Alexander (2007), Atmospheric bridge, oceanic tunnel, and global climate teleconnections, Rev. Geophys., 45, RG2005, doi:10.1029/2005RG000172.1.INTRODUCTION.\nLoubere, P. (2000), Marine control of biological production in the eastern equatorial Pacific Ocean, Nature, 406(August), 497–500.\nLoubere, P. (2001), Nutrient and oceanographic changes in the Eastern Equatorial Pacific from the last full glacial to the present, Glob. Planet. Change, 29, 77–98, doi:10.1016/S0921-8181(00)00085-0.\nLyle, M. (1988), Climatically forced organic-carbon burial in equatorial Atlantic and Pacific oceans, Nature, 335, 529–532.\nLyle, M., N. Mitchell, N. Pisias, A. Mix, J. I. Martinez, and A. Paytan (2005), Do geochemical estimates of sediment focusing pass the sediment test in the equatorial Pacific?, Paleoceanography, 20(1), doi:10.1029/2004PA001019.\nLyle, M., N. Pisias, A. Paytan, J. I. Martinez, and A. Mix (2007), Reply to comment by R. Francois et al. on “Do geochemical estimates of sediment focusing pass the sediment test in the equatorial Pacific?”: Further explorations of 230 Th normalization, Paleoceanography, 22(1), doi:10.1029/2006PA001373.\nLyle, M., F. Marcantonio, W. S. Moore, R. W. Murray, C. Huh, B. P. Finney, D. W. Murray, and A. C. Mix (2014), Sediment size fractionation and focusing in the equatorial Pacific: Effect on 230Th normalization and paleo flux measurements, Paleoceanography, 29, 747–763, doi:10.1002/2014PA002616.Received.\nLyle, M. W., D. W. Murray, B. P. Finney, J. Dymond, J. M. Robbins, and K. Brooksforce (1988), The record of late Pleistocene biogenic sedimentation in the Eastern Tropical Pacific Ocean, Paleoceanography, 3(1), 39–59.\nLynch-Stieglitz, J. et al. (2015), Glacial-Interglacial Changes in Central Tropical Pacific Surface Seawater Property Gradients, Paleoceanography, 30, doi:10.1002/2014PA002746.\nManabe, S., and R. J. Stouffer (1995), Simulation of abrupt climate change induced by freshwater input to the North Atlantic Ocean, Nature, 378, 165–167.\nMarcantonio, F., M. Lyle, and R. Ibrahim (2014), Particle sorting during sediment redistribution processes and the effect on 230Th-normalized mass accumulation rates, Geophys. Res. Lett., 41, 5547–5554, doi:10.1002/2014GL060477.Received.\nMarshall, J., A. Donohoe, D. Ferreira, and D. McGee (2014), The ocean’s role in setting the mean position of the Inter-Tropical Convergence Zone, Clim. Dyn., 42(7–8), 1967–1979, doi:10.1007/s00382-013-1767-z.\nMartinez-Boti, M. A., G. Marino, G. L. Foster, P. Ziveri, M. J. Henehan, J. W. B. Rae, P. G. Mortyn, and D. Vance (2015), Boron isotope evidence for oceanic carbon dioxide leakage during the last deglaciation, Nature, 518, 219–222, doi:10.1038/nature14155.\nMartinez-Garcia, A., D. M. Sigman, H. Ren, R. F. Anderson, M. Straub, D. a. Hodell, S. L. Jaccard, T. I. Eglinton, and G. H. Haug (2014), Iron Fertilization of the Subantarctic Ocean During the Last Ice Age, Science (80-. )., 343, 1347–1350, doi:10.1126/science.1246848.\nMartinez, I., L. Keigwin, T. T. Barrows, and Y. Yokoyama (2003), La Niña-like conditions in the eastern equatorial Pacific and a stronger Choco jet in the northern Andes during the last glaciation, Paleoceanography, 18(2), doi:10.1029/2002PA000877.\nMartinez, I., D. Rincon, Y. Yokoyama, and T. Barrows (2006), Foraminifera and coccolithophorid assemblage changes in the Panama Basin during the last deglaciation: Response to sea-surface productivity induced by a transient climate change, Palaeogeogr. Palaeoclimatol. Palaeoecol., 234(1), 114–126, doi:10.1016/j.palaeo.2005.10.022.\nMartinez, P., and R. S. Robinson (2010), Increase in water column denitrification during the last deglaciation : the influence of oxygen demand in the eastern equatorial Pacific, Biogeosciences, 7, 1–9.\nMcGee, D., F. Marcantonio, and J. Lynch-Stieglitz (2007), Deglacial changes in dust flux in the eastern equatorial Pacific, Earth Planet. Sci. Lett., 257(1–2), 215–230, doi:10.1016/j.epsl.2007.02.033.\nMcGee, D., F. Marcantonio, J. F. McManus, and G. Winckler (2010), The response of excess 230Th and extraterrestrial 3He to sediment redistribution at the Blake Ridge, western North Atlantic, Earth Planet. Sci. Lett., 299(1–2), 138–149, doi:10.1016/j.epsl.2010.08.029.\nMcManus, J. F., R. Francois, J.-M. Gherardi, L. D. Keigwin, and S. Brown-Leger (2004), Collapse and rapid resumption of Atlantic meridional circulation linked to deglacial climate changes., Nature, 428(6985), 834–7, doi:10.1038/nature02494.\nMollenhauer, G., J. F. McManus, A. Benthien, P. J. Müller, and T. I. Eglinton (2006), Rapid lateral particle transport in the Argentine Basin: Molecular 14C and 230Thxs evidence, Deep Sea Res. Part I Oceanogr. Res. Pap., 53(7), 1224–1243, doi:10.1016/j.dsr.2006.05.005.\nMollenhauer, G., J. F. McManus, T. Wagner, I. N. McCave, and T. I. Eglinton (2011), Radiocarbon and 230Th data reveal rapid redistribution and temporal changes in sediment focussing at a North Atlantic drift, Earth Planet. Sci. Lett., 301(1–2), 373–381, doi:10.1016/j.epsl.2010.11.022.\nMoore, J. K., S. C. Doney, and K. Lindsay (2004), Upper ocean ecosystem dynamics and iron cycling in a global three-dimensional model, Global Biogeochem. Cycles, 18(4), 1–21, doi:10.1029/2004GB002220.\nMurray, R. W., M. Leinen, and C. W. Knowlton (2012), Links between iron input and opal deposition in the Pleistocene equatorial Pacific Ocean, Nat. Geosci., 5(4), 270–274, doi:10.1038/ngeo1422.\nNicholson, S. E. (2009), A revised picture of the structure of the “monsoon” and land ITCZ over West Africa, Clim. Dyn., 32(7–8), 1155–1171, doi:10.1007/s00382-008-0514-3.\nOppo, D. W., W. B. Curry, and J. F. McManus (2015), What do benthic δ13C and δ18O data tell us about Atlantic circulation during Heinrich Stadial 1?, Paleoceanography, 30(4), 353–368, doi:10.1002/2014PA002667.\nPark, J. Y., J. S. Kug, J. Park, S. W. Yeh, and C. J. Jang (2011), Variability of chlorophyll associated with El Nio-Southern Oscillation and its possible biological feedback in the equatorial Pacific, J. Geophys. Res. Ocean., 116(10), 1–16, doi:10.1029/2011JC007056.\nPaytan, A., M. Kastner, and F. P. Chavez (1996), Glacial to Interglacial Fluctuations in Productivity in the Equatorial Pacific as Indicated by Marine Barite, Science (80-. )., 274(5291), 1355–1357.\nPedersen, T. F. (1983), Increased productivity in the eastern equatorial Pacific during the last glacial maximum (19000-14000 yr B.P.), Geology, 11(1971), 16–19.\nPedersen, T. F., B. Nielsen, and M. Pickering (1991), Timing of Late Quaternary productivity pulses in the Panama Basin and implications for atmospheric CO2, Paleoceanography, 6(6), 657–677, doi:10.1029/91PA02532.\nPena, L. D., I. Cacho, P. Ferretti, and M. a. Hall (2008), El Niño-Southern Oscillation-like variability during glacial terminations and interlatitudinal teleconnections, Paleoceanography, 23(3), n/a-n/a, doi:10.1029/2008PA001620.\nPena, L. D., S. L. Goldstein, S. R. Hemming, K. M. Jones, E. Calvo, C. Pelejero, and I. Cacho (2013), Rapid changes in meridional advection of Southern Ocean intermediate waters to the tropical Pacific during the last 30kyr, Earth Planet. Sci. Lett., 368, 20–32, doi:10.1016/j.epsl.2013.02.028.\nPerks, H. M., C. D. Charles, and R. F. Keeling (2002), Precessionally forced productivity variations across the equatorial Pacific, Paleoceanography, 17(3), 1–7, doi:10.1029/2000PA000603.\nPichat, S., K. W. W. Sims, R. Francois, J. F. McManus, S. Brown-Leger, and F. Albarede (2004), Lower export production during glacial periods in the equatorial Pacific derived from (231Pa/230Th)xs,0 measurements in deep-sea sediments, Paleoceanography, 19(4), PA4023, doi:10.1029/2003PA000994.\nPichevin, L. E., B. C. Reynolds, R. S. Ganeshram, I. Cacho, L. Pena, K. Keefe, and R. M. Ellam (2009), Enhanced carbon pump inferred from relaxation of nutrient limitation in the glacial ocean., Nature, 459(7250), 1114–1117, doi:10.1038/nature08101.\nPiotrowski, A. M., S. L. Goldstein, S. R. Hemming, and R. G. Fairbanks (2004), Intensification and variability of ocean thermohaline circulation through the last deglaciation, Earth Planet. Sci. Lett., 225(1–2), 205–220, doi:10.1016/j.epsl.2004.06.002.\nPoggemann, D., E. C. Hathorne, D. Nürnberg, M. Frank, I. Bruhn, S. Reißig, and A. Bahr (2017), Rapid deglacial injection of nutrients into the tropical Atlantic via Antarctic Intermediate Water, Earth Planet. Sci. Lett., 463, 118–126, doi:10.1016/j.epsl.2017.01.030.\nQin, X., L. Menviel, A. Sen Gupta, and E. Sebille (2016), Iron sources and pathways into the Pacific Equatorial Undercurrent, Geophys. Res. Lett., 43, 9843–9851, doi:10.1002/2016GL070501.Received.\nRafter, P. a., P. J. DiFiore, and D. M. Sigman (2013), Coupled nitrate nitrogen and oxygen isotopes and organic matter remineralization in the Southern and Pacific Oceans, J. Geophys. Res. Ocean., 118(10), 4781–4794, doi:10.1002/jgrc.20316.\nRafter, P. A., and C. D. Charles (2012), Pleistocene equatorial Pacific dynamics inferred from the zonal asymmetry in sedimentary nitrogen isotopes, Paleoceanography, 27(September), PA3102, doi:10.1029/2012PA002367.\nRafter, P. A., and D. M. Sigman (2016), Spatial distribution and temporal variation of nitrate nitrogen and oxygen isotopes in the upper equatorial Pacific Ocean, Limnol. Oceanogr., 61(1), 14–31, doi:10.1002/lno.10152.\nRafter, P. A., D. M. Sigman, C. D. Charles, J. Kaiser, and G. H. Haug (2012), Subsurface tropical Pacific nitrogen isotopic composition of nitrate: Biogeochemical signals and their transport, Global Biogeochem. Cycles, 26, GB1003, doi:10.1029/2010GB003979.\nRegoli, F., T. de Garidel-Thoron, K. Tachikawa, Z. Jian, L. Ye, A. W. Droxler, G. Lenoir, M. Crucifix, N. Barbarin, and L. Beaufort (2015), Progressive shoaling of the equatorial Pacific thermocline over the last eight glacial periods, Paleoceanography, 30, 439–455, doi:10.1002/2014PA002696.\nReimi, M. A., and F. Marcantonio (2016), Constraints on the magnitude of the deglacial migration of the ITCZ in the Central Equatorial Pacific Ocean, Earth Planet. Sci. Lett., 453, 1–8, doi:10.1016/j.epsl.2016.07.058.\nRichaud, M., P. Loubere, S. Pichat, and R. Francois (2007), Changes in opal flux and the rain ratio during the last 50,000 years in the equatorial Pacific, Deep. Res. Part II Top. Stud. Oceanogr., 54(5–7), 762–771, doi:10.1016/j.dsr2.2007.01.012.\nRobinson, R. S., D. M. Sigman, P. J. DiFiore, M. M. Rohde, T. A. Mashiotta, and D. W. Lea (2005), Diatom-bound 15N/14 N: New support for enhanced nutrient consumption in the ice age subantarctic, Paleoceanography, 20, PA3003, doi:10.1029/2004PA001114.\nRobinson, R. S., P. Martinez, L. D. Pena, and I. Cacho (2009), Nitrogen isotopic evidence for deglacial changes in nutrient supply in the eastern equatorial Pacific, Paleoceanography, 24, PA4213, doi:10.1029/2008PA001702.\nSaito, M. A., M. R. McIlvin, D. M. Moran, T. J. Goepfert, G. R. DiTullio, A. F. Post, and C. H. Lamborg (2014), Multiple nutrient stresses at intersecting Pacific Ocean biomes detected by protein biomarkers., Science, 345(6201), 1173–7, doi:10.1126/science.1256450.\nSarmiento, J. L., N. Gruber, M. a Brzezinski, and J. P. Dunne (2004), High-latitude controls of thermocline nutrients and low latitude biological productivity., Nature, 427(6969), 56–60, doi:10.1038/nature02127.\nSarnthein, M., K. Winn, and R. Zahn (1987), Paleoproductivity of oceanic upwelling and the effect on atmospheric CO2 and climatic change during deglaciation times, Abrupt Clim. Chang., 311–337.\nSarnthein, M., K. Winn, J. ‐C Duplessy, and M. R. Fontugne (1988), Global variations of surface ocean productivity in low and mid latitudes: Influence on CO2 reservoirs of the deep ocean and atmosphere during the last 21,000 years, Paleoceanography, 3(3), 361–399, doi:10.1029/PA003i003p00361.\nSchneider, T., T. Bischoff, and G. H. Haug (2014), Migrations and dynamics of the intertropical convergence zone., Nature, 513(7516), 45–53.\nShaari, H. bin, M. Yamamoto, and T. Irino (2013), Enhanced upwelling in the eastern equatorial Pacific at the last five glacial terminations, Palaeogeogr. Palaeoclimatol. Palaeoecol., 386, 8–15, doi:10.1016/j.palaeo.2013.03.022.\nSlemons, L., B. Paul, J. Resing, and J. W. Murray (2012), Particulate iron, aluminum, and manganese in the Pacific equatorial undercurrent and low latitude western boundary current sources, Mar. Chem., 142–144, 54–67, doi:10.1016/j.marchem.2012.08.003.\nSlemons, L. O., J. W. Murray, J. Resing, B. Paul, and P. Dutrieux (2010), Western Pacific coastal sources of iron, manganese, and aluminum to the Equatorial Undercurrent, Global Biogeochem. Cycles, 24, 1–16, doi:10.1029/2009GB003693.\nSpero, H. J., and D. W. Lea (2002), The Cause of Carbon Isotope Minimum Events on Glacial Terminations, Science (80-. )., 447(January), 522–525.\nStrutton, P. G., W. Evans, and F. P. Chavez (2008), Equatorial Pacific chemical and biological variability, 1997-2003, Global Biogeochem. Cycles, 22(2), 1997–2003, doi:10.1029/2007GB003045.\nStrutton, P. G., A. P. Palacz, R. C. Dugdale, F. Chai, A. Marchi, A. E. Parker, V. Hogue, and F. P. Wilkerson (2011), The impact of equatorial Pacific tropical instability waves on hydrography and nutrients: 2004-2005, Deep Sea Res. Part II Top. Stud. Oceanogr., 58(3–4), 284–295, doi:10.1016/j.dsr2.2010.08.015.\nThunell, R. C., M. Qingmin, S. E. Calvert, and T. F. Pedersen (1992), Glacial-Holocene Biogenic Sedimentation Patterns in the South China Sea: Productivity Variations and Surface Water pCO 2, Paleoceanography, 7(2), 143–162, doi:10.1029/92PA00278.\nToggweiler, J. R., J. L. Russell, and S. R. Carson (2006), Midlatitude westerlies, atmospheric CO2, and climate change during the ice ages, Paleoceanography, 21(2), 1–15, doi:10.1029/2005PA001154.\nTrauth, M. H. (2013), TURBO2: A MATLAB simulation to study the effects of bioturbation on paleoceanographic time series, Comput. Geosci., 61, 1–10, doi:10.1016/j.cageo.2013.05.003.\nTurk, D., M. J. McPhaden, A. J. Busalacchi, and M. R. Lewis (2001), Remotely sensed biological production in the equatorial Pacific, Science (80-. )., 293(July), 471–474.\nVellinga, M., and R. A. Wood (2002), Global climatic impacts of a collapse of the atlantic thermohaline circulation, Clim. Change, 251–267.\nWaliser, D. E., and C. Gautier (1993), A satellite-derived climatology of the ITCZ, J. Clim., 6, 2162–2174.\nWang, C., and P. C. Fiedler (2006), ENSO variability and the eastern tropical Pacific: A review, Prog. Oceanogr., 69, 239–266.\nWang, X., J. R. Christian, R. Murtugudde, and A. J. Busalacchi (2006), Spatial and temporal variability in new production in the equatorial Pacific during 1980-2003: Physical and biogeochemical controls, Deep. Res. Part II Top. Stud. Oceanogr., 53(5–7), 677–697, doi:10.1016/j.dsr2.2006.01.023.\nWinckler, G., R. F. Anderson, M. Q. Fleisher, D. McGee, and N. Mahowald (2008), Covariant glacial-interglacial dust fluxes in the equatorial Pacific and Antarctica., Science, 320(5872), 93–96, doi:10.1126/science.1150595.\nWinckler, G., R. F. Anderson, S. L. Jaccard, and F. Marcantonio (2016), Ocean dynamics, not dust, have controlled equatorial Pacific productivity over the past 500,000 years, Proc. Natl. Acad. Sci., 113(22), 6119–6124, doi:10.1073/pnas.1600616113.\nZhang, R., and T. L. Delworth (2005), Simulated tropical response to a substantial weakening of the Atlantic thermohaline circulation, J. Clim., 18, 1853–1860."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Costa, K. M., A. W. Jacobel, J. F. McManus, R. F. Anderson, G. Winckler, and N. Thiagarajan (2017), Productivity patterns in the Equatorial Pacific over the last 30,000 years, Global Biogeochem. Cycles, 31, doi:10.1002/2016GB005579","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"AGS-1502889"},{"agency":"NSF Graduate Research Fellowship","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}