{"title":"Short FtsZ filaments can drive asymmetric cell envelope constriction at the onset of bacterial cytokinesis","uri":"","abstract":"FtsZ, the bacterial homologue of eukaryotic tubulin, plays a central role in cell division in nearly all bacteria and many archaea. It forms filaments under the cytoplasmic membrane at the division site where, together with other proteins it recruits, it drives peptidoglycan synthesis and constricts the cell. Despite extensive study, the arrangement of FtsZ filaments and their role in division continue to be debated. Here, we apply electron cryotomography to image the native structure of intact dividing cells and show that constriction in a variety of Gram‐negative bacterial cells, including Proteus mirabilis and Caulobacter crescentus, initiates asymmetrically, accompanied by asymmetric peptidoglycan incorporation and short FtsZ‐like filament formation. These results show that a complete ring of FtsZ is not required for constriction and lead us to propose a model for FtsZ‐driven division in which short dynamic FtsZ filaments can drive initial peptidoglycan synthesis and envelope constriction at the onset of cytokinesis, later increasing in length and number to encircle the division plane and complete constriction.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251723","docid":251723,"rev_number":4,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253519","fileid":1253519,"datasetid":"document","objectid":251723,"filename":"embj.201696235.full.pdf","mime_type":"application/pdf","hash":"3368a6ce606e564537d9bcbf01a02b40","hash_type":"MD5","filesize":2904373,"mtime":"2017-05-04 17:32:33","url":"http://authors.library.caltech.edu/77194/1/embj.201696235.full.pdf"}],"eprintid":77194,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"embj.201696235.full.pdf","content":"inpress"},{"id":"http://authors.library.caltech.edu/id/document/253160","docid":253160,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1266631","fileid":1266631,"datasetid":"document","objectid":253160,"filename":"1577.full.pdf","mime_type":"application/pdf","hash":"0022cfcb2558f315db5711661b09943a","hash_type":"MD5","filesize":2913462,"mtime":"2017-06-05 17:14:56","url":"http://authors.library.caltech.edu/77194/2/1577.full.pdf"}],"eprintid":77194,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"1577.full.pdf","content":"published"}],"note":"© 2017 The Authors. \n\nReceived 2 December 2016; Revised 17 March 2017; Accepted 23 March 2017. Published online 24.04.2017. \n\nWe thank Dr. Yves Brun and Mr. Erkin Kuru at Indiana University for providing reagents and technical assistance. We thank Prof. Douglas Weibel at University of Wisconsin‐Madison for providing the Proteus mirabilis strain. We thank Dr. Brian Hedlund at the University of Nevada for providing the Belliella baltica‐related strain. We are also grateful to all members of the Jensen laboratory for discussion and technical assistance. This work was supported by the Howard Hughes Medical Institute. \n\nAuthor contributions: QY and GJJ conceived and designed the experiments. QY, Y‐WC, MB, CVI, AB, and DG performed the experiments. AIJ wrote the software and made measurements. QY, AIJ, CMO, and GJJ analyzed the data. QY, AIJ, Y‐WC, CMO, and GJJ wrote the paper. \n\nThe authors declare that they have no conflict of interest.","id":77194,"rev_number":20,"userid":18,"eprint_dir":"disk0/00/07/71/94","datestamp":"2017-05-04 18:35:13","lastmod":"2017-06-06 18:03:45","status_changed":"2017-06-06 18:03:45","type":"article","metadata_visibility":"show","creators":[{"given":"Qing","family":"Yao","id":"Yao-Qing","orcid":""},{"given":"Andrew I.","family":"Jewett","id":"Jewett-A-I","orcid":""},{"given":"Yi‐Wei","family":"Chang","id":"Chang-Yi-Wei","orcid":""},{"given":"Catherine M.","family":"Oikonomou","id":"Oikonomou-C-M","orcid":""},{"given":"Morgan","family":"Beeby","id":"Beeby-M-D","orcid":"0000-0001-6413-9835"},{"given":"Cristina V.","family":"Iancu","id":"Iancu-C-V","orcid":""},{"given":"Ariane","family":"Briegel","id":"Briegel-A","orcid":"0000-0003-3733-3725"},{"given":"Debnath","family":"Ghosal","id":"Ghosal-D","orcid":""},{"given":"Grant J.","family":"Jensen","id":"Jensen-G-J","orcid":"0000-0003-1556-4864"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"asymmetric division; bacterial cell division; Caulobacter crescentus; electron cryotomography; FtsZ","date":"2017-06-01","date_type":"published","publication":"EMBO Journal","volume":"36","number":"11","pagerange":"1577-1589","id_number":"CaltechAUTHORS:20170504-103226288","refereed":true,"issn":"1460-2075","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170504-103226288","related_url":[{"url":"http://dx.doi.org/10.15252/embj.201696235","type":"doi","description":"Article"},{"url":"http://emboj.embopress.org/content/36/11/1577","type":"pub","description":"Article"},{"url":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5452018/","type":"pmc","description":"Article"}],"referencetext":["↵Adams DW, Errington J (2009) Bacterial cell division: assembly, maintenance and disassembly of the Z ring. Nat Rev Microbiol 7: 642–653CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Addinall SG, Lutkenhaus J (1996) FtsZ‐spirals and ‐arcs determine the shape of the invaginating septa in some mutants of Escherichia coli. Mol Microbiol 22: 231–237CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Anderson DE, Gueiros‐Filho FJ, Erickson HP (2004) Assembly dynamics of FtsZ rings in Bacillus subtilis and Escherichia coli and effects of FtsZ‐regulating proteins. J Bacteriol 186: 5775–5781Abstract/FREE Full TextGoogle Scholar\n↵Bendezu FO, de Boer PA (2008) Conditional lethality, division defects, membrane involution, and endocytosis in mre and mrd shape mutants of Escherichia coli. J Bacteriol 190: 1792–1811Abstract/FREE Full TextGoogle Scholar\n↵Bi EF, Lutkenhaus J (1991) FtsZ ring structure associated with division in Escherichia coli. Nature 354: 161–164CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Bisson‐Filho AW, Hsu Y‐P, Squyres GR, Kuru E, Wu F, Jukes C, Sun Y, Dekker C, Holden S, VanNieuwenhze MS, Brun YV, Garner EC (2017) Treadmilling by FtsZ filaments drives peptidoglycan synthesis and bacterial cell division. Science 355: 739–743Abstract/FREE Full TextGoogle Scholar\n↵Biteen JS, Goley ED, Shapiro L, Moerner WE (2012) Three‐dimensional super‐resolution imaging of the midplane protein FtsZ in live Caulobacter crescentus cells using astigmatism. ChemPhysChem 13: 1007–1012CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Buss J, Coltharp C, Huang T, Pohlmeyer C, Wang SC, Hatem C, Xiao J (2013) In vivo organization of the FtsZ‐ring by ZapA and ZapB revealed by quantitative super‐resolution microscopy. Mol Microbiol 89: 1099–1120CrossRefPubMedGoogle Scholar\n↵Buss J, Coltharp C, Shtengel G, Yang X, Hess H, Xiao J (2015) A multi‐layered protein network stabilizes the Escherichia coli FtsZ‐ring and modulates constriction dynamics. PLoS Genet 11: e1005128CrossRefPubMedGoogle Scholar\n↵Cabeen MT, Charbon G, Vollmer W, Born P, Ausmees N, Weibel DB, Jacobs‐Wagner C (2009) Bacterial cell curvature through mechanical control of cell growth. EMBO J 28: 1208–1219Abstract/FREE Full TextGoogle Scholar\n↵Charbon G, Brustad E, Scott KA, Wang J, Lobner‐Olesen A, Schultz PG, Jacobs‐Wagner C, Chapman E (2011) Subcellular protein localization by using a genetically encoded fluorescent amino acid. ChemBioChem 12: 1818–1821CrossRefPubMedGoogle Scholar\n↵Coltharp C, Buss J, Plumer TM, Xiao J (2016) Defining the rate‐limiting processes of bacterial cytokinesis. Proc Natl Acad Sci USA 113: E1044–E1053Abstract/FREE Full TextGoogle Scholar\n↵Corbin BD, Yu XC, Margolin W (2002) Exploring intracellular space: function of the Min system in round‐shaped Escherichia coli. EMBO J 21: 1998–2008Abstract/FREE Full TextGoogle Scholar\n↵Costa T, Priyadarshini R, Jacobs‐Wagner C (2008) Localization of PBP3 in Caulobacter crescentus is highly dynamic and largely relies on its functional transpeptidase domain. Mol Microbiol 70: 634–651CrossRefPubMedGoogle Scholar\n↵Ding HJ, Oikonomou CM, Jensen GJ (2015) The caltech tomography database and automatic processing pipeline. J Struct Biol 192: 279–286Google Scholar\n↵Egan AJ, Vollmer W (2013) The physiology of bacterial cell division. Ann N Y Acad Sci 1277: 8–28CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Erickson HP, Anderson DE, Osawa M (2010) FtsZ in bacterial cytokinesis: cytoskeleton and force generator all in one. Microbiol Mol Biol Rev 74: 504–528Abstract/FREE Full TextGoogle Scholar\n↵Farley MM, Hu B, Margolin W, Liu J (2016) Minicells, back in fashion. J Bacteriol 198: 1186–1195Abstract/FREE Full TextGoogle Scholar\n↵Fu G, Huang T, Buss J, Coltharp C, Hensel Z, Xiao J (2010) In vivo structure of the E. coli FtsZ‐ring revealed by photoactivated localization microscopy (PALM). PLoS ONE 5: e12682CrossRefPubMedGoogle Scholar\n↵Goley ED, Yeh YC, Hong SH, Fero MJ, Abeliuk E, McAdams HH, Shapiro L (2011) Assembly of the Caulobacter cell division machine. Mol Microbiol 80: 1680–1698CrossRefPubMedGoogle Scholar\n↵Haeusser DP, Margolin W (2016) Splitsville: structural and functional insights into the dynamic bacterial Z ring. Nat Rev Microbiol 14: 305–319Google Scholar\n↵Horger I, Velasco E, Mingorance J, Rivas G, Tarazona P, Velez M (2008a) Langevin computer simulations of bacterial protein filaments and the force‐generating mechanism during cell division. Phys Rev E Stat Nonlin Soft Matter Phys 77: 011902CrossRefPubMedGoogle Scholar\n↵Horger I, Velasco E, Rivas G, Velez M, Tarazona P (2008b) FtsZ bacterial cytoskeletal polymers on curved surfaces: the importance of lateral interactions. Biophys J 94: L81–L83CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Iancu CV, Wright ER, Benjamin J, Tivol WF, Dias DP, Murphy GE, Morrison RC, Heymann JB, Jensen GJ (2005) A “flip‐flop” rotation stage for routine dual‐axis electron cryotomography. J Struct Biol 151: 288–297CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Ingerson‐Mahar M, Briegel A, Werner JN, Jensen GJ, Gitai Z (2010) The metabolic enzyme CTP synthase forms cytoskeletal filaments. Nat Cell Biol 12: 739–746CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Iwaya M, Goldman R, Tipper DJ, Feingold B, Strominger JL (1978) Morphology of an Escherichia coli mutant with a temperature‐dependent round cell shape. J Bacteriol 136: 1143–1158Abstract/FREE Full TextGoogle Scholar\n↵Jennings PC, Cox GC, Monahan LG, Harry EJ (2011) Super‐resolution imaging of the bacterial cytokinetic protein FtsZ. Micron 42: 336–341CrossRefPubMedGoogle Scholar\n↵Katzmann E, Muller FD, Lang C, Messerer M, Winklhofer M, Plitzko JM, Schuler D (2011) Magnetosome chains are recruited to cellular division sites and split by asymmetric septation. Mol Microbiol 82: 1316–1329CrossRefPubMedGoogle Scholar\n↵Kremer JR, Mastronarde DN, McIntosh JR (1996) Computer visualization of three‐dimensional image data using IMOD. J Struct Biol 116: 71–76CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Kuru E, Hughes HV, Brown PJ, Hall E, Tekkam S, Cava F, de Pedro MA, Brun YV, VanNieuwenhze MS (2012) In Situ probing of newly synthesized peptidoglycan in live bacteria with fluorescent D‐amino acids. Angew Chem Int Ed Engl 51: 12519–12523CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Lan G, Daniels BR, Dobrowsky TM, Wirtz D, Sun SX (2009) Condensation of FtsZ filaments can drive bacterial cell division. Proc Natl Acad Sci USA 106: 121–126Abstract/FREE Full TextGoogle Scholar\n↵Leisch N, Pende N, Weber PM, Gruber‐Vodicka HR, Verheul J, Vischer NO, Abby SS, Geier B, den Blaauwen T, Bulgheresi S (2016) Asynchronous division by non‐ring FtsZ in the gammaproteobacterial symbiont of Robbea hypermnestra. Nat Microbiol 2: 16182Google Scholar\n↵Li Z, Trimble MJ, Brun YV, Jensen GJ (2007) The structure of FtsZ filaments in vivo suggests a force‐generating role in cell division. EMBO J 26: 4694–4708Abstract/FREE Full TextGoogle Scholar\n↵Lu C, Reedy M, Erickson HP (2000) Straight and curved conformations of FtsZ are regulated by GTP hydrolysis. J Bacteriol 182: 164–170Abstract/FREE Full TextGoogle Scholar\n↵Ma X, Ehrhardt DW, Margolin W (1996) Colocalization of cell division proteins FtsZ and FtsA to cytoskeletal structures in living Escherichia coli cells by using green fluorescent protein. Proc Natl Acad Sci USA 93: 12998–13003Abstract/FREE Full TextGoogle Scholar\n↵Makarova KS, Yutin N, Bell SD, Koonin EV (2010) Evolution of diverse cell division and vesicle formation systems in Archaea. Nat Rev Microbiol 8: 731–741CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Margolin W (2005) FtsZ and the division of prokaryotic cells and organelles. Nat Rev Mol Cell Biol 6: 862–871CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Oikonomou CM, Jensen GJ (2016) A new view into prokaryotic cell biology from electron cryotomography. Nat Rev Microbiol 14: 205–220CrossRefPubMedGoogle Scholar\n↵Osawa M, Anderson DE, Erickson HP (2008) Reconstitution of contractile FtsZ rings in liposomes. Science 320: 792–794Abstract/FREE Full TextGoogle Scholar\n↵Osawa M, Anderson DE, Erickson HP (2009) Curved FtsZ protofilaments generate bending forces on liposome membranes. EMBO J 28: 3476–3484Abstract/FREE Full TextGoogle Scholar\n↵Pilhofer M, Ladinsky MS, McDowall AW, Jensen GJ (2010) Bacterial TEM: new insights from cryo‐microscopy. Methods Cell Biol 96: 21–45CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Poplawski A, Gullbrand B, Bernander R (2000) The ftsZ gene of Haloferax mediterranei: sequence, conserved gene order, and visualization of the FtsZ ring. Gene 242: 357–367CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Ramirez D, Garcia‐Soriano DA, Raso A, Feingold M, Rivas G, Schwille P (2016) Chiral vortex dynamics on membranes is an intrinsic property of FtsZ, driven by GTP hydrolysis. bioRxiv. doi:10.1101/079533Abstract/FREE Full TextGoogle Scholar\n↵Raskin DM, de Boer PA (1999) MinDE‐dependent pole‐to‐pole oscillation of division inhibitor MinC in Escherichia coli. J Bacteriol 181: 6419–6424Abstract/FREE Full TextGoogle Scholar\n↵Rowlett VW, Margolin W (2014) Asymmetric constriction of dividing Escherichia coli cells induced by expression of a fusion between two min proteins. J Bacteriol 196: 2089–2100Abstract/FREE Full TextGoogle Scholar\n↵Sato M, Mogi Y, Nishikawa T, Miyamura S, Nagumo T, Kawano S (2009) The dynamic surface of dividing cyanelles and ultrastructure of the region directly below the surface in Cyanophora paradoxa. Planta 229: 781–791Google Scholar\n↵Schneider CA, Rasband WS, Eliceiri KW (2012) NIH Image to ImageJ: 25 years of image analysis. Nat Methods 9: 671–675CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Schofield WB, Lim HC, Jacobs‐Wagner C (2010) Cell cycle coordination and regulation of bacterial chromosome segregation dynamics by polarly localized proteins. EMBO J 29: 3068–3081Abstract/FREE Full TextGoogle Scholar\n↵Soderstrom B, Skoog K, Blom H, Weiss DS, von Heijne G, Daley DO (2014) Disassembly of the divisome in Escherichia coli: evidence that FtsZ dissociates before compartmentalization. Mol Microbiol 92: 1–9CrossRefPubMedGoogle Scholar\n↵Strauss MP, Liew AT, Turnbull L, Whitchurch CB, Monahan LG, Harry EJ (2012) 3D‐SIM super resolution microscopy reveals a bead‐like arrangement for FtsZ and the division machinery: implications for triggering cytokinesis. PLoS Biol 10: e1001389CrossRefPubMedGoogle Scholar\n↵Sun Q, Margolin W (1998) FtsZ dynamics during the division cycle of live Escherichia coli cells. J Bacteriol 180: 2050–2056Abstract/FREE Full TextGoogle Scholar\n↵Sundararajan K, Miguel A, Desmarais SM, Meier EL, Casey Huang K, Goley ED (2015) The bacterial tubulin FtsZ requires its intrinsically disordered linker to direct robust cell wall construction. Nat Commun 6: 7281CrossRefPubMedGoogle Scholar\n↵Szwedziak P, Wang Q, Bharat TA, Tsim M, Lowe J (2014) Architecture of the ring formed by the tubulin homologue FtsZ in bacterial cell division. eLife 3: e04601Google Scholar\n↵Thanbichler M, Shapiro L (2006) MipZ, a spatial regulator coordinating chromosome segregation with cell division in Caulobacter. Cell 126: 147–162CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Thanedar S, Margolin W (2004) FtsZ exhibits rapid movement and oscillation waves in helix‐like patterns in Escherichia coli. Curr Biol 14: 1167–1173CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Tivol WF, Briegel A, Jensen GJ (2008) An improved cryogen for plunge freezing. Microsc Microanal 14: 375–379CrossRefPubMedWeb of ScienceGoogle Scholar\n↵Typas A, Banzhaf M, Gross CA, Vollmer W (2011) From the regulation of peptidoglycan synthesis to bacterial growth and morphology. Nat Rev Microbiol 10: 123–136CrossRefPubMedGoogle Scholar\n↵Wachi M, Doi M, Tamaki S, Park W, Nakajima‐Iijima S, Matsuhashi M (1987) Mutant isolation and molecular cloning of mre genes, which determine cell shape, sensitivity to mecillinam, and amount of penicillin‐binding proteins in Escherichia coli. J Bacteriol 169: 4935–4940Abstract/FREE Full TextGoogle Scholar\n↵Wagstaff JM, Tsim M, Oliva MA, Garcia‐Sanchez A, Kureisaite‐Ciziene D, Andreu JM, Lowe J (2016) A polymerisation‐associated conformational switch in FtsZ that enables treadmilling. bioRxiv. doi:10.1101/093708Abstract/FREE Full TextGoogle Scholar\n↵Yang X, Lyu Z, Miguel A, McQuillen R, Huang KC, Xiao J (2017) GTPase activity‐coupled treadmilling of the bacterial tubulin FtsZ organizes septal cell wall synthesis. Science 355: 744–747Abstract/FREE Full TextGoogle Scholar\n↵Zheng SQ, Keszthelyi B, Branlund E, Lyle JM, Braunfeld MB, Sedat JW, Agard DA (2007) UCSF tomography: an integrated software suite for real‐time electron microscopic tomographic data collection, alignment, and reconstruction. J Struct Biol 157: 138–147\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Short FtsZ filaments can drive asymmetric cell envelope constriction at the onset of bacterial cytokinesis\nQing Yao, Andrew I Jewett, Yi‐Wei Chang, Catherine M Oikonomou, Morgan Beeby, Cristina V Iancu, Ariane Briegel, Debnath Ghosal, Grant J Jensen\nEMBO J. 2017 Jun 1; 36(11): 1577–1589. Published online 2017 Apr 24. doi: 10.15252/embj.201696235","other_numbering_system":null,"funders":[{"agency":"Howard Hughes Medical Institute (HHMI)","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}