{"title":"RARβ2 is required for vertebrate somitogenesis","uri":"","abstract":"During vertebrate somitogenesis, retinoic acid is known to establish the position of the determination wavefront, controlling where new somites are permitted to form along the anteroposterior body axis. Less is understood about how RAR regulates somite patterning, rostral-caudal boundary setting, specialization of myotome subdivisions, or the specific RAR subtype that is required for somite patterning. Characterizing the function of RARβ has been challenging due to the absence of embryonic phenotypes in murine loss-of-function studies. Using the Xenopus system, we show that RARβ2 plays a specific role in somite number and size, restriction of the presomitic mesoderm anterior border, somite chevron morphology and hypaxial myoblast migration. Rarβ2 is the RAR subtype whose expression is most up-regulated in response to ligand and its localization in the trunk somites positions it at the right time and place to respond to embryonic retinoid levels during somitogenesis. RARβ2 positively regulates Tbx3 a marker of hypaxial muscle, and negatively regulates Tbx6 via Ripply2 to restrict the anterior boundaries of the presomitic mesoderm and caudal progenitor pool. These results demonstrate for the first time an early and essential role for RARβ2 in vertebrate somitogenesis.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251722","docid":251722,"rev_number":4,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253501","fileid":1253501,"datasetid":"document","objectid":251722,"filename":"dev.144345.full.pdf","mime_type":"application/pdf","hash":"816d87e9116cbca28027df15d20a29b2","hash_type":"MD5","filesize":44925550,"mtime":"2017-05-04 16:30:31","url":"http://authors.library.caltech.edu/77191/1/dev.144345.full.pdf"}],"eprintid":77191,"pos":1,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"dev.144345.full.pdf","content":"accepted"},{"id":"http://authors.library.caltech.edu/id/document/253126","docid":253126,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1266292","fileid":1266292,"datasetid":"document","objectid":253126,"filename":"1997.full.pdf","mime_type":"application/pdf","hash":"860785bcff97723a0b8ebb2c5ae345e3","hash_type":"MD5","filesize":2243497,"mtime":"2017-06-02 22:41:01","url":"http://authors.library.caltech.edu/77191/2/1997.full.pdf"}],"eprintid":77191,"pos":2,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1997.full.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/253127","docid":253127,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1266296","fileid":1266296,"datasetid":"document","objectid":253127,"filename":"DEV144345supp.pdf","mime_type":"application/pdf","hash":"0e8ececf88bd67268fda056d676f2ffa","hash_type":"MD5","filesize":43555690,"mtime":"2017-06-02 22:44:02","url":"http://authors.library.caltech.edu/77191/3/DEV144345supp.pdf"}],"eprintid":77191,"pos":3,"placement":3,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"DEV144345supp.pdf","content":"supplemental"}],"note":"© 2017 Published by The Company of Biologists Ltd. \n\nReceived September 8, 2016. Accepted April 7, 2017. \n\nWe thank Kristin Ampig and Jingmin Zhou for technical assistance in paraffin sectioning and the cloning of Bowline and Ledgerline constructs. \n\nAuthor contributions: A.J. and B.B. conceived the experiments and wrote the manuscript. A.J., B.B., and W.T. performed most of the experiments. T.T.L.N. contributed the experiment for Figure 3. \n\nFunding: Supported by grants from the National Science Foundation (IOS-0719576, IOS-1147236) to B.B. \n\nThe authors declare no competing or financial interests.","id":77191,"rev_number":16,"userid":18,"eprint_dir":"disk0/00/07/71/91","datestamp":"2017-05-04 16:38:25","lastmod":"2017-06-02 23:54:50","status_changed":"2017-06-02 23:54:50","type":"article","metadata_visibility":"show","creators":[{"given":"Amanda","family":"Janesick","id":"Janesick-A","orcid":"0000-0001-7731-2756"},{"given":"Weiyi","family":"Tang","id":"Tang-Weiyi","orcid":""},{"given":"Tuyen T. L.","family":"Nguyen","id":"Nguyen-T-T-L","orcid":""},{"given":"Bruce","family":"Blumberg","id":"Blumberg-B","orcid":"0000-0002-8016-8414"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"retinoic acid receptor β2, Ripply2, Somitogenesis, hypaxial muscle\n","date":"2017-04-07","date_type":"published","publication":"Development","volume":"144","number":"11","pagerange":"1997-2008","id_number":"CaltechAUTHORS:20170504-093023130","refereed":true,"issn":"0950-1991","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170504-093023130","related_url":[{"url":"http://dx.doi.org/10.1242/dev.144345","type":"doi","description":"Article"},{"url":"http://dev.biologists.org/content/144/11/1997","type":"pub","description":"Article"}],"referencetext":["AFONIN, B., HO, M., GUSTIN, J. K., MELOTY-KAPELLA, C. \u0026 DOMINGO, C. R. 2006. Cell\nbehaviors associated with somite segmentation and rotation in Xenopus laevis. Dev Dyn, 235,\n3268-79.\nALBALAT, R., BRUNET, F., LAUDET, V. \u0026 SCHUBERT, M. 2011. Evolution of retinoid and\nsteroid signaling: vertebrate diversification from an amphioxus perspective. Genome Biol\nEvol, 3, 985-1005.\nAUERBACH, R. 1954. Analysis of the developmental effects of a lethal mutation in the house mouse.\nJournal of Experimental Zoology, 127, 305-329.\nBALLIM, R. D., MENDELSOHN, C., PAPAIOANNOU, V. E. \u0026 PRINCE, S. 2012. The ulnarmammary\nsyndrome gene, Tbx3, is a direct target of the retinoic acid signaling pathway,\nwhich regulates its expression during mouse limb development. Mol Biol Cell, 23, 2362-72.\nBASSETT, D. I. \u0026 CURRIE, P. D. 2003. The zebrafish as a model for muscular dystrophy and\ncongenital myopathy. Hum Mol Genet, 12 Spec No 2, R265-70.\nBAYHA, E., JORGENSEN, M. C., SERUP, P. \u0026 GRAPIN-BOTTON, A. 2009. Retinoic acid\nsignaling organizes endodermal organ specification along the entire antero-posterior axis.\nPLoS One, 4, e5845.\nBEVINGTON, P. R. \u0026 ROBINSON, D. K. 2003. Data Reduction and Error Analysis for the Physical\nSciences, New York City, McGraw-Hill Education.\nBLUMBERG, B., BOLADO, J., JR., MORENO, T. A., KINTNER, C., EVANS, R. M. \u0026\nPAPALOPULU, N. 1997. An essential role for retinoid signaling in anteroposterior neural\npatterning. Development, 124, 373-9.\nBRAND, N. J., PETKOVICH, M. \u0026 CHAMBON, P. 1990. Characterization of a functional promoter\nfor the human retinoic acid receptor-alpha (hRAR-alpha). Nucleic Acids Res, 18, 6799-806.\nBRAUN, M., WUNDERLIN, M., SPIETH, K., KNOCHEL, W., GIERSCHIK, P. \u0026 MOEPPS, B.\n2002. Xenopus laevis Stromal cell-derived factor 1: conservation of structure and function\nduring vertebrate development. J Immunol, 168, 2340-7.\nBRENNAN, C., AMACHER, S. L. \u0026 CURRIE, P. D. 2002. IV. Aspects of Organogenesis:\nSomitogenesis. In: SOLNICA-KREZEL, L. (ed.) Pattern Formation in Zebrafish. Berlin,\nHeidelberg: Springer.\nBRENT, A. E. \u0026 TABIN, C. J. 2004. White meat or dark? Nat Genet, 36, 8-10.\nBROWN, C. B., ENGLEKA, K. A., WENNING, J., MIN LU, M. \u0026 EPSTEIN, J. A. 2005.\nIdentification of a hypaxial somite enhancer element regulating Pax3 expression in migrating\nmyoblasts and characterization of hypaxial muscle Cre transgenic mice. Genesis, 41, 202-9.\nCHAN, T., SATOW, R., KITAGAWA, H., KATO, S. \u0026 ASASHIMA, M. 2006. Ledgerline, a novel\nXenopus laevis gene, regulates differentiation of presomitic mesoderm during somitogenesis.\nZoolog Sci, 23, 689-97.\nCHENG, L., ALVARES, L. E., AHMED, M. U., EL-HANFY, A. S. \u0026 DIETRICH, S. 2004. The\nepaxial-hypaxial subdivision of the avian somite. Dev Biol, 274, 348-69.\nCHIANG, M. Y., MISNER, D., KEMPERMANN, G., SCHIKORSKI, T., GIGUERE, V., SUCOV,\nH. M., GAGE, F. H., STEVENS, C. F. \u0026 EVANS, R. M. 1998. An essential role for retinoid\nreceptors RARbeta and RXRgamma in long-term potentiation and depression. Neuron, 21,\n1353-61.\nCUI, J., MICHAILLE, J. J., JIANG, W. \u0026 ZILE, M. H. 2003. Retinoid receptors and vitamin A\ndeficiency: differential patterns of transcription during early avian development and the rapid\ninduction of RARs by retinoic acid. Dev Biol, 260, 496-511.\nCUNNINGHAM, T. J., BRADE, T., SANDELL, L. L., LEWANDOSKI, M., TRAINOR, P. A.,\nCOLAS, A., MERCOLA, M. \u0026 DUESTER, G. 2015. Retinoic Acid Activity in\nUndifferentiated Neural Progenitors Is Sufficient to Fulfill Its Role in Restricting Fgf8\nExpression for Somitogenesis. PLoS One, 10, e0137894.\nD'ANIELLO, E., RYDEEN, A. B., ANDERSON, J. L., MANDAL, A. \u0026 WAXMAN, J. S. 2013.\nDepletion of retinoic acid receptors initiates a novel positive feedback mechanism that\npromotes teratogenic increases in retinoic acid. PLoS Genet, 9, e1003689.\nDAHMANN, C., OATES, A. C. \u0026 BRAND, M. 2011. Boundary formation and maintenance in tissue\ndevelopment. Nat Rev Genet, 12, 43-55.\nDE THE, H., VIVANCO-RUIZ, M. M., TIOLLAIS, P., STUNNENBERG, H. \u0026 DEJEAN, A. 1990.\nIdentification of a retinoic acid responsive element in the retinoic acid receptor beta gene.\nNature, 343, 177-80.\nDEQUEANT, M. L. \u0026 POURQUIE, O. 2008. Segmental patterning of the vertebrate embryonic axis.\nNat Rev Genet, 9, 370-82.\nDEY, A., MINUCCI, S. \u0026 OZATO, K. 1994. Ligand-dependent occupancy of the retinoic acid\nreceptor beta 2 promoter in vivo. Mol Cell Biol, 14, 8191-201.\nDIETRICH, S., SCHUBERT, F. R., HEALY, C., SHARPE, P. T. \u0026 LUMSDEN, A. 1998.\nSpecification of the hypaxial musculature. Development, 125, 2235-49.\nDIEZ DEL CORRAL, R., OLIVERA-MARTINEZ, I., GORIELY, A., GALE, E., MADEN, M. \u0026\nSTOREY, K. 2003. Opposing FGF and retinoid pathways control ventral neural pattern,\nneuronal differentiation, and segmentation during body axis extension. Neuron, 40, 65-79.\nDUBRULLE, J., MCGREW, M. J. \u0026 POURQUIE, O. 2001. FGF signaling controls somite boundary\nposition and regulates segmentation clock control of spatiotemporal Hox gene activation.\nCell, 106, 219-32.\nESCRIVA, H., BERTRAND, S., GERMAIN, P., ROBINSON-RECHAVI, M., UMBHAUER, M.,\nCARTRY, J., DUFFRAISSE, M., HOLLAND, L., GRONEMEYER, H. \u0026 LAUDET, V.\n2006. Neofunctionalization in vertebrates: the example of retinoic acid receptors. PLoS\nGenet, 2, e102.\nFISHER, A. L., OHSAKO, S. \u0026 CAUDY, M. 1996. The WRPW motif of the hairy-related basic\nhelix-loop-helix repressor proteins acts as a 4-amino-acid transcription repression and\nprotein-protein interaction domain. Mol Cell Biol, 16, 2670-7.\nFRANCO, P. G., PAGANELLI, A. R., LOPEZ, S. L. \u0026 CARRASCO, A. E. 1999. Functional\nassociation of retinoic acid and hedgehog signaling in Xenopus primary neurogenesis.\nDevelopment, 126, 4257-65.\nFRANKEL, N., DAVIS, G. K., VARGAS, D., WANG, S., PAYRE, F. \u0026 STERN, D. L. 2010.\nPhenotypic robustness conferred by apparently redundant transcriptional enhancers. Nature,\n466, 490-3.\nGARNAAS, M. K., CUTTING, C. C., MEYERS, A., KELSEY, P. B., JR., HARRIS, J. M., NORTH,\nT. E. \u0026 GOESSLING, W. 2012. Rargb regulates organ laterality in a zebrafish model of right\natrial isomerism. Dev Biol, 372, 178-89.\nGHYSELINCK, N. B., DUPE, V., DIERICH, A., MESSADDEQ, N., GARNIER, J. M.,\nROCHETTE-EGLY, C., CHAMBON, P. \u0026 MARK, M. 1997. Role of the retinoic acid\nreceptor beta (RARbeta) during mouse development. Int J Dev Biol, 41, 425-47.\nGOERING, L. M., HOSHIJIMA, K., HUG, B., BISGROVE, B., KISPERT, A. \u0026 GRUNWALD, D.\nJ. 2003. An interacting network of T-box genes directs gene expression and fate in the\nzebrafish mesoderm. Proc Natl Acad Sci U S A, 100, 9410-5.\nHALE, L. A., TALLAFUSS, A., YAN, Y. L., DUDLEY, L., EISEN, J. S. \u0026 POSTLETHWAIT, J. H.\n2006. Characterization of the retinoic acid receptor genes raraa, rarab and rarg during\nzebrafish development. Gene Expr Patterns, 6, 546-55.\nHALPERN, M. E., HO, R. K., WALKER, C. \u0026 KIMMEL, C. B. 1993. Induction of muscle pioneers\nand floor plate is distinguished by the zebrafish no tail mutation. Cell, 75, 99-111.\nHAMMOND, K. L., BAXENDALE, S., MCCAULEY, D. W., INGHAM, P. W. \u0026 WHITFIELD, T.\nT. 2009. Expression of patched, prdm1 and engrailed in the lamprey somite reveals conserved\nresponses to Hedgehog signaling. Evol Dev, 11, 27-40.\nHASELBECK, R. J., HOFFMANN, I. \u0026 DUESTER, G. 1999. Distinct functions for Aldh1 and\nRaldh2 in the control of ligand production for embryonic retinoid signaling pathways. Dev\nGenet, 25, 353-64.\nHE, M., WEN, L., CAMPBELL, C. E., WU, J. Y. \u0026 RAO, Y. 1999. Transcription repression by\nXenopus ET and its human ortholog TBX3, a gene involved in ulnar-mammary syndrome.\nProc Natl Acad Sci U S A, 96, 10212-7.\nHE, X., YAN, Y. L., EBERHART, J. K., HERPIN, A., WAGNER, T. U., SCHARTL, M. \u0026\nPOSTLETHWAIT, J. H. 2011. miR-196 regulates axial patterning and pectoral appendage initiation. Dev Biol, 357, 463-77.\nHEMMATI-BRIVANLOU, A., FRANK, D., BOLCE, M. E., BROWN, B. D., SIVE, H. L. \u0026\nHARLAND, R. M. 1990. Localization of specific mRNAs in Xenopus embryos by wholemount\nin situ hybridization. Development, 110, 325-30.\nHENRY, C. A., MCNULTY, I. M., DURST, W. A., MUNCHEL, S. E. \u0026 AMACHER, S. L. 2005.\nInteractions between muscle fibers and segment boundaries in zebrafish. Dev Biol, 287, 346-\n60.\nHITACHI, K., DANNO, H., TAZUMI, S., AIHARA, Y., UCHIYAMA, H., OKABAYASHI, K.,\nKONDOW, A. \u0026 ASASHIMA, M. 2009. The Xenopus Bowline/Ripply family proteins\nnegatively regulate the transcriptional activity of T-box transcription factors. Int J Dev Biol,\n53, 631-9.\nHITACHI, K., KONDOW, A., DANNO, H., INUI, M., UCHIYAMA, H. \u0026 ASASHIMA, M. 2008.\nTbx6, Thylacine1, and E47 synergistically activate bowline expression in Xenopus\nsomitogenesis. Dev Biol, 313, 816-28.\nHOLLWAY, G. E., BRYSON-RICHARDSON, R. J., BERGER, S., COLE, N. J., HALL, T. E. \u0026\nCURRIE, P. D. 2007. Whole-somite rotation generates muscle progenitor cell compartments\nin the developing zebrafish embryo. Dev Cell, 12, 207-19.\nHONG, J. W., HENDRIX, D. A. \u0026 LEVINE, M. S. 2008. Shadow enhancers as a source of\nevolutionary novelty. Science, 321, 1314.\nHOOGAARS, W. M., TESSARI, A., MOORMAN, A. F., DE BOER, P. A., HAGOORT, J.,\nSOUFAN, A. T., CAMPIONE, M. \u0026 CHRISTOFFELS, V. M. 2004. The transcriptional\nrepressor Tbx3 delineates the developing central conduction system of the heart. Cardiovasc\nRes, 62, 489-99.\nHOPWOOD, N. D., PLUCK, A. \u0026 GURDON, J. B. 1989. MyoD expression in the forming somites is\nan early response to mesoderm induction in Xenopus embryos. EMBO J, 8, 3409-17.\nHUBAUD, A. \u0026 POURQUIE, O. 2014. Signalling dynamics in vertebrate segmentation. Nat Rev Mol\nCell Biol, 15, 709-21.\nJANESICK, A., ABBEY, R., CHUNG, C., LIU, S., TAKETANI, M. \u0026 BLUMBERG, B. 2013. ERF\nand ETV3L are retinoic acid-inducible repressors required for primary neurogenesis.\nDevelopment, 140, 3095-106.\nJANESICK, A., NGUYEN, T. T., AISAKI, K., IGARASHI, K., KITAJIMA, S.,\nCHANDRARATNA, R. A., KANNO, J. \u0026 BLUMBERG, B. 2014. Active repression by\nRARgamma signaling is required for vertebrate axial elongation. Development, 141, 2260-70.\nJANESICK, A., SHIOTSUGU, J., TAKETANI, M. \u0026 BLUMBERG, B. 2012. RIPPLY3 is a retinoic\nacid-inducible repressor required for setting the borders of the pre-placodal ectoderm.\nDevelopment, 139, 1213-24.\nJEN, W. C., GAWANTKA, V., POLLET, N., NIEHRS, C. \u0026 KINTNER, C. 1999. Periodic\nrepression of Notch pathway genes governs the segmentation of Xenopus embryos. Genes\nDev, 13, 1486-99.\nJOSEPH, E. M. \u0026 CASSETTA, L. A. 1999. Mespo: a novel basic helix-loop-helix gene expressed in\nthe presomitic mesoderm and posterior tailbud of Xenopus embryos. Mech Dev, 82, 191-4.\nKARPINKA, J. B., FORTRIEDE, J. D., BURNS, K. A., JAMES-ZORN, C., PONFERRADA, V. G.,\nLEE, J., KARIMI, K., ZORN, A. M. \u0026 VIZE, P. D. 2014. Xenbase, the Xenopus model\norganism database; new virtualized system, data types and genomes. Nucleic Acids Res.\nKAWAKAMI, Y., RAYA, A., RAYA, R. M., RODRIGUEZ-ESTEBAN, C. \u0026 IZPISUA\nBELMONTE, J. C. 2005. Retinoic acid signalling links left-right asymmetric patterning and\nbilaterally symmetric somitogenesis in the zebrafish embryo. Nature, 435, 165-71.\nKAWAMURA, A., KOSHIDA, S., HIJIKATA, H., OHBAYASHI, A., KONDOH, H. \u0026 TAKADA,\nS. 2005. Groucho-associated transcriptional repressor ripply1 is required for proper transition\nfrom the presomitic mesoderm to somites. Dev Cell, 9, 735-44.\nKAWAMURA, A., KOSHIDA, S. \u0026 TAKADA, S. 2008. Activator-to-repressor conversion of T-box\ntranscription factors by the Ripply family of Groucho/TLE-associated mediators. Mol Cell\nBiol, 28, 3236-44.\nKOIDE, T., DOWNES, M., CHANDRARATNA, R. A., BLUMBERG, B. \u0026 UMESONO, K. 2001.\nActive repression of RAR signaling is required for head formation. Genes Dev, 15, 2111-21.\nKONDOW, A., HITACHI, K., IKEGAME, T. \u0026 ASASHIMA, M. 2006. Bowline, a novel protein\nlocalized to the presomitic mesoderm, interacts with Groucho/TLE in Xenopus. Int J Dev\nBiol, 50, 473-9.\nKONDOW, A., HITACHI, K., OKABAYASHI, K., HAYASHI, N. \u0026 ASASHIMA, M. 2007.\nBowline mediates association of the transcriptional corepressor XGrg-4 with Tbx6 during\nsomitogenesis in Xenopus. Biochem Biophys Res Commun, 359, 959-64.\nKUMAR, S., CUNNINGHAM, T. J. \u0026 DUESTER, G. 2016. Nuclear receptor corepressors Ncor1\nand Ncor2 (Smrt) are required for retinoic acid-dependent repression of Fgf8 during\nsomitogenesis. Dev Biol.\nLEAL, M. A., FICKEL, S. R., SABILLO, A., RAMIREZ, J., VERGARA, H. M., NAVE, C., SAW,\nD. \u0026 DOMINGO, C. R. 2014. The Role of Sdf-1alpha signaling in Xenopus laevis somite\nmorphogenesis. Dev Dyn, 243, 509-26.\nLEROY, P., KRUST, A., ZELENT, A., MENDELSOHN, C., GARNIER, J. M., KASTNER, P.,\nDIERICH, A. \u0026 CHAMBON, P. 1991. Multiple isoforms of the mouse retinoic acid receptor\nalpha are generated by alternative splicing and differential induction by retinoic acid. EMBO\nJ, 10, 59-69.\nLI, H., TIERNEY, C., WEN, L., WU, J. Y. \u0026 RAO, Y. 1997. A single morphogenetic field gives rise\nto two retina primordia under the influence of the prechordal plate. Development, 124, 603-\n15.\nLI, H. Y., GRIFONE, R., SAQUET, A., CARRON, C. \u0026 SHI, D. L. 2013. The Xenopus homologue\nof Down syndrome critical region protein 6 drives dorsoanterior gene expression and\nembryonic axis formation by antagonising polycomb group proteins. Development, 140,\n4903-13.\nLINVILLE, A., RADTKE, K., WAXMAN, J. S., YELON, D. \u0026 SCHILLING, T. F. 2009.\nCombinatorial roles for zebrafish retinoic acid receptors in the hindbrain, limbs and\npharyngeal arches. Dev Biol, 325, 60-70.\nLOHNES, D., MARK, M., MENDELSOHN, C., DOLLE, P., DIERICH, A., GORRY, P.,\nGANSMULLER, A. \u0026 CHAMBON, P. 1994. Function of the retinoic acid receptors (RARs)\nduring development (I). Craniofacial and skeletal abnormalities in RAR double mutants.\nDevelopment, 120, 2723-48.\nLUFKIN, T., LOHNES, D., MARK, M., DIERICH, A., GORRY, P., GAUB, M. P., LEMEUR, M. \u0026\nCHAMBON, P. 1993. High postnatal lethality and testis degeneration in retinoic acid receptor\nalpha mutant mice. Proc Natl Acad Sci U S A, 90, 7225-9.\nMADEN, M. 2007. Retinoic acid in the development, regeneration and maintenance of the nervous\nsystem. Nat Rev Neurosci, 8, 755-65.\nMADEN, M. 2010. Analysis of Retinoid Signaling in Embryos. In: WHITMAN, M. \u0026 SATER, A.\n(eds.) Analysis of Growth Factor Signaling in Embryos. Boca Raton: CRC Press.\nMANGELSDORF, D. J. \u0026 EVANS, R. M. 1995. The RXR heterodimers and orphan receptors. Cell,\n83, 841-50.\nMARK, M., GHYSELINCK, N. B. \u0026 CHAMBON, P. 2006. Function of retinoid nuclear receptors:\nlessons from genetic and pharmacological dissections of the retinoic acid signaling pathway\nduring mouse embryogenesis. Annu Rev Pharmacol Toxicol, 46, 451-80.\nMARTIN, B. L. \u0026 HARLAND, R. M. 2001. Hypaxial muscle migration during primary myogenesis\nin Xenopus laevis. Dev Biol, 239, 270-80.\nMARTIN, B. L., PEYROT, S. M. \u0026 HARLAND, R. M. 2007. Hedgehog signaling regulates the\namount of hypaxial muscle development during Xenopus myogenesis. Dev Biol, 304, 722-34.\nMASSARO, G. D., MASSARO, D. \u0026 CHAMBON, P. 2003. Retinoic acid receptor-alpha regulates\npulmonary alveolus formation in mice after, but not during, perinatal period. Am J Physiol\nLung Cell Mol Physiol, 284, L431-3.\nMASSARO, G. D., MASSARO, D., CHAN, W. Y., CLERCH, L. B., GHYSELINCK, N.,\nCHAMBON, P. \u0026 CHANDRARATNA, R. A. 2000. Retinoic acid receptor-beta: an\nendogenous inhibitor of the perinatal formation of pulmonary alveoli. Physiol Genomics, 4,\n51-7.\nMENDELSOHN, C., RUBERTE, E., LEMEUR, M., MORRISS-KAY, G. \u0026 CHAMBON, P. 1991.\nDevelopmental analysis of the retinoic acid-inducible RAR-beta 2 promoter in transgenic animals. Development, 113, 723-34.\nMIC, F. A. \u0026 DUESTER, G. 2003. Patterning of forelimb bud myogenic precursor cells requires\nretinoic acid signaling initiated by Raldh2. Dev Biol, 264, 191-201.\nMORENO, T. A., JAPPELLI, R., IZPISUA BELMONTE, J. C. \u0026 KINTNER, C. 2008. Retinoic acid\nregulation of the Mesp-Ripply feedback loop during vertebrate segmental patterning. Dev\nBiol, 315, 317-30.\nMORENO, T. A. \u0026 KINTNER, C. 2004. Regulation of segmental patterning by retinoic acid\nsignaling during Xenopus somitogenesis. Dev Cell, 6, 205-18.\nMORIMOTO, M., SASAKI, N., OGINUMA, M., KISO, M., IGARASHI, K., AIZAKI, K., KANNO,\nJ. \u0026 SAGA, Y. 2007. The negative regulation of Mesp2 by mouse Ripply2 is required to\nestablish the rostro-caudal patterning within a somite. Development, 134, 1561-9.\nNAGANO, T., TAKEHARA, S., TAKAHASHI, M., AIZAWA, S. \u0026 YAMAMOTO, A. 2006. Shisa2\npromotes the maturation of somitic precursors and transition to the segmental fate in Xenopus\nembryos. Development, 133, 4643-54.\nNAKAYA, Y., KURODA, S., KATAGIRI, Y. T., KAIBUCHI, K. \u0026 TAKAHASHI, Y. 2004.\nMesenchymal-epithelial transition during somitic segmentation is regulated by differential\nroles of Cdc42 and Rac1. Dev Cell, 7, 425-38.\nNIEDERREITHER, K. \u0026 DOLLE, P. 2008. Retinoic acid in development: towards an integrated\nview. Nat Rev Genet, 9, 541-53.\nNIKAIDO, M., KAWAKAMI, A., SAWADA, A., FURUTANI-SEIKI, M., TAKEDA, H. \u0026 ARAKI,\nK. 2002. Tbx24, encoding a T-box protein, is mutated in the zebrafish somite-segmentation\nmutant fused somites. Nat Genet, 31, 195-9.\nOATES, A. C., MORELLI, L. G. \u0026 ARES, S. 2012. Patterning embryos with oscillations: structure,\nfunction and dynamics of the vertebrate segmentation clock. Development, 139, 625-639.\nOGINUMA, M., NIWA, Y., CHAPMAN, D. L. \u0026 SAGA, Y. 2008. Mesp2 and Tbx6 cooperatively\ncreate periodic patterns coupled with the clock machinery during mouse somitogenesis.\nDevelopment, 135, 2555-62.\nOMIM®. Online Mendelian Inheritance in Man [Online]. Baltimore, MD: McKusick-Nathans\nInstitute of Genetic Medicine, Johns Hopkins University. Available: http://omim.org\n[Accessed 7-1-16].\nPERRY, M. W., BOETTIGER, A. N., BOTHMA, J. P. \u0026 LEVINE, M. 2010. Shadow enhancers\nfoster robustness of Drosophila gastrulation. Curr Biol, 20, 1562-7.\nPFAFFL, M. W. 2001. A new mathematical model for relative quantification in real-time RT-PCR.\nNucleic Acids Res, 29, e45.\nROMEIH, M., CUI, J., MICHAILLE, J. J., JIANG, W. \u0026 ZILE, M. H. 2003. Function of RARgamma\nand RARalpha2 at the initiation of retinoid signaling is essential for avian embryo survival\nand for distinct events in cardiac morphogenesis. Dev Dyn, 228, 697-708.\nROST, F., EUGSTER, C., SCHROTER, C., OATES, A. C. \u0026 BRUSCH, L. 2014. Chevron formation\nof the zebrafish muscle segments. J Exp Biol, 217, 3870-82.\nRUBERTE, E., DOLLE, P., CHAMBON, P. \u0026 MORRISS-KAY, G. 1991. Retinoic acid receptors\nand cellular retinoid binding proteins. II. Their differential pattern of transcription during\nearly morphogenesis in mouse embryos. Development, 111, 45-60.\nSCHMITTGEN, T. D. \u0026 LIVAK, K. J. 2008. Analyzing real-time PCR data by the comparative C(T)\nmethod. Nat Protoc, 3, 1101-8.\nSESSION, A., UNO, Y. \u0026 KWON, T. 2016. Genome evolution in the allotetraploid frog Xenopus\nlaevis. Nature (submitted).\nSHARPE, C. R. \u0026 GOLDSTONE, K. 1997. Retinoid receptors promote primary neurogenesis in\nXenopus. Development, 124, 515-23.\nSPARROW, D. B., JEN, W. C., KOTECHA, S., TOWERS, N., KINTNER, C. \u0026 MOHUN, T. J.\n1998. Thylacine 1 is expressed segmentally within the paraxial mesoderm of the Xenopus\nembryo and interacts with the Notch pathway. Development, 125, 2041-51.\nSROUR, M., CHITAYAT, D., CARON, V., CHASSAING, N., BITOUN, P., PATRY, L.,\nCORDIER, M. P., CAPO-CHICHI, J. M., FRANCANNET, C., CALVAS, P., RAGGE, N.,\nDOBRZENIECKA, S., HAMDAN, F. F., ROULEAU, G. A., TREMBLAY, A. \u0026\nMICHAUD, J. L. 2013. Recessive and dominant mutations in retinoic acid receptor beta in cases with microphthalmia and diaphragmatic hernia. Am J Hum Genet, 93, 765-72.\nSUBBARAYAN, V., KASTNER, P., MARK, M., DIERICH, A., GORRY, P. \u0026 CHAMBON, P.\n1997. Limited specificity and large overlap of the functions of the mouse RAR gamma 1 and\nRAR gamma 2 isoforms. Mech Dev, 66, 131-42.\nSUCOV, H. M., MURAKAMI, K. K. \u0026 EVANS, R. M. 1990. Characterization of an autoregulated\nresponse element in the mouse retinoic acid receptor type beta gene. Proc Natl Acad Sci U S\nA, 87, 5392-6.\nTAKABATAKE, Y., TAKABATAKE, T. \u0026 TAKESHIMA, K. 2000. Conserved and divergent\nexpression of T-box genes Tbx2-Tbx5 in Xenopus. Mech Dev, 91, 433-7.\nTAKAHASHI, J., OHBAYASHI, A., OGINUMA, M., SAITO, D., MOCHIZUKI, A., SAGA, Y. \u0026\nTAKADA, S. 2010. Analysis of Ripply1/2-deficient mouse embryos reveals a mechanism\nunderlying the rostro-caudal patterning within a somite. Dev Biol, 342, 134-45.\nTAKEMOTO, T., UCHIKAWA, M., YOSHIDA, M., BELL, D. M., LOVELL-BADGE, R.,\nPAPAIOANNOU, V. E. \u0026 KONDOH, H. 2011. Tbx6-dependent Sox2 regulation determines\nneural or mesodermal fate in axial stem cells. Nature, 470, 394-8.\nUCHIYAMA, H., KOBAYASHI, T., YAMASHITA, A., OHNO, S. \u0026 YABE, S. 2001. Cloning and\ncharacterization of the T-box gene Tbx6 in Xenopus laevis. Dev Growth Differ, 43, 657-69.\nUMESONO, K., MURAKAMI, K. K., THOMPSON, C. C. \u0026 EVANS, R. M. 1991. Direct repeats as\nselective response elements for the thyroid hormone, retinoic acid, and vitamin D3 receptors.\nCell, 65, 1255-66.\nVERMOT, J. \u0026 POURQUIE, O. 2005. Retinoic acid coordinates somitogenesis and left-right\npatterning in vertebrate embryos. Nature, 435, 215-20.\nWAHI, K., BOCHTER, M. S. \u0026 COLE, S. E. 2016. The many roles of Notch signaling during\nvertebrate somitogenesis. Semin Cell Dev Biol, 49, 68-75.\nWATANABE, M., HAYASHIDA, T., NISHIMOTO, T. \u0026 KOBAYASHI, H. 1993. Nucleotide\nsequence of Xenopus homeobox gene, En-1. Nucleic Acids Res, 21, 2513.\nWAXMAN, J. S. \u0026 YELON, D. 2007. Comparison of the expression patterns of newly identified\nzebrafish retinoic acid and retinoid X receptors. Dev Dyn, 236, 587-95.\nWHITE, P. H. \u0026 CHAPMAN, D. L. 2005. Dll1 is a downstream target of Tbx6 in the paraxial\nmesoderm. Genesis, 42, 193-202.\nWINDNER, S. E., DORIS, R. A., FERGUSON, C. M., NELSON, A. C., VALENTIN, G., TAN, H.,\nOATES, A. C., WARDLE, F. C. \u0026 DEVOTO, S. H. 2015. Tbx6, Mesp-b and Ripply1\nregulate the onset of skeletal myogenesis in zebrafish. Development, 142, 1159-68.\nZELENT, A., MENDELSOHN, C., KASTNER, P., KRUST, A., GARNIER, J. M., RUFFENACH,\nF., LEROY, P. \u0026 CHAMBON, P. 1991. Differentially expressed isoforms of the mouse\nretinoic acid receptor beta generated by usage of two promoters and alternative splicing.\nEMBO J, 10, 71-81."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"RARβ2 is required for vertebrate somitogenesis\nAmanda Janesick, Weiyi Tang, Tuyen T. L. Nguyen, Bruce Blumberg\nDevelopment  2017  144:  1997-2008;  doi: 10.1242/dev.144345","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"IOS-0719576"},{"agency":"NSF","grant_number":"IOS-1147236"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}