{"title":"Discovery and modelling of a flattening of the positive cyclotron line/luminosity relation in GX 304−1 with RXTE","uri":"","abstract":"The Rossi X-ray Timing Explorer (RXTE) observed four outbursts of the accreting X-ray binary transient source, GX 304−1 in 2010 and 2011. We present results of detailed 3–100 keV spectral analysis of 69 separate observations, and report a positive correlation between cyclotron line parameters, as well as other spectral parameters, with power-law flux. The cyclotron line energy, width and depth versus flux, and thus luminosity, correlations show a flattening of the relationships with increasing luminosity, which are well described by quasi-spherical or disc accretion that yield the surface magnetic field to be ∼5 × 10^(12) Gauss. Since HEXTE (High Energy X-ray Timing Experiment) cluster A was fixed aligned with the Proportional Counter Array field of view and cluster B was fixed viewing a background region 1°.5 off of the source direction during these observations near the end of the RXTE mission, the cluster A background was estimated from cluster B events using\nHEXTEBACKEST.\nThis made possible the detection of the ∼55 keV cyclotron line and an accurate measurement of the continuum. Correlations of all spectral parameters with the primary 2–10 keV power-law flux reveal it to be the primary driver of the spectral shape. The accretion is found to be in the collisionless shock braking regime.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251766","docid":251766,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1253939","fileid":1253939,"datasetid":"document","objectid":251766,"filename":"stw3222.pdf","mime_type":"application/pdf","hash":"2a1455240e9528bf9c3c7f7993137824","hash_type":"MD5","filesize":4374629,"mtime":"2017-05-05 15:06:25","url":"http://authors.library.caltech.edu/77205/1/stw3222.pdf"}],"eprintid":77205,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"stw3222.pdf","content":"published"}],"note":"© 2016 The Authors. Published by Oxford University Press on behalf of the Royal Astronomical Society. \n\nAccepted 2016 December 8. Received 2016 December 7; in original form 2016 July 5. \n\nWe thank the referee for the careful reading of the paper and the thoughtful comments proffered. We acknowledge the ongoing efforts of the Magnet collaboration on accreting X-ray pulsars. Their work over the years has led to a better understanding of emission from the accretion column, and has led to production of physics-based models of both the continuum and cyclotron line shapes. We acknowledge the support of the International Space Science Institute (ISSI) in Bern, Switzerland, for workshops supporting the Magnet collaboration. The work of KoP is supported by RFBF grants 14-02-00657 and 14-02-91345. The work of MG and NS (calculations of the scaling laws) is supported by RSF grant 14-12-00146. The work of DK, JW and RS was supported by DFG grants KL2734/2-1 and WI 1860/11-1. MK acknowledges support by the Bundesministerium für Wirtschaft und Technologie under Deutsches Zentrum für Luft- und Raumfahrt grant 50OR1207.","id":77205,"rev_number":9,"userid":772,"eprint_dir":"disk0/00/07/72/05","datestamp":"2017-05-05 16:20:26","lastmod":"2017-05-05 16:20:26","status_changed":"2017-05-05 16:20:26","type":"article","metadata_visibility":"show","creators":[{"given":"Richard E.","family":"Rothschild","id":"Rothschild-R-E","orcid":""},{"given":"Matthias","family":"Kühnel","id":"Kühnel-M","orcid":""},{"given":"Katja","family":"Pottschmidt","id":"Pottschmidt-K","orcid":""},{"given":"Paul","family":"Hemphill","id":"Hemphill-P","orcid":""},{"given":"Konstantin","family":"Postnov","id":"Postnov-K-A","orcid":""},{"given":"Mikhail","family":"Gornostaev","id":"Gornostaev-M","orcid":""},{"given":"Nikolai","family":"Shakura","id":"Shakura-N","orcid":""},{"given":"Felix","family":"Fürst","id":"Fürst-F","orcid":""},{"given":"Jörn","family":"Wilms","id":"Wilms-J","orcid":""},{"given":"Rüdiger","family":"Staubert","id":"Staubert-R","orcid":""},{"given":"Dmitry","family":"Klochkov","id":"Klochkov-D","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"magnetic fields, stars: neutron, pulsars: individual: GX 304−1, X-rays: binaries, X-rays: individual: GX 304−1","date":"2017-04","date_type":"published","publication":"Monthly Notices of the Royal Astronomical Society","volume":"466","number":"3","pagerange":"2752-2779","id_number":"CaltechAUTHORS:20170505-080551077","refereed":true,"issn":"0035-8711","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170505-080551077","related_url":[{"url":"https://doi.org/10.1093/mnras/stw3222","type":"doi","description":"Article"},{"url":"https://academic.oup.com/mnras/article/466/3/2752/2671017/Discovery-and-modelling-of-a-flattening-of-the","type":"pub","description":"Article"}],"referencetext":["Arnaud K. A., 1996, in Jacoby G. H., Barnes J., eds, ASP Conf. Ser.\nVol. 101, Astronomical Data Analysis Software and Systems V. Astron.\nSoc. Pac., San Francisco, p. 17\nBasko M. M., Sunyaev R. A., 1976, MNRAS, 175, 395\nBecker P. T. et al., 2012, A\u0026A, 544, A123\nBevington P. R., Robinson D. K., 1992, Data Reduction and Data Analysis\nfor the Physical Sciences, 2nd edn. McGraw-Hill, New York\nBoldin P. R., Tsygankov S. S., Lutovinov A. A., 2013, Astron. Lett., 39, 375\nBykov A. M., Krassilshchikov A. M., 2004, Astron. Lett., 30, 309\nCaballero I. et al., 2008, A\u0026A, 480, L17\nCoburnW., HeindlW. A., Rothschild R. E., Gruber D. E., Kreykenbohm I.,\nWilms J., Kretschmar P., Staubert R., 2002, ApJ, 580, 394\nDavidson K., 1973, Nat. Phys. Sci., 246, 1\nDevasia J., James M., Paul B., Indulekha K., 2011, MNRAS, 417, 348\nF¨urst F. et al., 2014, ApJ, 780, 133\nF¨urst F. et al., 2015, ApJ, 806, L24\nGarasev M., Derishev E., Kocharovsky V., Kocharovsky Vl., 2011, A\u0026A,\n531, L14\nGiacconi R.,Murray S., Gursky H., Kellogg E., Schreier E., Tananbaum H.,\n1972, ApJ, 178, 281\nHouck J. C., Denicola L. A., 2000, in Manset N., Veillet C., Crabtree D.,\neds, ASP Conf. Ser. Vol. 216, Astronomical Data Analysis Software and\nSystems IX. Astron. Soc. Pac., San Francisco, p. 591\nIvanov V. V., 1969, Radiative Transfer and Spectra of Celestial Bodies.\nNauka, Moskova, p. 472\nIvanov V. V., 1973, NBS Special Publication. US Department of Commerce,\nWashington\nJahoda K., Marquardt C. B., Radeva Y., Rots A. H., Stark M. J., Swank J.\nH., Strohmayer T. E., Zhang W., 2006, ApJS, 163, 401\nJaisawal G. K., Naik S., Eplil P., 2016, MNRAS, 457, 2749\nKlochkov D., Staubert R., Santangelo A., Rothschild R. E., Ferrigno C.,\n2011, A\u0026A, 532, A126\nKlochkov D. et al., 2012, A\u0026A, 542, L28\nK¨uhnel M. et al., 2013, A\u0026A, 555, A95\nLa Parola V., Cusumano G., Segreto A., D’A`ı A., 2016, MNRAS, 463, 185\nLanger S. H., Rappaport S., 1982, ApJ, 257, 733\nLyutikov M., Gavriil F. P., 2006, MNRAS, 454, 1847\nMcClintock J. E., Ricker G. R., Lewin W. H. G., 1971, ApJ, 166, L63\nMcClintock J. E., Rappaport S. A., Nugent J. J., Li F. K., 1977, ApJ, 216,\nL15\nMalacaria C., Klochkov D., Santangelo A., Staubert R., 2015, A\u0026A, 581,\nA121\nManousakis A. et al., 2008, Astron. Telegram, 1613\nMason K. O., Murdin P. G., Parkes G. E., Visvanathan N., 1978, MNRAS,\n184, 45p\nM¨uller S. et al., 2015, A\u0026A, 551, A6\nMushtukov A. A., Suleimanov V. F., Tsygankov S. S., Poutanen J., 2015a,\nMNRAS, 447, 1847\nMushtukovA. A., Tsygankov S. S., Serber A.V., SuleimanovV. F., Poutanen\nJ., 2015b, MNRAS, 454, 2714\nNelson R. W., Salpeter E. E., Wasserman I., 1993, ApJ, 418\nNishimura O., 2014, ApJ, 781, 30\nParkes G. E., Murdin P. G., Mason K. O., 1980, MNRAS, 190, 537\nPostnov K., Staubert R., Santangelo A., Klochkov D., Kretschmar P.,\nCaballero I., 2008, A\u0026A, 480, L21\nPostnov K., Mironov A. I., Lutovinov A. A., Shakura N. I., Kochetkova A.\nYu., Tsygankov S. S., 2015a, MNRAS, 446, 1013\nPostnov K. A., Gornostaev M. I., Klochkov D., Laplace E., Lukin V. V.,\nShakura N. I., 2015b, MNRAS, 452, 1601\nPottschmidt K., Rothschild R. E., Gasaway T., Wilms J., Suchy S., Coburn\nW., 2006, BAAS, 38, 384\nPoutanen J.,MushTukov A. A., SuleimanovV. F., Tsygankov S. S., Nagirner\nD. I., Doroshenko V., Lutovinov A. A., 2013, ApJ, 777, 115\nReig P., Nespoli E., 2013, A\u0026A, 551, A1\nReig P., Fabregat J., Coe J., 1997, A\u0026A, 322, 193\nRothschild R. E. et al., 1998, ApJ, 496, 538\nShakura N., Postnov K., Kochetkova A., Hjalmarsdotter L., 2012, MNRAS,\n420, 216\nShapiro S. L., Salpeter E. E., 1975, ApJ, 198, 671\nStaubert R., Shakura N. I., Postnov K., Wilms J., Rothschild R. E., Coburn\nW., Rodina L., Klochkov D., 2007, A\u0026A, 465, L25\nStaubert R., Klochkov D., Wilms J., Postnov K., Shakura N. I., Rothschild\nR. E., F¨urst F., Harrison F. A., 2014, A\u0026A, 572, 119\nStaubert R., Klochkov D., Vybornov V., Wilms J., Harrison F. A., 2016,\nA\u0026A, 590, A91\nSugizaki M., Yamamoto T., Mihara T., Nakajima M., Makishima K., 2015,\nPASJ, 67, 73\nTr¨umper J., Pietsch W., Reppin C., Voges W., Staubert R., Kendziorra E.,\n1978, ApJ, 219, L105\nTsygankov S. S., Lutovinov A. A., Churazov E. M., Sunyaev R. A., 2006,\nMNRAS, 371, 19\nVerner D. A., Yakovlev D. G., 1995, A\u0026AS, 109, 125\nWasserman I., Saltpeter E., 1980, ApJ, 241, 1107\nWilms J., Allen A., McCray R., 2000, ApJ, 542, 914\nYamamoto T. et al., 2011, PASJ, 63, S751\nZheleznyakov V., 1996, Astrophysics and Space Science Library, Vol. 204,\nRadiation in Astrophysical Plasmas. Springer, the Netherlands"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Richard E. Rothschild, Matthias Kühnel, Katja Pottschmidt, Paul Hemphill, Konstantin Postnov, Mikhail Gornostaev, Nikolai Shakura, Felix Fürst, Jörn Wilms, Rüdiger Staubert, Dmitry Klochkov; Discovery and modelling of a flattening of the positive cyclotron line/luminosity relation in GX 304−1 with RXTE. Mon Not R Astron Soc 2017; 466 (3): 2752-2779. doi: 10.1093/mnras/stw3222","other_numbering_system":null,"funders":[{"agency":"International Space Science Institute (ISSI)","grant_number":""},{"agency":"Russian Foundation for Basic Research","grant_number":"14-02-00657"},{"agency":"Russian Foundation for Basic Research","grant_number":"14-02-91345"},{"agency":"Russian Foundation for Basic Research","grant_number":"14-12-00146"},{"agency":"Deutsche Forschungsgemeinschaft (DFG)","grant_number":"KL2734/2-1"},{"agency":"Deutsche Forschungsgemeinschaft (DFG)","grant_number":"WI 1860/11-1"},{"agency":"Bundesministerium für Wirtschaft und Technologie (BMWi)","grant_number":""},{"agency":"Deutsches Zentrum für Luft- und Raumfahrt (DLR)","grant_number":"50OR1207"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}