{"title":"A Herschel Space Observatory Spectral Line Survey of Local Luminous Infrared Galaxies from 194 to 671 Microns","uri":"","abstract":"We describe a Herschel Space Observatory 194–671 μm spectroscopic survey of a sample of 121 local luminous infrared galaxies and report the fluxes of the CO J to J–1 rotational transitions for 4 ⩽ J ⩽ 13, the [N ii] 205 μm line, the [C i] lines at 609 and 370 μm, as well as additional and usually fainter lines. The CO spectral line energy distributions (SLEDs) presented here are consistent with our earlier work, which was based on a smaller sample, that calls for two distinct molecular gas components in general: (i) a cold component, which emits CO lines primarily at J ≾ 4 and likely represents the same gas phase traced by CO (1−0), and (ii) a warm component, which dominates over the mid-J regime (4 \u003c J ≾ 10) and is intimately related to current star formation. We present evidence that the CO line emission associated with an active galactic nucleus is significant only at J \u003e 10. The flux ratios of the two [C i] lines imply modest excitation temperatures of 15–30 K; the [C i] 370 μm line scales more linearly in flux with CO (4−3) than with CO (7−6). These findings suggest that the [C i] emission is predominantly associated with the gas component defined in (i) above. Our analysis of the stacked spectra in different far-infrared (FIR) color bins reveals an evolution of the SLED of the rotational transitions of H_2 O vapor as a function of the FIR color in a direction consistent with infrared photon pumping.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251790","docid":251790,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1254124","fileid":1254124,"datasetid":"document","objectid":251790,"filename":"Lu_2017_ApJS_230_1.pdf","mime_type":"application/pdf","hash":"9a5d6d774873d72b742ab5b486abb929","hash_type":"MD5","filesize":2613539,"mtime":"2017-05-05 16:50:45","url":"http://authors.library.caltech.edu/77216/1/Lu_2017_ApJS_230_1.pdf"}],"eprintid":77216,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Lu_2017_ApJS_230_1.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251791","docid":251791,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1254127","fileid":1254127,"datasetid":"document","objectid":251791,"filename":"1703.00005.pdf","mime_type":"application/pdf","hash":"5604f235221ba16f192f7df7252b7dbf","hash_type":"MD5","filesize":16151132,"mtime":"2017-05-05 16:51:39","url":"http://authors.library.caltech.edu/77216/2/1703.00005.pdf"}],"eprintid":77216,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1703.00005.pdf","content":"submitted"}],"note":"© 2017 American Astronomical Society. \n\nReceived 2016 September 9. Accepted 2017 February 22. Published 2017 May 3. \n\nThis paper benefited from a number of thoughtful comments made by the anonymous referee. The work presented here is based in part on observations made with Herschel, a European Space Agency Cornerstone Mission with significant participation by NASA. Support for this work was provided in part by NASA through an award issued by JPL/Caltech. N.L. acknowledges partial support from the Natural Science Foundation of China (NSFC) under grant No. 11673028. Y.Z. is partially supported by NSFC grant No. 11673057. Y.G. and Y.Z. are partially supported by NSFC grants No. 11173059, 11390373, and 11420101002, and the CAS pilot-b project No. XDB09000000. T.D.-S. acknowledges support from ALMA-CONICYT project 31130005 and FONDECYT 1151239. V.C. acknowledges partial support from the EU FP7 Grant PIRSES-GA-2012-316788. K.I. acknowledges support by the Spanish MINECO under grantAYA2013-47447-C3-2-P and MDM-2014-0369 of ICCUB (Unidad deExcelencia \"María de Maeztu\"). G.C.P. was supported by a FONDECYT postdoctoral fellowship (No. 3150361). This research has made use of the NASA/IPAC Extragalactic Database (NED), which is operated by the Jet Propulsion Laboratory, California Institute of Technology, under contract with the National Aeronautics and Space Administration.","id":77216,"rev_number":10,"userid":772,"eprint_dir":"disk0/00/07/72/16","datestamp":"2017-05-05 18:04:26","lastmod":"2017-05-05 18:04:26","status_changed":"2017-05-05 18:04:26","type":"article","metadata_visibility":"show","creators":[{"given":"Nanyao","family":"Lu","id":"Lu-Nanyao","orcid":""},{"given":"Yinghe","family":"Zhao","id":"Zhao-Yinghe","orcid":""},{"given":"Tanio","family":"Diaz-Santos","id":"Díaz-Santos-T","orcid":""},{"given":"C. Kevin","family":"Xu","id":"Xu-C-Kevin","orcid":""},{"given":"Yu","family":"Gao","id":"Gao-Yu","orcid":""},{"given":"Lee","family":"Armus","id":"Armus-L","orcid":""},{"given":"Kate G.","family":"Isaak","id":"Isaak-K-G","orcid":""},{"given":"Joseph M.","family":"Mazzarella ","id":"Mazzarella-J-M","orcid":""},{"given":"Paul P.","family":"van der Werf","id":"van-der-Werf-P-P","orcid":""},{"given":"Philip N.","family":"Appleton","id":"Appleton-P-N","orcid":""},{"given":"Vassilis","family":"Charmandaris","id":"Charmandaris-V","orcid":""},{"given":"Aaron S.","family":"Evans","id":"Evans-A-S","orcid":""},{"given":"Justin","family":"Howell","id":"Howell-J-H","orcid":""},{"given":"Kazushi","family":"Iwasawa","id":"Iwasawa-Kazushi","orcid":""},{"given":"Jamie","family":"Leech","id":"Leech-J","orcid":""},{"given":"Steven","family":"Lord","id":"Lord-S","orcid":""},{"given":"Andreea O.","family":"Petric","id":"Petric-A-O","orcid":""},{"given":"George C.","family":"Privon","id":"Privon-G-C","orcid":""},{"given":"David B.","family":"Sanders","id":"Sanders-D-B","orcid":""},{"given":"Bernhard","family":"Schulz","id":"Schulz-B","orcid":""},{"given":"Jason A.","family":"Surace","id":"Surace-J-A","orcid":"0000-0001-7291-0087"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"galaxies: active; galaxies: ISM; galaxies: star formation; infrared: galaxies; ISM: molecules; submillimeter: galaxies","date":"2017-05","date_type":"published","publication":"Astrophysical Journal Supplement Series","volume":"230","number":"1","pagerange":"Art. No. 1","id_number":"CaltechAUTHORS:20170505-095027368","refereed":true,"issn":"1538-4365","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170505-095027368","related_url":[{"url":"https://doi.org/10.3847/1538-4365/aa6476","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-4365/aa6476/meta","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1703.00005","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Alatalo, K., Blitz, L., Young, L. M., et al. 2011, ApJ, 735, 88\nAlonso-Herrero, A., Rieke, G. H., Rieke, M. J., \u0026 Scoville, N. Z. 2000, ApJ,\n532, 845\nAlonso-Herrero, A., Roche, P. F., Esquej, P., et al. 2013, ApJL, 779, L14\nAniano, G, Draine, B. T., Gordon, K. D., \u0026 Sandstrom, K. 2011, PASP, 123, 1218\nAppleton, P. N., Guillard, P., Boulanger, F., et al. 2013, ApJ, 777, 66\nArmus, L., Mazzarella, J. M., Evans, A. S., et al. 2009, PASP, 121, 559\nBayet, E., Gerin, M., Philips, T. G., \u0026 Contursi, A. 2009, MNRAS, 399, 264\nBeuther, H., Ragan, S. E., Ossenkopf, V., et al. 2014, A\u0026A, 571, A53\nBuat, V., \u0026 Deharveng, J. M. 1988, A\u0026A, 195, 60\nBüttgenbach, T. H., Keene, J., Phillips, T. G., \u0026 Walker, C. K. 1992, ApJL,\n397, L15\nCaputi, K. I., Lagache, G., Yan, L., et al. 2007, ApJ, 660, 97\nCarilli, C. L., \u0026 Walter, F. 2013, ARA\u0026A, 51, 105\nda Cunha, E., Groves, B., Walter, F., et al. 2013, ApJ, 766, 13\nDaddi, E., Elbaz, D., Walter, F., et al. 2010, ApJ, 714, 118\nDella Ceca, R., Ballo, L., Tavecchio, F., et al. 2002, ApJL, 581, L9\nDíaz-Santos, T., Armus, L., Charmandaris, V., et al. 2013, ApJ, 774, 68\nDíaz-Santos, T., Armus, L., Charmandaris, V., et al. 2014, ApJ, 788, 17\nDíaz-Santos, T., Armus, L., Charmandaris, V., et al. 2017, ApJ, submitted\nDíaz-Santos, T., Charmandaris, V., Armus, L., et al. 2010, ApJ, 723, 993\nDíaz-Santos, T., Charmandaris, V., Armus, L., et al. 2011, ApJ, 741, 32\nDraine, B. T., \u0026 Li, A. 2007, ApJ, 657, 810\nElbaz, D., Dickinson, M., Hwang, H. S., et al. 2010, A\u0026A, 533, A119\nFeruglio, C., Fiore, F., Maiolino, R., et al. 2013a, A\u0026A, 549, A51\nFeruglio, C., Fiore, F., Piconcelli, E., et al. 2013b, A\u0026A, 558, A87\nGao, Y, \u0026 Solomon, P. M. 1999, ApJL, 512, L99\nGao, Y, \u0026 Solomon, P. M. 2014, ApJ, 606, 271\nGenzel, R., Tacconi, L. J., Gracia-Carpio, J., et al. 2010, MNRAS, 407, 2091\nGerin, M., \u0026 Phillips, T. G. 2000, ApJ, 537, 644\nGilli, R., Norman, C., Vignali, C., et al. 2014, A\u0026A, 562, 67\nGoicoechea, J., Martín-Pintado, J., \u0026 Cernicharo, J. 2005, ApJ, 619, 291\nGonzález-Alfonso, E., Fischer, J., Aalto, S., \u0026 Falstad, N. 2014a, A\u0026A, 567, A91\nGonzález-Alfonso, E., Fischer, J., Bruderer, S., et al. 2013, A\u0026A, 550, A25\nGonzález-Alfonso, E., Fischer, J., Graciá-Carpio, J., et al. 2012, A\u0026A, 541, A4\nGonzález-Alfonso, E., Fischer, J., Graciá-Carpio, J., et al. 2014b, A\u0026A,\n561, A27\nGonzález-Alfonso, E., Fischer, J., Isaak, K., et al. 2010, A\u0026A, 518, 43\nGonzález-Alfonso, E., Smith, H. A., Ashby, M. L. N., et al. 2008, ApJ,\n675, 303\nGonzález-Alfonso, E., Smith, H. A., Fischer, J., \u0026 Cernicharo, J. 2004, ApJ,\n613, 247\nGreve, T. R., Leonidaki, I., Xilouris, E. M., et al. 2014, ApJ, 794, 142\nGriffin, M. J., Abergel, A., Abreu, A., et al. 2010, A\u0026A, 518, L3\nGruppioni, C., Pozzi, F., Rodighiero, G., et al. 2013, MNRAS, 432, 23\nHaan, S., Armus, L., Laine, S., et al. 2011, ApJS, 197, 27\nHailey-Dunsheath, S., Sturm, E., Fischer, J., et al. 2012, ApJ, 755, 57\nHarrison, A., Puxley, P., Russell, A., \u0026 Brand, P. 1995, MNRAS, 277, 413\nHeckman, T. M., Armus, L., \u0026 Miley, G. K. 1987, AJ, 93, 276\nHelou, G. 1986, ApJL, 311, L33\nHenkel, C., Peck, A. B., Tarchi, A., et al. 2005, A\u0026A, 436, 75\nHowell, J. H., Armus, L., Mazzarella, J. M., et al. 2010, ApJ, 715, 572\nIkeda, M., Oka, T., Tatematsu, K., Sekimoto, Y., \u0026 Yamamoto, S. 2002, ApJS,\n139, 467\nInami, H., Armus, L., Charmandaris, V., et al. 2013, ApJ, 777, 156\nIsrael, F. P., \u0026 Baas, F. 2002, A\u0026A, 383, 82\nIwasawa, K., Sanders, D. B., Teng, S. H., et al. 2011, A\u0026A, 529, A106\nKamenetzky, J., Glenn, J., Rangwala, N., et al. 2012, ApJ, 753, 70\nKamenetzky, J., Rangwala, N., Glenn, J., Maloney, P. R., \u0026 Conley, A. 2016,\nApJ, 829, 93\nKaufman, M. J., Wolfire, M. G., Hollenbach, D. J., \u0026 Luhman, M. L. 1999,\nApJ, 527, 795\nLagos, C. P., Bayet, E., Baugh, C. M., et al. 2012, MNRAS, 426, 2142\nLanz, L., Ogle, P. M., Evans, D., et al. 2015, ApJ, 801, 17\nLaurent, O, Mirabel, I. F., Charmandaris, V., et al. 2000, A\u0026A, 359, 887\nLe Flóch, E., Papovich, C., Dole, H., et al. 2005, ApJ, 632, 169\nLeech, J., Isaak, K. G., Papadopoulos, P. P., Gao, Y., \u0026 Davis, G. R. 2010,\nMNRAS, 406, 1364\nLiu, D., Gao, Y., Isaak, K., et al. 2015, ApJL, 810, L14\nLu, N., Dow, M. W., Houck, J. R., Salpeter, E. E., \u0026 Lewis, B. M. 1990, ApJ,\n357, 388\nLu, N., Zhao, Y., Xu, C. K., et al. 2014, ApJL, 787, L23\nLu, N., Zhao, Y., Xu, C. K., et al. 2015, ApJL, 802, L11\nLutz, D., Berta, S., Contursi, A., et al. 2016, A\u0026A, 591, A136\nMagnelli, B., Elbaz, D., Chary, R. R., et al. 2009, A\u0026A, 496, 57\nMagnelli, B., Elbaz, D., Chary, R. R., et al. 2011, A\u0026A, 528, A35\nMarkwardt, C. B. 2009, adass XVIII, 411, 251\nMashian, N., Sturm, E., Sternberg, A., et al. 2015, ApJ, 802, 81\nMax, C. E., Canalizo, G., Macintosh, B. A., et al. 2005, ApJ, 621, 738\nMeijerink, R., Kristensen, L. E., Weiß, A., et al. 2013, ApJL, 762, L16\nMonje, R. R., Emprechtinger, M., Phillips, T. G., et al. 2011, ApJ, 734, 23\nMonje, R. R., Lord, S., Falgarone, E., et al. 2014, ApJ, 785, 22\nMurphy, E. J., Stierwalt, S., Armus, L., Condon, J. J., \u0026 Evans, A. S. 2013,\nApJ, 768, 2\nMuzzin, A., van Dokkum, P., Kriek, M., et al. 2010, ApJ, 725, 742\nNeufeld, D. A., Sonnentrucker, P., Phillips, T. G., et al. 2010, A\u0026A, 518, L108\nNeufeld, D. A., Wolfire, M., \u0026 Schilke, P. 2005, ApJ, 628, 260\nOgle, P., Boulanger, F., Guillard, P., et al. 2010, ApJ, 1193\nOjha, R., Stark, A. A., Hsieh, H. H., et al. 2001, ApJ, 548, 253\nOtt, S. 2010, in ASP Conf. Ser. 434, Astronomical Data Analysis Software and\nSystems XIX, ed. Y. Mizumoto, K. Morita, \u0026 M. Ohishi (San Francisco,\nCA: Astronomical Society of the Pacific), 139\nPanuzzo, P., Rangwala, N., Rykala, A., et al. 2010, A\u0026A, 518, L37\nPapadopoulos, P. P., \u0026 Greve, T. R. 2004, ApJL, 615, L29\nPapadopoulos, P. P., Thi, W.-F., \u0026 Viti, S. 2004, MNRAS, 351, 147\nPapadopoulos, P. P., van der Werf, P., Xilouris, E., Isaak, K. G., \u0026 Gao, Y.\n2012, ApJ, 751, 10\nPapadopoulos, P. P., Zhang, Z.-Y., Xilouris, E. M., et al. 2014, ApJ, 788, 153\nPellegrini, E. W., Smith, J. D., Wolfire, M. G., et al. 2013, ApJL, 779, L19\nPereira-Santaella, M., Spinoglio, L., Busquet, G., et al. 2013, ApJ, 768, 55\nPetric, A. O., Armus, L., Howell, J., et al. 2011, ApJ, 730, 28\nPetty, S. M., Armus, L., Charmandaris, V., et al. 2014, AJ, 148, 111\nPhillips, T. G., Bergin, E. A., Liz, D. C., et al. 2010, A\u0026A, 518, 109\nPilbratt, G. L., Riedinger, J. R., Passvogel, T., et al. 2010, A\u0026A, 518, L1\nPoglitsch, A., Waelkens, C., Geis, N., et al. 2010, A\u0026A, 518, L2\nPrivon, G. C., Herrero-Illana, R., Evans, A. S., et al. 2015, ApJ, 814, 39\nRangwala, N., Maloney, P. R., Glenn, J., et al. 2011, ApJ, 743, 94\nRawle, T. D., Egami, E., Bussmann, R. S., et al. 2014, ApJ, 783, 59\nRiechers, D. A., Bradford, C. M., Clements, D. L., et al. 2013, Natur, 496, 329\nRigopoulou, D., Hurley, P. D., Swinyard, B.M., et al. 2013, MNRAS, 434, 2051\nRosenberg, M. J. F., Kazandjian, M. V., van der Werf, P. P., et al. 2014a,\nA\u0026A, 564, A126\nRosenberg, M. J. F., Meijerink, R., Israel, F. P., et al. 2014b, A\u0026A, 568, A90\nRosenberg, M. J. F., van der Werf, P. P., Aalto, S., et al. 2015, A\u0026A, 568, A90\nRujopakarn, W., Rieke, G. H., Eisenstein, D. J., \u0026 Juneau, S. 2011, ApJ,\n726, 93\nSakamoto, K., Aalto, S., Costagliola, F., et al. 2013, ApJ, 764, 42\nSanders, D. B., Mazzarella, J. M., Kim, D.-C., \u0026 Surace, J. A. 2003, ApJ,\n126, 1607\nSanders, D. B., \u0026 Mirabel, I. F. 1996, ARA\u0026A, 34, 749\nSanders, D. B., Scoville, N. Z., \u0026 Soifer, B. T. 1991, ApJ, 370, 158\nSargent, A. L., \u0026 Scoville, N. 1991, ApJL, 366, L1\nSchilke, P., Carlstrom, J. E., Keene, J., \u0026 Phillips, T. 1993, ApJL, 417, L67\nSchirm, M. R. P., Wilson, C. D., Parkin, T. J., et al. 2014, ApJ, 781, 101\nScoville, N., Sheth, K., Walter, F., et al. 2015, ApJ, 800, 70\nSonnentrucker, P, Neufeld, D. A., Phillips, T. G., et al. 2010, A\u0026A, 521, L12\nSonnentrucker, P, Wolfire, M., Neufeld, D. A., et al. 2015, ApJ, 806, 49\nSpaans, M., \u0026 Meijerink, R. 2008, ApJL, 678, L5\nSpinoglio, L., Pereira-Santaella, M., Busquet, G., et al. 2012, ApJ, 758, 108\nStierwalt, S., Armus, L., Charmandaris, V., et al. 2014, ApJ, 790, 124\nStierwalt, S., Armus, L., Surace, J. A., et al. 2013, ApJS, 206, 1\nStutzki, J, Graf, U. U., Haas, S., et al. 1997, ApJL, 477, L33\nSurace, J. A., Sanders, D. B., \u0026 Mazzarella, J. M. 2004, ApJ, 127, 3235\nSwinyard, B. M., Polehampton, E. T., Hopwood, R., et al. 2014, MNRAS,\n440, 3658\nTacconi, L. J., Genzel, R., Tecza, M., et al. 1999, ApJ, 524, 732\nTarchi, A., Castangia, P., Henkel, C., \u0026 Menten, K. M. 2007, NewAR, 51, 67\nTelesco, C. M., \u0026 Decher, R. 1988, ApJ, 334, 573\nU, V., Sanders, D. B., Mazzarella, J. M., et al. 2012, ApJS, 203, 9\nVan der Tak, F. F. S., Ossenkopf, V., Nagy, Z., et al. 2012, A\u0026A, 537, L10\nvan der Werf, P. P., Isaak, K. G., Meijerink, R., et al. 2010, A\u0026A, 518, L42\nvan Dishoeck, E. F., Kristensen, L. E., Benz, A. O., et al. 2011, PASP, 123, 138\nVeilleux, S., Pupke, D. S. N., Kim, D.-C., et al. 2009, ApJS, 182, 628\nWeiß, A., Henkel, C., Downes, D., \u0026 Walter, F. 2003, A\u0026A, 409, L41\nWeiß, A., Requena-Torres, M. A., Güsten, R., et al. 2010, A\u0026A, 521, L1\nWu, J., Evans, N. J., II, Gao, Y., et al. 2005, ApJ, 635, 173\nWu, R., Madden, S. C., Galliano, F., et al. 2015, A\u0026A, 575, A88\nWu, R., Polehampton, E. T., Etxaluze, M., et al. 2013, A\u0026A, 556, A116\nXu, C. K, Cao, C., Lu, N., et al. 2014, ApJ, 787, 48\nXu, C. K., Cao, C., Lu, N., et al. 2015, ApJ, 799, 11\nYang, C., Gao, Y., Omont, A., et al. 2013, ApJL, 771, L24\nYao, L., Seaquist, E. R., Kuno, N., \u0026 Dunne, L. 2003, ApJ, 588, 771\nZhao, Y., Lu, N., Xu, C. K., et al. 2013, ApJL, 765, L13\nZhao, Y., Lu, N., Xu, C. K., et al. 2016a, ApJ, 819, 69\nZhao, Y., Lu, N., Xu, C. K., et al. 2016b, ApJ, 820, 118"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Nanyao Lu et al 2017 ApJS 230 1","other_numbering_system":null,"funders":[{"agency":"NASA/JPL/Caltech","grant_number":""},{"agency":"Natural Science Foundation of China","grant_number":"11673028"},{"agency":"Natural Science Foundation of China","grant_number":"11673057"},{"agency":"Natural Science Foundation of China","grant_number":"11173059"},{"agency":"Natural Science Foundation of China","grant_number":"11390373"},{"agency":"Natural Science Foundation of China","grant_number":"11420101002"},{"agency":"Chinese Academy of Sciences","grant_number":"XDB09000000"},{"agency":"Comisión Nacional de Investigación Científica y Tecnológica (CONICYT)","grant_number":"31130005"},{"agency":"Fondo Nacional de Desarrollo Científico y Tecnolόgico (FONDECYT)","grant_number":"1151239"},{"agency":"Marie Curie Fellowship","grant_number":"PIRSES-GA-2012-316788"},{"agency":"Ministerio de Economía, Industria y Competitividad (MINECO)","grant_number":"AYA2013-47447-C3-2-P"},{"agency":"Unidad de Excelencia \"María de Maeztu\"","grant_number":"MDM-2014-0369"},{"agency":"Fondo Nacional de Desarrollo Científico y Tecnológico (FONDECYT)","grant_number":"3150361"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Infrared Processing and Analysis Center (IPAC)"]}