{"title":"Log-normal Star Formation Histories in Simulated and Observed Galaxies","uri":"","abstract":"Gladders et al. have recently suggested that the star formation histories (SFHs) of individual galaxies are characterized by a log-normal function in time, implying a slow decline rather than rapid quenching. We test their conjecture on theoretical SFHs from the cosmological simulation Illustris and on observationally inferred SFHs. While the log-normal form necessarily ignores short-lived features such as starbursts, it fits the overall shape of the majority of SFHs very well. In particular, 85% of the cumulative SFHs are fitted to within a maximum error of 5% of the total stellar mass formed, and 99% to within 10%. The log-normal performs systematically better than the commonly used delayed-τ model, and is superseded only by functions with more than three free parameters. Poor fits are mostly found in galaxies that were rapidly quenched after becoming satellites. We explore the log-normal parameter space of normalization, peak time, and full width at half maximum, and find that the simulated and observed samples occupy similar regions, though Illustris predicts wider, later-forming SFHs on average. The ensemble of log-normal fits correctly reproduces complex metrics such as the evolution of Illustris galaxies across the star formation main sequence, but overpredicts their quenching timescales. SFHs in Illustris are a diverse population not determined by any one physical property of galaxies, but follow a tight relation, where width ∝ (peak time)^(3/2). We show that such a relation can be explained qualitatively (though not quantitatively) by a close connection between the growth of dark matter halos and their galaxies.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251786","docid":251786,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1254100","fileid":1254100,"datasetid":"document","objectid":251786,"filename":"Diemer__2017_ApJ_839_26.pdf","mime_type":"application/pdf","hash":"d4e24febd69904b5994b769aa984beed","hash_type":"MD5","filesize":5850019,"mtime":"2017-05-05 16:37:50","url":"http://authors.library.caltech.edu/77214/1/Diemer__2017_ApJ_839_26.pdf"}],"eprintid":77214,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Diemer__2017_ApJ_839_26.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251787","docid":251787,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1254102","fileid":1254102,"datasetid":"document","objectid":251787,"filename":"1701.02308.pdf","mime_type":"application/pdf","hash":"43a9c1cb24d3a135c32a029713d886ad","hash_type":"MD5","filesize":1984222,"mtime":"2017-05-05 16:37:57","url":"http://authors.library.caltech.edu/77214/2/1701.02308.pdf"}],"eprintid":77214,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1701.02308.pdf","content":"submitted"}],"note":"© 2017 The American Astronomical Society. \n\nReceived 2017 January 9; revised 2017 March 2; accepted 2017 March 21; published 2017 April 11. \n\nWe are deeply grateful to all those who shared their data with us, namely the authors of G13 (Mike Gladders, Augustus Oemler, Alan Dressler, Bianca Poggianti, and Benedetta Vulcani), Camilla Pacifici for sharing her SFHs, and the Illustris team for making their simulation public (Mark Vogelsberger, Shy Genel, Volker Springel, Debora Sijacki, Dandan Xu, Greg Snyder, Dylan Nelson, Lars Hernquist, and, in particular, Vicente Rodriguez-Gomez for his help with the merger trees). We thank Peter Behroozi, Charlie Conroy, Andrew Hearin, Lars Hernquist, Joel Leja, Camilla Pacifici, Ana-Roxana Pop, Laura Sales, Josh Speagle, and Sandro Tacchella for fruitful discussions and/or comments on a draft of this paper. B.D. gratefully acknowledges the financial support of an Institute for Theory and Computation Fellowship.","id":77214,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/72/14","datestamp":"2017-05-05 16:51:05","lastmod":"2017-05-05 16:51:05","status_changed":"2017-05-05 16:51:05","type":"article","metadata_visibility":"show","creators":[{"given":"Benedikt","family":"Diemer","id":"Diemer-B","orcid":""},{"given":"Martin","family":"Sparre","id":"Sparre-M","orcid":""},{"given":"Louis E.","family":"Abramson","id":"Abramson-L-E","orcid":""},{"given":"Paul","family":"Torrey","id":"Torrey-P","orcid":"0000-0002-5653-0786"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"cosmology: theory – galaxies: star formation – methods: numerical","date":"2017-04-10","date_type":"published","publication":"Astrophysical Journal","volume":"839","number":"1","pagerange":"Art. No. 26","id_number":"CaltechAUTHORS:20170505-093744385","refereed":true,"issn":"1538-4357","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170505-093744385","related_url":[{"url":"https://doi.org/10.3847/1538-4357/aa68e5","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-4357/aa68e5/meta","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1701.02308","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Abramson L. E., Gladders M. D., Dressler A. et al 2015 ApJL 801 L12\nIOPscienceADS  \n\n\nAbramson L. E., Gladders M. D., Dressler A. et al 2016 ApJ 832 7\nIOPscienceADS  \n\n\nBecker M. R. 2015 arXiv:1507.03605\nPreprint\n\n\nBehroozi P. S., Marchesini D., Wechsler R. H. et al 2013a ApJL 777 L10\nIOPscienceADS  \n\n\nBehroozi P. S., Wechsler R. H. and Conroy C. 2013b ApJ 770 57\nIOPscienceADS  \n\n\nBluck A. F. L., Mendel J. T., Ellison S. L. et al 2016 MNRAS 462 2559\nCrossrefADS  \n\n\nBouché N., Dekel A., Genzel R. et al 2010 ApJ 718 1001\nIOPscienceADS  \n\n\nBrinchmann J., Charlot S., White S. D. M. et al 2004 MNRAS 351 1151\nCrossrefADS  \n\n\nBrook C. B., Stinson G., Gibson B. K. et al 2012 MNRAS 419 771\nCrossrefADS  \n\n\nBruzual A. G. 1983 ApJ 273 105\nCrossrefADS  \n\n\nBruzual G. and Charlot S. 2003 MNRAS 344 1000\nCrossrefADS  \n\n\nBundy K., Ellis R. S., Conselice C. J. et al 2006 ApJ 651 120\nIOPscienceADS  \n\n\nCalvi R., Poggianti B. M. and Vulcani B. 2011 MNRAS 416 727\nCrossrefADS  \n\n\nCarollo C. M., Bschorr T. J., Renzini A. et al 2013 ApJ 773 112\nIOPscienceADS  \n\n\nChabrier G. 2003 PASP 115 763\nIOPscienceADS  \n\n\nChang Y.-Y., van der Wel A., da Cunha E. and Rix H.-W. 2015 ApJS 219 8\nIOPscienceADS  \n\n\nCohn J. D. and van de Voort F. 2015 MNRAS 446 3253\nCrossrefADS  \n\n\nConroy C. and Wechsler R. H. 2009 ApJ 696 620\nIOPscienceADS  \n\n\nConroy C., Wechsler R. H. and Kravtsov A. V. 2006 ApJ 647 201\nIOPscienceADS  \n\n\nCowie L. L., Songaila A., Hu E. M. and Cohen J. G. 1996 AJ 112 839\nCrossrefADS  \n\n\nCroton D. J., Gao L. and White S. D. M. 2007 MNRAS 374 1303\nCrossrefADS  \n\n\nDalal N., White M., Bond J. R. and Shirokov A. 2008 ApJ 687 12\nIOPscienceADS  \n\n\nDavé R., Finlator K. and Oppenheimer B. D. 2012 MNRAS 421 98\nCrossrefADS  \n\n\nDavé R., Thompson R. and Hopkins P. F. 2016 MNRAS 462 3265\nCrossrefADS  \n\n\nDavis M., Efstathiou G., Frenk C. S. and White S. D. M. 1985 ApJ 292 371\nCrossrefADS  \n\n\nDe Lucia G. and Blaizot J. 2007 MNRAS 375 2\nCrossrefADS  \n\n\nDekel A., Zolotov A., Tweed D. et al 2013 MNRAS 435 999\nCrossrefADS  \n\n\nDolag K., Borgani S., Murante G. and Springel V. 2009 MNRAS 399 497\nCrossrefADS  \n\n\nDressler A. 1980 ApJ 236 351\nCrossrefADS  \n\n\nDressler A., Kelson D. D., Abramson L. E. et al 2017 ApJ 833 251\nIOPscienceADS  \n\n\nDressler A., Oemler A. Jr., Poggianti B. M. et al 2013 ApJ 770 62\nIOPscienceADS  \n\n\nEales S., de Vis P., W. L. Smith M. et al 2017 MNRAS 465 3125\nCrossrefADS  \n\n\nElbaz D., Daddi E., Le Borgne D. et al 2007 A\u0026A 468 33\nCrossrefADS  \n\n\nFagioli M., Carollo C. M., Renzini A. et al 2016 ApJ 831 173\nIOPscienceADS  \n\n\nFeldmann R., Hopkins P. F., Quataert E., Faucher-Giguère C.-A. and Kereš D. 2016a MNRAS 458 L14\nCrossrefADS  \n\n\nFeldmann R., Quataert E., Hopkins P. F., Faucher-Giguère C.-A. and Kereš D. 2016b MNRAS submitted (arXiv:1610.02411)\nPreprint  \n\n\nGallagher J. S. III, Hunter D. A. and Tutukov A. V. 1984 ApJ 284 544\nCrossrefADS  \n\n\nGao L., Springel V. and White S. D. M. 2005 MNRAS 363 L66\nCrossrefADS  \n\n\nGavazzi G., Bonfanti C., Sanvito G., Boselli A. and Scodeggio M. 2002 ApJ 576 135\nIOPscienceADS  \n\n\nGeha M., Blanton M. R., Yan R. and Tinker J. L. 2012 ApJ 757 85\nIOPscienceADS  \n\n\nGenel S., Vogelsberger M., Springel V. et al 2014 MNRAS 445 175\nCrossrefADS  \n\n\nGladders M. D., Oemler A., Dressler A. et al 2013 ApJ 770 64\nIOPscienceADS  \n\n\nGu M., Conroy C. and Behroozi P. 2016 ApJ 833 2\nIOPscienceADS  \n\n\nGuo Q., White S., Boylan-Kolchin M. et al 2011 MNRAS 413 101\nCrossrefADS  \n\n\nGutcke T. A., Macciò A. V., Dutton A. A. and Stinson G. S. 2017 MNRAS 466 4614\nCrossref  \n\n\nHahn C., Tinker J. L. and Wetzel A. R. 2016 arXiv:1609.04398\nPreprint\n\n\nHayward C. C., Kereš D., Jonsson P. et al 2011 ApJ 743 159\nIOPscienceADS  \n\n\nHearin A. P. and Watson D. F. 2013 MNRAS 435 1313\nCrossrefADS  \n\n\nHearin A. P., Zentner A. R., van den Bosch F. C., Campbell D. and Tollerud E. 2016 MNRAS 460 2552\nCrossrefADS  \n\n\nHeavens A., Panter B., Jimenez R. and Dunlop J. 2004 Natur 428 625\nCrossrefADS  \n\n\nHinshaw G., Larson D., Komatsu E. et al 2013 ApJS 208 19\nIOPscienceADS  \n\n\nHopkins A. M. and Beacom J. F. 2006 ApJ 651 142\nIOPscienceADS  \n\n\nKarim A., Schinnerer E., Martínez-Sansigre A. et al 2011 ApJ 730 61\nIOPscienceADS  \n\n\nKauffmann G., Heckman T. M., White S. D. M. et al 2003 MNRAS 341 33\nCrossrefADS  \n\n\nKauffmann G., White S. D. M. and Guiderdoni B. 1993 MNRAS 264 201\nCrossrefADS  \n\n\nKelson D. D. 2014 ApJ, submitted (arXiv:1406.5191)\nPreprint\n\n\nKelson D. D., Benson A. J. and Abramson L. E. 2016 ApJ, submitted (arXiv:1610.06566)\nPreprint\n\n\nKennicutt R. C. Jr. 1998 ARA\u0026A 36 189\nCrossrefADS  \n\n\nKennicutt R. C. and Evans N. J. 2012 ARA\u0026A 50 531\nCrossrefADS  \n\n\nKravtsov A. V., Berlind A. A., Wechsler R. H. et al 2004 ApJ 609 35\nIOPscienceADS  \n\n\nKriek M., van Dokkum P. G., Franx M. et al 2007 ApJ 669 776\nIOPscienceADS  \n\n\nLee S.-K., Ferguson H. C., Somerville R. S., Wiklind T. and Giavalisco M. 2010 ApJ 725 1644\nIOPscienceADS  \n\n\nLeitner S. N. 2012 ApJ 745 149\nIOPscienceADS  \n\n\nLeja J., Johnson B. D., Conroy C., van Dokkum P. G. and Byler N. 2017 ApJ 837 170\nIOPscienceADS  \n\n\nLeja J., van Dokkum P. and Franx M. 2013 ApJ 766 33\nIOPscienceADS  \n\n\nLeja J., van Dokkum P. G., Franx M. and Whitaker K. E. 2015 ApJ 798 115\nIOPscienceADS  \n\n\nLewis A. R., Dolphin A. E., Dalcanton J. J. et al 2015 ApJ 805 183\nIOPscienceADS  \n\n\nLilly S. J., Carollo C. M., Pipino A., Renzini A. and Peng Y. 2013 ApJ 772 119\nIOPscienceADS  \n\n\nLilly S. J., Le Fevre O., Hammer F. and Crampton D. 1996 ApJL 460 L1\nIOPscienceADS  \n\n\nLin Y.-T., Mandelbaum R., Huang Y.-H. et al 2016 ApJ 819 119\nIOPscienceADS  \n\n\nMadau P. and Dickinson M. 2014 ARA\u0026A 52 415\nCrossrefADS  \n\n\nMadau P., Pozzetti L. and Dickinson M. 1998 ApJ 498 106\nIOPscienceADS  \n\n\nMcBride J., Fakhouri O. and Ma C.-P. 2009 MNRAS 398 1858\nCrossrefADS  \n\n\nMcDermid R. M., Alatalo K., Blitz L. et al 2015 MNRAS 448 3484\nCrossrefADS  \n\n\nMistani P. A., Sales L. V., Pillepich A. et al 2016 MNRAS 455 2323\nCrossrefADS  \n\n\nMitra S., Davé R., Simha V. and Finlator K. 2017 MNRAS 464 2766\nCrossrefADS  \n\n\nMiyatake H., More S., Takada M. et al 2016 PhRvL 116 041301\nCrossrefADS  \n\n\nMore S., van den Bosch F. C., Cacciato M. et al 2009 MNRAS 392 801\nCrossrefADS  \n\n\nMoster B. P., Naab T. and White S. D. M. 2013 MNRAS 428 3121\nCrossrefADS  \n\n\nNeistein E., van den Bosch F. C. and Dekel A. 2006 MNRAS 372 933\nCrossrefADS  \n\n\nNoeske K. G., Weiner B. J., Faber S. M. et al 2007 ApJL 660 L43\nIOPscienceADS  \n\n\nOemler A. Jr. 1974 ApJ 194 1\nCrossrefADS  \n\n\nOemler A. Jr, Abramson L. E., Gladders M. D. et al 2016 ApJ, submitted (arXiv:1611.05932)\nPreprint\n\n\nOemler A. Jr., Dressler A., Gladders M. G. et al 2013a ApJ 770 63\nIOPscienceADS  \n\n\nOemler A. Jr., Dressler A., Gladders M. G. et al 2013b ApJ 770 61\nIOPscienceADS  \n\n\nOesch P. A., Bouwens R. J., Carollo C. M. et al 2010 ApJL 709 L21\nIOPscienceADS  \n\n\nPacifici C., Charlot S., Blaizot J. and Brinchmann J. 2012 MNRAS 421 2002\nCrossrefADS  \n\n\nPacifici C., Kassin S. A., Weiner B., Charlot S. and Gardner J. P. 2013 ApJL 762 L15\nIOPscienceADS  \n\n\nPacifici C., Kassin S. A., Weiner B. J. et al 2016b ApJ 832 79\nIOPscienceADS  \n\n\nPacifici C., Oh S., Oh K., Lee J. and Yi S. K. 2016a ApJ 824 45\nIOPscienceADS  \n\n\nPatel S. G., Fumagalli M., Franx M. et al 2013 ApJ 778 115\nIOPscienceADS  \n\n\nPeacock J. A. and Smith R. E. 2000 MNRAS 318 1144\nCrossrefADS  \n\n\nPeng Y., Maiolino R. and Cochrane R. 2015 Natur 521 192\nCrossrefADS  \n\n\nPeng Y.-j., Lilly S. J., Renzini A. and Carollo M. 2012 ApJ 757 4\nIOPscienceADS  \n\n\nPeng Y.-j., Lilly S. J., Kovač K. et al 2010 ApJ 721 193\nIOPscienceADS  \n\n\nPoggianti B. M., Calvi R., Bindoni D. et al 2013 ApJ 762 77\nIOPscienceADS  \n\n\nPostman M. and Geller M. J. 1984 ApJ 281 95\nCrossrefADS  \n\n\nReddick R. M., Wechsler R. H., Tinker J. L. and Behroozi P. S. 2013 ApJ 771 30\nIOPscienceADS  \n\n\nRodriguez-Gomez V., Genel S., Vogelsberger M. et al 2015 MNRAS 449 49\nCrossrefADS  \n\n\nRodriguez-Gomez V., Pillepich A., Sales L. V. et al 2016 MNRAS 458 2371\nCrossrefADS  \n\n\nRodriguez-Gomez V., Sales L. V., Genel S. et al 2017 MNRAS 467 3083\nCrossrefADS  \n\n\nSandage A. 1986 A\u0026A 161 89\nADS  \n\n\nSchawinski K., Urry C. M., Simmons B. D. et al 2014 MNRAS 440 889\nCrossrefADS  \n\n\nSchaye J., Crain R. A., Bower R. G. et al 2015 MNRAS 446 521\nCrossrefADS  \n\n\nSeljak U. 2000 MNRAS 318 203\nCrossrefADS  \n\n\nSijacki D., Vogelsberger M., Genel S. et al 2015 MNRAS 452 575\nCrossrefADS  \n\n\nSimha V., Weinberg D. H., Conroy C. et al 2014 arXiv:1404.0402\nPreprint\n\n\nSkillman E. D., Hidalgo S. L., Weisz D. R. et al 2014 ApJ 786 44\nIOPscienceADS  \n\n\nSomerville R. S., Primack J. R. and Faber S. M. 2001 MNRAS 320 504\nCrossrefADS  \n\n\nSparre M., Hayward C. C., Feldmann R. et al 2017 MNRAS 466 88\nCrossrefADS  \n\n\nSparre M., Hayward C. C., Springel V. et al 2015 MNRAS 447 3548\nCrossrefADS  \n\n\nSpeagle J. S., Steinhardt C. L., Capak P. L. and Silverman J. D. 2014 ApJS 214 15\nIOPscienceADS  \n\n\nSpringel V. 2010 MNRAS 401 791\nCrossrefADS  \n\n\nSpringel V. and Hernquist L. 2003 MNRAS 339 289\nCrossrefADS  \n\n\nSpringel V., White S. D. M., Tormen G. and Kauffmann G. 2001 MNRAS 328 726\nCrossrefADS  \n\n\nSpringel V., White S. D. M., Jenkins A. et al 2005 Natur 435 629\nCrossrefADS  \n\n\nTacchella S., Dekel A., Carollo C. M. et al 2016a MNRAS 458 242\nCrossrefADS  \n\n\nTacchella S., Dekel A., Carollo C. M. et al 2016b MNRAS 457 2790\nCrossrefADS  \n\n\nTacchella S., Trenti M. and Carollo C. M. 2013 ApJL 768 L37\nIOPscienceADS  \n\n\nTasitsiomi A., Kravtsov A. V., Gottlöber S. and Klypin A. A. 2004 ApJ 607 125\nIOPscienceADS  \n\n\nThomas D., Maraston C., Bender R. and Mendes de Oliveira C. 2005 ApJ 621 673\nIOPscienceADS  \n\n\nTinker J., Wetzel A., Conroy C. and Mao Y.-Y. 2016 MNRAS, submitted (arXiv:1609.03388)\nPreprint\n\n\nTinsley B. M. 1968 ApJ 151 547\nCrossrefADS  \n\n\nTinsley B. M. 1972 A\u0026A 20 383\nADS  \n\n\nTojeiro R., Heavens A. F., Jimenez R. and Panter B. 2007 MNRAS 381 1252\nCrossrefADS  \n\n\nTojeiro R., Wilkins S., Heavens A. F., Panter B. and Jimenez R. 2009 ApJS 185 1\nIOPscienceADS  \n\n\nTorrey P., Cox T. J., Kewley L. and Hernquist L. 2012 ApJ 746 108\nIOPscienceADS  \n\n\nTorrey P., Vogelsberger M., Genel S. et al 2014 MNRAS 438 1985\nCrossrefADS  \n\n\nTorrey P., Wellons S., Ma C.-P., Hopkins P. F. and Vogelsberger M. 2016 MNRAS, submitted (arXiv:1606.07271)\nPreprint\n\n\nTorrey P., Wellons S., Machado F. et al 2015 MNRAS 454 2770\nCrossrefADS  \n\n\nTreu T., Ellis R. S., Liao T. X. and van Dokkum P. G. 2005 ApJL 622 L5\nIOPscienceADS  \n\n\nÜbler H., Naab T., Oser L. et al 2014 MNRAS 443 2092\nCrossrefADS  \n\n\nValentinuzzi T., Fritz J., Poggianti B. M. et al 2010 ApJ 712 226\nIOPscienceADS  \n\n\nvan den Bosch F. C., Aquino D., Yang X. et al 2008 MNRAS 387 79\nCrossrefADS  \n\n\nvan der Wel A., Franx M., van Dokkum P. G. et al 2014 ApJ 788 28\nIOPscienceADS  \n\n\nvan Dokkum P. G., Leja J., Nelson E. J. et al 2013 ApJL 771 L35\nIOPscienceADS  \n\n\nVogelsberger M., Genel S., Sijacki D. et al 2013 MNRAS 436 3031\nCrossrefADS  \n\n\nVogelsberger M., Genel S., Springel V. et al 2014a Natur 509 177\nCrossrefADS  \n\n\nVogelsberger M., Genel S., Springel V. et al 2014b MNRAS 444 1518\nCrossrefADS  \n\n\nWechsler R. H., Bullock J. S., Primack J. R., Kravtsov A. V. and Dekel A. 2002 ApJ 568 52\nIOPscienceADS  \n\n\nWechsler R. H., Zentner A. R., Bullock J. S., Kravtsov A. V. and Allgood B. 2006 ApJ 652 71\nIOPscienceADS  \n\n\nWeisz D. R., Dolphin A. E., Skillman E. D. et al 2014 ApJ 789 147\nIOPscienceADS  \n\n\nWeisz D. R., Dalcanton J. J., Williams B. F. et al 2011 ApJ 739 5\nIOPscienceADS  \n\n\nWellons S. and Torrey P. 2017 MNRAS 467 3887\nCrossrefADS  \n\n\nWetzel A. R., Tinker J. L., Conroy C. and van den Bosch F. C. 2013 MNRAS 432 336\nCrossrefADS  \n\n\nWhitaker K. E., van Dokkum P. G., Brammer G. and Franx M. 2012 ApJL 754 L29\nIOPscienceADS  \n\n\nWilliams B. F., Dalcanton J. J., Johnson L. C. et al 2011 ApJL 734 L22\nIOPscienceADS  \n\n\nWuyts S., Förster Schreiber N. M., van der Wel A. et al 2011 ApJ 742 96\nIOPscienceADS  \n\n\nZentner A. R., Hearin A. P. and van den Bosch F. C. 2014 MNRAS 443 3044\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Benedikt Diemer et al 2017 ApJ 839 26","other_numbering_system":null,"funders":[{"agency":"Institute for Theory and Computation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}