{"title":"Juice from juice: Bringing solar energy education to the classroom","uri":"","abstract":"The Center for Chem. Innovation in Solar Fuels (CCI Solar) has developed several diverse outreach programs over the 10 years of its existence that satisfy the National Science Foundation's Broader Impacts requirements, including citizen science, informal science education, and teacher professional development. Started in 2008, Juice from Juice is a teacher professional development program where researchers from the Center put on workshops for local teachers to introduce them to solar energy expts. and curriculum that they can implement in their classrooms. The program was originally local to the Pasadena area centered on the CCI's headquarters at Caltech. Teachers from the Pasadena Unified School District and researchers at Caltech developed the expts. and curriculum together, along with assembling kits for teachers to take back to their classroom. After professional evaluation of the program and feedback from the National Science Foundation program officer, multiple changes were implemented that not only improved the quality of the local Juice from Juice workshops, but also allowed the program to expand across the country. Now as the sunset of the Center is on the horizon, CCI Solar is reflecting on the success and challenges of the Juice from Juice program and looking\nto permanently secure the future of this robust, popular program. Director of Education, Outreach and Diversity at CCI Solar, Michelle DeBoever, will walk through the development of the Juice from Juice program, its evaluation, revisions to the program, and its potential future with a third party partner as Center funding\ncomes to a close. Hopefully the story of Juice from Juice can serve as a model for other outreach programs\nand offer insight to what works (and what doesn't) when developing a teacher professional development\nworkshop and offering classroom expt. kits and curriculum.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251820","docid":251820,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1254405","fileid":1254405,"datasetid":"document","objectid":251820,"filename":"DeBoever_2017pCHED-284.pdf","mime_type":"application/pdf","hash":"0f331200849175cd705f378dd6cdfcfc","hash_type":"MD5","filesize":91308,"mtime":"2017-05-05 19:56:12","url":"http://authors.library.caltech.edu/77228/1/DeBoever_2017pCHED-284.pdf"}],"eprintid":77228,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"DeBoever_2017pCHED-284.pdf","content":"published"}],"note":"© 2017 American Chemical Society.","id":77228,"rev_number":11,"userid":18,"eprint_dir":"disk0/00/07/72/28","datestamp":"2017-05-05 20:00:11","lastmod":"2017-05-05 21:14:04","status_changed":"2017-05-05 20:00:11","type":"conference_item","metadata_visibility":"show","creators":[{"given":"Michelle","family":"DeBoever","id":"DeBoever-M","orcid":""},{"given":"Jennifer D.","family":"Schuttlefield Christus","id":"Schuttlefield-Christus-J-D","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-04","date_type":"published","publication":"","volume":"","number":"","pagerange":"CHED-284","id_number":"CaltechAUTHORS:20170505-125605543","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170505-125605543","related_url":[{"url":"https://www.acs.org/content/acs/en/meetings/spring-2017.html","type":"org","description":"Conference Website"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["CCI Solar Fuels"]}