{"title":"Sunlight-driven hydrogen formation by membrane-supported photoelectrochemical water splitting\n","uri":"","abstract":"We are developing an artificial photosynthetic system that utilizes sunlight and water as the inputs and produce hydrogen and oxygen as the outputs. We are taking a modular, parallel development approach in which three distinct primary components-the photoanode, the photocathode, and the product-sepg. but ion-conducting membrane-are fabricated and optimized sep. before assembly into a complete water-splitting system. The design principles incorporate two sep., photosensitive semiconductor/liq. junctions that will collectively generate the 1.7-1.9 Vat open circuit necessary to support both the oxldn. of H_2O (or OH‾) and the redn. of H+ (or H_2O). The photoanode and photocathode will consist of rod-like semiconductor components, with attached heterogeneous multi-electron transfer catalysts, which are needed to drive the oxidn. or redn. reactions at low overpotentials. The high aspect-ratio semiconductor rod electrode architecture allows for the use of low cost, earth abundant materials without sacrificing energy conversion efficiency due to the orthogonalization of light absorption and charge-carrier collection. Addnl., the high surface-area design of the rod-based semiconductor array electrode inherently lowers the flux of charge carriers over the rod array surface relative to the projected geometric surface of the photoelectrode, thus lowering the photocurrent d. at the solid/liq. Junction and thereby relaxing the demands on the activity (and cost) of any electrocatalysts. A flexible composite polymer film will allow for electron and ion conduction between the photocanode and photocathode while simultaneously preventing mixing of the gaseous products. Sep. polymeric materials will be used to make elec. contact between the anode and cathode, and also to provide structural support Interspersed patches of an ion conducting polymer will maintain charge balance between the two half-cells. ","documents":[{"id":"http://authors.library.caltech.edu/id/document/251843","docid":251843,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1254710","fileid":1254710,"datasetid":"document","objectid":251843,"filename":"Lewis_2017pCATL-552.pdf","mime_type":"application/pdf","hash":"f438f155878a32154ca240347fd78410","hash_type":"MD5","filesize":391820,"mtime":"2017-05-05 21:39:13","url":"http://authors.library.caltech.edu/77236/1/Lewis_2017pCATL-552.pdf"}],"eprintid":77236,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"Lewis_2017pCATL-552.pdf","content":"published"}],"note":"© 2017 American Chemical Society.","id":77236,"rev_number":10,"userid":18,"eprint_dir":"disk0/00/07/72/36","datestamp":"2017-05-05 22:07:37","lastmod":"2017-05-05 22:07:37","status_changed":"2017-05-05 22:07:37","type":"conference_item","metadata_visibility":"show","creators":[{"given":"Nathan S.","family":"Lewis","id":"Lewis-N-S","orcid":"0000-0001-5245-0538"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-04","date_type":"published","publication":"","volume":"","number":"","pagerange":"CATL-552","id_number":"CaltechAUTHORS:20170505-143903259","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170505-143903259","related_url":[{"url":"https://www.acs.org/content/acs/en/meetings/spring-2017.html","type":"org","description":"Conference Website"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}