{"title":"Layering as Optimization Decomposition: Questions and Answers","uri":"","abstract":"Network protocols in layered architectures have historically been obtained on an ad-hoc basis, and much of the recent cross-layer designs are conducted through piecemeal approaches. Network protocols may instead be holistically analyzed and systematically designed as distributed solutions to some global optimization problems in the form of generalized Network Utility Maximization (NUM), providing insight on what they optimize and on the structures of network protocol stacks. In the form of 10 Questions and Answers, this paper presents a short survey of the recent efforts towards a systematic understanding of \"layering\" as \"optimization decomposition\". The overall communication network is modeled by a generalized NUM problem, each layer corresponds to a decomposed subproblem, and the interfaces among layers are quantified as functions of the optimization variables coordinating the subproblems. Furthermore, there are many alternative decompositions, each leading to a different layering architecture. Industry adoption of this unifying framework has also started. Here we summarize the current status of horizontal decomposition into distributed computation and vertical decomposition into functional modules such as congestion control, routing, scheduling, random access, power control, and coding. We also discuss under-explored future research directions in this area. More importantly than proposing any particular crosslayer design, this framework is working towards a mathematical foundation of network architectures and the design process of modularization.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251924","docid":251924,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255365","fileid":1255365,"datasetid":"document","objectid":251924,"filename":"04086859.pdf","mime_type":"application/pdf","hash":"b13e5c4f3db369a59fd393f3ee7f07e6","hash_type":"MD5","filesize":187078,"mtime":"2017-05-09 00:28:31","url":"http://authors.library.caltech.edu/77276/1/04086859.pdf"}],"eprintid":77276,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"04086859.pdf","content":"published"}],"note":"© 2006 IEEE. \n\nThe  work summarized in this paper has been in part supported by NSF grants CCF-0440043,  CCF-0448012, CNS-0417607, CNS-0427677, CNS-0430487, CNS-0519880, DARPA  grant  HR0011-06-1-0008, AFOSR FA9550-06-1-0297, and Cisco grant GH072605.","id":77276,"rev_number":9,"userid":207,"eprint_dir":"disk0/00/07/72/76","datestamp":"2017-05-16 20:16:07","lastmod":"2017-05-16 20:16:07","status_changed":"2017-05-16 20:16:07","type":"book_section","metadata_visibility":"show","creators":[{"given":"Mung","family":"Chiang","id":"Chiang-Mung","orcid":""},{"given":"Steven H.","family":"Low","id":"Low-S-H","orcid":""},{"given":"A. Robert","family":"Calderbank","id":"Calderbank-A-R","orcid":""},{"given":"John C.","family":"Doyle","id":"Doyle-J-C","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Adaptive coding, Cross-layer design, Congestion control, Distributed algorithm, Lagrange duality, MAC, Network architecture,  Network utility  maximization,  Optimization,  Power control,  Reverse engineering, Routing, TCP/IP, Scheduling, Stochastic control, Wireless ad hoc networks","date":"2006-10","date_type":"published","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170508-172152981","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170508-172152981","related_url":[{"url":"https://doi.org/10.1109/MILCOM.2006.302293","type":"doi","description":"Article"},{"url":"http://ieeexplore.ieee.org/document/4086859/","type":"pub","description":"Article"}],"referencetext":["[1]  M.  Andrews,  “Joint  optimization  of  scheduling  and  congestion\ncontrol in communication networks,” in\nProc. of CISS\n, 2006.\n[2]  S. Bhadra, S. Shakkottai, and P. Gupta, “Min-cost selfish multicast\nwith network coding”,\nProc. IEEE NetCod Workshop\n, April 2006.\n[3]  T. Bonald and L. Massoulie, “Impact of fairness on Internet per-\nformance”,\nProc. ACM Sigmetrics\n, pp. 82-91, 2001.\n[4]  C. S. Chang and Z. Liu, “A bandwidth sharing theory for a large\nnumber  of  HTTP-like  connections,”\nIEEE/ACM  Trans.  on  Net-\nworking\n, vol. 12, no. 5, Oct. 2004.\n[5]  L. Chen, S. H. Low, M. Chiang, and J. C. Doyle, “Optimal joint\ncongestion control, routing, and scheduling design for wireless ad\nhoc networks,”\nProc. IEEE INFOCOM,\nApril 2006.\n[6]  L. Chen, S. H. Low, and J. C. Doyle, “Joint congestion control and\nmedium access control for wireless ad hoc networks,”\nProc. IEEE\nINFOCOM,\nMarch 2005.\n[7]  L. Chen,  T. Ho,  S. H. Low,  M. Chiang,  and J. C. Doyle,  “Rate\ncontrol for multicasting with network coding”, Preprint, 2006.\n[8]  M. Chiang, “Balancing transport and physical layers in wireless\nmultihop networks: Jointly optimal congestion and power control”\nIEEE J. Sel. Area Comm.,\nvol. 23, no. 1, pp.104-116, Jan. 2005.\n[9]  M.  Chiang,  “Geometric  programming  for  communication  sys-\ntems”,\nTrends and Foundations in Communications and Informa-\ntion Theory\n, vol. 2, no. 1, pp. 1-156, Aug. 2005.\n[10]  M. Chiang, S. H. Low, R. A. Calderbank, and J. C. Doyle, “Lay-\nering as optimization decomposition”, To appear in\nProceedings\nof IEEE\n, Jan. 2007. A shorter version appeared in\nProc. Conf. In-\nform. Sciences and Systems\n, March 2006.\n[11]  M. Chiang, D. Shah, and A. Tang, “Stochastic stability of net-\nwork  utility  maximization:  General  filesize  distribution”,\nProc.\nAllerton Conference\n, Sept. 2006.\n[12]  M.  Chiang  and  M.  Yang,  “Towars  X-ities  from  a  topological\npoint of view:  Evolvability and scalability”,\nProc. Allerton Conf.\nOct. 2004.\n[13]  R. L. Cruz and A. Santhanam:  “Optimal routing, link Schedul-\ning, and power control in multihop wireless networks,”\nProc. IEEE\nINFOCOM\n, April 2003.\n[14]  G.  de  Veciana,  T.  J.  Lee,  and  T.  Konstantopoulos,  “Stability\nand performance analysis of network supporting elastic services”,\nIEEE/ACM  Trans.  on  Networking\n,  vol.  9,  no.  1,  pp.  2-14,  Feb.\n2001.\n[15]  S. Deb, S. Shakkottai, and R. Srikant, “Asymptotic behavior of\nInternet congestion controllers in a many-flow regime”,\nMath. Op-\nerations Research\n, 2005.\n[16]  A. Eryilmaz and R. Srikant,  “Joint congestion control,  routing\nand MAC for stability and fairness in wireless networks,” in\nIEEE\nJ. Sel. Area Comm.\n, vol. 24, no. 8, Aug. 2006.\n[17]  TCP FAST Project\nnetlab.caltech.edu\n.\n[18]  FAST Copper Project\nwww.princeton.edu/fastcopper\n.\n[19]  M.  Fazel  and  M.  Chiang,  “Nonconcave  network  utility  maxi-\nmization through sum of squares method”,\nProc. IEEE CDC\n, Dec.\n2005.\n[20]  T. G. Griffin, F. B. Shepherd, and G. Wilfong, “The stable path\nproblem and interdomain routing,”\nIEEE/ACM Trans. on Network-\ning,\nvol. 10, no. 2, pp. 232-243, April 2002.\n[21]  P. Hande, S. Rangan, and M. Chiang,  “Distributed power con-\ntrol for optimal QoS assignment in wireless data networks”,\nProc.\nIEEE INFOCOM\n, April 2006.\n[22]  P. Hande, S. Zhang, and M. Chiang, “Distributed rate allocation\nfor inelastic flows”, Submitted to\nIEEE/ACM Trans. on Network-\ning\n, preliminary version in\nProc. IEEE INFOCOM\n, March 2005.\n[23]  J.  He,  M.  Chiang,  and  J.  Rexford,  “TCP/IP  interaction  based\non congestion prices:  Stability and optimality”,\nProc. IEEE ICC\n,\nJune 2006.\n[24]  J. He, J. Rexford, and M. Chiang, “Design principles of manage-\nable networks”, Preprint, 2006.\n[25]  J. Huang,  Z. Li,  M. Chiang,  and A. K. Katsaggelos,  “Pricing-\nbased rate control and joint packet scheduling for multi-user wire-\nless upllink video streaming”,\nProc. IEEE Packet Video Workshop\n,\nApril, 2006.\n[26]  C. Jin, D. X. Wei, and S. H. Low.  TCP FAST: motivation, ar-\nchitecture, algorithms, performance.\nProc. of IEEE INFOCOM\n,\nMarch 2004.\n[27]  B.  Johansson  and  M.  Johansson,  “Primal  and  dual  approaches\nto distributed cross-layer optimization,” in\nProc. 16th IFAC World\nCongress\n, Prague, Czech republic, 2005.\n[28]  K. Kar, S. Sarkar, and L. Tassiulas, “Achieving proportional fair-\nness using local information in Aloha networks,”\nIEEE Trans. on\nAuto. Control\n, vol. 49, no. 10, pp. 1858–1862, October 2004.\n[29]  F. P. Kelly, A. Maulloo, and D. Tan, “Rate control for communi-\ncation networks: Shadow prices, proportional fairness and stabil-\nity,”\nJ. Op. Res. Soc.\n, vol. 49, no. 3, pp.237–252, March 1998.\n[30]  F. P. Kelly and T. Voice, “Stability of end-to-end algorithms for\njoint  routing  and  rate  control”,\nComputer  Communications  Re-\nview\n, vol, 35, no. 2, pp. 5-12, 2005.\n[31]  F. P. Kelly and R. J. Williams, “Fluid model for a network op-\nerating under a fair bandwidth-sharing policy”,\nAnnals of Applied\nProbability\n, vol. 14, no. pp. 1055-1083, 2004.\n[32]  P. Key and L. Massoulie, “Fluid models of integrated traffic and\nmultipath routing”, To appear in\nQueuing Systems\n, 2006.\n[33]  M. Kodialam and T. Nandagopal, “Charaterizing achievable rates\nin multi-hop wireless networks: The joint routing and scheduling\nproblem”,\nProc. ACM Mobicom\n, Sept. 2003.\n[34]  S. Kunniyur and R. Srikant. End-to-end congestion control: util-\nity functions, random losses and ECN marks.\nIEEE/ACM Trans.\non Networking\n, 2003.\n[35]  R. J. La and V. Anantharam,  “Utility-based rate control in the\nInternet for elastic traffic,”\nIEEE/ACM Trans. on Networking,\nvol.\n10, no. 2, pp. 272-286, April 2002.\n[36]  J. W. Lee, R. R. Mazumdar, and N. Shroff, “Non-convex opti-\nmization and rate control for multi-class services in the Internet,”\nProc. IEEE INFOCOM\n, Hong Kong, China, March 2004.\n[37]  J. W. Lee, M. Chiang, and R. A. Calderbank, “Price-based dis-\ntributed algorithm for optimal rate-reliability tradeoff in network\nutility maximization”, To appear\nIEEE Journal of Selected Areas\nin Communications\n, 2006.\n[38]  J. W. Lee,  M. Chiang,  and R. A. Calderbank,  “Utility-optimal\nmedium access control:  reverse and forward engineering,”\nProc.\nIEEE INFOCOM\n, April 2006.\n[39]  J. W. Lee,  M. Chiang,  and R. A. Calderbank,  “Jointly optimal\ncongestion and contention control in wireless ad hoc networks”,\nTo appear in\nIEEE Communication Letters\n, 2006.\n[40]  X. Lin and N. B. Shroff, “On the stability region of congestion\ncontrol”,,\nProc. Allerton Conference\n, 2004.\n[41]  X. Lin and N. Shroff, “Impact of imperfect scheduling in cross\nlayer design,”\nProc. IEEE INFOCOM,\nMarch 2005.\n[42]  J. Liu, M. Chiang, and H. V. Poor, “Stability of distributed dual\nalgorithm for convex optimization”, Preprint, 2006.\n[43]  D. S. Lun, N. Ratnakar, M. Mdard, R. Koetter, D. R. Karger, T.\nHo and E. Ahmed, “Minimum-cost multicast over coded packet\nnetworks”,\nIEEE Trans. Inform. Theory\n, 2005.\n[44]  S.  H.  Low,  “A  duality  model  of  TCP  and  queue  management\nalgorithms,”\nIEEE/ACM Trans. on Networking\n, vol. 11, no. 4, pp.\n525–536, Aug. 2003.\n[45]  S. H. Low and D. E. Lapsley, “Optimization flow control, I: basic\nalgorithm  and  convergence,”\nIEEE/ACM  Trans.  on  Networking,\nvol. 7, no. 6, pp. 861–874, December 1999.\n[46]  L. Massoulie and J. W. Roberts, “Bandwidth sharing and admis-\nsion control for elastic traffic”,\nTelecommunication Systems\n, vol.\n15, pp. 185-201, March 2000.\n[47]  J. Mo and J. Walrand, “Fair end-to-end window-based congestion\ncontrol,”\nIEEE/ACM Trans. on Networking,\nvol. 8, no. 5, pp. 556–\n567, Oct. 2000.\n[48]  H. Nama, M. Chiang, and N. Mandayam, “Utility lifetime trade-\noff in self regulating wireless sensor networks:  A cross-layer de-\nsign approach”,\nProc. IEEE ICC\n, June 2006.\n[49]  T. Nandagopal,  T. Kim,  X. Gao,  and V. Bharghavan,  “Achiev-\ning MAC layer fairness in wireless packet networks,”\nProc. ACM\nMobicom,\nBoston, USA, Aug. 2000.\n[50]  M. J. Neely, E. Modiano, and C. E. Rohrs, “Dynamic power al-\nlocation and routing time varying wireless networks”,\nIEEE J. Sel.\nArea Comm.\n, vol. 23, no. 1, pp. 89-103, Jan. 2005.\n[51]  D. Palomar and M. Chiang, “A tutorial to decompositon methods\nfor network utility maximization”,\nIEEE J. Sel. Area Comm.\n, vol.\n24, no. 8, pp. 1439-1450, Aug. 2006.\n[52]  D. Palomar and M. Chiang, “Alternative decompositions for dis-\ntributed maximization of network utility: Framework and applica-\ntions”,\nProc. IEEE INFOCOM\n, April 2006.\n[53]  P. A. Parrilo, “Semidefinite programming relaxations for semial-\ngebraic problems,”\nMathematical Programming Series B\n, vol. 96,\nno. 2, pp. 293-320, 2003.\n[54]  S.  Shakkottai  and  R.  Srikant,  “Mean  FDE  models  for  Internet\ncongestion control under a many-flows regime”,\nIEEE Trans. In-\nform. Theory\n, vol. 50, no. 6, pp. 1050-1072, June 2004.\n[55]  R.  Srikant,\nThe  Mathematics  of  Internet  Congestion  Control,\nBirkhauser 2004.\n[56]  R. Srikant,  “On the positive recurrence of a Markov chain de-\nscribing file arrivals and departures in a congestion-controlled net-\nwork”,\nIEEE Computer Communications Workshop\n, 2004.\n[57]  A. L. Stolyar, “Maximizing queueing network utility subject to\nstatbility: greedy primal-dual algorithm”,\nQueueing Systems\n, vol.\n50, no. 4, pp. 401-457, 2005.\n[58]  C.  W.  Tan,  D.  Palomar,  and  M.  Chiang,  “Decoupling  coupled\nnetwork utility maximization”,\nProc. IEEE ICASSP\n, May 2006.\n[59]  A. Tang, J. W. Lee, J. Huang, M. Chiang, and R. A. Calderbank,\n“Reverse engineering MAC”,\nProc. IEEE WiOpt\n, April 2006.\n[60]  A. Tang, J. Wang, S. H. Low, and M. Chiang, “Equilibrium of\nheterogeneous congestion control protocols”,\nProc. IEEE INFO-\nCOM\n, March 2005.\n[61]  A. Tang,  D. Wei,  S. H. Low,  and M. Chiang,  “Heterogeneous\ncongestion control: Efficiency, fairness, and control”,\nProc. IEEE\nICNP\n, Nov. 2006.\n[62]  X.  Wang  and  K.  Kar,  “Cross-layer  rate  control  for  end-to-end\nproportional fairness in wireless networks with random access,”\nProc. ACM Mobihoc\n, May, 2005.\n[63]  J. Wang, L. Li, S. H. Low, and J. C. Doyle.  “Cross-layer opti-\nmization in TCP/IP networks,”\nIEEE/ACM Trans. on Networking\n,\nvol. 13, no. 3, pp. 582-595, August 2005.\n[64]  Y. Wu and S.Y. Kung, “Distributed utility maximization for net-\nwork coding based multicasting: A shortest path approach”,\nIEEE\nJournal on Selected Areas in Communications\n, Aug. 2006.\n[65]  Y.  Wu,  M.  Chiang,  and  S.Y.  Kung,  “Distributed  utility  maxi-\nmization  for  network  coding  based  multicasting:  A  critical  cut\napproach”,\nProc. IEEE NetCod Workshop\n, April 2006.\n[66]  Y. Xi and E. Yeh, “Optimal distributed power control, routing,\nand congestion control in wireless networks”, Submitted to\nIEEE\nTrans. Inform. Theory\n, 2005.\n[67]  Y. Xi and E. M. Yeh, “Distributed algorithms for minimum cost\nmulticast with network coding”,\nProc. IEEE NetCod Workshop\n,\nApril 2006.\n[68]  L. Xiao, M. Johansson, and S. Boyd, “Joint routing and resource\nallocation via dual decomposition,”\nIEEE Trans. Comm.,\nvol. 52,\nno. 7, pp. 1136-1144, July 2004.\n[69]  H.  Ye,  “Stability  of  data  networks  under  optimization-based\nbandwidth allocation”,\nIEEE Trans. Auto. Control\n, vo.. 48, no. 7,\npp. 1238-1242, July 2003.\n[70]  W. Yu and J. Yuan, “Joint source coding, routing, and resource\nallocation for wireless sensor networks,”\nProc. IEEE ICC\n, May\n2005.\n[71]  C. Yuen and P. Marbach, “Price-based rate control in random ac-\ncess networks,”\nIEEE/ACM Trans. on Networking\n, vol. 13, no. 5,\npp. 1027–1040, December 2005.\n[72]  J. Zhang, D. Zheng, and M. Chiang, “Impacts of stochastic noisy\nfeedback in network utility maximization,” Preprint, 2006"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"M. Chiang, S. H. Low, A. R. Calderbank and J. C. Doyle, \"Layering as Optimization Decomposition: Questions and Answers,\" MILCOM 2006 - 2006 IEEE Military Communications conference, Washington, DC, 2006, pp. 1-10.\ndoi: 10.1109/MILCOM.2006.302293","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"CCF-0440043"},{"agency":"NSF","grant_number":"CCF-0448012"},{"agency":"NSF","grant_number":"CNS-0417607"},{"agency":"NSF","grant_number":"CNS-0427677"},{"agency":"NSF","grant_number":"CNS-0430487"},{"agency":"NSF","grant_number":"CNS-0519880"},{"agency":"Defense Advanced Research Projects Agency (DARPA)","grant_number":"HR0011-06-1-0008"},{"agency":"Air Force Office of Scientific Research (AFOSR)","grant_number":"FA9550-06-1-0297"},{"agency":"Cisco","grant_number":"GH072605"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}