{"title":"Layering As Optimization Decomposition: Current Status and Open Issues","uri":"","abstract":"Network protocols in layered architectures have historically been obtained on an ad-hoc basis, and much of the recent cross-layer designs are conducted through piecemeal approaches. Network protocols may instead be holistically analyzed and systematically designed as distributed solutions to some global optimization problems in the form of generalized network utility maximization (NUM), providing insight on what they optimize and structures of the network protocol stack. This paper presents a short survey of the recent efforts towards a systematic understanding of \"layering\" as \"optimization decomposition\", where the overall communication network is modeled by a generalized NUM problem, each layer corresponds to a decomposed subproblem, and the interfaces among layers are quantified as functions of the optimization variables coordinating the subproblems. Furthermore, there are many alternative decompositions, each leading to a different layering architecture. Industry adoption of this unifying framework has also started. Here we summarize the current status of horizontal decomposition into distributed computation and vertical decomposition into functional modules such as congestion control, routing, scheduling, random access, power control, and coding. Key messages and methodologies arising out of many recent work are listed. Then we present a list of challenging open issues in this area and the initial progress made on some of them.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251925","docid":251925,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255372","fileid":1255372,"datasetid":"document","objectid":251925,"filename":"04067833.pdf","mime_type":"application/pdf","hash":"f9aa147bb0e980c61a2d6efe5e222afd","hash_type":"MD5","filesize":150628,"mtime":"2017-05-09 00:39:05","url":"http://authors.library.caltech.edu/77277/1/04067833.pdf"}],"eprintid":77277,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"04067833.pdf","content":"published"}],"note":"© 2006 IEEE.","id":77277,"rev_number":8,"userid":207,"eprint_dir":"disk0/00/07/72/77","datestamp":"2017-05-16 20:13:47","lastmod":"2017-05-16 20:13:47","status_changed":"2017-05-16 20:13:47","type":"book_section","metadata_visibility":"show","creators":[{"given":"Mung","family":"Chiang","id":"Chiang-Mung","orcid":""},{"given":"Steven H.","family":"Low","id":"Low-S-H","orcid":""},{"given":"A. Robert","family":"Calderbank","id":"Calderbank-A-R","orcid":""},{"given":"John C.","family":"Doyle","id":"Doyle-J-C","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Adaptive coding, Cross-layer design, Congestion control, Distributed algorithm, Lagrange duality, MAC, Network utility maximization, Optimization, Power control, Reverse engineering, Routing, TCP/IP, Scheduling, Stochastic control, Wireless ad hoc networks","date":"2006-03","date_type":"published","publication":"","volume":"","number":"","pagerange":"355-362","id_number":"CaltechAUTHORS:20170508-173109246","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170508-173109246","related_url":[{"url":"https://dx.doi.org/10.1109/CISS.2006.286492","type":"doi","description":"Article"},{"url":"http://ieeexplore.ieee.org/document/4067833/","type":"pub","description":"Article"}],"referencetext":["1] T. Bonald and L. Massoulie, “Impact of fairness on Internet performance”,\nProc. ACM Sigmetrics\n, pp. 82-91, 2001.\n[2] C. S. Chang and Z. Liu, “A bandwidth sharing theory for a large number\nof HTTP-like connections,”\nIEEE/ACM Trans. on Networking\n, vol. 12, no.\n5, Oct. 2004.\n[3] L. Chen, S. H. Low, M. Chiang, and J. C. Doyle, “Optimal joint conges-\ntion control, routing, and scheduling design for wireless ad hoc networks,”\nProc. IEEE INFOCOM,\nApril 2006.\n[4] L. Chen, S. H. Low, and J. C. Doyle, “Joint congestion control and medium\naccess control for wireless ad hoc networks,”\nProc.  IEEE  INFOCOM,\nMarch 2005.\n[5] M. Chiang, “Balancing transport and physical layers in wireless multihop\nnetworks: Jointly optimal congestion and power control”\nIEEE J. Sel. Area\nComm.,\nvol. 23, no. 1, pp.104-116, Jan. 2005.\n[6] M. Chiang, “Geometric programming for communication systems”,\nTrends\nand Foundations in Communications and Information Theory\n, vol. 2, no.\n1, pp. 1-156, Aug. 2005.\n[7] M. Chiang, S. H. Low, R. A. Calderbank, and J. C. Doyle, “Layering as\noptimization decomposition”, To appear in\nProceedings of IEEE\n, 2006.\n[8] M. Chiang and M. Yang, “Towars X-ities from a topological point of view:\nEvolvability and scalability”,\nProc. Allerton Conf.\nOct. 2004.\n[9] R. L. Cruz and A. Santhanam: “Optimal routing, link Scheduling, and\npower control in multihop wireless networks,”\nProc.  IEEE  INFOCOM\n,\nApril 2003.\n[10] G. de Veciana, T. J. Lee, and T. Konstantopoulos, “Stability and perfor-\nmance analysis of network supporting elastic services”,\nIEEE/ACM Trans.\non Networking\n, vol. 9, no. 1, pp. 2-14, Feb. 2001.\n[11] S. Deb, S. Shakkottai, and R. Srikant, “Asymptotic behavior of Inter-\nnet congestion controllers in a many-flow regime”,\nMath. Operations Re-\nsearch\n, 2005.\n[12] A. Eryilmaz and R. Srikant, “Fair resource allocation in wireless networks\nusing queue-length-based scheduling and congestion control,”\nProc. IEEE\nINFOCOM\n, March 2005.\n[13] TCP FAST Project\nnetlab.caltech.edu\n.\n[14] FAST Copper Project\nwww.princeton.edu/fastcopper\n.\n[15] M. Fazel and M. Chiang, “Nonconcave network utility maximization\nthrough sum of squares method”,\nProc. IEEE CDC\n, Dec. 2005.\n[16] T. G. Griffin, F. B. Shepherd, and G. Wilfong, “The stable path problem\nand interdomain routing,”\nIEEE/ACM Trans. on Networking,\nvol. 10, no.\n2, pp. 232-243, April 2002.\n[17] P. Hande, S. Zhang, and M. Chiang, “Distributed rate allocation for in-\nelastic flows”, Submitted to\nIEEE/ACM Trans. on Networking\n, preliminary\nversion in\nProc. IEEE INFOCOM\n, March 2005.\n[18] J. He, M. Chiang, and J. Rexford, “TCP/IP interaction based on conges-\ntion prices: Stability and optimality”,\nProc. IEEE ICC\n, June 2006.\n[19] J. Huang, Z. Li, M. Chiang, and A. K. Katsaggelos, “Pricing-based rate\ncontrol and joint packet scheduling for multi-user wireless upllink video\nstreaming”,\nProc. IEEE Packet Video Workshop\n, April, 2006.\n[20] C. Jin, D. X. Wei, and S. H. Low. TCP FAST: motivation, architecture,\nalgorithms, performance.\nProc. of IEEE INFOCOM\n, March 2004.\n360\n[21] K. Kar, S. Sarkar, and L. Tassiulas, “Achieving proportional fairness us-\ning local information in Aloha networks,”\nIEEE Trans. on Auto. Control\n,\nvol. 49, no. 10, pp. 1858–1862, October 2004.\n[22] F. P. Kelly, A. Maulloo, and D. Tan, “Rate control for communication\nnetworks: Shadow prices, proportional fairness and stability,”\nJ. Op. Res.\nSoc.\n, vol. 49, no. 3, pp.237–252, March 1998.\n[23] F. P. Kelly and T. Voice, “Stability of end-to-end algorithms for joint rout-\ning and rate control”,\nComputer Communications Review\n, vol, 35, no. 2,\npp. 5-12, 2005.\n[24] F. P. Kelly and R. J. Williams, “Fluid model for a network operating under\na fair bandwidth-sharing policy”,\nAnnals of Applied Probability\n, vol. 14,\nno. pp. 1055-1083, 2004.\n[25] P. Key and L. Massoulie, “Fluid models of integrated traffic and multipath\nrouting”, To appear in\nQueuing Systems\n, 2006.\n[26] M. Kodialam and T. Nandagopal, “Charaterizing achievable rates in\nmulti-hop wireless networks: The joint routing and scheduling problem”,\nProc. ACM Mobicom\n, Sept. 2003.\n[27] S. Kunniyur and R. Srikant. End-to-end congestion control: utility func-\ntions, random losses and ECN marks.\nIEEE/ACM Trans. on Networking\n,\n2003.\n[28] R. J. La and V. Anantharam, “Utility-based rate control in the Internet\nfor elastic traffic,”\nIEEE/ACM Trans. on Networking,\nvol. 10, no. 2, pp.\n272-286, April 2002.\n[29] J. W. Lee, R. R. Mazumdar, and N. Shroff, “Non-convex optimization\nand rate control for multi-class services in the Internet,”\nProc. IEEE INFO-\nCOM\n, Hong Kong, China, March 2004.\n[30] J. W. Lee, M. Chiang, and R. A. Calderbank, “Price-based distributed\nalgorithm for optimal rate-reliability tradeoff in network utility maximiza-\ntion”, To appear\nIEEE Journal of Selected Areas in Communications\n, 2006.\n[31] J. W. Lee, M. Chiang, and R. A. Calderbank, “Utility-optimal medium\naccess control: reverse and forward engineering,”\nProc. IEEE INFOCOM\n,\nApril 2006.\n[32] J. W. Lee, M. Chiang, and R. A. Calderbank, “Jointly optimal congestion\nand contention control in wireless ad hoc networks”, To appear in\nIEEE\nCommunication Letters\n, 2006.\n[33] X. Lin and N. B. Shroff, “On the stability region of congestion control”,,\nProc. Allerton Conference\n, 2004.\n[34] X. Lin and N. Shroff, “Impact of imperfect scheduling in cross layer de-\nsign,”\nProc. IEEE INFOCOM,\nMarch 2005.\n[35] J. Liu, M. Chiang, and H. V. Poor, “Stability of distributed dual algorithm\nfor convex optimization”, Submitted to\nIEEE Conf. Control and Decision\n,\n2006.\n[36] S. H. Low, “A duality model of TCP and queue management algorithms,”\nIEEE/ACM Trans. on Networking\n, vol. 11, no. 4, pp. 525–536, Aug. 2003.\n[37] S. H. Low and D. E. Lapsley, “Optimization flow control, I: basic algo-\nrithm and convergence,”\nIEEE/ACM Trans. on Networking,\nvol. 7, no. 6,\npp. 861–874, December 1999.\n[38] L. Massoulie and J. W. Roberts, “Bandwidth sharing and admission con-\ntrol for elastic traffic”,\nTelecommunication Systems\n, vol. 15, pp. 185-201,\nMarch 2000.\n[39] J. Mo and J. Walrand, “Fair end-to-end window-based congestion con-\ntrol,”\nIEEE/ACM Trans. on Networking,\nvol. 8, no. 5, pp. 556–567, Oct.\n2000.\n[40] H. Nama, M. Chiang, and N. Mandayam, “Utility lifetime tradeoff in self\nregulating wireless sensor networks: A cross-layer design approach”,\nProc.\nIEEE ICC\n, June 2006.\n[41] T. Nandagopal, T. Kim, X. Gao, and V. Bharghavan, “Achieving MAC\nlayer fairness in wireless packet networks,”\nProc. ACM Mobicom,\nBoston,\nUSA, Aug. 2000.\n[42] M. J. Neely, E. Modiano, and C. E. Rohrs, “Dynamic power allocation\nand routing time varying wireless networks”,\nIEEE J. Sel. Area Comm.\n,\nvol. 23, no. 1, pp. 89-103, Jan. 2005.\n[43] D. Palomar and M. Chiang, “Alternative decompositions for distributed\nmaximization of network utility:  Framework and applications”,\nProc.\nIEEE INFOCOM\n, April 2006.\n[44] P. A. Parrilo, “Semidefinite programming relaxations for semialgebraic\nproblems,”\nMathematical Programming Series B\n, vol. 96, no. 2, pp. 293-\n320, 2003.\n[45] S. Shakkottai and R. Srikant, “Mean FDE models for Internet congestion\ncontrol under a many-flows regime”,\nIEEE Trans. Inform. Theory\n, vol. 50,\nno. 6, pp. 1050-1072, June 2004.\n[46] R. Srikant,\nThe Mathematics of Internet Congestion Control,\nBirkhauser\n2004.\n[47] R. Srikant, “On the positive recurrence of a Markov chain describing file\narrivals and departures in a congestion-controlled network”,\nIEEE Com-\nputer Communications Workshop\n, 2004.\n[48] A. L. Stolyar, “Maximizing queueing network utility subject to statbility:\ngreedy primal-dual algorithm”,\nQueueing Systems\n, vol. 50, no. 4, pp. 401-\n457, 2005.\n[49] C. W. Tan, D. Palomar, and M. Chiang, “Decoupling coupled network\nutility maximization”,\nProc. IEEE ICASSP\n, May 2006.\n[50] A. Tang, J. W. Lee, J. Huang, M. Chiang, and R. A. Calderbank, “Reverse\nengineering MAC”,\nProc. IEEE WiOpt\n, April 2006.\n[51] A. Tang, J. Wang, S. H. Low, and M. Chiang, “Equilibrium of heteroge-\nneous congestion control protocols”,\nProc. IEEE INFOCOM\n, March 2005.\n[52] X. Wang and K. Kar, “Cross-layer rate control for end-to-end proportional\nfairness in wireless networks with random access,”\nProc. ACM Mobihoc\n,\nMay, 2005.\n[53] J. Wang, L. Li, S. H. Low, and J. C. Doyle. “Cross-layer optimization in\nTCP/IP networks,”\nIEEE/ACM Trans. on Networking\n, vol. 13, no. 3, pp.\n582-595, August 2005.\n[54] Y. Xi and E. Yeh, “Optimal distributed power control, routing, and con-\ngestion control in wireless networks”, Submitted to\nIEEE Trans. Inform.\nTheory\n, 2005.\n[55] L. Xiao, M. Johansson, and S. Boyd, “Joint routing and resource allo-\ncation via dual decomposition,”\nIEEE Trans. Comm.,\nvol. 52, no. 7, pp.\n1136-1144, July 2004.\n[56] H. Ye, “Stability of data networks under optimization-based bandwidth\nallocation”,\nIEEE Trans. Auto. Control\n, vo.. 48, no. 7, pp. 1238-1242, July\n2003.\n[57] W. Yu and J. Yuan, “Joint source coding, routing, and resource allocation\nfor wireless sensor networks,”\nProc. IEEE ICC\n, May 2005.\n[58] C. Yuen and P. Marbach, “Price-based rate control in random access net-\nworks,”\nIEEE/ACM Trans. on Networking\n, vol. 13, no. 5, pp. 1027–1040,\nDecember 2005.\n[59] D. Zheng and J. Zhang, “A stochastic primal-dual algorithm for joint flow\ncontrol and MAC design in multihop wireless networks”, Preprint, 2006."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"M. Chiang, S. H. Low, A. R. Calderbank and J. C. Doyle, \"Layering As Optimization Decomposition: Current Status and Open Issues,\" 2006 40th Annual Conference on Information Sciences and Systems, Princeton, NJ, 2006, pp. 355-362.\ndoi: 10.1109/CISS.2006.286492","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}