{"title":"Anomalously large complete stress drop during the 2016 M_w 5.2 Borrego Springs earthquake inferred by waveform modeling and near-source aftershock deficit","uri":"","abstract":"The 2016 M_w 5.2 Borrego Springs earthquake occurred in the trifurcation area of the San Jacinto fault zone and generated more than 23,000 aftershocks. We analyze source properties of this earthquake along with 12,487 precisely located aftershock hypocenters to obtain an unusually detailed view of the rupture process and energy budget for this moderate earthquake. Source time functions are obtained using an empirical Green's function approach and are inverted for a slip distribution on the fault plane. The rupture propagated unilaterally to the northwest over a distance of 1.8 km, resulting in clear directivity signals. Two asperities are identified and the maximum slip is 2.54 m, resulting in a static stress drop of 78.2 MPa. Over 97% of the aftershocks occur more than 1 rupture length from the slip area. We conclude that the Borrego Springs earthquake had a complete stress drop, and estimate the seismic efficiency to be 15-26%.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251936","docid":251936,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255435","fileid":1255435,"datasetid":"document","objectid":251936,"filename":"Ross_et_al-2017-Geophysical_Research_Letters.pdf","mime_type":"application/pdf","hash":"db1c8b9c0bf8bffed517a20b92a4b98c","hash_type":"MD5","filesize":768710,"mtime":"2017-05-09 15:07:19","url":"http://authors.library.caltech.edu/77286/1/Ross_et_al-2017-Geophysical_Research_Letters.pdf"}],"eprintid":77286,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"Ross_et_al-2017-Geophysical_Research_Letters.pdf","content":"accepted"},{"id":"http://authors.library.caltech.edu/id/document/251937","docid":251937,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255440","fileid":1255440,"datasetid":"document","objectid":251937,"filename":"grl55912-sup-0001-2017GL073338_SI.docx","mime_type":"application/vnd.openxmlformats-officedocument.wordprocessingml.document","hash":"0ece119456c0498f1186410f0e6f60b0","hash_type":"MD5","filesize":434372,"mtime":"2017-05-09 15:09:10","url":"http://authors.library.caltech.edu/77286/2/grl55912-sup-0001-2017GL073338_SI.docx"}],"eprintid":77286,"pos":2,"placement":2,"mime_type":"application/vnd.openxmlformats-officedocument.wordprocessingml.document","format":"application/msword","language":"en","security":"public","license":"other","main":"grl55912-sup-0001-2017GL073338_SI.docx","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/251938","docid":251938,"rev_number":1,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255443","fileid":1255443,"datasetid":"document","objectid":251938,"filename":"indexcodes.txt","mime_type":"text/plain","hash":"ebc62c1d5a7e254fc772fd23d11a9c3f","hash_type":"MD5","filesize":746,"mtime":"2017-05-09 15:09:29","url":"http://authors.library.caltech.edu/77286/3/indexcodes.txt"}],"eprintid":77286,"pos":3,"placement":3,"mime_type":"text/plain","format":"other","language":"en","security":"public","license":"other","main":"indexcodes.txt","content":""}],"note":"© 2017 American Geophysical Union.\n\nAccepted manuscript online: \n8 May 2017;\n\nManuscript Accepted: \n5 May 2017;\n\nManuscript Revised: \n4 May 2017;\n\nManuscript Received: \n4 March 2017.\n\nWe thank Zhongwen Zhan and Yehuda Ben-Zion, Marine Denolle, and an anonymous reviewer for their constructive comments. This research was supported by USGS/NEHRP grant G16AP00147; NSF award: EAR-1550704; and by the Southern California Earthquake Center, which is funded by NSF Cooperative Agreement EAR-1033462 and USGS Cooperative Agreement G12AC20038. We used GMT from Wessel et al. [2003] to make the Figures. We have used waveforms and parametric data from the Caltech/USGS Southern California Seismic Network (SCSN); doi: 10.7914/SN/CI; stored at the Southern California Earthquake Center. doi:10.7909/C3WD3xH1. There are no real or perceived financial conflicts of interests for any author.\n\n","id":77286,"rev_number":11,"userid":18,"eprint_dir":"disk0/00/07/72/86","datestamp":"2017-05-11 21:45:27","lastmod":"2017-05-11 21:45:27","status_changed":"2017-05-11 21:45:27","type":"article","metadata_visibility":"show","creators":[{"given":"Z. E.","family":"Ross","id":"Ross-Z-E","orcid":""},{"given":"H.","family":"Kanamori","id":"Kanamori-H","orcid":"0000-0001-8219-9428"},{"given":"E.","family":"Hauksson","id":"Hauksson-E","orcid":"0000-0002-6834-5051"}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"Earthquake source properties; \nSan Jacinto fault zone; \nStress drop; \nSeismic energy budget; \nRupture directivity; \nFinite source modeling\n","date":"2017-05-08","date_type":"inpress","publication":"Geophysical Research Letters","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170509-080713878","refereed":true,"issn":"0094-8276","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170509-080713878","related_url":[{"url":"http://dx.doi.org/10.1002/2017GL073338","type":"doi","description":"Article"},{"url":"http://onlinelibrary.wiley.com/doi/10.1002/2017GL073338/abstract","type":"pub","description":"Article"}],"referencetext":["Allam, A. A., Y. Ben-Zion, I. Kurzon and F. L. Vernon (2014), Seismic velocity structure in the Hot Springs and Trifurcation Areas of the San Jacinto Fault Zone, California, from double-difference tomography, Geophys. J. Int., 198, 978–999, doi:10.1093/gji/ggu176.\nAmpuero, J.-P. and Y. Ben-Zion (2008), Cracks, pulses and macroscopic asymmetry of dynamic rupture on a bimaterial interface with velocity-weakening friction, Geophys. J. Int., 173, 674–692, doi: 10.1111/j.1365-246X.2008.03736.x.\nAndrews, D. J. and Y. Ben-Zion (1997), Wrinkle-like Slip Pulse on a Fault Between Different Materials, J. Geophys. Res., 102, 553-571.\nBeroza, G. C. (1991), Near-source modeling of the Loma Prieta earthquake: Evidence for heterogeneous slip and implications for earthquake hazard, Bull. Seismol. Soc. Am., 81(5), 1603-1621.\nBeroza, G. C. and P. Spudich (1988), Linearized inversion for fault rupture behavior: Application to the 1984 Morgan Hill, California, earthquake, J. Geophys. Res.-Solid Earth, 93, 6275-6296, doi:10.1029/JB093iB06p06275.\nBoatwright, J (2007), The persistence of directivity in small earthquakes, Bull. Seismol. Soc. Am., 97(6), 1850-61.\nBrietzke, G. B. and Y. Ben-Zion, 2006. Examining tendencies of in-plane rupture to migrate to material interfaces, Geophys. J. Int., 167, 807-819, doi: 10.1111/j.1365-246X.2006.03137.x.\nCalderoni, G., A. Rovelli, and S. K. Singh (2013), Stress drop and source scaling of the 2009 April L’Aquila earthquakes, Geophys. J. Int., 192(1), 260-274, doi:10.1093/gji/ggs011.\nChester, J. S., F. M. Chester, and A. K. Kronenberg (2005), Fracture surface energy of the Punchbowl fault, San Andreas system, Nature, 437, 133-136, doi:10.1038/nature03942.\nDoser, D. I., and H. Kanamori (1986), Depth of seismicity in the Imperial Valley Region (1977–1983) and its relationship to heat flow, crustal structure and the October 15, 1979, earthquake, J. Geophys. Res., 91, B1, 675-688.\nHadley, D. H., and H. Kanamori (1977), Seismic structure of the Transverse Ranges, California, Geological Society of America Bulletin, 88(10), 1469-1478.\nHartzell, S. H., and T. H. Heaton (1983), Inversion of strong ground motion and teleseismic waveform data for the fault rupture history of the 1979 Imperial Valley, California, earthquake, Bull. Seismol. Soc. Am., 73, 6A, 1553-1583.\nHauksson, E. H., K. Felzer, D. Given, M. Giveon, S. Hough, H. Kanamori, V. Sevilgen, S. Wei, and A. Yong (2008), Preliminary Report on the 29 July 2008 Mw 5.4 Chino Hills, Eastern Los Angeles Basin, California, Earthquake Sequence, Seismol. Res. Lett., 79(6), doi:10.1785/gssrl.79.6.855.\nHauksson, E. H., W. Yang, and P. M. Shearer (2012), Waveform Relocated Earthquake Catalog for Southern California (1981 to June 2011), Bull. Seismol. Soc. Am., 102(5), 2239-2244, doi: 10.1785/0120120010.\nHsu, Y.-J., M. Simons, J.-P. Avouac, J. Galetzka, K. Sieh, M. Chlieh, D. Natawidjaja, L. Prawirodirdjo, and Y. Bock (2006), Frictional Afterslip Following the 2005 Nias-Simeulue Earthquake, Sumatra, Science, 312, 1921-1926, doi:10.1126/science.1126960.\nKagan, Y. Y., D. D. Jackson, and Y. Rong (2006), A new catalog of southern California earthquakes, 1800-2005, Seismol. Res. Lett., 77, 30-38.\nKanamori, H. and Rivera, L. (2006), Energy Partitioning During an Earthquake, in Earthquakes: Radiated Energy and the Physics of Faulting (eds R. Abercrombie, A. McGarr, G. Di Toro and H. Kanamori), American Geophysical Union, Washington, D. C. doi: 10.1029/170GM03\nKanamori, H., and E. Brodsky (2004), The physics of earthquakes, Reports on Progress in Physics, 67(8), 1429-1496.\nKanamori, H., J. Mori, E. Hauksson, T. H. Heaton, L. K. Hutton, and L. M. Jones (1993), Determination of earthquake energy release and ML using TERRAscope, Bull. Seismol. Soc. Am., 83(2), 330-346.\nKane, D. L., P. M. Shearer, B. P. Goertz-Allmann, and F. L. Vernon (2013), Rupture directivity of small earthquakes at Parkfield, J. Geophys. Res.-Solid Earth, 118, doi: 10.1029/2012JB009675.\nKikuchi, M., and H. Kanamori (1982), Inversion of complex body waves, Bull. Seismol. Soc. Am., 72(2), 491-506.\nKurzon, I., F. L. Vernon, Y. Ben-Zion, and G. Atkinson (2014), Ground Motion Prediction Equations in the San Jacinto Fault Zone: Significant Effects of Rupture Directivity and Fault Zone Amplification, Pure and Applied Geophysics, 171(11), 3045-3081, doi:10.1007/s00024-014-0855-2.\nLawson, C. L., and R. J. Hanson (1995), Solving Least Squares Problems, Society for Industrial and Applied Mathematics, Philadelphia, PA.\nLigorría, J. P. and C. J. Ammon (1999). Iterative Deconvolution and Receiver-Function Estimation, Bull. Seismol. Soc. Am., 89(5), 1395-1400.\nMendoza, C., and S. H. Hartzell (1988), Aftershock patterns and main shock faulting, Bull. Seismol. Soc. Am., 78(4), 1438-1449.\nMori, J. (1993), Fault Plane Determinations for Three Small Earthquakes Along the San Jacinto Fault, California: Search for Cross Faults, J. Geophs. Res., 98(B10), 17,711-17,722.\nMori, J., and S. Hartzell (1990), Source inversion of the 1988 Upland, California, earthquake: Determination of a fault plane for a small event, Bull. Seismol. Soc. Am., 80(3), 507-518.\nNoda, H., N. Lapusta, and H. Kanamori (2013), Comparison of average stress drop measures for ruptures with heterogeneous stress change and implications for earthquake physics, Geophys. J. Int., 193(3), 1691-1712, doi:10.1093/gji/ggt074\nRoss, Z. E. and Y. Ben-Zion, 2016. Towards reliable automated estimates of earthquake source properties from body wave spectra, J. Geophys. Res., 121, 4390-4407, doi:10.1002/2016JB013003.\nRoss, Z. E., Y. Ben-Zion, White, M. C., and F. L. Vernon, 2016. Analysis of earthquake body wave spectra for potency and magnitude values: implications for magnitude scaling relations, Geophys. J. Int., 207, 1158-1164, doi: 10.1093/gji/ggw327.\nRoss, Z. E., E. Hauksson and Y. Ben-Zion, 2017. Abundant off-fault seismicity and orthogonal structures in the San Jacinto fault zone, Science Advances, 3(3), e1601946, doi: 10.1126/sciadv.1601946.\nSanders, C. O., and H. Kanamori (1984), A seismotectonic analysis of the Anza Seismic Gap, San Jacinto Fault Zone, southern California, J. Geophys. Res.-Solid Earth, 89(B7), 5873-5890, doi:10.1029/JB089iB07p05873\nSCEDC (2013), Southern California Earthquake Data Center, California Institute of Technology, doi: 10.7909/C3WD3xH1.\nShao, G., C. Ji, and E. Hauksson (2012), Rupture process and energy budget of the 29 July 2008 Mw 5.4 Chino Hills, California, earthquake, J. Geophys. Res.-Solid Earth, 117(B7), doi:10.1029/2011JB008856\nSharp, R. V. (1967), San Jacinto Fault Zone in the Peninsular Ranges of Southern California, Geological Society of America Bulletin, 78(6), 705-730.\nSharp, R. V. (1975), En echelon fault patterns of the San Jacinto fault zone, in San Andreas Fault in Southern California (ed. J. C. Cromwell), Spec. Rep. Calif. Div. Mines Geol., 118, 147-154.\nShelly, D. R., W. L. Ellsworth, and D. P. Hill (2016), Fluid-faulting evolution in high definition: Connecting fault structure and frequency-magnitude variations during the 2014 Long Valley Caldera, California, earthquake swarm, J. Geophys Res.:Solid Earth, 121, 1776–1795, doi:10.1002/2015JB012719.\nSladen, A., H. Tavera, M. Simons, J. P. Avouac, A. O. Konca, H. Perfettini, L. Audin, E. J. Fielding, F. Ortega, and R. Cavagnoud (2010), Source model of the 2007 Mw 8.0 Pisco, Peru earthquake: Implications for seismogenic behavior of subduction megathrusts, J. Geophys. Res., 115, B02405, doi:10.1029/2009JB006429.\nVassiliou, M. S., and H. Kanamori (1982), The energy release in earthquakes, Bull. Seismol. Soc. Am., 72(2), 371-387.\nWeertman, J. (1980), Unstable slippage across a fault that separates elastic media of different elastic constants, J. Geophys. Res.:Solid Earth, 85(B3), 1455-1461, doi:10.1029/JB085iB03p01455\nWei, S., E. Fielding, S. Leprince, A. Sladen, J.-P. Avouac, D. Helmberger, E. Hauksson, R. Chu, M. Simons, K. Hudnut, T. Herring, and R. Briggs (2011), Superficial simplicity of the 2010 El Mayor-Cucapah earthquake of Baja California in Mexico, Nature Geoscience, 4, 615-618, doi:10.1038/ngeo1213.\nWessel, P., W. H. F. Smith, R. Scharroo, J. F. Luis, and F. Wobbe (2013), Generic Mapping Tools: Improved version released, EOS Trans. AGU, 94, 409-410.\nYang, W., E. Hauksson, and P. M. Shearer (2012), Computing a Large Refined Catalog of Focal Mechanisms for Southern California (1981-2010): Temporal Stability of the Style of Faulting, Bull. Seismol. Soc. Am., 102(3), 1179-1194, doi:10.1785/0120110311."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Ross, Z. E., H. Kanamori, and E. Hauksson (2017), Anomalously large complete stress drop during the 2016 Mw 5.2 Borrego Springs earthquake inferred by waveform modeling and near-source aftershock deficit, Geophys. Res. Lett., 44, doi:10.1002/2017GL073338","other_numbering_system":null,"funders":[{"agency":"USGS","grant_number":"G16AP00147"},{"agency":"NSF","grant_number":"EAR-1550704"},{"agency":"Southern California Earthquake Center (SCEC)","grant_number":""},{"agency":"NSF","grant_number":"EAR-1033462"},{"agency":"USGS","grant_number":"G12AC20038"}],"collection":"CaltechAUTHORS","reviewer":"Joy Painter","local_group":["Seismological Laboratory"]}