{"title":"Crust and Upper Mantle Seismic Anisotropy Variations from the Coast to Inland in Central and Southern Mexico","uri":"","abstract":"Subduction zones are among the most dynamic tectonic environments on Earth. Deformation mechanisms of various scales produce networks of oriented structures and faulting systems that result in a highly anisotropic medium for seismic wave propagation. In this study, we combine shear wave splitting inferred from receiver functions and the results from a previous SKS-wave study to quantify and constrain the vertically averaged shear wave splitting at different depths along the 100-station MesoAmerican Subduction Experiment array. This produces a transect that runs perpendicular to the trench across the flat slab portion of the subduction zone below central and southern Mexico. Strong anisotropy in the continental crust is found below the Trans-Mexican Volcanic Belt (TMVB) and above the source region of slow-slip events. We interpret this as the result of fluid/melt ascent. The upper oceanic crust and the overlying low-velocity zone exhibit highly complex anisotropy, while the oceanic lower crust is relatively homogeneous. Regions of strong oceanic crust anisotropy correlate with previously found low V_p/V_s regions, indicating that the relatively high V_s is an anisotropic effect. Upper-mantle anisotropy in the southern part of the array is in trench-perpendicular direction, consistent with the alignment of type-A olivine and with entrained subslab flow. The fast polarization direction of mantle anisotropy changes to N–S in the north, likely reflecting mantle wedge corner flow perpendicular to the TMVB.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251965","docid":251965,"rev_number":4,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255627","fileid":1255627,"datasetid":"document","objectid":251965,"filename":"ggx174.pdf","mime_type":"application/pdf","hash":"8fe798e24edcac9b8af75878436d36ba","hash_type":"MD5","filesize":5524588,"mtime":"2017-05-09 19:23:38","url":"http://authors.library.caltech.edu/77302/1/ggx174.pdf"}],"eprintid":77302,"pos":1,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"ggx174.pdf","content":"accepted"},{"id":"http://authors.library.caltech.edu/id/document/251966","docid":251966,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255632","fileid":1255632,"datasetid":"document","objectid":251966,"filename":"ggx174_Supp.docx","mime_type":"application/vnd.openxmlformats-officedocument.wordprocessingml.document","hash":"9f992a437119450b374622f5f7a45290","hash_type":"MD5","filesize":1482397,"mtime":"2017-05-09 19:26:15","url":"http://authors.library.caltech.edu/77302/2/ggx174_Supp.docx"}],"eprintid":77302,"pos":2,"placement":3,"mime_type":"application/vnd.openxmlformats-officedocument.wordprocessingml.document","format":"application/msword","language":"en","security":"public","license":"other","main":"ggx174_Supp.docx","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/251967","docid":251967,"rev_number":1,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255635","fileid":1255635,"datasetid":"document","objectid":251967,"filename":"indexcodes.txt","mime_type":"text/plain","hash":"502b04c10ba32376652de7560729ae55","hash_type":"MD5","filesize":2659,"mtime":"2017-05-09 19:26:42","url":"http://authors.library.caltech.edu/77302/3/indexcodes.txt"}],"eprintid":77302,"pos":3,"placement":3,"mime_type":"text/plain","format":"other","language":"en","security":"public","license":"other","main":"indexcodes.txt","content":""},{"id":"http://authors.library.caltech.edu/id/document/253113","docid":253113,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1266197","fileid":1266197,"datasetid":"document","objectid":253113,"filename":"ggx174.pdf","mime_type":"application/pdf","hash":"75903503e26d44e10420bbbabb2f51f5","hash_type":"MD5","filesize":7303693,"mtime":"2017-06-02 21:25:14","url":"http://authors.library.caltech.edu/77302/4/ggx174.pdf"}],"eprintid":77302,"pos":4,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"ggx174.pdf","content":"published"}],"note":"© 2017 The Author. Published by Oxford University Press on behalf of The Royal Astronomical Society. \n\nAccepted 2017 April 26. Received 2017 April 24; in original form 2015 October 4. Published: 27 April 2017. \n\nWe thank the editor Saskia Goes and an anonymous reviewer whose comments greatly improved this manuscript. We thank the MASE team that installed and maintained MASE stations. Funding was possible through projects Conacyt 177676 and UNAM-PAPIIT IN110913. The first author had a scholarship from Conacyt.","id":77302,"rev_number":21,"userid":18,"eprint_dir":"disk0/00/07/73/02","datestamp":"2017-05-12 22:39:20","lastmod":"2017-06-02 21:33:19","status_changed":"2017-06-02 21:33:19","type":"article","metadata_visibility":"show","creators":[{"given":"Jorge","family":"Castellanos","id":"Castellanos-J","orcid":""},{"given":"Xyoli","family":"Pérez-Campos","id":"Pérez-Campos-X","orcid":""},{"given":"Raúl","family":"Valenzuela","id":"Valenzuela-R","orcid":""},{"given":"Allen","family":"Husker","id":"Husker-A-L","orcid":""},{"given":"Luca","family":"Ferrari","id":"Ferrari-L","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"North America; Seismic anisotropy; Subduction zone processes","date":"2017-07","date_type":"published","publication":"Geophysical Journal International","volume":"210","number":"1","pagerange":"360-374","id_number":"CaltechAUTHORS:20170509-122332119","refereed":true,"issn":"0956-540X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170509-122332119","related_url":[{"url":"https://doi.org/10.1093/gji/ggx174","type":"doi","description":"Article"},{"url":"https://academic.oup.com/gji/article-lookup/doi/10.1093/gji/ggx174","type":"pub","description":"Article"}],"referencetext":["Ammon C.J., 1991. The isolation of receiver effects from teleseismic P waveforms, Bull. seism. Soc. Am. , 81, 2504–2510.\nAudet P., 2013. Seismic anisotropy of subducting oceanic uppermost mantle from fossil spreading, Geophys. Res. Lett. , 40, 173–177.\nGoogle ScholarCrossRefSearch ADS open URL link  \nAudet P., Bostock M.G., Christensen N.I., Peacock S.M., 2009. Seismic evidence for overpressured subducted oceanic crust and megathrust fault sealing, Nature , 457, 76–78.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nBalfour N., Savage M., Townend J., 2005. Stress and crustal anisotropy in Marlborough, New Zealand: evidence for low fault strength and structure-controlled anisotropy, Geophys. J. Int. , 163(3), 1073–1086.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBernal-López L.A., Garibaldi B.R., León Soto G., Valenzuela R.W., Escudero C.R., 2016. Seismic anisotropy and mantle flow driven by the Cocos slab under southern Mexico, Pure appl. Geophys. , 173, 3373–3393.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBezacier L., Reynard B., Bass J.D., Sanchez-Valle C., Van de Moortele B., 2010. Elasticity of antigorite, seismic detection of serpentinites and anisotropy in subduction zones, Earth planet Sci. Lett. , 289, 198–208.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBlatter D.L., Hammersley L., 2010. Impact of the Orozco Fracture Zone on the central Mexican Volcanic Belt, J. Volc. Geotherm. Res. , 197, 67–84.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBoness N.L., Zoback M.D., 2004. Stress-induced seismic velocity anisotropy and physical properties in the SAFOD Pilot Hole in Parkfield, California, Geophys. Res. Lett. , 31, L15S17, doi:10.1029/2003GL019020.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBoness N.L., Zoback M.D., 2006. A multiscale study of the mechanisms controlling shear velocity anisotropy in the San Andreas Fault Observatory at depth, Geophysics , 71(5), F131–F146.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBowman J.R., Ando M., 1987. Shear wave splitting in the upper mantle wedge above the Tonga subduction zone, Geophys. J. R. astr. Soc. , 88, 25–41.\nGoogle ScholarCrossRefSearch ADS open URL link  \nCassidy J.F., 1992. Numerical experiments in broadband receiver function analysis, Bull. seism. Soc. Am. , 82, 1453–1474.\nCochran E., Li Y.-G., Vidale J., 2006. Anisotropy in the shallow crust observed around the San Andreas Fault before and after the 2004 M 6.0 Parkfield earthquake, Bull. seism. Soc. Am. , 96, S364–S375.\nGoogle ScholarCrossRefSearch ADS open URL link  \nChen T., Clayton R.W., 2009. Seismic attenuation structure in central Mexico: image of a focused high-attenuation zone in the mantle wedge, J. geophys. Res. , 114, B07304, doi:10.1029/2008JB005964.\nChen T., Clayton R.W., 2012. Structure of central and southern Mexico from velocity and attenuation tomography, J. geophys. Res. , 117, B09302, doi:10.1029/2012JB009233.\nChen Y., Niu F., 2013. Ray-parameter based stacking and enhanced pre-conditioning for stable inversion of receiver function data, Geophys. J. Int. , 194, 1682–1700.\nGoogle ScholarCrossRefSearch ADS open URL link  \nChevrot S., Van der Hilst R.D., 2000. The Poisson's ratio of the Australian crust: geological and geophysical implications, Earth planet. Sci. Lett. , 183, 121–132.\nGoogle ScholarCrossRefSearch ADS open URL link  \nChristensen N.I., 1984. The magnitude, symmetry and origin of upper mantle anisotropy based on fabric analyses of ultramafic tectonics, Geophys. J. R. astr. Soc. , 76, 89–111.\nGoogle ScholarCrossRefSearch ADS open URL link  \nClayton R.W., Wiggins R.A., 1976. Source shape estimation and deconvolution of teleseismic bodywaves, Geophys. J. R. astr. Soc. , 47, 151–177.\nGoogle ScholarCrossRefSearch ADS open URL link  \nCrampin S., 1990. The scattering of shear waves in the crust, Pure appl. Geophys. , 132, 67–91.\nGoogle ScholarCrossRefSearch ADS open URL link  \nCrampin S., 1994. The fracture criticality of crustal rocks, Geophys. J. Int. , 118, 428–438.\nGoogle ScholarCrossRefSearch ADS open URL link  \nCrampin S., Chastin S., 2003. A review of shear-wave splitting in the crack-critical crust, Geophys. J. Int. , 155, 221–240.\nGoogle ScholarCrossRefSearch ADS open URL link  \nCrampin S., Gao Y., 2006. A review of techniques for measuring shear-wave splitting above small earthquakes, Phys. Earth planet. Inter. , 159, 1–14.\nGoogle ScholarCrossRefSearch ADS open URL link  \nCrampin S., Zatsepin S.V., 1997. Modelling the compliance of crustal rock. II. Response to temporal changes before earthquakes, Geophys. J. Int. , 129, 495–506.\nGoogle ScholarCrossRefSearch ADS open URL link  \nDeMets C., Wilson D.S., 1997. Relative motions of the Pacific, Rivera, North American and Cocos plates since 0.78 Ma, J. geophys. Res. , 102, 2789–2806.\nGoogle ScholarCrossRefSearch ADS open URL link  \nDougherty S.L., Clayton R.W., 2014. Seismicity and structure in central Mexico: evidence for a possible slab tear in the South Cocos plate, J. geophys. Res. , 119, 3424–3447.\nGoogle ScholarCrossRefSearch ADS open URL link  \nDougherty S., Clayton R., Helmberger D., 2012. Seismic structure in Central Mexico: implication for fragmentation of the subducted Cocos plate, J. geophys. Res. , 117, B09316, doi:10.1029/2012JB009528.\nGoogle ScholarCrossRefSearch ADS open URL link  \nEfron E., Tibshirani R.J., 1993. An Introduction to the Bootsrap , Chapman \u0026 Hall, New York.\nFerrari L., Orozco-Esquivel T., Manea V.C., Manea M., 2012. The dynamic history of the Trans-Mexican Volcanic Beltandthe Mexico subduction zone, Tectonophysics , 522–523, 122–149.\nGoogle ScholarCrossRefSearch ADS open URL link  \nFrederiksen A.W., Bostock M.G., 2000. Modelling teleseismic waves in dipping anisotropic structures. Geophys. J. Int. , 141, 401–412.\nGoogle ScholarCrossRefSearch ADS open URL link  \nGilje E., Thomsen I., 1970. Two methods for splitting data into homogeneous groups, Stat. Rev. , 8(4), 307–314.\nGill J.B., 1981. Orogenic andesites and Plate Tectonics, Minerals and Rocks , Vol. 16, Springer, Berlin.\nGomez-Tuena A., Orozco-Esquivel T., Ferrari L., 2007. Igneous petrogenesis of the Trans-Mexican Volcanic belt. Geol. Soc. Am. Spec. Pap. , 442, 129–181.\nGreene Gondi F., 2009. Geometría de la placa de Cocos usando funciones de receptor, MSc thesis , Posgrado en Ciencias de la Tierra, Universidad Nacional Autónoma de México, Mexico City, Mexico, p. 118.\nHelffrich G., Wood B.J., 2001. The Earth's mantle, Nature , 412, 501–507.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nHudson J.A., 1994. Overall properties of anisotropic materials containing cracks, Geophys. J. Int. , 116, 279–282.\nGoogle ScholarCrossRefSearch ADS open URL link  \nHuesca-Pérez E., Husker A., 2012. Shallow travel-time tomography bellow Southern Mexico, Geofís. Int. , 51, 281–291.\nHuesca-Pérez E., Valenzuela R.W., Ortega R., 2016. Crustal anisotropy from tectonic tremor in Guerrero, Mexico, Geochem. Geophys. Geosyst. , 17, 2323–2335.\nGoogle ScholarCrossRefSearch ADS open URL link  \nHusker A., Davis P.M., 2009. Tomography and thermal state of the Cocos plate subduction beneath Mexico City, J. geophys. Res. , 114, B04306, doi:10.1029/2008JB006039.\nGoogle ScholarCrossRefSearch ADS open URL link  \nIglesias A., Clayton R.W., Pérez-Campos X., Singh S.K., Pacheco J.F., García D., Valdés-González C., 2010. S wave velocity structure below central Mexico using high-resolution surface wave tomography, J. geophys. Res. , 115, B06307, doi:10.1029/2009JB006332.\nGoogle ScholarCrossRefSearch ADS open URL link  \nJödicke H., Jording A., Ferrari L., Arzate J., Mezger K., Rüpke L., 2006. Fluid release from the subducted Cocos plate and partial melting of the crust deduced from magnetotelluric studies in southern Mexico: implications for the generation of volcanism and subduction dynamics, J. geophys. Res. , 111, B08102, doi:10.1029/2005JB003739.\nGoogle ScholarCrossRefSearch ADS open URL link  \nJung H., Karato S.I., 2001. Water-induced fabric transitions in olivine, Science , 293, 1460–1463.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nKaneshima S., 1990. Origin of crustal anisotropy: shear wave splitting studies in Japan, J. geophys. Res. , 95, 11 121–11 133.\nGoogle ScholarCrossRefSearch ADS open URL link  \nKarato S.I., Jung H., Katayama I., Skemer P., 2008. Geodynamic significance of seismic anisotropy of the upper mantle: new insights from laboratory studies, Annu. Rev. Earth planet. Sci. , 36, 59–95.\nGoogle ScholarCrossRefSearch ADS open URL link  \nKim Y., Miller M.S., Pearce F., Clayton R.W., 2012. Seismic imaging of the Cocos plate subduction zone system in central Mexico, Geochem. Geophys. Geosyst. , 13, Q07001, doi:10.1029/2012GC004033.\nGoogle ScholarCrossRefSearch ADS open URL link  \nKim Y., Clayton R.W., Jackson J.M., 2010. Geometry and seismic properties of the subducting Cocos plate in central Mexico, J. geophys. Res. , 115, B06310, doi:10.1029/2009JB006942.\nGoogle ScholarCrossRefSearch ADS open URL link  \nKim Y., Clayton R.W., Asimow P.D., Jackson J.M., 2013. Generation of talc in the mantle wedgeandits role in subduction dynamics in central Mexico, Earth planet. Sci. Lett. , 384, 81–87.\nGoogle ScholarCrossRefSearch ADS open URL link  \nKneller E.A., van Keken P.E., Karato S.-I., Park J., 2005. B-type olivine fabric in the mantle wedge: insights from high-resolution non-Newtonian subduction zone models, Earth planet. Sci. Lett. , 237, 781–797.\nGoogle ScholarCrossRefSearch ADS open URL link  \nKodaira S., Iidaka T., Kato A., Iwasaki T., Kaneda Y., 2004. High pore fluid pressure may cause silent slip in the Nankai Trough, Scienc e, 304, 1295–1298.\nGoogle ScholarCrossRefSearch ADS open URL link  \nLangston C.A., 1977. The effect of planar dipping structure on source and receiver responses for constant ray parameter, Bull. seism. Soc. Am. , 67, 1029–1050.\nLangston C.A., 1979. Structure under Mount Rainier, Washington, inferred from teleseismic body waves, J. geophys. Res. , 84, 4749–4762.\nGoogle ScholarCrossRefSearch ADS open URL link  \nLangston C.A., 1989. Scattering of teleseismic body waves under Pasadena, California, J. geophys. Res. , 94, 1935–1951.\nGoogle ScholarCrossRefSearch ADS open URL link  \nLeón Soto G., Ni J.F., Grand S.P., Sandvol E., Valenzuela R.W., Guzmán Speziale M., Gómez González J.M., Domínguez Reyes T., 2009. Mantle flow in the Rivera-Cocos subduction zone, Geophys. J. Int. , 179, 1004–1012.\nGoogle ScholarCrossRefSearch ADS open URL link  \nLevin V., Park J., 1998. P-SH conversions in layered media with hexagonally symmetric anisotropy: a cookbook, in Geodynamics of Lithosphere and Earth's Mantle, Pageoph Topical Volumes , pp. 669–697, eds Plomerová J., Liebermann R.C. \u0026 Babuška V., Birkhäuser Basel.\nLong M.D., 2009a. Geophysics: going with the mantle flow, Nat. Geosci. , 2, 10–11.\nGoogle ScholarCrossRefSearch ADS open URL link  \nLong M.D., 2009b. Complex anisotropy in D″ beneath the eastern Pacific from SKS-SKKS splitting discrepancies, Earth planet. Sci. Lett. , 283, 181–189.\nGoogle ScholarCrossRefSearch ADS open URL link  \nLong M.D., Silver P.G., 2008. The subduction zone flow field from seismic anisotropy: a global view, Science , 319, 315–318.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nMainprice D., Ildefonse B., 2009. Seismic anisotropy of subduction zone minerals—contribution of hydrous phases, in Frontiers in Earth Sciences: Subduction Zone Geodynamics , pp. 63–84, eds Plomerová, J., Liebermann, R.C. \u0026 Babuška, V., Springer.\nMainprice D., Nicolas A., 1989. Development of shape and lattice preferred orientation: application to the seismic anisotropy of the lower crust, J. Struct. Geol. , 11, 175–189.\nGoogle ScholarCrossRefSearch ADS open URL link  \nManea V., Manea M., Kostoglodov V., Sewell G., 2006. Intraslab seismicity and thermal stress in the subducted Cocos plate beneath Central Mexico, Tectonophysics , 420, 389–408.\nGoogle ScholarCrossRefSearch ADS open URL link  \nManea M., Manea V., Ferrari L., Kostoglodov V., Bandy W., 2005. Tectonic evolution of the Tehuantepec Ridge, Earth planet. Sci. Lett. , 238, 64–77.\nGoogle ScholarCrossRefSearch ADS open URL link  \nManea V.C., Manea M., Ferrari L., 2013. A geodynamical perspective on the subduction of Cocos and Rivera plates beneath Mexico and Central America, Tectonophysics , 609, 56–81.\nGoogle ScholarCrossRefSearch ADS open URL link  \nMASE, 2007. Meso America subduction experiment, Caltech. Dataset , doi:10.7909/C3RN35SP.\nMavko G., Mukerji T., Dvorkin J., 1998. The Rock Physics Handbook , Cambridge Univ. Press.\nMcNamara D.E., Owens T.J., 1993. Azimuthal shear wave velocity anisotropy in the Basin and Range province using Moho Ps converted phases, J. geophys. Res. , 98, 12 003–12 017.\nGoogle ScholarCrossRefSearch ADS open URL link  \nMelgar D., Pérez-Campos X., 2011. Imaging the Moho and subducted oceanic crust at the isthmus of Tehuantepec, Mexico, from receiver functions, Pure appl. Geophys. , 168, 1449–1460.\nGoogle ScholarCrossRefSearch ADS open URL link  \nNair S.K., Gao S.S., Liu K.H., Silver P.G., 2006. Southern African curstal evolution and composition: constraints from receiver function studies, J. geophys. Res. , 111, B02304, doi:10.1029/2005JB003802.\nGoogle ScholarCrossRefSearch ADS open URL link  \nNicolas A., Christensen N.I., 1987. Formation of anisotropy in upper mantle peridotites—a review, in the composition, structure and dynamics of the lithosphere-asthenosphere system, Am. geophys. Un. Geodyn. Ser. , 16, 111–123.\nPardo M., Suárez G., 1995. Shape of the subducted Rivera and Cocos plates in southern Mexico: seismic and tectonic implications, J. geophys. Res. , 100, 12 357–12 373.\nGoogle ScholarCrossRefSearch ADS open URL link  \nPeacock S.M., Christensen N.I., Bostock M.G., Audet P., 2011. High pore pressuresandporosity at 35 km depth in the Cascadia subduction zone, Geology , 39, 471–475.\nGoogle ScholarCrossRefSearch ADS open URL link  \nPérez-Campos X. et al., 2008. Horizontal subduction and truncation of the Cocos plate beneath central Mexico, Geophys. Res. Lett. , 35, L18303, doi:10.1029/2008GL035127.\nGoogle ScholarCrossRefSearch ADS open URL link  \nPonce Cortés J.G., 2012. Medición de la anisotropía de las ondas SKS en el manto superior, debajo de las estaciones permanentes del Servicio Sismológico Nacional instaladas a partir del año 2005, BSc thesis , Facultad de Ingeniería, Universidad Nacional Autónoma de México, Mexico City, Mexico, p. 79.\nRandall G.E., Owens T.J., 1994. Array analysis of teleseismic P-waveforms from the 1988–89 PASSCAL, Basin and Range passive source seismic experiment, Geophys. J. Int. , 116, 618–636.\nGoogle ScholarCrossRefSearch ADS open URL link  \nRojo Garibaldi B., 2011. Anisotropía de las ondas SKS en el manto superior debajo de un arreglo sísmico entre Guerrero y Veracruz, BSc thesis , Facultad de Ciencias, Universidad Nacional Autónoma de México, Mexico City, Mexico, p. 85.\nSandvol E., Seber D., Barazangi M., Vernon F., Mellors R., Al-Amri A., 1998. Lithospheric seismic velocity discontinuities beneath the Arabian Shield, Geophys. Res. Lett. , 25, 2873–2876.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSavage M.K., 1998. Lower crustal anisotropy or dipping boundaries? Effects on receiver functions and a case study in New Zealand, J. geophys. Res. , 103, 15069–15087.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSavage M.K., 1999. Seismic anisotropy and mantle deformation: what have we learned from shear wave splitting?, Rev. Geophys. , 37, 65–106.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSavage M.K., Peppin W.A., Vetter U.R., 1990. Shear-wave anisotropyandstress direction in and near Long Valley Caldera, Califoria, 1979–1988, J. geophys. Res. , 95, 11 165–11 177.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSilver P.G., 1996. Seismic anisotropy beneath the continents: probing the depths of Geology, Annu. Rev. Earth planet. Sci. , 24, 385–432.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSilver P.G., Chan W.W., 1988. Implications for continental structure andevolution from seismic anisotropy, Nature , 335, 34–39.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSilver P.G., Chan W.W., 1991. Shear wave splitting and subcontinental mantle deformation, J. geophys. Res. , 96, 16 429–16 454.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSingh S.K., Pardo M., 1993. Geometry of the Benioff zone and state of stress in the overriding plate in central Mexico, Geophys. Res. Lett. , 20(14), 1483–1486.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSolari L.A., Torres de León R., Hernández Pineda G., Solé J., Solís-Pichardo G., 2007. Tectonic significance of Cretaceous–Tertiary magmatic and structural evolution of the northern margin of the Xolapa Complex, Tierra Colorada area, southern Mexico, Geol. Soc. Am. Bull. , 119, 1265–1279.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSong T.-R., Kim Y., 2012a. Anisotropic uppermost mantle in young subducted slab underplating central Mexico, Nat. Geosci. , 5, 55–59.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSong T.-R., Kim Y., 2012b. Localized seismic anisotropy associated with long-term slow-slip events beneath southern Mexico, Geophys. Res. Lett. , 39, L09308, doi:10.1029/2012GL051324.\nSong T.-R.A., Helmberger D.V., Brudzinski M.R., Clayton R.W., Davis P., Pérez-Campos X., Singh S.K., 2009. Subducting slab ultra-slow velocity layer coincident with silent earthquakes in southern Mexico, Science , 324, 502–506.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nStubailo I., Beghein C., Davis P.M., 2012. Structure and anisotropy of the Mexico subduction zone based on Rayleigh-wave analysis and implocations for the geometry of the Trans-Mexican Volcanic Belt, J. geophys. Res. , 117, B05303, doi:10.1029/2011JB008631.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSuárez G., Singh S.K., 1986. Tectonic interpretation of the Trans-Mexican Volcanic Belt―discussion, Tectonophysics , 127, 155–158.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSuter M., 1991. State of stress and active deformation in Mexico and western Central America, in Neotectonics of North America , pp. 401–421, Geological Society of America Memoir, doi:10.1130/dnag-csms-neo.\nValenzuela R.W., León Soto G., 2017. Shear wave splittingandmantle flow in Mexico: what have we learned?, Geofísica Internacional , 56, 187–217.\nvan Benthem S.A.C., Valenzuela R.W., Ponce G.J., 2013. Measurements of upper mantle shear wave anisotropy from a permanent network in southern Mexico, Geofís. Int. , 52, 385–402.\nVillafuerte C., 2014. Modelado poroelástico de sismos silenciosos en Guerrero, México, BSc thesis , Facultad de Ingeniería, Universidad Nacional Autónoma de México, Mexico City, Mexico, p. 123.\nVinnik L., Chevrot S., Montagner J.P., 1997. Evidence for a stagnant plume in the transition zone?, Geophys. Res. Lett. , 24, 1007–1010.\nGoogle ScholarCrossRefSearch ADS open URL link  \nWang X.-Q., Schubnel A., Fortin J., David E.C., Guéguen Y., Ge H.-K., 2012. High Vp Vs ratio: saturated cracks or anisotropy effects?, Geophys. Res. Lett. , 39, L11307, doi:10.1029/2012GL051742.\nZhang S., Karato S.-I., 1995. Lattice preferred orientation of olivine aggregates deformed in simple shear, Nature , 375, 774–777.\nGoogle ScholarCrossRefSearch ADS open URL link  \nZhu L., Kanamori H., 2000. Moho depth variations in Southern California from teleseismic receiver functions, J. geophys. Res. , 105, 2969–2980."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Jorge Castellanos, Xyoli Pérez-Campos, Raúl Valenzuela, Allen Husker, Luca Ferrari; Crust and upper-mantle seismic anisotropy variations from the coast to inland in central and Southern Mexico. Geophys J Int 2017; 210 (1): 360-374. doi: 10.1093/gji/ggx174","other_numbering_system":null,"funders":[{"agency":"Consejo Nacional de Ciencia y Tecnología (CONACYT)","grant_number":"177676"},{"agency":"Universidad Nacional Autónoma de México (UNAM)","grant_number":"IN110913"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":["Seismological Laboratory"]}