{"title":"Controls on the sequence stratigraphic architecture of the Neogene Zagros foreland basin","uri":"","abstract":"We investigated the sequence stratigraphic architecture of Neogene deposits in the Zagros region using 12 measured stratigraphic sections and performing strontium isotope measurements on 10 samples. We combined our data with 44 previous published Sr isotope measurements and five paleomagnetostratigraphic sections in order to place the foreland deposits in a chronostratigraphic framework. Two chronostratigraphic charts were created, and transgressive-regressive system tracts were identified in the western and eastern sectors of the Zagros. These results show that the southward migration of the Zagros fold-and-thrust belt led to broadly upward-coarsening, progradational sequences due to progressive uplift and seaward (southwestward) migration of the Zagros fold-and-thrust belt. In addition, we show distinct differences in the sequences between the eastern and western sectors. It can be inferred that, in the strike-parallel direction, the Zagros foreland basin did not respond in a simple manner to tectonics and global sea-level changes during the Neogene. The different architecture of the sequences and mismatch of Neogene sedimentary architecture with global sea-level curves imply different orogen-parallel evolutionary histories and strong impact of tectonics on the basin evolution as compared to eustasy. Finally, we present evidence for a retrogradational sequence related to a period of enhanced deformation and related crustal thickening during the middle Miocene in the eastern Zagros.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251968","docid":251968,"rev_number":4,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255641","fileid":1255641,"datasetid":"document","objectid":251968,"filename":"Geological Society of America Special Papers-2016-Pirouz-2016.2525_12.pdf","mime_type":"application/pdf","hash":"83bbad4f066880d5782a3d08e8bc122d","hash_type":"MD5","filesize":3355452,"mtime":"2017-05-09 19:50:43","url":"http://authors.library.caltech.edu/77303/1/Geological%20Society%20of%20America%20Special%20Papers-2016-Pirouz-2016.2525_12.pdf"}],"eprintid":77303,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"Geological Society of America Special Papers-2016-Pirouz-2016.2525_12.pdf","content":"inpress"}],"note":"© 2016 Geological Society of America. \n\nAccepted 15 June 2016. First published online December 20, 2016. \n\nThis study was supported by the Swiss National Science Foundation (grant P2GEP2-148801). We thank Mohammad Fakhari, Rasoul Sorkhabi, and two anonymous reviewers for their thorough reviews and highly appreciate their comments and suggestions, which significantly contributed to improving the quality of the paper. We also thank Jean-Philippe Avouac, Jamshid Hassanzadeh, and Seyed Abolfazl Hosseini for discussions. This research paper is lovingly dedicated to those who are fighting cancer or who have survived it.","id":77303,"rev_number":17,"userid":18,"eprint_dir":"disk0/00/07/73/03","datestamp":"2017-05-12 23:02:37","lastmod":"2017-06-02 19:50:16","status_changed":"2017-05-12 23:02:37","type":"book_section","metadata_visibility":"show","creators":[{"given":"Mortaza","family":"Pirouz","id":"Pirouz-M","orcid":""},{"given":"Guy","family":"Simpson","id":"Simpson-G","orcid":""},{"given":"Sebastien","family":"Castelttort","id":"Castelttort-S","orcid":""},{"given":"Georges","family":"Gorin","id":"Gorin-G","orcid":""},{"given":"Abbas","family":"Bahroudi","id":"Bahroudi-A","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"none","keywords":"","date":"2016-12-20","date_type":"inpress","publication":"","volume":"","number":"525","pagerange":"","id_number":"CaltechAUTHORS:20170509-125037614","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170509-125037614","related_url":[{"url":"http://dx.doi.org/10.1130/2016.2525(12)​","type":"doi","description":"Article"},{"url":"http://specialpapers.gsapubs.org/content/early/2016/12/20/2016.2525_12.abstract","type":"pub","description":"Article"}],"referencetext":["Adamia, S.A., Chkhotua, T., Kekelia, M., Lordkipanidze, M., Shavishvili,\nI., and Zakariadze, G., 1981, Tectonics of the Caucasus and adjoining\nregions: Implications for the evolution of the Tethys ocean: Journal of\nStructural Geology, v. 3, no. 4, p. 437–447.\nAgard, P., Omrani, J., Jolivet, L., and Mouthereau, F., 2005, Convergence history\nacross Zagros (Iran): Constraints from collisional and earlier deformation:\nInternational Journal of Earth Sciences, v. 94, p. 401–419.\nAlavi, M., 1994, Tectonics of the Zagros orogenic belt of Iran: New data\nand interpretations: Tectonophysics, v. 229, no. 3–4, p. 211–238,\ndoi:10.1016/0040-1951(94)90030-2.\nAlavi, M., 2004, Regional stratigraphy of the Zagros fold-thrust belt of Iran\nand its proforeland evolution: American Journal of Science, v. 304, no. 1,\np. 1–20, doi:10.2475/ajs.304.1.1.\nAlavi, M., 2007, Structures of the Zagros fold-thrust belt in Iran: American\nJournal of Science, v. 307, no. 9, p. 1064–1095, doi:10.2475/09.2007.02.\nAllen, M., Jackson, J., and Walker, R., 2004, Late Cenozoic reorganization\nof the Arabia-Eurasia collision and the comparison of shortterm\nand long-term deformation rates: Tectonics, v. 23, TC2008,\ndoi:10.1029/2003TC001530.\nBallato, P., and Strecker, M.R., 2014, Assessing tectonic and climatic causal\nmechanisms in foreland-basin stratal architecture: Insights from the\nAlborz Mountains, northern Iran: Earth Surface Processes and Landforms,\nv. 39, no. 1, p. 110–125, doi:10.1002/esp.3480.\nBerberian, M., 1995, Master ‘blind’ thrust faults hidden under the Zagros folds:\nActive basement tectonics and surface morphotectonics: Tectonophysics,\nv. 241, no. 3–4, p. 193–224, doi:10.1016/0040-1951(94)00185-C.\nBerberian, M., and King, G.C.P., 1981, Towards a paleogeography and tectonic\nevolution of Iran: Canadian Journal of Earth Sciences, v. 18, p. 210–265,\ndoi:10.1139/e81-019.\nCatuneanu, O., 2002, Sequence stratigraphy of clastic systems: Concepts,\nmerits, and pitfalls: Journal of African Earth Sciences, v. 35, p. 1–43,\ndoi:10.1016/S0899-5362(02)00004-0.\nCatuneanu, O., Beaumont, C., and Waschbusch, P., 1997, Interplay of static\nloads and subduction dynamics in foreland basins: Reciprocal stratigraphies\nand the “missing” peripheral bulge: Geology, v. 25, no. 12, p. 1087–\n1090, doi:10.1130/0091-7613(1997)025\u003c1087:IOSLAS\u003e2.3.CO;2.\nDeCelles, P.G., and Currie, B.S., 1996, Long-term sediment accumulation\nin the Middle Jurassic–early Eocene Cordilleran retroarc forelandbasin\nsystem: Geology, v. 24, no. 7, p. 591–594, doi:10.1130/0091\n-7613(1996)024\u003c0591:LTSAIT\u003e2.3.CO;2.\nEhrenberg, S.N., Pickard, N.A.H., Laursen, G.V., Monibi, S., Mossadegh, Z.K.,\nSvånå, T.A., Aqrawi, A.A.M., McArthur, J.M., and Thirlwall, M.F., 2007,\nStrontium isotope stratigraphy of the Asmari Formation (Oligocene–\nLower Miocene): SW Iran: Journal of Petroleum Geology, v. 30, no. 2,\np. 107–128.\nElliott, G.F., 1957, Subterraniphyllum, a new Tertiary calcareous algae: Paleontology,\nv. 1, p. 73–75.\nEmami, H., 2008, Foreland Propagation Folding and Structure of the Mountain\nFront Flexure in the Posht-e-kuh Arc (NW Zagros, Iran) [Ph.D. thesis]:\nBarcelona, Universitat de Barcelona, 181 p.\nEmbry, A.F., and Johannessen, E.P., 1992, T-R sequence stratigraphy, facies\nanalysis and reservoir distribution in the uppermost Triassic–Lower Jurassic\nsuccession, western Sverdrup Basin, Arctic Canada, in Vorren, T.O.,\nBergsager, E., Dahl-Stamnes, O.A., Holter, E., Johansen, B., Lie, E., and\nLund, T.B., eds., Arctic Geology and Petroleum Potential: Norwegian\nPetroleum Society Special Publication 2, p. 121–146.\nFakhari, M.D., Axen, G.J., Horton, B.K., Hassanzadeh, J., and Amini, A.,\n2008, Revised age of proximal deposits in the Zagros foreland basin and\nimplications for Cenozoic evolution of the High Zagros: Tectonophysics,\nv. 451, no. 1–4, p. 170–185, doi:10.1016/j.tecto.2007.11.064.\nFavre, G., 1974, The Post-Asmari Formations of Southwest Iran: Tehran,\nNational Iranian Oil Company, 1220 p.\nFrançois, T., Agard, P., Bernet, M., Meyer, B., Chung, S.L., Zarrinkoub, M.H.,\nBurov, E., and Monié, P., 2014, Cenozoic exhumation of the internal\nZagros: First constraints from low-temperature thermochronology and\nimplications for the build-up of the Iranian plateau: Lithos, v. 206–207,\np. 100–112.\nGavillot, Y., Axen, G.J., Stockli, D.F., Horton, B.K., and Fakhari, M.D.,\n2010, Timing of thrust activity in the High Zagros fold-thrust belt, Iran,\nfrom (U-Th)/He thermochronometry: Tectonics, v. 29, no. 4, TC4025,\ndoi:10.1029/2009TC002484.\nHaq, B.U., and Qahtani, A.M.A., 2005, Phanerozoic cycles of sea-level change\non the Arabian Platform: GeoArabia, v. 10, p. 127–160.\nHessami, K., Koyi, H.A., and Talbot, C.J., 2001, The signifi cance of strike-slip\nfaulting in the basement of the Zagros fold and thrust belt: Journal of\nPetroleum Geology, v. 24, no. 1, p. 5–28, doi:10.1111/j.1747-5457.2001\n.tb00659.x.\nHolbrook, J., Scott, R.W., and Oboh-Ikuenobe, F.E., 2006, Base-level buffers\nand buttresses: A model for upstream versus downstream control on fl uvial\ngeometry and architecture within sequences: Journal of Sedimentary\nResearch, v. 76, no. 1, p. 162–174, doi:10.2110/jsr.2005.10.\nHomke, S., Vergés, J., Garcés, M., Emami, H., and Karpuz, R., 2004, Magnetostratigraphy\nof Miocene–Pliocene Zagros foreland deposits in the front of\nthe Push-e Kush Arc (Lurestan Province, Iran): Earth and Planetary Science\nLetters, v. 225, no. 3–4, p. 397–410, doi:10.1016/j.epsl.2004.07.002.\nJames, G.A., and Wynd, J.G., 1965, Stratigraphic nomenclature of Iranian Oil\nConsortium Agreement Area: American Association of Petroleum Geologists\nBulletin, v. 49, no. 12, p. 2182–2245.\nKashfi , M.S., 1980, Stratigraphy and environmental sedimentology of Lower\nFars Group (Miocene), south-southwest Iran: American Association of\nPetroleum Geologists Bulletin, v. 64, no. 12, p. 2095–2107.\nKent, P.E., 1979, The emergent Hormuz salt plugs of southern Iran: Journal of\nPetroleum Geology, v. 2, no. 2, p. 117–144, doi:10.1111/j.1747-5457.1979\n.tb00698.x.\nKhadivi, S., Mouthereau, F., Larrasoaña, J.C., Vergés, J., Lacombe, O., Khademi,\nE., Beamud, E., Melinte-Dobrinescu, M., and Suc, J.P., 2010, Magnetochronology\nof synorogenic Miocene foreland sediments in the Fars\narc of the Zagros Folded Belt (SW Iran): Basin Research, v. 22, no. 6,\np. 918–932.\nKhadivi, S., Mouthereau, F., Barbarand, J., Adatte, T., and Lacombe, O., 2012,\nConstraints on palaeodrainage evolution induced by uplift and exhumation\non the southern fl ank of the Zagros-Iranian Plateau: Journal of the\nGeological Society, London, v. 169, no. 1, p. 83–97, doi:10.1144/0016\n-76492011-031.\nKoop, W.J., Stoneley, R., Ridd, M.F., Murphy, R.W., Osmaston, M.F., and Kholief,\nM.M., 1982, Subsidence history of the Middle East Zagros Basin,\nPermian to Recent [and discussion]: Philosophical Transactions of the\nRoyal Society of London, ser. A, Mathematical and Physical Sciences,\nv. 305, no. 1489, p. 149–168, doi:10.1098/rsta.1982.0031.\nLovell, B., 2010, A pulse in the planet: Regional control of high-frequency\nchanges in relative sea level by mantle convection: Journal of the Geological\nSociety, London, v. 167, no. 4, p. 637–648, doi:10.1144/0016\n-76492009-127.\nManaman, N.S., Shomali, H., and Koyi, H., 2011, New constraints on uppermantle\nS-velocity structure and crustal thickness of the Iranian plateau\nusing partitioned waveform inversion: Geophysical Journal International,\nv. 184, no. 1, p. 247–267.\nMcArthur, J.M., Howarth, R.J., and Bailey, T.R., 2001, Strontium isotope\nstratigraphy: LOWESS Version 3: Best fit to the marine Sr-isotope\ncurve for 0–509 Ma and accompanying look-up table for deriving\nnumerical age: The Journal of Geology, v. 109, no. 2, p. 155–170,\ndoi:10.1086/319243.\nMiall, A.D., 1991, Stratigraphic sequences and their chronostratigraphic correlation:\nJournal of Sedimentary Research, v. 61, no. 4, p. 497–505.\nMiller, K., Mountain, G., Wright, J., and Browning, J., 2011, A 180-millionyear\nrecord of sea level and ice volume variations from continental margin\nand deep-sea isotopic records: Oceanography (Washington, D.C.), v. 24,\nno. 2, p. 40–53, doi:10.5670/oceanog.2011.26.\nMiller, K.G., Kominz, M.A., Browning, J.V., Wright, J.D., Mountain, G.S.,\nKatz, M.E., Sugarman, P.J., Cramer, B.S., Christie-Blick, N., and Pekar,\nS.F., 2005, The Phanerozoic record of global sea-level change: Science,\nv. 310, no. 5752, p. 1293–1298, doi:10.1126/science.1116412.\nMitchum, R.M., Jr., 1977, Seismic stratigraphy and global changes of sea level,\npart II: Glossary of terms used in seismic stratigraphy, in Payton, C.E.,\ned., Seismic Stratigraphy Applications to Hydrocarbon Exploration:\nAmerican Association of Petroleum Geologists Memoir 26, p. 205–212.\nMotiei, H., 1993, Stratigraphy of Zagros: Tehran, Geological Survey of Iran,\n536 p.\nMouthereau, F., 2011, Timing of uplift in the Zagros belt/Iranian plateau and\naccommodation of late Cenozoic Arabia-Eurasia convergence: Geological\nMagazine, v. 148, no. 5–6, p. 726–738.\nMouthereau, F., Lacombe, O., and Vergés, J., 2012, Building the Zagros collisional\norogen: Timing, strain distribution and the dynamics of Arabia/\nEurasia plate convergence: Tectonophysics, v. 532, p. 27–60.\nPilgrim, 1908, The Geology of the Persian Gulf and the Adjoining Portions of\nPersia and Arabia: Geological Survey of India Memoir 34, 177 p.\nPirouz, M., 2013, The Geometry and Sedimentary Record of Tectonics in the\nNeogene Zagros Foreland Basin [Ph.D. thesis]: Geneva, Switzerland,\nUniversity of Geneva, 135 p.\nPirouz, M., Simpson, G., Bahroudi, A., and Azhdari, A., 2011, Neogene sediments\nand modern depositional environments of the Zagros foreland basin\nsystem: Geological Magazine, v. 148, no. 5–6, p. 838–853, doi:10.1017/\nS0016756811000392.\nPirouz, M., Simpson, G., and Chiaradia, M., 2015, Constraint on foreland basin\nmigration in the Zagros mountain belt using Sr isotope stratigraphy: Basin\nResearch, v. 27, p. 714–728, doi:10.1111/bre.12097.\nPosamentier, H.W., and Vail, P.R., 1988, Eustatic controls on clastic deposition:\nII. Sequence and system tract models, in Wilgus, C.K., Hastings,\nB.S., Kendall, C.G.St.C., Posamentier, H.W., Ross, C.A., and Van Wagoner,\nJ.C., eds., Sea Level Changes—An Integrated Approach: Society\nof Economic Paleontologists and Mineralogists Special Publication 42,\np. 125–154, doi:10.2110/pec.88.01.0125.\nSaura, E., Vergés, J., Homke, S., Blanc, E., Serra-Kiel, J., Bernaola, G., Casciello,\nE., Fernández, N., Romaire, I., Casini, G., Embry, J.C., Sharp, I.R.,\nand Hunt, D.W., 2011, Basin architecture and growth folding of the NW\nZagros early foreland basin during the Late Cretaceous and Early Tertiary:\nJournal of the Geological Society, London, v. 168, no. 1, p. 235–\n250, doi:10.1144/0016-76492010-092.\nSepehr, M., and Cosgrove, J.W., 2004, Structural framework of the Zagros foldthrust\nbelt, Iran: Marine and Petroleum Geology, v. 21, no. 7, p. 829–843,\ndoi:10.1016/j.marpetgeo.2003.07.006.\nSetudehnia A.A., 1972, Lexique Stratigraphique International ASIE v. III, Fascicule,\nb. 2—Iran du sud Ouest.\nSimpson, G., 2014, Decoupling of foreland basin subsidence from topography\nlinked to faulting and erosion: Geology, v. 42, p. 775–778, doi:10.1130/\nG35749.1.\nStampfl i, G.M., 2000, Tethyan oceans, in Bozkurt, E., and Winchester, J.A.,\neds., Tectonics and Magmatism in Turkey and the Surrounding Area:\nGeological Society, London, Special Publication, v. 173, no. 1, p. 1–23,\ndoi:10.1144/GSL.SP.2000.173.01.01.\nStampfl i, G.M., and Borel, G.D., 2002, A plate tectonic model for the Paleozoic\nand Mesozoic constrained by dynamic plate boundaries and restored\nsynthetic oceanic isochrons: Earth and Planetary Science Letters, v. 196,\nno. 1–2, p. 17–33.\nStocklin, J., 1968, Structural history and tectonics of Iran: A review: Association\nof Petroleum Geologists Bulletin, v. 52, no. 7, p. 1229–1258.\nTalbot, C.J., and Alavi, M., 1996, The past of a future syntaxis across the\nZagros, in Alsop, G.I., Blundell, D.J., and Davison, I., eds., Salt Tectonics:\nGeological Society, London, Special Publication 100, p. 89–109,\ndoi:10.1144/GSL.SP.1996.100.01.08.\nvan Buchem, F.S.P., Allan, T.L., Laursen, G.V., Lotfpour, M., Moallemi, A.,\nMonibi, S., Motiei, H., Pickard, N.A.H., Tahmasbi, A.R., Vedrenne, V.,\nand Vincent, B., 2010, Regional stratigraphic architecture and reservoir\ntypes of the Oligo-Miocene deposits in the Dezful Embayment (Asmari\nand Pabdeh Formations) SW Iran, in van Buchem, F.S.P., Gerdes, K.D.,\nand Esteban, M., eds., Mesozoic and Cenozoic Carbonate Systems of the\nMediterranean and the Middle East: Stratigraphic and Diagenetic Reference\nModels: Geological Society, London, Special Publication 329,\np. 219–263, doi:10.1144/SP329.10.\nWagoner, J.C.V., and Bertram, G.T., eds., 1995, Sequence Stratigraphy of Foreland\nBasin Deposits: Outcrop and Subsurface Examples from the Cretaceous\nof North America: American Association of Petroleum Geologists\nMemoir 64, 523 p.\nWatts, A.B., and Thorne, J., 1984, Tectonics, global changes in sea level and\ntheir relationship to stratigraphical sequences at the US Atlantic continental\nmargin: Marine and Petroleum Geology, v. 1, no. 4, p. 319–339,\ndoi:10.1016/0264-8172(84)90134-X.\nWright, V.P., and Marriott, S.B., 1993, The sequence stratigraphy of fl uvial depositional\nsystems: The role of fl oodplain sediment storage: Sedimentary\nGeology, v. 86, no. 3–4, p. 203–210, doi:10.1016/0037-0738(93)90022-W."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Mortaza Pirouz, Guy Simpson, Sebastien Castelttort, Georges Gorin, and Abbas Bahroudi\nControls on the sequence stratigraphic architecture of the Neogene Zagros foreland basin\nGeological Society of America Special Papers, , 525, p. SPE525-12, first published on December 20, 2016, doi:10.1130/2016.2525(12)","other_numbering_system":null,"funders":[{"agency":"Swiss National Science Foundation (SNSF)","grant_number":"P2GEP2-148801"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}