{"title":"A phase coherence approach to identifying co-located earthquakes and tremor","uri":"","abstract":"We present and use a phase coherence approach to identify seismic signals that have similar path effects but different source time functions: co-located earthquakes and tremor. The method used is a phase coherence-based implementation of empirical matched field processing, modified to suit tremor analysis. It works by comparing the frequency-domain phases of waveforms generated by two sources recorded at multiple stations. We first cross-correlate the records of the two sources at a single station. If the sources are co-located, this cross-correlation eliminates the phases of the Green’s function. It leaves the relative phases of the source time functions, which should be the same across all stations so long as the spatial extent of the sources are small compared with the seismic wavelength. We therefore search for cross-correlation phases that are consistent across stations as an indication of co-located sources. We also introduce a method to obtain relative locations between the two sources, based on back-projection of interstation phase coherence. We apply this technique to analyse two tremor-like signals that are thought to be composed of a number of earthquakes. First, we analyse a 20 s long seismic precursor to a M 3.9 earthquake in central Alaska. The analysis locates the precursor to within 2 km of the mainshock, and it identifies several bursts of energy—potentially foreshocks or groups of foreshocks—within the precursor. Second, we examine several minutes of volcanic tremor prior to an eruption at Redoubt Volcano. We confirm that the tremor source is located close to repeating earthquakes identified earlier in the tremor sequence. The amplitude of the tremor diminishes about 30 s before the eruption, but the phase coherence results suggest that the tremor may persist at some level through this final interval.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251974","docid":251974,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255681","fileid":1255681,"datasetid":"document","objectid":251974,"filename":"ggx012.pdf","mime_type":"application/pdf","hash":"45dd140a312d12006ed53d0b9821d837","hash_type":"MD5","filesize":5106869,"mtime":"2017-05-09 20:47:48","url":"http://authors.library.caltech.edu/77308/1/ggx012.pdf"}],"eprintid":77308,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"ggx012.pdf","content":"published"}],"note":"© 2017 The Authors. Published by Oxford University Press on behalf of The Royal Astronomical Society. \n\nAccepted 2017 January 13. Received 2016 November 7; in original form 2016 May 17. Published: 15 January 2017. \n\nSeismic data for the Nenana earthquake were obtained via the IRIS DMC from stations in the Alaska Regional Network, run by the Alaska Earthquake Center and the University of Alaska Fairbanks (doi:10.7914/SN/AK) and from one station in the Global Seismograph Network (doi:10.7914/SN/IU) Seismic data from Redoubt volcano was obtained from stations run by the Alaska Volcano Observatory. Seismic data used for testing noise was obtained via the IRIS DMC from stations in the Southern California Seismic Network (doi:10.7914/SN/CI), the Plate Boundary Observatory borehole seismic network, operated by UNAVCO, and the ANZA regional network (doi:10.7914/SN/AZ) This research was supported by NSF grant EAR-1015698, by a Caltech Division of Geological and Planetary Sciences postdoctoral fellowship to JCH, and by the Southern California Earthquake Center, which is funded by National Science Foundation Cooperative Agreement EAR-82081033462 and U.S. Geological Survey Cooperative Agreement G12AC20038.","id":77308,"rev_number":6,"userid":18,"eprint_dir":"disk0/00/07/73/08","datestamp":"2017-05-12 22:56:11","lastmod":"2017-05-12 22:56:11","status_changed":"2017-05-12 22:56:11","type":"article","metadata_visibility":"show","creators":[{"given":"J. C.","family":"Hawthorne","id":"Hawthorne-J-C","orcid":""},{"given":"J.-P.","family":"Ampuero","id":"Ampuero-J-P","orcid":"0000-0002-4827-7987"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Fourier analysis, Earthquake source observations, Volcano seismology, Rheology and friction of fault zones","date":"2017-05","date_type":"published","publication":"Geophysical Journal International","volume":"209","number":"2","pagerange":"623-642","id_number":"CaltechAUTHORS:20170509-134742865","refereed":true,"issn":"0956-540X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170509-134742865","related_url":[{"url":"https://doi.org/10.1093/gji/ggx012","type":"doi","description":"Article"},{"url":"https://academic.oup.com/gji/article-lookup/doi/10.1093/gji/ggx012","type":"pub","description":"Article"}],"referencetext":["Ampuero J.-P. Rubin A.M., 2008. Earthquake nucleation on rate and state faults — aging and slip laws, J. geophys. Res.,  113, B01302, doi:10.1029/2007JB005082.\nGoogle ScholarCrossRefSearch ADS open URL link  \nAmpuero J.-P. Vilotte J.-P. Sánchez-Sesma F.J., 2002. Nucleation of rupture under slip dependent friction law: simple models of fault zone, J. geophys. Res.,  107(B12), 2324, doi:10.1029/2001JB000452.\nGoogle ScholarCrossRefSearch ADS open URL link  \nAndo R. Takeda N. Yamashita T., 2012. Propagation dynamics of seismic and aseismic slip governed by fault heterogeneity and Newtonian rheology, J. geophys. Res. , 117, B11308, doi:10.1029/2012JB009532.\nArmbruster J.G. Kim W.-Y. Rubin A.M., 2014. Accurate tremor locations from coherent S and P waves, J. geophys. Res. , 119(6), 5000–5013.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBaggeroer A. Kuperman W. Mikhalevsky P., 1993. An overview of matched field methods in ocean acoustics, IEEE J. Ocean. Eng. , 18(4), 401–424.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBaggeroer A.B. Kuperman W.A. Schmidt H., 1988. Matched field processing: source localization in correlated noise as an optimum parameter estimation problem, J. acoust. Soc. Am. , 83(2), 571–587.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBeaudoin B.C. Fuis G.S. Mooney W.D. Nokleberg W.J. Christensen N.I., 1992. Thin, low-velocity crust beneath the southern Yukon-Tanana Terrane, east central Alaska: Results from Trans-Alaska crustal transect refraction/wide-angle reflection data, J. geophys. Res. , 97(B2), 1921–1942.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBendat J.S. Piersol A.G., 2010. Random Data: Analysis and Measurement Procedures , 4th edn, Wiley.\nBeroza G.C. Ellsworth W.L., 1996. Properties of the seismic nucleation phase, Tectonophysics , 261(1–3), 209–227.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBostock M.G. Royer A.A. Hearn E.H. Peacock S.M., 2012. Low frequency earthquakes below southern Vancouver Island, Geochem. Geophys. Geosyst. , 13, Q11007, doi:10.1029/2012GC004391.\nBouchon M. Karabulut H. Aktar M. Özalaybey S. Schmittbuhl J. Bouin M.-P., 2011. Extended nucleation of the 1999 Mw 7.6 Izmit earthquake, Science , 331(6019), 877 –880.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nBouchon M. Durand V. Marsan D. Karabulut H. Schmittbuhl J., 2013. The long precursory phase of most large interplate earthquakes, Nat. Geosci. , 6(4), 299–302.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBrodsky E.E. van der Elst N.J., 2010. Connecting near-field and far-field earthquake triggering to dynamic strain, J. geophys. Res. , 115, B07311, doi:10.1029/2009JB006681.\nBrown J.R. et al, 2009. Deep low-frequency earthquakes in tremor localize to the plate interface in multiple subduction zones, Geophys. Res. Lett. , 36, L19306, doi:10.1029/2009GL040027.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBucker H.P., 1976. Use of calculated sound fields and matched-field detection to locate sound sources in shallow water, J. acoust. Soc. Am. , 59(2), 368–373.\nGoogle ScholarCrossRefSearch ADS open URL link  \nBuurman H. West M.E. Thompson G., 2013. The seismicity of the 2009 Redoubt eruption, J. Volcanol. Geotherm. Res. , 259, 16–30.\nGoogle ScholarCrossRefSearch ADS open URL link  \nCampillo M. Ionescu I.R., 1997. Initiation of antiplane shear instability under slip dependent friction, J. geophys. Res. , 102(B9), 20 363–20 371.\nGoogle ScholarCrossRefSearch ADS open URL link  \nChen X. Shearer P.M., 2013. California foreshock sequences suggest aseismic triggering process, Geophys. Res. Lett. , 40(11), 2602–2607.\nGoogle ScholarCrossRefSearch ADS open URL link  \nColombelli S. Zollo A. Festa G. Picozzi M., 2014. Evidence for a difference in rupture initiation between small and large earthquakes, Nat. Comm. , 5, 3958, doi:10.1038/ncomms4958.\nGoogle ScholarCrossRefSearch ADS open URL link  \nCorciulo M. Roux P. Campillo M. Dubucq D. Kuperman W., 2012. Multiscale matched-field processing for noise-source localization in exploration geophysics, Geophysics , 77(5), KS33–KS41.\nGoogle ScholarCrossRefSearch ADS open URL link  \nCros E. Roux P. Vandemeulebrouck J. Kedar S., 2011. Locating hydrothermal acoustic sources at Old Faithful Geyser using matched field processing, Geophys. J. Int. , 187(1), 385–393.\nGoogle ScholarCrossRefSearch ADS open URL link  \nCrotwell H.P. Owens T.J. Ritsema J., 1999. The TauP toolkit: flexible seismic travel-time and ray-path utilities, Seismol. Res. Lett. , 70(2), 154–160.\nGoogle ScholarCrossRefSearch ADS open URL link  \nDieterich J.H., 1992. Earthquake nucleation on faults with rate-dependent and state-dependent strength, Tectonophysics , 211(1–4), 115–134.\nGoogle ScholarCrossRefSearch ADS open URL link  \nDixon J.P. Stihler S.D. Power J.A. Searcy C., 2010. Catalog of earthquake hypocenters at Alaskan volcanoes: January 1 through December 31, 2009, Tech. Rep. 531, USGS.\nDmitrieva K. Hotovec-Ellis A.J. Prejean S. Dunham E.M., 2013. Frictional-faulting model for harmonic tremor before Redoubt Volcano eruptions, Nat. Geosci. , 6(8), 652–656.\nGoogle ScholarCrossRefSearch ADS open URL link  \nDodge D.A. Beroza G.C. Ellsworth W.L., 1996. Detailed observations of California foreshock sequences: implications for the earthquake initiation process, J. geophys. Res. , 101(B10), 22 371–22 392.\nGoogle ScholarCrossRefSearch ADS open URL link  \nEllsworth W.L. Beroza G.C., 1995. Seismic evidence for an earthquake nucleation phase, Science , 268(5212), 851–855.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nFang Z. Dieterich J.H. Richards-Dinger K.B. Xu G., 2011. Earthquake nucleation on faults with nonconstant normal stress, J. geophys. Res. , 116, B09307, doi:10.1029/2011JB008196.\nFehler M., 1983. Observations of volcanic tremor at Mount St. Helens Volcano, J. geophys. Res. , 88(B4), 3476–3484.\nGoogle ScholarCrossRefSearch ADS open URL link  \nFialkowski L.T. Collins M.D. Kuperman W.A. Perkins J.S. Kelly L.J. Larsson A. Fawcett J.A. Hall L.H., 2000. Matched-field processing using measured replica fields, J. acoust. Soc. Am. , 107(2), 739–746.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nGaragash D.I. Germanovich L.N., 2012. Nucleation and arrest of dynamic slip on a pressurized fault, J. geophys. Res. , 117, B10310, doi:10.1029/2012JB009209.\nGoogle ScholarCrossRefSearch ADS open URL link  \nGibbons S.J. Ringdal F., 2009. Detection and analysis of near-surface explosions on the Kola Peninsula, Pure appl. Geophys. , 167(4–5), 413–436.\nGomberg J. Davis S., 1996. Stress/strain changes and triggered seismicity at the Geysers, California, J. geophys. Res. , 101, 733–750.\nGoogle ScholarCrossRefSearch ADS open URL link  \nGomberg J. Agnew D.C. Schwartz S.Y., 2016. Alternative source models of very low frequency events, J. geophys. Res. , 121(9), 6722–6740.\nGoogle ScholarCrossRefSearch ADS open URL link  \nHarrington R.M. Brodsky E.E., 2007. Volcanic hybrid earthquakes that are brittle-failure events, Geophys. Res. Lett. , 34, L06308, doi:10.1029/2006GL028714.\nGoogle ScholarCrossRefSearch ADS open URL link  \nHarris F.J., 1978. Use of windows for harmonic analysis with discrete Fourier transform, Proc. IEEE , 66(1), 51–83.\nGoogle ScholarCrossRefSearch ADS open URL link  \nHarris D.B. Kvaerna T., 2010. Superresolution with seismic arrays using empirical matched field processing, Geophys. J. Int. , 182(3), 1455–1477.\nGoogle ScholarCrossRefSearch ADS open URL link  \nHill D.P. Prejean S.G., 2007. Dynamic triggering, in Treatise on Geophysics , Earthquake Seismology , vol. 4, p. 6054, eds Kanamori H. Schubert G., Elsevier.\nHill D.P. et al, 1993. Seismicity remotely triggered by the magnitude 7.3 Landers, California, earthquake, Science , 260, 1617–1623.\nGoogle ScholarCrossRefSearch ADS open URL link  \nHotovec A.J. Prejean S.G. Vidale J.E. Gomberg J., 2013. Strongly gliding harmonic tremor during the 2009 eruption of Redoubt Volcano, J. Volcanol. Geotherm. Res. , 259, 89–99.\nGoogle ScholarCrossRefSearch ADS open URL link  \nIde S. Shelly D.R. Beroza G.C., 2007. Mechanism of deep low frequency earthquakes: further evidence that deep non-volcanic tremor is generated by shear slip on the plate interface, Geophys. Res. Lett. , 34(3), L03308, doi:10.1029/2006GL028890.\nIshii M. Shearer P.M. Houston H. Vidale J.E., 2007. Teleseismic P wave imaging of the 26 December 2004 Sumatra-Andaman and 28 March 2005 Sumatra earthquake ruptures using the Hi-net array, J. geophys. Res. , 112, B11307, doi:10.1029/2006JB004700.\nGoogle ScholarCrossRefSearch ADS open URL link  \nIverson R.M. et al, 2006. Dynamics of seismogenic volcanic extrusion at Mount St Helens in 2004–05, Nature , 444(7118), 439–443.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nJohnston M.J.S. Borcherdt R.D. Linde A.T. Gladwin M.T., 2006. Continuous borehole strain and pore pressure in the near field of the 28 September 2004 M 6.0 Parkfield, California, earthquake: implications for nucleation, fault response, earthquake prediction, and tremor, Bull. seism. Soc. Am. , 96(4B), S56–S72.\nGoogle ScholarCrossRefSearch ADS open URL link  \nKato A. Obara K. Igarashi T. Tsuruoka H. Nakagawa S. Hirata N., 2012. Propagation of slow slip leading up to the 2011 Mw 9.0 Tohoku-Oki earthquake, Science , 335(6069), 705 –708.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nKoehler R.D. Farrell R.-E. Burns P.A.C. Combellick R.A., 2012. Quaternary Faults and Folds in Alaska: A Digital Database , Alaska Division of Geological \u0026 Geophysical Surveys, p. 141.\nKrolik J.L., 1992. Matched-field minimum variance beamforming in a random ocean channel, J. acoust. Soc. Am. , 92(3), 1408–1419.\nGoogle ScholarCrossRefSearch ADS open URL link  \nLahr J.C. Chouet B.A. Stephens C.D. Power J.A. Page R.A., 1994. Earthquake classification, location, and error analysis in a volcanic environment: implications for the magmatic system of the 1989–1990 eruptions at redoubt volcano, Alaska, J. Volcanol. Geotherm. Res. , 62(1–4), 137–151.\nGoogle ScholarCrossRefSearch ADS open URL link  \nLapusta N. Rice J.R., 2003. Nucleation and early seismic propagation of small and large events in a crustal earthquake model, J. geophys. Res. , 108(B4), 2205, doi:10.1029/2001JB000793.\nGoogle ScholarCrossRefSearch ADS open URL link  \nLatour S. Schubnel A. Nielsen S. Madariaga R. Vinciguerra S., 2013. Characterization of nucleation during laboratory earthquakes, Geophys. Res. Lett. , 40(19), 5064–5069.\nGoogle ScholarCrossRefSearch ADS open URL link  \nLindseth R.O., 1968. Vibroseis, in Digital Processing of Geophysical Data—A Review , pp. 7.1–7.14, Society of Exploration Geophysicists.\nMcLaskey G.C. Kilgore B.D., 2013. Foreshocks during the nucleation of stick-slip instability, J. geophys. Res. , 118(6), 2982–2997.\nGoogle ScholarCrossRefSearch ADS open URL link  \nMcLaskey G.C. Lockner D.A., 2014. Preslip and cascade processes initiating laboratory stick slip, J. geophys. Res. , 119(8), 6323–6336.\nGoogle ScholarCrossRefSearch ADS open URL link  \nMeng L. Inbal A. Ampuero J.-P., 2011. A window into the complexity of the dynamic rupture of the 2011 Mw 9 Tohoku-Oki earthquake, Geophys. Res. Lett. , 38, L00G07, doi:10.1029/2011GL048118.\nGoogle ScholarCrossRefSearch ADS open URL link  \nMori J. Frankel A., 1990. Source parameters for small events associated with the 1986 North Palm Springs, California, earthquake determined using empirical Green functions, Bull. seism. Soc. Am. , 80(2), 278–295.\nMueller C.S., 1985. Source pulse enhancement by deconvolution of an empirical Green’s function, Geophys. Res. Lett. , 12(1), 33–36.\nGoogle ScholarCrossRefSearch ADS open URL link  \nNadeau R.M. McEvilly T.V., 1999. Fault slip rates at depth from recurrence intervals of repeating microearthquakes, Science , 285(5428), 718–721.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nNeuberg J. Luckett R. Baptie B. Olsen K., 2000. Models of tremor and low-frequency earthquake swarms on Montserrat, J. Volcanol. Geotherm. Res. , 101(1–2), 83–104.\nGoogle ScholarCrossRefSearch ADS open URL link  \nNeuberg J.W. Tuffen H. Collier L. Green D. Powell T. Dingwell D., 2006. The trigger mechanism of low-frequency earthquakes on Montserrat, J. Volcanol. Geotherm. Res. , 153(1–2), 37–50.\nGoogle ScholarCrossRefSearch ADS open URL link  \nNoda H. Nakatani M. Hori T., 2013a. Large nucleation before large earthquakes is sometimes skipped due to cascade-up—implications from a rate and state simulation of faults with hierarchical asperities, J. geophys. Res. , 118(6), 2924–2952.\nGoogle ScholarCrossRefSearch ADS open URL link  \nNoda H. Nakatani M. Hori T., 2013b. A slower fault may produce a smaller preseismic moment rate: Non-1/tf acceleration of moment rate during nucleation and dependency on the background slip rate, Geophys. Res. Lett. , 40(18), 4850–4854.\nGoogle ScholarCrossRefSearch ADS open URL link  \nOhnaka M., 1992. Earthquake source nucleation: a physical model for short-term precursors, Tectonophysics , 211, 149–178.\nGoogle ScholarCrossRefSearch ADS open URL link  \nOhnaka M., 2000. A physical scaling relation between the size of an earthquake and its nucleation zone size, Pure appl. Geophys. , 157, 2259–2282.\nGoogle ScholarCrossRefSearch ADS open URL link  \nOhnaka M. Shen L.-F., 1999. Scaling of the shear rupture process from nucleation to dynamic propagation: implications of geometric irregularity of the rupturing surfaces, J. geophys. Res. , 104, 817–844.\nGoogle ScholarCrossRefSearch ADS open URL link  \nPeng Y. Rubin A.M. Bostock M.G. Armbruster J.G., 2015. High-resolution imaging of rapid tremor migrations beneath southern Vancouver Island using cross-station cross correlations, J. geophys. Res. , 120(6), 4317–4332.\nGoogle ScholarCrossRefSearch ADS open URL link  \nPeng Z. Zhao P., 2009. Migration of early aftershocks following the 2004 Parkfield earthquake, Nat. Geosci. , 2(12), 877–881.\nGoogle ScholarCrossRefSearch ADS open URL link  \nPercival D.B. Walden A.T., 1993. Spectral Analysis for Physical Applications , 1st edn, Cambridge Univ. Press.\nPowell T.W. Neuberg J., 2003. Time dependent features in tremor spectra, J. Volcanol. Geotherm. Res. , 128(1–3), 177–185.\nGoogle ScholarCrossRefSearch ADS open URL link  \nRatchkovski N.A. Hansen R.A., 2002. New constraints on tectonics of interior Alaska: earthquake locations, source mechanisms, and stress regime, Bull. seism. Soc. Am. , 92(3), 998–1014.\nGoogle ScholarCrossRefSearch ADS open URL link  \nRichards-Dinger K. Stein R.S. Toda S., 2010. Decay of aftershock density with distance does not indicate triggering by dynamic stress, Nature , 467(7315), 583–586.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nRipperger J. Ampuero J.-P. Mai P.M. Giardini D., 2007. Earthquake source characteristics from dynamic rupture with constrained stochastic fault stress, J. geophys. Res. , 112, B04311, doi:10.1029/2006JB004515.\nGoogle ScholarCrossRefSearch ADS open URL link  \nRubin A.M. Ampuero J.P., 2005. Earthquake nucleation on (aging) rate and state faults, J. geophys. Res. , 110, B11312, doi:10.1029/2005JB003686.\nGoogle ScholarCrossRefSearch ADS open URL link  \nRubin A.M. Armbruster J.G., 2013. Imaging slow slip fronts in Cascadia with high precision cross-station tremor locations, Geochem. Geophys. Geosyst. , 14, 5371–5392.\nGoogle ScholarCrossRefSearch ADS open URL link  \nRubinstein S.M. Cohen G. Fineberg J., 2009. Visualizing stick–slip: experimental observations of processes governing the nucleation of frictional sliding, J. Phys. D: Appl. Phys. , 42, 214016, doi:10.1088/0022-3727/42/21/214016.\nGoogle ScholarCrossRefSearch ADS open URL link  \nRydelek P.A. Hass L., 1994. On estimating the amount of blasts in seismic catalogs with Schuster’s method, Bull. seism. Soc. Am. , 84(4), 1256–1259.\nSavard G. Bostock M.G., 2015. Detection and location of low-frequency earthquakes using cross-station correlation, Bull. seism. Soc. Am. , 105(4), 2128–2142.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSchuster A., 1897. On lunar and solar periodicities of earthquakes, Proc. R. Soc. A , 61(369–377), 455–465.\nGoogle ScholarCrossRefSearch ADS open URL link  \nShearer P.M., 2012. Self-similar earthquake triggering, Bath’s law, and foreshock/aftershock magnitudes: simulations, theory, and results for southern California, J. geophys. Res. , 117, B06310, doi:10.1029/2011JB008957.\nGoogle ScholarCrossRefSearch ADS open URL link  \nShelly D.R. Beroza G.C. Ide S., 2007. Non-volcanic tremor and low-frequency earthquake swarms, Nature , 446(7133), 305–307.\nGoogle ScholarCrossRefSearch ADS open URL link PubMed \nSlepian D., 1976. On bandwidth, Proc. IEEE , 64(3), 292–300.\nGoogle ScholarCrossRefSearch ADS open URL link  \nSweet J.R. Creager K.C. Houston H., 2014. A family of repeating low-frequency earthquakes at the downdip edge of tremor and slip, Geochem. Geophys. Geosyst. , 15(9), 3713–3721.\nGoogle ScholarCrossRefSearch ADS open URL link  \nTanaka S. Ohtake M. Sato H., 2002. Evidence for tidal triggering of earthquakes as revealed from statistical analysis of global data, J. geophys. Res. , 107(B10), 2211, doi:10.1029/2001JB001577.\nGoogle ScholarCrossRefSearch ADS open URL link  \nTape C. West M. Silwal V. Ruppert N., 2013. Earthquake nucleation and triggering on an optimally oriented fault, Earth planet. Sci. Lett. , 363, 231–241.\nGoogle ScholarCrossRefSearch ADS open URL link  \nThomson D.J., 1982. Spectrum estimation and harmonic analysis, Proc. IEEE , 70(9), 1055–1096.\nGoogle ScholarCrossRefSearch ADS open URL link  \nTyapkin Y. Ursin B., 2005. Optimum stacking of seismic records with irregular noise, J. Geophys. Eng. , 2(3), 177–187.\nGoogle ScholarCrossRefSearch ADS open URL link  \nUSGS , 2015. USGS NED 2 arc-second DEM ArcGrid 2015 , Tech. rep., Reston, VA.\nVelasco A.A. Ammon C.J. Lay T., 1994. Empirical green function deconvolution of broadband surface waves: rupture directivity of the 1992 Landers, California (Mw = 7.3), earthquake, Bull. seism. Soc. Am. , 84(3), 735–750.\nWaldhauser F. Schaff D.P., 2008. Large-scale relocation of two decades of Northern California seismicity using cross-correlation and double-difference methods, J. geophys. Res. , 113, B08311, doi:10.1029/2007JB005479.\nGoogle ScholarCrossRefSearch ADS open URL link  \nWang J.Templeton D.C. Harris D.B., 2015. Discovering new events beyond the catalogue—application of empirical matched field processing to Salton Sea geothermal field seismicity, Geophys. J. Int. , 203(1), 22–32.\nGoogle ScholarCrossRefSearch ADS open URL link  \nYagi Y. Nakao A. Kasahara A., 2012. Smooth and rapid slip near the Japan Trench during the 2011 Tohoku-oki earthquake revealed by a hybrid back-projection method, Earth planet. Sci. Lett. , 355–356, 94–101.\nGoogle ScholarCrossRefSearch ADS open URL link"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"J.C. Hawthorne, J.-P. Ampuero; A phase coherence approach to identifying co-located earthquakes and tremor. Geophys J Int 2017; 209 (2): 623-642. doi: 10.1093/gji/ggx012","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"EAR-1015698"},{"agency":"Caltech Division of Geological and Planetary Sciences","grant_number":""},{"agency":"Southern California Earthquake Center (SCEC)","grant_number":""},{"agency":"NSF","grant_number":"EAR-82081033462"},{"agency":"USGS","grant_number":"G12AC20038"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Seismological Laboratory"]}