{"title":"Dynamic Rupture Simulations Based on the Characterized Source Model of the 2011 Tohoku Earthquake","uri":"","abstract":"The 2011 Off the Pacific Coast of Tohoku earthquake (Tohoku earthquake, M_w 9.0) occurred on the Japan Trench and caused a devastating tsunami. Studies of this earthquake have revealed complex features of its rupture process. In particular, the shallow parts of the fault (near the trench) hosted large slip and long period seismic wave radiation, whereas the deep parts of the rupture (near the coast) hosted smaller slip and strong radiation of short period seismic waves. Understanding such depth-dependent feature of the rupture process of the Tohoku earthquake is necessary as it may occur during future mega-thrust earthquakes in this and other regions. In this study, we investigate the “characterized source model” of the Tohoku earthquake through dynamic rupture simulations. This source model divides the fault plane into several parts characterized by different size and frictional strength (main asperity, background area, etc.) and is widely used in Japan for the prediction of strong ground motion and tsunami through kinematic rupture simulations. Our characterized source model of the Tohoku earthquake comprises a large shallow asperity with moderate frictional strength, small deep asperities with high frictional strength, a background area with low frictional strength, and an area with dynamic weakening close to the trench (low dynamic friction coefficient as arising from, e.g., thermal pressurization). The results of our dynamic rupture simulation reproduce the main depth-dependent feature of the rupture process of the Tohoku earthquake. We also find that the width of the area close to the trench (equal to the distance from the trench to the shallow asperity, interpreted as the size of the accretionary prism) and the presence of dynamic weakening in this area have a significant influence on the final slip distribution. These results are useful to construct characterized source models for other subduction zones with different scale of the accretionary prism, such as the Chile subduction zone and the Nankai Trough. Dynamic rupture simulations based on the characterized source model might provide useful insights for hazard assessment associated with future mega-thrust earthquakes.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251976","docid":251976,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255706","fileid":1255706,"datasetid":"document","objectid":251976,"filename":"art%3A10.1007%2Fs00024-016-1446-1.pdf","mime_type":"application/pdf","hash":"cffb09e9d4a4e5d4702018a5e1f3a2de","hash_type":"MD5","filesize":2747169,"mtime":"2017-05-09 21:06:28","url":"http://authors.library.caltech.edu/77311/1/art%253A10.1007%252Fs00024-016-1446-1.pdf"}],"eprintid":77311,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"art%3A10.1007%2Fs00024-016-1446-1.pdf","content":"inpress"}],"note":"© 2017 The Author(s). This article is distributed under the terms of the Creative Commons Attribution 4.0 International License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium, provided you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. \n\nReceived: 31 July 2016; Revised: 10 November 2016; Accepted: 28 November 2016. First Online: 11 January 2017. \n\nDiscussions with Prof. Kelin Wang and David Oglesby helped improve the draft. We also appreciated very constructive comments by Dr. Luis Dalguer (guest editor) and two anonymous reviewers to elaborate the manuscript.","id":77311,"rev_number":7,"userid":18,"eprint_dir":"disk0/00/07/73/11","datestamp":"2017-05-12 23:22:44","lastmod":"2017-05-12 23:22:44","status_changed":"2017-05-12 23:22:44","type":"article","metadata_visibility":"show","creators":[{"given":"Kenichi","family":"Tsuda","id":"Tsuda-Kenichi","orcid":""},{"given":"Satoshi","family":"Iwase","id":"Iwase-Satoshi","orcid":""},{"given":"Hiroaki","family":"Uratani","id":"Uratani-Hiroaki","orcid":""},{"given":"Sachio","family":"Ogawa","id":"Ogawa-Sachio","orcid":""},{"given":"Takahide","family":"Watanabe","id":"Watanabe-Takahide","orcid":""},{"given":"Jun’ichi","family":"Miyakoshi","id":"Miyakoshi-Jun-ichi","orcid":""},{"given":"Jean Paul","family":"Ampuero","id":"Ampuero-J-P","orcid":"0000-0002-4827-7987"}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"The 2011 Off the Pacific Coast of Tohoku earthquake; characterized source model;  dynamic rupture simulations; dynamic weakening; accretionary prism","date":"2017-01-11","date_type":"inpress","publication":"Pure and Applied Geophysics","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170509-140621134","refereed":true,"issn":"0033-4553 ","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170509-140621134","related_url":[{"url":"http://dx.doi.org/10.1007/s00024-016-1446-1","type":"doi","description":"Article"},{"url":"http://link.springer.com/article/10.1007%2Fs00024-016-1446-1","type":"pub","description":"Article"},{"url":"http://rdcu.be/rYnf","type":"pub","description":"Free ReadCube access"}],"referencetext":["\nBilek, S. L. (2010). The role of subduction erosion on seismicity. Geology, 38, 479–480.\nCrossRefGoogle Scholar\n\n\nBletery, Q., Sladen, A., Delouis, B., Vallée, M., Nocquet, J. M., Rolland, L., et al. (2014). A detailed source model for the Mw9.0 Tohoku-Oki earthquake reconciling geodesy, seismology and tsunami records. Journal Geophysical Research, 119, 7636–7653. doi:10.1002/2014JB011261.\nGoogle Scholar\n\n\nBrown, L., Wang, K., \u0026 Sun, T. (2016). Static stress drop in the Mw 9 Tohoku-oki earthquake: Heterogeneous distribution and low average value. Geophysical Research Letters, 42, 10595–10600. doi:10.1002/2015GL066361.\nCrossRefGoogle Scholar\n\n\nCabinet Office of Japan (2011). Interim report of the source model study meeting of the giant earthquake along the Nankai Trough. http://www.bousai.go.jp/jishin/nankai/model/pdf/chukan_matome.pdf. Accessed 20 July 2016 (in Japanese).\n\n\nCabinet Office of Japan (2015). Report of the long-period ground motion study meeting of of the giant earthquake along the Nankai Trough. http://www.bousai.go.jp/jishin/nankai/nankaitrough_report.html. Accessed 20 July 2016 (in Japanese).\n\n\nDunham, E. M. (2007). Conditions governing the occurrence of supershear ruptures under slip-weakening friction. Journal Geophysical Research, 112, B07302. doi:10.1029/2006JB004717.\nCrossRefGoogle Scholar\n\n\nFujiwara, T., Kodaira, S., No, T., Kaiho, Y., Takahashi, N., \u0026 Kaneda, Y. (2011). The 2011 Tohoku-Oki earthquake: Displacement reaching the trench axis. Science, 334, 1240. doi:10.1126/science.1211554.\nCrossRefGoogle Scholar\n\n\nFulton, P. M., Brodsky, E. E., Kano, Y., Mori, J., Chester, F., Ishikawa, T., et al. (2013). Low coseismic friction on the Tohoku-Oki fault determined from temperature measurements. Science, 342, 1214–1217. doi:10.1126/science.1243641.\nCrossRefGoogle Scholar\n\n\nGalis, M., Pelties, C., Kristek, J., Moczo, P., Ampuero, J. P., \u0026 Mai, P. M. (2015). On the initiation of sustained slip-weakening ruptures by localized stresses. Geophysical Journal International, 200(2), 890–909.\nCrossRefGoogle Scholar\n\n\nGalvez, P., Ampuero, J. P., Dalguer, L. A., Somala, S. N., \u0026 Nissen-Meyer, T. F. (2014). Dynamic earthquake rupture modelled with an unstructured 3-D spectral element method applied to the 2011 M9 Tohoku earthquake. Geophysical Journal International, 198(2), 1222–1240.\nCrossRefGoogle Scholar\n\n\nGalvez, P., Dalguer, L. A., Ampuero, J. P., \u0026 Giardini, D. (2016). Slip reactivation during the 2011 Mw 9.0 Tohoku earthquake: Dynamic rupture and ground motion simulations. Bulletin of the Seismological Society of America, 106(3), 819–831. doi:10.1785/0120150153.\nCrossRefGoogle Scholar\n\n\nHasegawa, A. (2015). What happened in the source area of the 2011 Tohoku-Oki earthquake?—the mechanism of the Tohoku-Oki earthquake. Earthquake Journal, 60, 2–15. (in Japanese).\nGoogle Scholar\n\n\nHashimoto, C., Noda, A., \u0026 Matsu'ura, M. (2012). The M w 9.0 northeast Japan earthquake: total rupture of a basement asperity. Geophysical Journal International, 189(1), 1–5. doi:10.1111/j.1365-246X.2011.05368.x.\nCrossRefGoogle Scholar\n\n\nHirono, T., Tsuda, K., Tanikawa, W., Ampuero, J. P., Shibazaki, B., Kinoshita, M., et al. (2016). Near-trench slip potential of megaquakes evaluated from fault properties and conditions. Scientific Reports, 6, 28184. doi:10.1038/srep28184.\nCrossRefGoogle Scholar\n\n\nHu, Y., \u0026 Wang, K. (2008). Coseismic strengthening of the shallow portion of the subduction fault and its effects on wedge taper. Journal Geophysical Research, 113, B12411. doi:10.1029/2008JB005724.\nCrossRefGoogle Scholar\n\n\nHuang, Y., Ampuero, J. P., \u0026 Kanamori, H. (2014). Slip-weakening models of the 2011 Tohoku-Oki earthquake and constraints on stress drop and fracture energy. Pure and Applied Geophysics, 171(10), 2555–2568. doi:10.1007/s00024-013-0718-2.\nCrossRefGoogle Scholar\n\n\nHuang, Y., Meng, L., \u0026 Ampuero, J. P. (2012). A dynamic model of the frequency-dependent rupture process of the 2011 Tohoku-Oki earthquake. Earth, Planets and Space, 64(12), 1061–1066. doi:10.5047/eps.2012.05.011.\nCrossRefGoogle Scholar\n\n\nIda, Y. (1972). Cohesive force across the tip of a longitudinal-shear crack and Griffith’s specific surface energy. Journal Geophysical Research, 77, 3796–3805.\nCrossRefGoogle Scholar\n\n\nIde, S., \u0026 Aochi, H. (2013). Historical seismicity and dynamic rupture process of the 2011 Tohoku-Oki earthquake. Tectonophysics, 600, 1–13. doi:10.1016/j.tecto.2012.10.018.\nCrossRefGoogle Scholar\n\n\nIinuma, T., Hino, R., Kido, M., Inazu, D., Osada, Y., Ito, Y., et al. (2012). Coseismic slip distribution of the 2011 off the Pacific Coast of Tohoku Earthquake (M9.0) refined by means of seafloor geodetic data. Journal Geophysical Research, 117, B07409. doi:10.1029/2012JB009186.\nCrossRefGoogle Scholar\n\n\nIrikura, K., \u0026 Miyake, H. (2001). Prediction of strong ground motions for scenario earthquake. Journal of Geography, 110, 849–875. (in Japanese with English abstract).\nCrossRefGoogle Scholar\n\n\nIrikura, K., \u0026 Miyake, H. (2011). Recipe for predicting strong ground motion from crustal earthquake scenarios. Pure and Applied Geophysics, 168, 85–104. doi:10.1007/s00024-010-0150-9.\nCrossRefGoogle Scholar\n\n\nIrikura, K, Miyake, H., Iwata, T., Kamae, K., Kawabe, H., Dalguer, L.A. (2004). Recipe for predicting strong ground motions from future large earthquakes. In 13th world conference of earthquake engineering, Vancouver, Canada.\n\n\nIto, A., Fujie, G., Miura, S., Kodaira, S., Kaneda, Y., \u0026 Hino, R. (2005). Bending of the subducting oceanic plate and its implication for rupture propagation of large interplate earthquakes off Miyagi, Japan, in the Japan Trench subduction zone. Geophysical Reseach Letters, 32, L05310. doi:10.1029/2004GL022307.\nGoogle Scholar\n\n\nKaneko, Y., \u0026 Lapusta, N. (2010). Supershear transition due to a free surface in 3-D simulations of spontaneous dynamic rupture on vertical strike-slip faults. Tectonophysics, 493, 272–284. doi:10.1016/j.tecto.2010.06.015.\nCrossRefGoogle Scholar\n\n\nKoper, K. D., Hutko, A. R., Lay, T., Ammon, C. J., \u0026 Kanamori, H. (2011). Frequency dependent rupture process of the 2011 Mw 9.0 Tohoku Earthquake: Comparison of short-period P wave back-projection images and broadband seismic rupture models. Earth, Planets and Space, 63, 599–602. doi:10.5047/eps.2011.05.026.\nCrossRefGoogle Scholar\n\n\nKurahashi, S., \u0026 Irikura, K. (2013). Short-period source model of the 2011 Mw9.0 Off the Pacific Coast of Tohoku earthquake. Bulletin of the Seismological Society of America, 103(2B), 1373–1393.\nCrossRefGoogle Scholar\n\n\nLay, T., Kanamori, H., Ammon, C. J., Koper, K. D., Hutko, A. R., Ye, L., et al. (2012). Depth-varying rupture properties of subduction zone megathrust faults. Journal Geophysical Research, 117, B04311. doi:10.1029/2011JB009133.\nCrossRefGoogle Scholar\n\n\nMeng, L., Inbal, A., \u0026 Ampuero, J. P. (2011). A window into the complexity of the dynamic rupture of the 2011 Mw 9 Tohoku-Oki earthquake. Geophysical Research Letters, 38, L00G07. doi:10.1029/2011GL04811.\nCrossRefGoogle Scholar\n\n\nMiura, S., Takahashi, N., Nakanishi, A., Tsuru, T., Kodaira, S., \u0026 Kaneda, Y. (2005). Structural characteristics off Miyagi forearc region, the Japan Trench seismogenic zone, deduced from a wide-angle reflection and refraction study. Tectonophysics, 407, 165–188.\nCrossRefGoogle Scholar\n\n\nNakanishi, A., Kodaira, S., Park, J. O., \u0026 Kaneda, Y. (2003). The relation between the source area of mega-thrust earthquake of the Nankai Trough and the distribution of back-strap. The Monthly Earth, 41, 126–134. (in Japanese).\nGoogle Scholar\n\n\nObana, K., Kodaira, S., Shinohara, M., Hino, R., Uehira, K., Shiobara, H., et al. (2013). Aftershocks near the updip end of the 2011 Tohoku-Oki earthquake. Earth and Planetary Science Letters, 382, 111–116. doi:10.1016/j.epsl.2013.09.007.\nCrossRefGoogle Scholar\n\n\nRice, J. R. (1993). Spatio-temporal complexity of slip on a fault. Journal Geophysical Research, 93, 9885–9907.\nCrossRefGoogle Scholar\n\n\nSun, T., Wang, K., Fujiwara, T., Kodaira, S., He, J. (2016). Large fault slip peaking at trench in the 2011 Tohoku-Oki earthquake. Nature Communications (accepted for publication).\n\n\nSuzuki, W., Aoi, S., Sekiguchi, H., \u0026 Kunugi, T. (2011). Rupture process of the 2011 Tohoku-Oki mega-thrust earthquake (M9.0) inverted from strong-motion data. Geophysical Research Letters, 38, L00G16. doi:10.1029/2011GL049136.\nGoogle Scholar\n\n\nTajima, F., Mori, J., \u0026 Kennett, B. L. N. (2013). A review of the 2011 Tohoku-Oki earthquake (Mw 9.0): Large-scale rupture across heterogeneous plate coupling. Tectonophysics, 586, 15–34. doi:10.1016/j.tecto.2012.09.014.\nCrossRefGoogle Scholar\n\n\nTsuru, T., Park, J.-O., Miura, S., Kodaira, S., Kido, Y., \u0026 Hayashi, T. (2002). Along-arc structural variation of the plate boundary at the Japan Trench margin: Implication of interplate coupling. Journal Geophysical Research, 107, 357. doi:10.1029/2001JB001664.\nCrossRefGoogle Scholar\n\n\nUjiie, K., Tanaka, H., Saito, T., Tsutsumi, A., Mori, J., Kameda, J., et al. (2013). Low coseismic shear stress on the Tohoku-Oki megathrust determined from laboratory experiments. Science, 342, 1211–1214. doi:10.1126/science.1243485.\nCrossRefGoogle Scholar\n\n\nWang, K. (2013). Megathrust surprises. Nature Geoscience, 6, 11–12. doi:10.1038/ngeo1682.\nCrossRefGoogle Scholar\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Tsuda, K., Iwase, S., Uratani, H. et al. Pure Appl. Geophys. (2017). doi:10.1007/s00024-016-1446-1","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Seismological Laboratory"]}