{"title":"Upper limit on damage zone thickness controlled by seismogenic depth","uri":"","abstract":"The thickness of fault damage zones, a characteristic length of the cross-fault distribution of secondary fractures, significantly affects fault stress, earthquake rupture, ground motions and crustal fluid transport. Field observations indicate that damage zone thickness scales with\naccumulated fault displacement at short displacements, but saturates at few hundred meters for displacements larger than few kilometers. To explain this transition of scaling behavior, we conduct 3D numerical simulations of dynamic rupture with off-fault inelastic deformation on long strike-slip faults. We find that the distribution of coseismic inelastic strain is controlled by the transition from crack-like to pulse-like rupture propagation associated with saturation of the seismogenic depth. The yielding zone reaches its maximum thickness when the rupture becomes\na stable pulse-like rupture. Considering fracture mechanics theory, we show that seismogenic depth controls the upper bound of damage zone thickness on mature faults by limiting the efficiency of stress concentration near earthquake rupture fronts. We obtain a quantitative relation between limiting damage zone thickness, background stress, dynamic fault strength, off fault yield strength and seismogenic depth, which agrees with first-order field observations. Our results help linking dynamic rupture processes with field observations, and contribute to a fundamental understanding of damage zone properties.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251978","docid":251978,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255722","fileid":1255722,"datasetid":"document","objectid":251978,"filename":"Ampuero Mao 2016.pdf","mime_type":"application/pdf","hash":"2780fa73b45142bf3e8b1453c0f6534e","hash_type":"MD5","filesize":1328294,"mtime":"2017-05-09 21:23:11","url":"http://authors.library.caltech.edu/77313/1/Ampuero%20Mao%202016.pdf"}],"eprintid":77313,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Ampuero Mao 2016.pdf","content":"accepted"}],"note":"© 2017 John Wiley \u0026 Sons, Inc. \n\nThis work was supported by the Southern California Earthquake Center (funded by NSF Cooperative Agreement EAR-1033462 and USGS Cooperative Agreement G12AC20038) and by the National Science Foundation (CAREER award EAR-1151926). We thank Yoshihiro Kaneko for sharing his version of the SPECFEM3D code modified for the SCEC TPV27 benchmark, and Steve Day and an anonymous reviewer for their stimulating comments.","id":77313,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/73/13","datestamp":"2017-05-12 22:31:58","lastmod":"2017-05-12 22:31:58","status_changed":"2017-05-12 22:31:58","type":"book_section","metadata_visibility":"show","creators":[{"given":"Jean Paul","family":"Ampuero","id":"Ampuero-J-P","orcid":"0000-0002-4827-7987"},{"given":"Xiaolin","family":"Mao","id":"Mao-Xiaolin","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"Damage zone; Seismogenic depth; Pulse-like rupture; Fracture; Strike-slip fault","date":"2017-07","date_type":"inpress","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170509-142306720","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170509-142306720","related_url":[{"url":"http://www.wiley.com/WileyCDA/WileyTitle/productCd-1119156882.html","type":"pub","description":"Book Table of Contents"}],"referencetext":["Andrews, D. J. (1976a), Rupture propagation with finite stress in antiplane strain, J. Geophys.\n380 Res., 81 (20), 3575-3582.\n381 Andrews, D. J. (1976b), Rupture velocity of plane strain shear cracks, J. Geophys. Res.,\n382 81(32), 5679–5687, doi:10.1029/JB081i032p05679.\n383 Andrews, D. J. (2005), Rupture dynamics with energy loss outside the slip zone, J. Geophys.\n384 Res., 110, B01307, doi:10.1029/2004JB003191.\n385 Beeler, N. M., and T. E. Tullis (1996), Self-healing slip pulses in dynamic rupture models due\n386 to velocity-dependent strength, Bull. Seismol. Soc. Am., 86(4), 1130–1148.\n387 Ben-Zion, Y., and J.-P. Ampuero (2009), Seismic radiation from regions sustaining material\n388 damage, Geophys. J. Int., 178(3), 1351-1356, doi: 10.1111/j.1365-246X.2009.04285.x.\n389 Ben-Zion, Y., and Z. Shi (2005), Dynamic rupture on a material interface with spontaneous\n390 generation of plastic strain in the bulk, Earth Planet. Sci. Lett., 236, 486–496,\n391 doi:10.1016/j.epsl.2005.03.025.\nBeroza, G. C., and T. Mikumo (1996), Short slip duration in dyna 392 mic rupture in the presence\n393 of heterogeneous fault properties, J. Geophys. Res., 101(B10), 22,449–22,460,\n394 doi:10.1029/96JB02291.\n395 Cappa, F., Perrin, C., Manighetti, I., Delor, E. (2014), Off-fault\nlong-term damage: A\n396 condition to account for generic, triangular earthquake slip profiles, Geochem. Geophys. Geosys.,\n397 15, 1476–1493, doi:10.1002/2013GC005182.\n398 Das, S., and K. Aki (1977), A numerical study of two-dimensional spontaneous rupture\n399 propagation, Geophys. J. R. Astron. Soc., 50(3), 643–668, doi.10.1111/j.1365-\n400 246X.1977.tb01339.x.\n401 Day, S. M. (1982), Three-dimensional finite difference simulation of fault dynamics:\n402 Rectangular faults with fixed rupture velocity, Bull. Seismol. Soc. Am., 72(3), 705–727.\n403 Drucker, D. C., and W. Prager (1952), Soil mechanics and plastic analysis or limit design, Q.\n404 Appl. Math., 10, 157–165.\n405 Duan, B., and S. M. Day (2008), Inelastic strain distribution and seismic radiation from\n406 rupture of a fault kink, J. Geophys. Res., 113, B12311, doi:10.1029/2008JB005847.\n407 Eshelby, J. D. (1957), The determination of the elastic field of an elliptical inclusion, and\n408 related problems, Proc. R. Soc. London, 241, 376–396.\n409 Fang, Z. and E. M. Dunham (2013), Additional shear resistance from fault roughness and\n410 stress levels on geometrically complex faults, J. Geophys. Res., 118(7), 3642-3654,\n411 doi:10.1002/jgrb.50262\n412 Faulkner, D. R., T. M. Mitchell, D. Healy, and M. J. Heap (2006), Slip on 'weak' faults by the\n413 rotation of regional stress in the fracture damage zone, Nature, 444, 922-925,\n414 doi:10.1038/nature05353.\nGabriel, A. A., J. P. Ampuero, L. A. Dalguer and P. M. Mai 415 (2013), Source properties of\n416 dynamic rupture pulses with off-fault plasticity, J. Geophys. Res., 118 (8), 4117-4126,\n417 doi:10.1002/jgrb.50213.\n418 Galvez, P., J. P. Ampuero, L. A. Dalguer, S. N. Somala and T. F. Nissen-Meyer (2014),\n419 Dynamic earthquake rupture modelled with an unstructured 3-D spectral element method applied\n420 to the 2011 M9 Tohoku earthquake, Geophys. J. Int., 198 (2), 1222-1240,\n421 doi:10.1093/gji/ggu203.\n422 Harris, R. A., et al. (2011), Verifying a computational method for predicting extreme ground\n423 motion, Seis. Res. Let., 82 (5), 638-644, doi:10.1785/gssrl.82.5.638\n424 Heaton, T. H. (1990), Evidence for and implications of self-healing pulses of slip in\n425 earthquake rupture, Phys. Earth Planet. Inter., 64(1), 1–20.\n426 Huang, Y., and J. P. Ampuero (2011), Pulse-like ruptures induced by low-velocity fault\n427 zones, J. Geophys. Res., 116, B12307, doi:10.1029/2011JB008684.\n428 Huang, Y., J. P. Ampuero, and D. V. Helmberger (2014), Earthquake ruptures modulated by\n429 waves in damaged fault zones, J. Geophys. Res. Solid Earth, 119, 3133–3154,\n430 doi:10.1002/2013JB010724.\n431 Huang, Y., J. P. Ampuero and D. V. Helmberger (2015), The potential for supershear\n432 earthquakes in damaged fault zones - Theory and observations, Earth Planet. Sci. Lett., 433, 109-\n433 115, doi:10.1016/j.epsl.2015.10.046.\n434 Johri, M., E. M. Dunham, M. D. Zoback, and Z. Fang (2014a), Predicting fault damage zones\n435 by modeling dynamic rupture propagation and comparison with field observations, J. Geophys.\n436 Res. Solid Earth, 119, 1251–1272, doi:10.1002/2013JB010335.\nJohri, M., M. D. Zoback, and P. Hennings (2014b). A scaling 437 law to characterize fault438\ndamage zones at reservoir depths, AAPG Bull., 98(10), 2057-2079.\n439 Kaneko, Y., N. Lapusta and J. P. Ampuero (2008), Spectral-element modeling of spontaneous\n440 earthquake rupture on rate and state faults: Effect of velocity-strengthening friction at shallow\n441 depths, J. Geophys. Res., 113 (B9), B09317, doi:10.1029/2007JB005553.\n442 Kaneko, Y., J. P. Ampuero and N. Lapusta (2011), Spectral-element simulations of long-term\n443 fault slip: Effect of low-rigidity layers on earthquake-cycle dynamics, J. Geophys. Res., 116,\n444 B10313, doi:10.1029/2011JB008395.\n445 Lehner, F. K., V. C. Li, and J. R. Rice (1981), Stress diffusion along rupturing plate\n446 boundaries, J. Geophys. Res., 86(B7), 6155–6169, doi:10.1029/JB086iB07p06155.\n447 Ma, S., and D. J. Andrews (2010), Inelastic off-fault response and three-dimensional\n448 dynamics of earthquake rupture on a strike-slip fault, J. Geophys. Res., 115, B04304,\n449 doi:10.1029/2009JB006382.\n450 Madariaga, R. (1976), Dynamics of an expanding circular fault, Bull. Seismol. Soc. Am.,\n451 66(3), 639–666.\n452 Madariaga, R., and K. B. Olsen (2000), Criticality of rupture dynamics in 3-D, Pure Appl.\n453 Geophys., 157 (11-12), 1981-2001.\n454 Milliner, C. W., Dolan, J. F., Hollingsworth, J., Leprince, S., Ayoub, F., \u0026 Sammis, C.\n455 (2015), Quantifying near-field and off-fault deformation patterns of the 1992 Mw 7.3 Landers\n456 earthquake, Geochem. Geophys. Geosyst., 16 (5), 1577-1598, doi:10.1002/2014GC005693.\n457 Mitchell, T. M., and D. R. Faulkner (2009), The nature and origin of off-fault damage\n458 surrounding strike-slip fault zones with a wide range of displacements: A field study from the Atacama fault system, northern 459 Chile, J. Struct. Geol., 31, 802–816,\n460 doi:10.1016/j.jsg.2009.05.002.\n461 Mitchell, T. M., and D. R. Faulkner (2012), Towards quantifying the matrix permeability of\n462 fault damage zones in low porosity rocks, Earth Planet. Sci. Lett., 339-340, 24-31.\n463 Perrin, G., J. R. Rice, and G. Zheng (1995), Self-healing slip pulse on a frictional surface, J.\n464 Mech. Phys. Solids, 43(9), 1461–1495.\n465 Perrin, C., I. Manighetti, and Y. Gaudemer (2016a), Off-fault tip splay networks: A genetic\n466 and generic property of faults indicative of their long-term propagation, C. R. Geosci., 348, 52–\n467 60, doi:10.1016/j.crte.2015.05.002.\n468 Perrin, C., I. Manighetti, J. P. Ampuero, F. Cappa and Y. Gaudemer (2016b), Location of\n469 largest earthquake slip and fast rupture controlled by along-strike change in fault structural\n470 maturity due to fault growth, J. Geophys. Res., 121 (5), 3666-3685, doi:10.1002/2015JB012671.\n471 Pelties, C., Y. Huang and J. P. Ampuero (2014), Pulse-like rupture induced by three472\ndimensional fault zone flower structures, Pure Appl. Geophys., 172 (5), 1229–1241,\n473 doi:10.1007/s00024-014-0881-0.\n474 Poliakov, A. N., R. Dmowska and J. R. Rice (2002), Dynamic shear rupture interactions with\n475 fault bends and off-axis secondary faulting, J. Geophys. Res., 107 (B11), ESE-6.\n476 Rice, J. R., C. G. Sammis and R. Parsons (2005), Off-fault secondary failure induced by a\n477 dynamic slip pulse, Bull. Seismo. Soc. Am., 95 (1), 109-134.\n478 Savage, H. M., and E. E. Brodsky (2011), Collateral damage: Evolution with displacement of\n479 fracture distribution and secondary fault strands in fault damage zones, J. Geophys. Res., 116,\n480 B03405, doi:10.1029/2010JB007665.\nScholz, C. H., N. H. Dawers, J. Z. Yu, M. H. Anders, 481 and P. A. Cowie (1993), Fault growth\n482 and fault scaling laws: preliminary results. J. Geophys. Res., 98 (B12), 21951-21961.\n483 Shi, Z., and S. M. Day (2013), Rupture dynamics and ground motion from 3-D rough-fault\n484 simulations, J. Geophys. Res., 118, 1122–1141, doi:10.1002/jgrb.50094.\n485 Spudich, P., and K. Olsen (2001), Fault zone amplified waves as a possible seismic hazard\n486 along the Calaveras fault in central California, Geophys. Res. Lett., 28 (13), 2533–2536,\n487 doi:10.1029/2000GL011902.\n488 Templeton, E. L., and J. R. Rice (2008), Off‐fault plasticity and earthquake rupture dynamics:\n489 1. Dry materials or neglect of fluid pressure changes, J. Geophys. Res., 113 (B9), B09306,\n490 doi:10.1029/2007JB005529.\n491 Xu, S., Y. Ben-Zion, and J. P. Ampuero (2012a), Properties of inelastic yielding zones\n492 generated by in-plane dynamic ruptures-I. Model description and basic results, Geophys. J. Int.,\n493 191(3), 1325–1342, doi:10.1111/j.1365-246X.2012.05679.x.\n494 Xu, S., Y. Ben-Zion, and J. P. Ampuero (2012b), Properties of inelastic yielding zones\n495 generated by in-plane dynamic ruptures-II. Detailed parameter-space study, Geophys. J. Int.,\n496 191(3), 1343-1360, doi:10.1111/j.1365-246X.2012.05685.x.\n497 Xu, S., Y. Ben-Zion, J. P. Ampuero and V. Lyakhovsky (2014), Dynamic ruptures on a\n498 frictional interface with off-fault brittle damage: Feedback mechanisms and effects on slip and\n499 near-fault motion, Pure Appl. Geophys., 172 (5), 1243-1267, doi:10.1007/s00024-014-0923-7."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Ampuero, J., \u0026 Mao, X. (2017). Upper limit on damage zone thickness controlled by seismogenic depth. In Ampuero, J., Mao, X., \u0026 (Eds.), Fault Zone Dynamic Processes: Evolution of Fault Properties During Seismic Rupture, (accepted). http://eu.wiley.com/WileyCDA/WileyTitle/productCd-1119156882.html","other_numbering_system":null,"funders":[{"agency":"Southern California Earthquake Center (SCEC)","grant_number":""},{"agency":"NSF","grant_number":"EAR-1033462"},{"agency":"USGS","grant_number":"G12AC20038"},{"agency":"NSF","grant_number":"EAR-1151926"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Seismological Laboratory"]}