{"title":"Surface Rupture Effects on Earthquake Moment-Area Scaling Relations","uri":"","abstract":"Empirical earthquake scaling relations play a central role in fundamental studies of earthquake physics and in current practice of earthquake hazard assessment, and are being refined by advances in earthquake source analysis. A scaling relation between seismic moment (M_0) and rupture area (A) currently in use for ground motion prediction in Japan features a transition regime of the form M_0–A^2, between the well-recognized small (self-similar) and very large (W-model) earthquake regimes, which has counter-intuitive attributes and uncertain theoretical underpinnings. Here, we investigate the mechanical origin of this transition regime via earthquake cycle simulations, analytical dislocation models and numerical crack models on strike-slip faults. We find that, even if stress drop is assumed constant, the properties of the transition regime are controlled by surface rupture effects, comprising an effective rupture elongation along-dip due to a mirror effect and systematic changes of the shape factor relating slip to stress drop. Based on this physical insight, we propose a simplified formula to account for these effects in M_0–A scaling relations for strike-slip earthquakes.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251975","docid":251975,"rev_number":4,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255693","fileid":1255693,"datasetid":"document","objectid":251975,"filename":"art%3A10.1007%2Fs00024-017-1467-4.pdf","mime_type":"application/pdf","hash":"af19ea274a2b5694a940a4839377dc81","hash_type":"MD5","filesize":4399701,"mtime":"2017-05-09 20:56:34","url":"http://authors.library.caltech.edu/77310/1/art%253A10.1007%252Fs00024-017-1467-4.pdf"}],"eprintid":77310,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"art%3A10.1007%2Fs00024-017-1467-4.pdf","content":"inpress"}],"note":"© 2017 Springer International Publishing. \n\nReceived: 01 August 2016; Revised: 13 December 2016; Accepted: 02 January 2017; First Online: 25 January 2017. \n\nThis study was based on the 2015 research project ‘Improvement for uncertainty of strong ground motion prediction’ by the Nuclear Regulation Authority (NRA), Japan.","id":77310,"rev_number":10,"userid":18,"eprint_dir":"disk0/00/07/73/10","datestamp":"2017-05-12 23:13:24","lastmod":"2017-05-12 23:13:24","status_changed":"2017-05-12 23:13:24","type":"article","metadata_visibility":"show","creators":[{"given":"Yingdi","family":"Luo","id":"Luo-Yingdi","orcid":""},{"given":"Jean-Paul","family":"Ampuero","id":"Ampuero-J-P","orcid":"0000-0002-4827-7987"},{"given":"Ken","family":"Miyakoshi","id":"Miyakoshi-Ken","orcid":""},{"given":"Kojiro","family":"Irikura","id":"Irikura-Kojiro","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"none","keywords":"Earthquake scaling relations; surface rupture effects; earthquake cycle model; rate-and-state friction; analytical dislocation model; numerical crack model","date":"2017-01-25","date_type":"inpress","publication":"Pure and Applied Geophysics","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170509-135627436","refereed":true,"issn":"0033-4553 ","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170509-135627436","related_url":[{"url":"http://dx.doi.org/10.1007/s00024-017-1467-4","type":"doi","description":"Article"},{"url":"http://link.springer.com/article/10.1007%2Fs00024-017-1467-4","type":"pub","description":"Article"},{"url":"http://rdcu.be/rYnb","type":"pub","description":"Free ReadCube access"}],"referencetext":["Dalguer, L. A., Miyake, H., Day, S. M., \u0026 Irikura, K. (2008). Surface rupturing and buried dynamic rupture models calibrated with statistical observations of past earthquakes. Bulletin of the Seismological Society of America, 98, 1147–1161. doi:10.1785/0120070134.\nCrossRefGoogle Scholar\n\n\nFujii, Y., \u0026 Matsu’ura, M. (2000). Regional difference in scaling laws for large earthquakes and its tectonic implication. Pure and Applied Geophysics, 157(11–12), 2283–2301.\nCrossRefGoogle Scholar\n\n\nGallovič, F. (2008). Heterogeneous Coulomb stress perturbation during earthquake cycles in a 3D rate-and-state fault model. Geophysical Research Letters, 35(21).\n\n\nHanks, T. C., \u0026 Bakun, W. H. (2002). A bilinear source-scaling model for M–log A observations of continental earthquakes. Bulletin of the Seismological Society of America, 92(5), 1841–1846.\nCrossRefGoogle Scholar\n\n\nHanks, T. C., \u0026 Bakun, W. H. (2014). M–log A models and other curiosities. Bulletin of the Seismological Society of America, 104(5), 2604–2610.\nCrossRefGoogle Scholar\n\n\nHillers, G., Ben-Zion, Y., \u0026 Mai, P. M. (2006). Seismicity on a fault controlled by rate-and-state dependent friction with spatial variations of the critical slip distance. Journal of Geophysical Research: Solid Earth, 111(B1), B01403.\nCrossRefGoogle Scholar\n\n\nHillers, G., Mai, P. M., Ben-Zion, Y., \u0026 Ampuero, J. P. (2007). Statistical properties of seismicity of fault zones at different evolutionary stages. Geophysical Journal International, 169(2), 515–533.\nCrossRefGoogle Scholar\n\n\nIrikura, K., \u0026 Miyake, H. (2001). Prediction of strong ground motions for scenario earthquakes. Journal of Geography (Chigaku Zasshi), 110(6), 849–875.\nCrossRefGoogle Scholar\n\n\nIrikura, K., \u0026 Miyake, H. (2011). Recipe for predicting strong ground motion from crustal earthquake scenarios. Pure and Applied Geophysics, 168(1–2), 85–104.\nCrossRefGoogle Scholar\n\n\nKanamori, H., \u0026 Anderson, D. L. (1975). Theoretical basis of some empirical relations in seismology. Bulletin of the Seismological Society of America, 65(5), 1073–1095.\nGoogle Scholar\n\n\nLeonard, M. (2010). Earthquake fault scaling: Self-consistent relating of rupture length, width, average displacement, and moment release. Bulletin of the Seismological Society of America, 100(5A), 1971–1988.\nCrossRefGoogle Scholar\n\n\nMarone, C. (1998). Laboratory-derived friction laws and their application to seismic faulting. Annual Review of Earth and Planetary Sciences, 26(1), 643–696.\nCrossRefGoogle Scholar\n\n\nMatsu’ura, M., \u0026 Sato, T. (1997). Loading mechanism and scaling relations of large interplate earthquakes. Tectonophysics, 277(1), 189–198.\nCrossRefGoogle Scholar\n\n\nMiyakoshi, K., Irikura, K., \u0026 Kamae, K. (2015). Re-examination of scaling relationships of source parameters of the inland crustal earthquakes in Japan based on the waveform inversion of strong motion data. Journal of Japan Association for Earthquake Engineering, 15–7, 141–156. (in Japanese with English abstract).\nGoogle Scholar\n\n\nMurotani, S., Matsushima, S., Azuma, T., Irikura, K., \u0026 Kitagawa, S. (2015). Scaling relations of source parameters of earthquakes occurring on inland crustal mega-fault systems. Pure and Applied Geophysics, 172(5), 1371–1381.\nCrossRefGoogle Scholar\n\n\nOkada, Y. (1992). Internal deformation due to shear and tensile faults in a half-space. Bulletin of the Seismological Society of America, 82(2), 1018–1040.\nGoogle Scholar\n\n\nRomanowicz, B., \u0026 Rundle, J. B. (1993). On scaling relations for large earthquakes. Bulletin of the Seismological Society of America, 83(4), 1294–1297.\nGoogle Scholar\n\n\nRubin, A. M., \u0026 Ampuero, J. P. (2005). Earthquake nucleation on (aging) rate and state faults. Journal of Geophysical Research: Solid Earth, 110(B11), B11312.\nCrossRefGoogle Scholar\n\n\nScholz, C. H. (1982). Scaling laws for large earthquakes: consequences for physical models. Bulletin of the Seismological Society of America, 72(1), 1–14.\nGoogle Scholar\n\n\nScholz, C. H. (1998). Earthquakes and friction laws. Nature, 391(6662), 37–42.\nCrossRefGoogle Scholar\n\n\nShaw, B. E. (2009). Constant stress drop from small to great earthquakes in magnitude-area scaling. Bulletin of the Seismological Society of America, 99(2A), 871–875.\nCrossRefGoogle Scholar\n\n\nShaw, B. E., \u0026 Wesnousky, S. G. (2008). Slip-length scaling in large earthquakes: The role of deep-penetrating slip below the seismogenic layer. Bulletin of the Seismological Society of America, 98(4), 1633–1641.\nCrossRefGoogle Scholar\n\n\nSomerville, P., Irikura, K., Graves, R., Sawada, S., Wald, D., Abrahamson, N., et al. (1999). Characterizing crustal earthquake slip models for the prediction of strong ground motion. Seismological Research Letters, 70(1), 59–80.\nCrossRefGoogle Scholar\n\n\nSong, S. G., Beroza, G. C., \u0026 Segall, P. (2008). A unified source model for the 1906 San Francisco earthquake. Bulletin of the Seismological Society of America, 98(2), 823–831.\nCrossRefGoogle Scholar\n\n\nStreit, J. E., \u0026 Cox, S. F. (2001). Fluid pressures at hypocenters of moderate to large earthquakes. Journal of Geophysical Research: Solid Earth, 106(B2), 2235–2243.\nCrossRefGoogle Scholar\n\n\nWells, D. L., \u0026 Coppersmith, K. J. (1994). New empirical relationships among magnitude, rupture length, rupture width, rupture area, and surface displacement. Bulletin of the Seismological Society of America, 84(4), 974–1002.\nGoogle Scholar\n\n\nBodin, P., \u0026 Brune, J. N. (1996). On the scaling of slip with rupture length for shallow strike-slip earthquakes: Quasi-static models and dynamic rupture propagation.  Bulletin of the Seismological Society of America, 86(5), 1292–1299.\nGoogle Scholar\n\n\nMai, P. M., \u0026 Beroza, G. C. (2000). Source scaling properties from finite-fault-rupture models. Bulletin of the Seismological Society of America, 90(3), 604–615.\nCrossRefGoogle Scholar\n\n\nCausse, M., \u0026 Song, S. G. (2015). Are stress drop and rupture velocity of earthquakes independent? Insight from observed ground motion variability. Geophysical Research Letters, 42(18), 7383–7389.\nCrossRefGoogle Scholar\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Luo, Y., Ampuero, JP., Miyakoshi, K. et al. Pure Appl. Geophys. (2017). doi:10.1007/s00024-017-1467-4","other_numbering_system":null,"funders":[{"agency":"Nuclear Regulation Authority (Japan)","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Seismological Laboratory"]}