{"title":"Dendritic Chelating Agents. 1. Cu(II) Binding to Ethylene Diamine Core Poly(amidoamine) Dendrimers in Aqueous Solutions","uri":"","abstract":"This paper describes an investigation of the uptake of Cu(II) by poly(amidoamine) (PAMAM) dendrimers with an ethylenediamine (EDA) core in aqueous solutions. We use bench scale measurements of proton and metal ion binding to assess the effects of (i) metal ion−dendrimer loading, (ii) dendrimer generation/terminal group chemistry, and (iii) solution pH on the extent of binding of Cu(II) in aqueous solutions of EDA core PAMAM dendrimers with primary amine, succinamic acid, glycidol, and acetamide terminal groups. We employ extended X-ray absorption fine structure (EXAFS) spectroscopy to probe the structures of Cu(II) complexes with Gx-NH_2 EDA core PAMAM dendrimers in aqueous solutions at pH 7.0. The overall results of the proton and metal ion binding measurements suggest that the uptake of Cu(II) by EDA core PAMAM dendrimers involves both the dendrimer tertiary amine and terminal groups. However, the extents of protonation of these groups control the ability of the dendrimers to bind Cu(II). Analysis of the EXAFS spectra suggests that Cu(II) forms octahedral complexes involving the tertiary amine groups of Gx-NH_2 EDA core PAMAM dendrimers at pH 7.0. The central Cu(II) metal ion of each of these complexes appears to be coordinated to 2−4 dendrimer tertiary amine groups located in the equatorial plane and 2 axial water molecules. Finally, we combine the results of our experiments with literature data to formulate and evaluate a phenomenological model of Cu(II) uptake by Gx-NH_2 PAMAM dendrimers in aqueous solutions. At low metal ion−dendrimer loadings, the model provides a good fit of the measured extent of binding of Cu(II) in aqueous solutions of G4-NH_2 and G5-NH_2 PAMAM dendrimers at pH 7.0.","documents":[{"id":"http://authors.library.caltech.edu/id/document/251995","docid":251995,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255867","fileid":1255867,"datasetid":"document","objectid":251995,"filename":"la036108k.pdf","mime_type":"application/pdf","hash":"180cefb5d2b902253d54a074d69eb9cb","hash_type":"MD5","filesize":320532,"mtime":"2017-05-10 13:58:15","url":"http://authors.library.caltech.edu/77323/1/la036108k.pdf"}],"eprintid":77323,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"la036108k.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/251996","docid":251996,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255871","fileid":1255871,"datasetid":"document","objectid":251996,"filename":"la036108ksi20040122_052709.pdf","mime_type":"application/pdf","hash":"3595cae4035a873793f125473fa9e0ed","hash_type":"MD5","filesize":566213,"mtime":"2017-05-10 14:11:00","url":"http://authors.library.caltech.edu/77323/2/la036108ksi20040122_052709.pdf"}],"eprintid":77323,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"la036108ksi20040122_052709.pdf","content":"supplemental"}],"note":"© 2004 American Chemical Society. \n\nReceived 9 November 2003. Published online 5 March 2004. Published in print 1 March 2004. \n\nWe thank Ms. Sa'Nia Carasquero (Graduate Student in Chemical Engineering) and Mr. Kwesi Falconer (Graduate Student in Environmental Engineering) of Howard University School of Engineering for their assistance with the proton and metal ion binding experiments. We also thank Dr. Prabal Maiti of the Materials and Process Simulation Center of the Beckman Institute at the California Institute of Technology for providing prior to publication data on the extent of binding of water molecules to EDA core PAMAM dendrimers. Funding for this work was provided by the National Science Foundation (NSF Grant CTS-0086727) and the U.S. Environmental Protection Agency (NCER STAR Grant R829626). Partial funding for this research was also provided by the Department of Energy (Cooperative Agreement EW15254). The EXAFS spectroscopic investigations were carried out at the Stanford Synchrotron Radiation Laboratory, a national user facility operated by Stanford University on behalf of the U.S. Department of Energy, Office of Basic Energy Sciences.","id":77323,"rev_number":10,"userid":772,"eprint_dir":"disk0/00/07/73/23","datestamp":"2017-05-16 20:54:42","lastmod":"2017-05-16 20:54:42","status_changed":"2017-05-16 20:54:42","type":"article","metadata_visibility":"show","creators":[{"given":"Mamadou S.","family":"Diallo","id":"Diallo-M-S","orcid":""},{"given":"Simone","family":"Christie","id":"Christie-S","orcid":""},{"given":"Pirabalini","family":"Swaminathan","id":"Swaminathan-P","orcid":""},{"given":"Lajos","family":"Balogh","id":"Balogh-L","orcid":""},{"given":"Xiangyang","family":"Shi","id":"Shi-Xiangyang","orcid":""},{"given":"Wooyong","family":"Um","id":"Um-Wooyong","orcid":""},{"given":"Charalambos","family":"Papelis","id":"Papelis-C","orcid":""},{"given":"William A., III","family":"Goddard","id":"Goddard-W-A-III","orcid":"0000-0003-0097-5716"},{"given":"James H., Jr.","family":"Johnson","id":"Johnson-J-H-Jr","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2004-03-30","date_type":"published","publication":"Langmuir","volume":"20","number":"7","pagerange":"2640-2651","id_number":"CaltechAUTHORS:20170510-065746632","refereed":true,"issn":"0743-7463","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170510-065746632","related_url":[{"url":"http://dx.doi.org/10.1021/la036108k","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/la036108k","type":"pub","description":"Article"},{"url":"http://pubs.acs.org/doi/suppl/10.1021/la036108k","type":"pub","description":"Supporting Information"}],"referencetext":["Newkome, G. R.; Moorefield, C. N.; Vogtle, F. Dendritic Molecules: Concepts, Syntheses, Perspectives; VCH:  New York, 1996.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(2) Bosman, A. W.; Janssen, H. M.; Meijer, E. W. Chem. Rev. 1999, 99, 1665−1668.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(3) Zeng, F.; Zimmerman, S. C. Chem. Rev. 1997, 97, 1681−1712.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(4) Dendrimers and Other Dendritic Polymers; Fréchet, J. M. J., Tomalia, D. A., Eds.; Wiley and Sons:  New York, 2001.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(5) Diallo, M. S.; Balogh, L.; Shafagati, A.; Johnson, J. H.; Goddard, W. A., III.; Tomalia, D. Environ. Sci. Technol. 1999, 33, 820−824.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(6) Zhou, L.; Russell, D.; H.; Zhao, M. Q.; Crooks, R. M. Macromolecules 2001, 34, 3567−3573.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(7) Ottaviani, M. F.; Montali, F.; Turro, N. J.; Tomalia, D. A. J. Am. Chem. Soc. 1994, 116, 661−671.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(8) Ottaviani, M. F.; Bossman, S.; Turro, N. J.; Tomalia, D. A. J. Phys. Chem. B. 1997, 101, 158−166.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(9) Ottaviani, M. F.; Montali, F.; Romanelli, M.; Turro, N. J.; Tomalia, D. A. J. Phys. Chem. 1996, 100, 11033−11042.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nBosman, A. W.; Schemming, A. P. H. J.; Janssen, R. A. J.; Meijer, E. W. Chem. Ber./Recl. 1997, 130, 725−728.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(11) Vassilev, K.; Ford, W. T. J. J. Polym. Sci., Part A 1999, 37, 2727−2736.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(12) Ottaviani, M. F.; Favuzza, P.; Bigazzi, M.; Turro, N. J.; Jockusch, S.; Tomalia, D. A. Langmuir 2000, 16, 7368−7372.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(13) Balogh, L.; Tomalia, D. A. J. Am. Chem. Soc. 1998, 120, 7355−7356.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(14) Zhao, M. Q.; Sun, L.; Crooks, R. M. J. Am. Chem. Soc. 1998, 120, 4877−4878.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(15) Zhao, M. Q.; Crooks, R. M. Chem. Mater. 1999, 11, 3379−3385.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(16) Balogh, L.; Valluzzi, R.; Hagnauer, G. L.; Laverdure, K. S.; Gido, S. P.;Tomalia, D. A. J. Nanopart. Res. 1999, 1, 353−368.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(17) Cohen, S. M.; Petoud, S.; Raymond, K. N. Chem.Eur. J. 2001, 7, 272−279.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(18) Esumi, K.; Suzuki, A.; Yamahira, A.; Torigoe, K. Langmuir 2000, 16, 2604−2608.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(19) Balogh, L.; Swanson, D. R.; Tomalia, D. A.; Hagnauer, G. L.; McManus, A. T. Nano Lett. 2001, 1, 18−21.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nZhao, M.; Crooks, R. M. Angew. Chem., Int. Ed. 1999, 38, 364−366.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(21) Chechik, V.; Crooks, R. M. J. Am. Chem. Soc. 2000, 122, 1243−1244.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(22) Crooks, R. M.; Zhao, M.; Sun, L.; Chechik, V.; Yeung, L. K. Acc. Chem. Res. 2001, 181−190.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(23) QC-Titrate is a titration/ion analysis system from Man-Tech Associates, http://www.titrationplus.com/.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(24) George, G. N.; Pickering, I. J. EXAFSPAK: A Suite of Computer Programs for Analysis of X-Ray Absorption Spectra; Stanford Synchrotron Radiation Laboratory:  Stanford, CA, 1995.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(25) Zabinsky, S. I.; Rehr, J. J.; Ankudinov, A.; Albers, R. C.; Eller, M. J. Phys. Rev. B 1995, 52, 2995−3009.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(26) Hummelen, J. C.; van Dongen, J. L. J.; Meijer, E. W. Chem.Eur. J. 1997, 3, 1489−1493.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(27) Tolic, L. P.; Anderson, G. A.; Smith, R. D.; Brothers, H. M.; Splindler, R.; Tomalia, D. Int. J. Mass. Spectrom. Ion Processes 1997, 165/166, 405−418.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(28) Koper, G. J. M.; van Genderen, M. H. P.; Elissen-Roman, C.; Baars, M. W. P.; Meijer, E. W.; Borkovec, M. J. Am. Chem. Soc. 1997, 119, 6512−6521.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(29) van Duijvenbode, R. C.; Rajanayagam, A.; Koper, G. J. M.; Baars, M. W. P.; de Waal, B. F. M.; Meijer, E. W.; Borkovec, M. Macromolecules 2000, 33, 46−52.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nKabanov, V. A.; Zezin, A. B.; Rogacheva, V. B.; Gulyaeva, V. B.; Zansochova, M. F.; Joosten, J. G. H.; Brackman, J. Macromolecules 1998, 31, 5142−5144.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(31) Mathematica, version 4; Wolfram Research:  Champaign, IL, 1999; http://www.wolfram.com/.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(32) Cakara, D.; Kleiman, J.; Borkovec, M. Macromolecules 2003, 36, 4201−4207. These authors used a site binding model analogous to the classical Ising model to analyze the measured titration curves of EDA core Gx-NH2 PAMAM dendrimers in aqueous solutions. The model has six adjustable parameters including three “microconstants” for the dendrimer primary amine groups (pK̃(I)), tertiary amine groups (pK̃(III)), and innermost tertiary amine groups (pK̃(III‘)) along with three nearest neighbor interaction parameters (ε, ε‘, and ε‘ ‘). These parameters were determined by nonlinear least-squares fitting of the measured titration curves for two low-generation (G0-NH2 and G1-NH2) EDA core PAMAM dendrimers. Cakara et al. (ref 32) subsequently used these parameters to investigate the protonation of higher generation EDA core PAMAM dendrimers.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(33) Niu, Y.; Sun, L.; Crooks, R. M. Macromolecules 2003, 36, 5725−5731. These authors used a multishell structural model and a Frumkin adsorption isotherm to analyze the measured titration curves of EDA core G4-NH2 and G4-OH PAMAM dendrimers in aqueous solutions. Their analysis yielded two parameters:  an intrinsic proton binding constant and “a constant that characterizes the strength of electrostatic interactions among occupied binding sites”. Based on the results of their analysis, Niu et al. (ref 33) estimated the pKa of the tertiary amine groups of G4-NH2 and G4-OH EDA PAMAM dendrimers to be respectively 6.30. They also reported a pKa of 9.23 for the primary amine groups of the G4-NH2 PAMAM dendrimer.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(34) Schwarzenbach, R. P.; Gschwend, P.; Imboden, D. M. Environmental Organic Chemistry, 2nd ed.; John Wiley \u0026 Sons:  Hoboken, NJ, 2003.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(35) Floriano, P. N.; Noble, C. O., IV; Schoonmaker, J. M.; Pollakof, E. D.; McCarley, R. L. J. Am. Chem. Soc. 2001, 125, 10545−10553.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(36) Choy, J.-H.; Kim, D.-K.; Choi, S.-N.; Kim, Y.-J. Inorg. Chem. 1997, 36, 189−195.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(37) D'Angelo, P.; Bottari, E.; Festa, M. R.; Nolting, H. F.; Pavel, N. V. J. Phys. Chem. B 1998, 102, 3114−3122.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(38) D'Angelo, P.; Bottari, E.; Festa, M. R.; Nolting, H. F.; Pavel, N. V. J. Chem Phys. 1997, 107, 2807−2812.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(39) Carrado, K. A.; Wasserman, S. R. J. Am. Chem. Soc. 1993, 115, 3394−3395.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nPerson, I.; Person, P.; Sandstrom, M.; Ulstrom, A.-S. J. Chem. Soc., Dalton Trans. 2002, 1256−1265.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(41) Harreis, H. M.; Likos, C. N.; Ballauf, M. J. Chem. Phys. 2003, 118, 1979−1988.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(42) Rathgeber, S.; Monkenbusch, M.; Kreitschmann, M.; Urban, V.; Brulet, E. J. Chem. Phys. 2002, 117, 4047−4062.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(43) Lee, I.; Athey, B. D.; Wetzel, A. W.; Meixner, W.; Baker, J. R. Macromolecules 2002, 35, 4510−4520.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(44) Maiti, P. K.; Cagin, T.; Goddard, W. A., III Macromolecules, submitted.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(45) Tanford, C. Physical Chemistry of Macromolecules; John Wiley \u0026 Sons:  New York, 1961. Conventional models of complexation have typically described metal ion chelation in aqueous solutions as a set of successive reactions between a central metal ion M and a ligand L (refs 46−48): M   ML   ML2...   MLi...   MLn                       (1)The ith stepwise stability constant (Ki) and overall stability constant (βi) are readily expressed in terms of the bound metal ion concentrations ([MLi] and [ML(i-1)]), free metal ion concentration ([M]), and free ligand concentration ([L]) as Ki =                                         (2)βi =                                             (3)The stability constants of a given metal ion can be determined by fitting experimental data to the corresponding chemical equilibrium and mass balance equations. Although this approach works well for a traditional chelating agent with a limited number of Lewis base donors (e.g., a polydendate ligand or a macrocycle), it is cumbersome and not feasible in many cases for macroligands (e.g., proteins and dendrimers) with a large number of binding sites. In the early 1960s, Tanford (ref 45) formulated a theory of solute binding to macromolecules. This theory describes the binding of small molecules or ions S to a macromolecule P by n association constants (k1, k2, ... kn): k1 =   k1 =   ..., kn =                      (4)where [PS], [PS2], ... [PSn] are the concentrations of bound solutes, [P] is the free macromolecule concentration, [S] is the free solute concentration, and n is the total number of binding sites on the macromolecule. The bound solute concentrations ([PS], [PS2], ... [PSn]) are usually very difficult to measure. However, in most cases, it is possible the measure the extent of binding υ defined as the average number of solutes S associated with each macromolecule P. υ is readily expressed as (ref 45) υ =                     (5)For a macromolecule with n1, n2, ... ni noninteracting binding sites of different intrinsic association constants ( , , ... ), eq 5 becomes υ =   +   + ...                       (6)Equation 6 provided the conceptual framework that we used to formulate our two-site model of Cu(II) uptake by Gx-NH2 PAMAM dendrimers in aqueous solutions.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(46) Hancook, R. D.; Martell, A. E. Metal Ion Complexes in Aqueous Solutions; Plenum Press:  New York, 1996.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(47) Burgess, J. Ions in Solution: Basic Principles of Chemical Interactions; 2nd ed.; Horwood:  West Sussex, U.K., 1999.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(48) Stumm, W.; Morgan, J. J. Aquatic Chemistry. Chemical Equilibria and Rates in Natural Waters; 3rd ed.; John Wiley \u0026 Sons:  New York, 1996."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Dendritic Chelating Agents. 1. Cu(II) Binding to Ethylene Diamine Core Poly(amidoamine) Dendrimers in Aqueous Solutions\nMamadou S. Diallo, Simone Christie, Pirabalini Swaminathan, Lajos Balogh, Xiangyang Shi, Wooyong Um, Charalambos Papelis, William A. Goddard III, and James H. Johnson, Jr.\nLangmuir 2004 20 (7), 2640-2651\nDOI: 10.1021/la036108k","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"CTS-0086727"},{"agency":"Environmental Protection Agency (EPA)","grant_number":"R829626"},{"agency":"Department of Energy (DOE)","grant_number":"EW15254"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}