{"title":"Müeller's Exchange-Correlation Energy in Density-Matrix-Functional Theory","uri":"","abstract":"The increasing interest in the Müller density-matrix-functional theory has led us to a systematic mathematical investigation of its properties. This functional is similar to the Hartree-Fock functional, but with a modified exchange term in which the square of the density matrix (x, x′) is replaced by the square of y^(1/2)(x,x′). After an extensive introductory discussion of densitymatrix-functional theory we show, among other things, that this functional is convex (unlike the HF functional) and that energy minimizing y’s have unique densities p(r), which is a physically desirable property often absent in HF theory. We show that minimizers exist if N ≤ Z, and derive various properties of the minimal energy and the corresponding minimizers. We also give a precise statement about the equation for the orbitals of y, which is more complex than for HF theory. We state some open mathematical questions about the theory together with conjectured solutions.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252010","docid":252010,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1255955","fileid":1255955,"datasetid":"document","objectid":252010,"filename":"0705.1587.pdf","mime_type":"application/pdf","hash":"f2192b15ac4605391487f70d426af094","hash_type":"MD5","filesize":417305,"mtime":"2017-05-10 16:15:02","url":"http://authors.library.caltech.edu/77333/1/0705.1587.pdf"}],"eprintid":77333,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"0705.1587.pdf","content":"submitted"}],"note":"Dated: September 28, 2009. (Submitted on 11 May 2007 (v1), last revised 29 Sep 2009 (this version, v3)). \n\nRupert Frank and Heinz Siedentop thank the Departments of Mathematics and Physics at Princeton University for hospitality while this work was done. The following partial support is gratefully acknowledged: The Swedish Foundation for International Cooperation in Research and Higher Education (STINT) (R.F.); U.S. National Science Foundation, grants PHY 01 39984 (E.H.L and H.S.) and PHY 03 53181 (R.S.); an A.P. Sloan Fellowship (R.S.); Deutsche Forschungsgemeinschaft, grant SI 348/13-1 (H.S.).","id":77333,"rev_number":9,"userid":772,"eprint_dir":"disk0/00/07/73/33","datestamp":"2017-05-16 20:41:18","lastmod":"2017-05-16 20:41:18","status_changed":"2017-05-16 20:41:18","type":"monograph","metadata_visibility":"show","creators":[{"given":"Rupert L.","family":"Frank","id":"Frank-R-L","orcid":""},{"given":"Elliott H.","family":"Lieb","id":"Lieb-E-H","orcid":""},{"given":"Robert","family":"Seiringer","id":"Seiringer-R","orcid":""},{"given":"Heinz","family":"Siedentop","id":"Siedentop-H","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2009-09-20","date_type":"submitted","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170510-091442211","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170510-091442211","related_url":[{"url":"https://arxiv.org/abs/0705.1587","type":"arxiv","description":"Discussion Paper"}],"referencetext":["1] V. Bach, E. H. Lieb, and J. P. Solovej. Generalized Hartree-Fock theory and the Hubbard\nmodel. J. Stat. Phys., 76(1\u00262):3–89, 1994.\n[2] Volker Bach. Error bound for the Hartree-Fock energy of atoms and molecules. Comm. Math.\nPhys., 147:527–548, 1992.\n[3] Volker Bach, Elliott H. Lieb, and Marcos V. Travaglia. Ferromagnetism of the Hubbard model\nat strong coupling in the Hartree-Fock approximation. Rev. Math. Phys., 18(5):519–543, 2006.\n[4] Rafael Benguria and Elliott H. Lieb. The most negative ion in the Thomas-Fermi-von\nWeizs¨acker theory of atoms and molecules. J. Phys. B., 18:1054–1059, 1985.\n[5] M.A. Buijse and E. J. Baerends. An approximate exchange-correlation hole density as a\nfunctional of the natural orbitals. Molecular Physics, 100(4):401–421, February 2002.\n[6] Jerzy Cioslowski and Katarzyna Pernal. Constraints upon natural spin orbital functionals imposed\nby properties of a homogeneous electron gas. Journal of Chemical Physics, 111(8):3396–\n3400, August 1999.\n[7] G´abor Cs´anyi and T. A. Arias. Tensor product expansions for correlation in quantum manybody\nsystems. Phys. Rev. B, 61(11):7348–7352, March 2000.\n[8] G´abor Cs´anyi, Stefan Goedecker, and T. A. Arias. Improved tensor-product expansions for\nthe two-particle density matrix. Phys. Rev. A, 65(3):032510, February 2002.\n[9] Hans L. Cycon, Richard G. Froese, Werner Kirsch, and Barry Simon. Schr¨odinger Operators\nwith Application to Quantum Mechanics and Global Geometry. Text and Monographs in\nPhysics. Springer-Verlag, Berlin, 1 edition, 1987.\n[10] Helmut Eschrig. The Fundamentals of Density Functional Theory. Edition am Gutenbergplatz,\n2 edition, 2003.\n[11] C. L. Fefferman and R. de la Llave. Relativistic stability of matter – I. Revista Matematica\nIberoamericana, 2(1, 2):119–161, 1986.\n[12] G. Friesecke. On the infinitude of non-zero eigenvalues of the single-electron density matrix\nfor atoms and molecules. R. Soc. Lond. Proc. Ser. A Math. Phys. Eng. Sci., 459(2029):47–52,\n2003.\n[13] T. L. Gilbert. Hohenberg-Kohn theorem for nonlocal external potentials. Phys. Rev. B,\n12(6):2111–2120, Sep 1975.\n[14] S. Goedecker and C. J. Umrigar. Natural orbital functional for the many-electron problem.\nPhys. Rev. Lett., 81(4):866–869, Jul 1998.\n[15] O. Gritsenko, K. Pernal, and E.J. Baerends. An improved density matrix functional by\nphysically motivated repulsive corrections. Journal of Chemical Physics, 122(20):204102–\n204102, 2005.\n[16] Eberhard K. U. Gross, Erich Runge, and Olle Heinonen. Many-Particle Theory. Hilger,\nBristol, 1991.\n[17] Eberhard K.U. Gross and Reiner M. Dreizler, editors. Density Functional Theory : an Approach\nto the Quantum Many-Body Problem, volume 337 of NATO Science Series: B:, Berlin,\n1995. NATO, Springer.\n","[18] Nicole Helbig. Orbital Functionals in Density-Matrix- and Current-\nDensity-Functional Theory. PhD thesis, Frei Universit¨at Berlin,\nhttp://www.diss.fu-berlin.de/2006/442/indexe.html, 2006.\n[19] John M. Herbert and John E. Harriman. n-representability and variational stability in natural\norbital functional theory. Journ. Chem. Phys., 118(24):10835–10846, June 2003.\n[20] P. Hohenberg and W. Kohn. Inhomogeneous electron gas. Phys. Rev. (2), 136:B864–B871,\n1964.\n[21] Matthias Huber and Heinz Siedentop. Solutions of the Dirac-Fock equations and the energy of\nthe electron-positron field. Archive for Rational Mechanics and Analysis, 184(1):1–22, April\n2007.\n[22] N. N. Lathiotakis, N. Helbig, and E. K. U. Gross. Open shells in reduced-density-matrixfunctional\ntheory. Physical Review A (Atomic, Molecular, and Optical Physics), 72(3):030501,\n2005.\n[23] N. N. Lathiotakis, N. Helbig, and E. K. U. Gross. Performance of one-body reduced density\nmatrix functionals for the homogeneous electron gas. Physical Review B 75:195120, 2007.\n[24] W. Lenz. ¨ Uber die Awendbarkeit der statistischen Methode auf Ionengitter. Z. Phys., 77:713–\n721, 1932.\n[25] Mel Levy. Universal variational functionals of electron densities, first-order density matrices,\nand natural spin-orbitals and solutions of the v-representability theorem. Proc. Natl. Acad.\nSci. USA, 76(12):6062–6065, December 1979.\n[26] Mel Levy. Electron densities in search of Hamiltonians. Phys. Rev. A, 26(3):1200–1208, Sep\n1982.\n[27] Mathieu Lewin. Quelques mod`eles non lin´eaires en m´ecanique quantique. PhD thesis, Paris\nDauphine, http://tel.archives-ouvertes.fr/documents/archives0/00/00/63/06/index.html,\n2004.\n[28] Elliott H. Lieb. Convex trace functions and the Wigner-Yanase-Dyson conjecture. Advances\nin Math., 11:267–288, 1973.\n[29] Elliott H. Lieb. Thomas-Fermi and related theories of atoms and molecules. Rev. Mod. Phys.,\n53(4):603–641, October 1981.\n[30] Elliott H. Lieb. Density functionals for Coulomb systems. International Journal of Quantum\nChemistry., 24(3):243–277, September 1983.\n","[31] Elliott H. Lieb. Bound on the maximum negative ionization of atoms and molecules. Phys.\nRev. A, 29(6):3018–3028, Jun 1984.\n[32] Elliott H. Lieb. Density functionals for Coulomb systems. In R. Dreizler and J. da Providencia,\neditors, Density Functional in Physics, volume 123 of Nato ASI, pages 31–80, New York, 1985.\nNATO, Plenum.\n[33] Elliott H. Lieb and Michael Loss. Analysis, volume 14 of Graduate Studies in Mathematics.\nAmerican Mathematical Society, Providence, RI, second edition, 2001.\n[34] Elliott H. Lieb and Barry Simon. On solutions of the Hartree-Fock problem for atoms and\nmolecules. Journal of Chemical Physics, 61(2):735–736, July 1974.\n[35] Elliott H. Lieb and Barry Simon. The Hartree-Fock theory for Coulomb systems. Comm.\nMath. Phys., 53(3):185–194, 1977.\n[36] Elliott H. Lieb and Barry Simon. The Thomas-Fermi theory of atoms, molecules and solids.\nAdv. Math., 23:22–116, 1977.\n[37] Gerhart L¨uders. ¨ Uber die Zustands¨anderung durch den Messprozess. Ann. Physik (6), 8:322–\n328, 1951.\n[38] A. M. K. M¨uller. Explicit approximate relation between reduced two- and one-particle density\nmatrices. Physics Letters A, 105(9):446–452, November 1984.\n[39] Michael A. Nielsen and Isaac L. Chuang. Quantum computation and quantum information.\nCambridge University Press, Cambridge, 2000.\n[40] Katarzyna Pernal. Effective potential for natural spin orbitals. Phys. Rev. Lett., 94(233002),\nJune 2005.\n[41] Jordi Poater, Miquel Duran, Miquel Sol´a, and Bernard Silvi. Theoretical evaluation of electron\ndelocalization in aromatic molecules by means of atoms in molecules (AIM) and electron\nlocalization function (ELF) topological approaches. Chem. Rev., 105:3911–3947, 2005.\n[42] Michael Reed and Barry Simon. Methods of Modern Mathematical Physics, volume 4: Analysis\nof Operators. Academic Press, New York, 1 edition, 1978.\n[43] Robert Seiringer. On the failure of subadditivity of the Wigner-Yanase entropy. Lett. Math.\nPhys., 80:285–288, 2007.\n[44] Barry Simon. Trace Ideals and their Applications, volume 35 of London Mathematical Society\nLecture Note Series. Cambridge University Press, Cambridge, 1979.\n[45] Viktor N. Staroverov and Gustavo E. Scuseria. Assessment of simple exchange-correlation\nenergy functionals of the one-particle density matrix. Journ. Chem. Phys., 117(6):2489–2495,\nAugust 2002.\n[46] E. P. Wigner and Mutsuo M. Yanase. Information contents of distributions. Proc. Nat. Acad.\nSci. U.S.A., 49:910–918, 1963.\n[47] Eugene P. Wigner and Mutsuo M. Yanase. On the positive semidefinite nature of a certain\nmatrix expression. Canad. J. Math., 16:397–406, 1964."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Swedish Foundation for International Cooperation in Research and Higher Education (STINT)","grant_number":""},{"agency":"NSF","grant_number":"PHY-0139984"},{"agency":"NSF","grant_number":"PHY-0353181"},{"agency":"Alfred P. Sloan Foundation","grant_number":""},{"agency":"Deutsche Forschungsgemeinschaft (DFG)","grant_number":"SI 348/13-1"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}