{"title":"Application-Oriented Input Design in System Identification: Optimal Input Design for Control","uri":"","abstract":"Model-based control design plays a key role in today's industrial practice, and industry demands cuttingedge methods for identifying the necessary models. However, additional tools are needed to handle the increasingly stringent conditions on cost and performance related to identifying the models.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252061","docid":252061,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256287","fileid":1256287,"datasetid":"document","objectid":252061,"filename":"07879927.pdf","mime_type":"application/pdf","hash":"812a6a63311579f130730c9bd9cbca36","hash_type":"MD5","filesize":4136583,"mtime":"2017-05-11 15:37:36","url":"http://authors.library.caltech.edu/77369/1/07879927.pdf"}],"eprintid":77369,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"07879927.pdf","content":"published"}],"note":"© 2007 IEEE. \n\nDate of Publication: 16 March 2017. ","id":77369,"rev_number":8,"userid":772,"eprint_dir":"disk0/00/07/73/69","datestamp":"2017-05-12 23:19:13","lastmod":"2017-05-12 23:19:13","status_changed":"2017-05-12 23:19:13","type":"article","metadata_visibility":"show","creators":[{"given":"Mariette","family":"Annergren","id":"Annergren-M","orcid":""},{"given":"Christian A.","family":"Larsson","id":"Larsson-C-A","orcid":""},{"given":"Hakan","family":"Hjalmarsson","id":"Hjalmarsson-H","orcid":""},{"given":"Xavier","family":"Bombois","id":"Bombois-X","orcid":""},{"given":"Bo","family":"Wahlberg","id":"Wahlberg-B","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-03-16","date_type":"published","publication":"IEEE Control Systems","volume":"37","number":"2","pagerange":"31-56","id_number":"CaltechAUTHORS:20170511-083644372","refereed":true,"issn":"1066-033X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170511-083644372","related_url":[{"url":"http://dx.doi.org/10.1109/MCS.2016.2643243","type":"doi","description":"Article"},{"url":"http://ieeexplore.ieee.org/document/7879927/","type":"pub","description":"Article"}],"referencetext":["[1] J. Löfberg, “YALMIP: A toolbox for modeling and optimization in MATLAB,”\nin Proc. Computer Aided Control System Design Conf.,Taipei,\nTaiwan,\n2004, pp. 284–289.\n[2] M. Annergren and C. A. Larsson, “Moose2—A toolbox for least-costly\napplication-oriented input design,” SoftwareX, vol. 5, pp. 96–100, 2016.\n[3] M. Annergren and C. A. Larsson. (2015). MOOSE2: Model based optimal\ninput signal design toolbox, version 2. [Online]. Available: www.kth\n.se/moose\n[4] C. R. Rojas, J. Mårtensson, and H. Hjalmarsson, “A tutorial on applications-\noriented optimal experiment design,” in Identification for Automotive\nSystems (Lecture Notes in Control and Information Sciences, vol. 418), D.\nAlberer, H. Hjalmarsson, and L. del Re. London, U.K.: Springer, 2012, pp.\n149–164.\n[5] C. R. Rojas, D. Katselis, H. Hjalmarsson, R. Hildebrand, and M. Bengtsson,\n“Chance constrained input design,” in Proc. Conf. Decision and Control\nand European Control, Orlando, 2011, pp. 2957–2962.\n[6] S. Boyd and L. Vandenberghe, Convex Optimization. Cambridge, U.K.:\nCambridge Univ. Press, 2004.\n[7] G. C. Calafiore and M. C. Campi, “The scenario approach to robust control\ndesign,” IEEE Trans. Automat. Control, vol. 51, no. 5, pp. 742–753, 2006.\n[8] M. Annergren. (2016). Application-oriented input design and optimization\nmethods involving ADMM. Ph.D. dissertation, Dept. Automatic Control,\nKTH Royal Institute of Technology. [Online]. Available: http://www\n.diva-portal.org\n[9] M. C. Campi and S. Garatti, “The exact feasibility of randomized solutions\nof uncertain convex programs,” SIAM J Optimiz., vol. 19, no. 3, pp.\n1211–1230, 2008.\n[10] H. Hjalmarsson, “System identification of complex and structured systems,”\nEur. J. Control, vol. 15, no. 3, pp. 275–310, 2009.\n[11] C. I. Byrnes, P. Enquist, and A. Lindquist, “Cepstral coefficients, covariance\nlags and pole-zero models for finite data strings,” IEEE Trans. Signal\nProcess., vol. 49, pp. 677–693, 2001.\n[12] U. Grenander and G. Szegö, Toeplitz Forms and Their Applications. New\nYork: Chelsea, 1984.\n[13] R. Hildebrand and G. Solari, “Closed-loop optimal input design: The\npartial correlation approach,” in Proc. IFAC Symp. System Identification,\nSaint-Malo, France, 2009, pp. 928–933.\n[14] T. Söderstrom, Discrete-Time Stochastic Systems: Estimation and Control,\n2nd ed. New York: Springer-Verlag, 2002.\n[15] S.P. Wu, S. Boyd, and L. Vandenberghe, “FIR filter design via semidefinite\nprogramming and spectral factorization,” in Proc. IEEE Conf. Decision\nand Control, Kobe, Japan, 1996, vol. 1, pp. 271–276.\n[16] H. Jansson and H. Hjalmarsson, “Input design via LMIs admitting\nfrequency-wise model specifications in confidence regions,” IEEE Trans.\nAutomat. Control, vol. 50, no. 10, pp. 1534–1549, 2005.\n[17] B. Wahlberg, H. Hjalmarsson, and M. Annergren, “On optimal input\ndesign in system identification for control,” in Proc. IEEE Conf. Decision and\nControl, Atlanta, GA, 2010, pp. 5548–5553.\n[18] H. Jansson, “Experiment design with applications in identification for\ncontrol,” Ph.D. dissertation, Dept. Automatic Control, KTH Royal Institute\nof Technology, 2004.\n[19] R. Pintelon and J. Schoukens, System Identification: A Frequency Domain\nApproach. Piscataway, NJ: IEEE Press, 2001.\n[20] X. Bombois, G. Scorletti, M. Gevers, P. M. J. Van den Hof, and R. Hildebrand,\n“Least costly identification experiment for control,” Automatica, vol.\n42, no. 10, pp. 1651–1662, 2006.\n[21] C. R. Rojas, J. C. Aguero, J. S. Welsh, G. C. Goodwin, and A. Feuer, “Robustness\nin experiment design,” IEEE Trans. Automat. Control, vol. 57, no. 4,\npp. 860–874, 2012.\n[22] P. Artzner, F. Delbaen, J. M. Eber, and D. Heath, “Thinking coherently,”\nRisk, vol. 10, pp. 68–71, Nov. 1997.\n[23] R. T. Rockafellar and S. Uryasev, “Optimization of conditional value-atrisk,”\nJ. Risk, vol. 2, no. 3, pp. 21–42, 2000.\n[24] P. E. Valenzuela, C. R. Rojas, and H. Hjalmarsson, “Uncertainty in system\nidentification: learning from the theory of risk,” IFAC-Paper OnLine,\nvol. 48, no. 28, pp. 1053–1058, 2015.\n[25] L. Gerencsér, H. Hjalmarsson, and J. Mårtensson, “Identification of\nARX systems with non-stationary inputs—Asymptotic analysis with application\nto adaptive input design,” Automatica, vol. 45, no. 3, pp. 623–633, 2009.\n[26] M. Forgione, X. Bombois, and P. M. J. Van den Hof, “Data-driven model\nimprovement for model-based control,” Automatica, vol. 52, no. 0, pp. 118–\n124, 2015.\n[27] C. Larsson. (2011). Toward applications oriented optimal input design\nwith focus on model predictive control. [Online]. Available: http://www\n.diva-portal.org/smash/get/diva2:447174/FULLTEXT01.pdf\n[28] A. Ebadat, M. Annergren, C. A. Larsson, C. R. Rojas, B. Wahlberg, H.\nHjalmarsson, M. Molander, and J. Sjöberg, “Application set approximation\nin optimal input design for model predictive control,” in Proc. European\nControl Conf., Strasbourg, France, 2014, pp. 744–749.\n[29] P. E. Modén and M. Lundh, “Performance monitoring for model predictive\ncontrol maintenance,” in Proc. European Control Conf., Zurich,\nSwitzerland, 2013, pp. 3770–3775.\n[30] M. G. Potters, X. Bombois, M. Forgione, P. E. Modén, M. Lundh, H.\nHjalmarsson, and P. M. J. Van den Hof, “Optimal experiment design in\nclosed loop with unknown, nonlinear and implicit controllers using stealth\nidentification,” in Proc. European Control Conf., Strasbourg, France, 2014, pp.\n726–731.\n[31] C. A. Larsson, M. Annergren, H. Hjalmarsson, C. R. Rojas, X. Bombois,\nA. Mesbah, and P. E. Modén, “Model predictive control with integrated experiment\ndesign for output error systems,” in Proc. European Control Conf.,\nZurich, Switzerland, 2013, pp. 3790–3795.\n[32] H. Hjalmarsson and H. Jansson, “Closed loop experiment design for\nlinear time invariant dynamical systems via LMIs,” Automatica, vol. 44, no.\n3, pp. 623–636, 2008.\n[33] R. Hildebrand, M. Gevers, and G. Solari, “Closed-loop optimal experiment\ndesign: The partial correlation approach,” in Proc. IEEE Conf. Decision\nand Control, Atlanta, GA, 2010, pp. 2855–2862.\n[34] C. A. Larsson, C. R. Rojas, X. Bombois, and H. Hjalmarsson, “Experimental\nevaluation of model predictive control with excitation (MPC-X)\non an industrial depropanizer,” J. Process Control, vol. 31, pp. 1–16, July\n2015.\n[35] H. Hjalmarsson, “From experiment design to closed-loop control,” Automatica,\nvol. 41, no. 3, pp. 393–438, 2005.\n[36] C. Rojas, M. B. Syberg, J. Welsh, and H. Hjalmarsson, “The cost of complexity\nin system identification: Frequency function estimation of finite\nimpulse response systems,” IEEE Trans. Automat. Control, vol. 55, no. 10, pp.\n2298–2309, 2010.\n[37] C. R. Rojas, M. B. Syberg, J. Welsh, and H. Hjalmarsson, “The cost of\ncomplexity in system identification: The output error case,” Automatica, vol.\n47, no. 9, pp. 1938–1948, 2011.\n[38] J. Mårtensson and H. Hjalmarsson, “How to make bias and variance\nerrors insensitive to system and model complexity in identification,” IEEE\nTrans. Automat. Control, vol. 56, no. 1, pp. 100–112, 2011.\n[39] L. Gerencsér and H. Hjalmarsson, “Adaptive input design in system\nidentification,” in Proc. IEEE Conf. Decision and Control and European Control,\nSeville, Spain, 2005, pp. 4988–4993.\n[40] L. Gerencsér, H. Hjalmarsson, and J. Mårtensson, “Identification of\nARX systems with non-stationary inputs—Asymptotic analysis with application\nto adaptive input design,” Automatica, vol. 45, no. 3, pp. 623–633,\n2009.\n[41] L. Gerencsér, H. Hjalmarsson, and L. Huang, “Adaptive experiment\ndesign for LTI systems,” IEEE Trans. Automati. Contr. doi: 10.1109/\nTAC.2016.2612946.\n[42] C. R. Rojas, H. Hjalmarsson, L. Gerenscér, and J. Mårtensson, “An adaptive\nmethod for consistent estimation of real-valued non-minimum zeros in\nstable LTI systems,” Automatica, vol. 47, no. 7, pp. 1388–1398, 2011.\n[43] H. Hjalmarsson and J. Mårtensson, “Optimal input design for identification\nof non-linear systems: Learning from the linear case,” in Proc.\nAmerican Control Conf., 2007, pp. 1572–1576.\n[44] A. D. Cock, M. Gevers, and J. Schoukens, “A preliminary study on optimal\ninput design for nonlinear systems,” in Proc. IEEE Conf. Decision and\nControl, Florence, Italy, 2013, pp. 4931–4936.\n[45] M. Forgione, X. Bombois, P. M. J. Van den Hof, and H. Hjalmarsson,\n“Experiment design for parameter estimation in nonlinear systems based\non multilevel excitation,” in Proc. European Control Conf., Strasbourg,\nFrance, 2014, pp. 25–30.\n[46] P. E. Valenzuela, C. R. Rojas, and H. Hjalmarsson, “A graph theoretical\napproach to input design for identification of nonlinear dynamical models,”\nAutomatica, vol. 51, no. 1, pp. 233–242, 2015."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"M. Annergren, C. A. Larsson, H. Hjalmarsson, X. Bombois and B. Wahlberg, \"Application-Oriented Input Design in System Identification: Optimal Input Design for Control [Applications of Control],\" in IEEE Control Systems, vol. 37, no. 2, pp. 31-56, April 2017.\ndoi: 10.1109/MCS.2016.2643243","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}