{"title":"Transition from collision to subduction in Western Greece: the Katouna–Stamna active fault system and regional kinematics","uri":"","abstract":"Transition from subduction to collision occurs in Western Greece and is accommodated along the downgoing plate by the Kefalonia right-lateral fault that transfers the Hellenic subduction front to the Apulian collision front. Here we present an active tectonic study of Aitolo-Akarnania (Western Greece) that highlights how such a transition is accommodated in the overriding plate. Based on new multi-scale geomorphic and tectonic observations, we performed an accurate active fault trace mapping in the region, and provide evidence for active normal and left-lateral faulting along the Katouna–Stamna Fault (KSF), a 65-km-long NNW-striking fault system connecting the Amvrakikos Gulf to the Patras Gulf. We further show that the Cenozoic Hellenide thrusts located west of the KSF are no longer active, either in field observation or in GPS data, leading us to propose that the KSF forms the northeastern boundary of a rigid Ionian Islands-Akarnania Block (IAB). Cosmic ray exposure measurements of ^(10)Be and ^(36)Cl were performed on a Quaternary alluvial fan offset along the KSF (~50 m left-lateral offset). A maximum abandonment age of ~12–14 ka for the alluvial fan surface can be determined, giving an estimated KSF minimum geological left-lateral slip rate of ~4 mm year^(−1), in agreement with high GPS slip rates (~10 mm year^(−1)). Despite this high slip rate, the KSF is characterized by subdued morphological evidence of tectonic activity, a gypsum-breccia bedrock and a low level of seismicity, suggesting a dominantly creeping behavior for this fault. Finally, we discuss how the IAB appears to have been progressively individualized during the Pleistocene (younger than ~1.5 Ma).","documents":[{"id":"http://authors.library.caltech.edu/id/document/252052","docid":252052,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256253","fileid":1256253,"datasetid":"document","objectid":252052,"filename":"art_10.1007_s00531-016-1345-9.pdf","mime_type":"application/pdf","hash":"591386949f77c9bed4bfc7943f81acf1","hash_type":"MD5","filesize":9059509,"mtime":"2017-05-11 14:49:34","url":"http://authors.library.caltech.edu/77365/1/art_10.1007_s00531-016-1345-9.pdf"}],"eprintid":77365,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"art_10.1007_s00531-016-1345-9.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252053","docid":252053,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256257","fileid":1256257,"datasetid":"document","objectid":252053,"filename":"531_2016_1345_MOESM1_ESM.docx","mime_type":"application/vnd.openxmlformats-officedocument.wordprocessingml.document","hash":"7d4d593ab1b7927be870b3e42ff95157","hash_type":"MD5","filesize":61517,"mtime":"2017-05-11 14:53:03","url":"http://authors.library.caltech.edu/77365/2/531_2016_1345_MOESM1_ESM.docx"}],"eprintid":77365,"pos":2,"placement":2,"mime_type":"application/vnd.openxmlformats-officedocument.wordprocessingml.document","format":"application/msword","language":"en","security":"public","license":"other","main":"531_2016_1345_MOESM1_ESM.docx","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/252054","docid":252054,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256259","fileid":1256259,"datasetid":"document","objectid":252054,"filename":"531_2016_1345_MOESM2_ESM.pdf","mime_type":"application/pdf","hash":"7995cc1cb613a8377e25d675c8c3a05c","hash_type":"MD5","filesize":167105,"mtime":"2017-05-11 14:53:18","url":"http://authors.library.caltech.edu/77365/3/531_2016_1345_MOESM2_ESM.pdf"}],"eprintid":77365,"pos":3,"placement":3,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"531_2016_1345_MOESM2_ESM.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/252055","docid":252055,"rev_number":1,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256261","fileid":1256261,"datasetid":"document","objectid":252055,"filename":"indexcodes.txt","mime_type":"text/x-pascal","hash":"95388b99df804e2cd27ceab106a423cc","hash_type":"MD5","filesize":40630,"mtime":"2017-05-11 14:53:28","url":"http://authors.library.caltech.edu/77365/4/indexcodes.txt"}],"eprintid":77365,"pos":4,"placement":4,"mime_type":"text/x-pascal","format":"other","language":"en","security":"public","license":"other","main":"indexcodes.txt","content":""},{"id":"http://authors.library.caltech.edu/id/document/252056","docid":252056,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256262","fileid":1256262,"datasetid":"document","objectid":252056,"filename":"531_2016_1345_MOESM3_ESM.pdf","mime_type":"application/pdf","hash":"2968625935db7a331a8235b37b4e9a87","hash_type":"MD5","filesize":226615,"mtime":"2017-05-11 14:53:29","url":"http://authors.library.caltech.edu/77365/5/531_2016_1345_MOESM3_ESM.pdf"}],"eprintid":77365,"pos":5,"placement":5,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"531_2016_1345_MOESM3_ESM.pdf","content":"supplemental"}],"note":"© 2016 Springer-Verlag Berlin Heidelberg. \n\nReceived: 9 July 2015; Accepted: 28 May 2016; Published online: 29 June 2016. \n\nThis research work has been funded by the Laboratoire de Géologie de l’Ecole Normale Supérieure, Paris (PSL Research University). We thank V. Guillou, L. Léanni, L. Benedetti, G. Aumaître, K. Keddadouche, M. Arnold, and F. Chauvet for their warm welcome and help during chemistry preparation and AMS measurements at CEREGE. The AMS measurements were performed at the ASTER AMS national facility (CEREGE, Aix-en-Provence), which is supported by the INSU/CNRS, the ANR through the “Projets thématiques d’excellence” program for the “Equipements d’excellence” ASTER-CEREGE action, IRD and CEA. We are very grateful to Mary Ford for the English syntax corrections in the manuscript, and her very careful review. We thank Laurent Jolivet for valuable comments in his review. Both reviewers significantly improved the final version of this work. We also thank Leigh Royden and two anonymous reviewers for critical reviews of a previous version of this work.","id":77365,"rev_number":13,"userid":18,"eprint_dir":"disk0/00/07/73/65","datestamp":"2017-05-12 23:00:10","lastmod":"2017-05-12 23:00:10","status_changed":"2017-05-12 23:00:10","type":"article","metadata_visibility":"show","creators":[{"given":"E.","family":"Pérouse","id":"Pérouse-E","orcid":""},{"given":"M.","family":"Sébrier","id":"Sébrier-M","orcid":""},{"given":"R.","family":"Braucher","id":"Braucher-R","orcid":""},{"given":"N.","family":"Chamot-Rooke","id":"Chamot-Rooke-N","orcid":""},{"given":"D.","family":"Bourlès","id":"Bourlès-D","orcid":""},{"given":"P.","family":"Briole","id":"Briole-P","orcid":""},{"given":"D.","family":"Sorel","id":"Sorel-D","orcid":""},{"given":"D.","family":"Dimitrov","id":"Dimitrov-D","orcid":""},{"given":"S.","family":"Arsenikos","id":"Arsenikos-S","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Active faults; Collision/subduction; Continental neotectonics; GPS; Western Greece; Mediterranean","date":"2017-04","date_type":"published","publication":"International Journal of Earth Sciences","volume":"106","number":"3","pagerange":"967-989","id_number":"CaltechAUTHORS:20170511-074920797","refereed":true,"issn":"1437-3254 ","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170511-074920797","related_url":[{"url":"http://dx.doi.org/10.1007/s00531-016-1345-9","type":"doi","description":"Article"},{"url":"http://link.springer.com/article/10.1007%2Fs00531-016-1345-9","type":"pub","description":"Article"},{"url":"http://rdcu.be/rYm1","type":"doi","description":"Free ReadCube access"}],"referencetext":["\nAnastasakis G, Piper DJW, Tziavos C (2007) Sedimentological response to neotectonics and sea-level change in a delta-fed, complex graben: Gulf of Amvrakikos, western Greece. Mar Geol 236:27–44. doi:10.1016/j.margeo.2006.09.014 \nCrossRefGoogle Scholar\n\n\nAubouin J (1959) Contribution à l’étude géologique de la Grèce septrionale; les confins de l’Epire et de la Thessalie. Annales Géologiques des pays Hélleniques 9\n\n\nBeckers A, Hubert-Ferrari A, Beck C, Bodeux S, Tripsanas E, Sakellariou D, De Batist M (2015) Active faulting at the western tip of the Gulf of Corinth, Greece, from high-resolution seismic data. Mar Geol 360:55–69\nCrossRefGoogle Scholar\n\n\nBraucher R, Del Castillo P, Siame L, Hidy AJ, Bourles DL (2009) Determination of both exposure time and denudation rate from an in situ-produced Be-10 depth profile: a mathematical proof of uniqueness. Model sensitivity and applications to natural cases. Quat Geochronol 4:56–67. doi:10.1016/j.quageo.2008.06.001 \nCrossRefGoogle Scholar\n\n\nBraucher R, Merchel S, Borgomano J, Bourles DL (2011) Production of cosmogenic radionuclides at great depth: a multi element approach. Earth Planet Sci Lett 309:1–9. doi:10.1016/j.epsl.2011.06.036 \nCrossRefGoogle Scholar\n\n\nBriole P (2013) Ground deformation across the Corinth rift from 22 years of GPS observations. Geophysical Research Abstracts 15:EGU2013-13183, EGU General Assembly, Vienna, Austria\n\n\nBriole P, Rigo A, Lyon-Caen H, Ruegg JC, Papazissi K, Mitsakaki C, Balodimou A, Veis G, Hatzfeld D, Deschamps A (2000) Active deformation of the Corinth rift, Greece: results from repeated Global Positioning System surveys between 1990 and 1995. J Geophys Res-Solid Earth 105:25605–25625\nCrossRefGoogle Scholar\n\n\nBritish Petroleum Co Ltd (1971) The Geological Results of Petroleum Exploration in Western Greece. Institute of Geology and Mineral Exploration, IGME, Special Report, 10, Athens\n\n\nCatalano R, Doglioni C, Merlini S (2001) On the Mesozoic Ionian Basin. Geophys J Int 144:49–64. doi:10.1046/j.0956-540X.2000.01287.x \nCrossRefGoogle Scholar\n\n\nChamot-Rooke N, Rangin C, Le Pichon X, Dotmed working group (2005) DOTMED: a synthesis of deep marine data in the eastern Mediterranean. Mém Soc Géol France 177:64p\nGoogle Scholar\n\n\nChousianitis K, Ganas A, Evangelidis CP (2015) Strain and rotation rate patterns of mainland Greece from continuous GPS data and comparison between seismic and geodetic moment release. J Geophys Res: Solid Earth. doi:10.1002/2014JB011762 \nGoogle Scholar\n\n\nClews JE (1989) Structural controls on basin evolution: Neogene to Quaternary of the Ionian zone, Western Greece. J Geol Soc Lond 146:447–457\nCrossRefGoogle Scholar\n\n\nCocard M, Kahle HG, Peter Y, Geiger A, Veis G, Felekis S, Paradissis D, Billiris H (1999) New constraints on the rapid crustal motion of the Aegean region: recent results inferred from GPS measurements (1993–1998) across the West Hellenic Arc, Greece. Earth Planet Sci Lett 172:39–47\nCrossRefGoogle Scholar\n\n\nCollier REL, Dart CJ (1991) Neogene to Quaternary rifting, sedimentation and uplift in the Corinth Basin, Greece. J Geol Soc Lond 148:1049–1065\nCrossRefGoogle Scholar\n\n\nCushing M (1985) Evolution structurale de la marge nord ouest Héllenique dans l’île de Levkas et ses environs (Grèce nord-occidentale). Université Paris-Sud (XI), Centre d'Orsay, France\nGoogle Scholar\n\n\nD’Agostino N, Avallone A, Cheloni D, D’Anastasio E, Mantenuto S, Selvaggi G (2008) Active tectonics of the Adriatic region from GPS and earthquake slip vectors. J Geophys Res-Solid Earth 113:B12413. doi:10.1029/2008JB005860 \nCrossRefGoogle Scholar\n\n\nDurand V, Bouchon M, Floyd MA, Theodulidis N, Marsan D, Karabulut H, Schmittbuhl J (2014) Observation of the spread of slow deformation in Greece following the breakup of the slab. Geophys Res Lett 41:7129–7134\nCrossRefGoogle Scholar\n\n\nEngdahl ER, van der Hilst R, Buland R (1998) Global teleseismic earthquake relocation with improved travel times and procedures for depth determination. Bull Seismol Soc Am 88:722–743\nGoogle Scholar\n\n\nEvangelidis CP, Konstantinou KI, Melis NS, Charalambakis M, Stavrakakis GN (2008) Waveform relocation and focal mechanism analysis of an earthquake swarm in Trichonis Lake, western Greece. Bull Seismol Soc Am 98:804–811\nCrossRefGoogle Scholar\n\n\nFeng LJ, Newman AV, Farmer GT, Psimoulis P, Stiros SC (2010) Energetic rupture, coseismic and post-seismic response of the 2008 M-W 6.4 Achaia-Elia Earthquake in northwestern Peloponnese, Greece: an indicator of an immature transform fault zone. Geophys J Int 183:103–110. doi:10.1111/j.1365-246X.2010.04747.x \nCrossRefGoogle Scholar\n\n\nFerentinos G, Brooks M, Doutsos T (1985) Quaternary tectonics in the Gulf of Patras, Western Greece. J Struct Geol 7:713–717. doi:10.1016/0191-8141(85)90146-4 \nCrossRefGoogle Scholar\n\n\nFloyd MA, Billiris H, Paradissis D, Veis G, Avallone A, Briole P, McClusky S, Nocquet JM, Palamartchouk K, Parsons B, England PC (2010) A new velocity field for Greece: implications for the kinematics and dynamics of the Aegean. J Geophys Res-Solid Earth 115:B10403. doi:10.1029/2009JB007040 \nCrossRefGoogle Scholar\n\n\nFord M, Rohais S, Williams EA, Bourlange S, Jousselin D, Backert N, Malartre F (2013) Tectono-sedimentary evolution of the western Corinth rift (Central Greece). Basin Res 25:3–25\nCrossRefGoogle Scholar\n\n\nGasse F, Vidal L, Van Campo E, Demory F, Develle A-L, Tachikawa K, Elias A, Bard E, Garcia M, Sonzogni C (2015) Hydroclimatic changes in northern Levant over the past 400,000 years. Quat Sci Rev 111:1–8\nCrossRefGoogle Scholar\n\n\nGaudemer Y, Tapponier P, Turcotte DL (1989) River offsets across active strike-slip faults. Annales Tectonicae 3:55–76\nGoogle Scholar\n\n\nGosse JC, Phillips FM (2001) Terrestrial in situ cosmogenic nuclides: theory and application. Quat Sci Rev 20:1475–1560. doi:10.1016/S0277-3791(00)00171-2 \nCrossRefGoogle Scholar\n\n\nGPS scope (permanent GPS network) supervised by Briole P, Charade O, and Ganas, A. On-line data available at http://crlab.eu \n\n\nHaslinger F, Kissling E, Ansorge J, Hatzfeld D, Papadimitriou E, Karakostas V, Makropoulos K, Kahle HG, Peter Y (1999) 3D crustal structure from local earthquake tomography around the Gulf of Arta (Ionian region, NW Greece). Tectonophysics 304:201–218. doi:10.1016/S0040-1951(98)00298-4 \nCrossRefGoogle Scholar\n\n\nHatzfeld D, Kassaras I, Panagiotopoulos D, Amorese D, Makropoulos K, Karakaisis G, Coutant O (1995) Microseimicity and strain pattern in northwestern Greece. Tectonics 14:773–785\nCrossRefGoogle Scholar\n\n\nHollenstein C, Muller MD, Geiger A, Kahle HG (2008) Crustal motion and deformation in Greece from a decade of GPS measurements, 1993–2003. Tectonophysics 449:17–40\nCrossRefGoogle Scholar\n\n\nInstitute of Geology and Mineral Exploration (IGME) (1987) Geological map of Greece, Amphilochia sheet, 1:50 000\n\n\nJolivet L, Labrousse L, Agard P, Lacombe O, Bailly V, Lecomte E, Mouthereau F, Mehl C (2010) Rifting and shallow-dipping detachments, clues from the Corinth Rift and the Aegean. Tectonophysics 483:287–304. doi:10.1016/j.tecto.2009.11.001 \nCrossRefGoogle Scholar\n\n\nKarakitsios V, Rigakis N (2007) Evolution and petroleum potential of Western Greece. J Petrol Geol 30:197–218. doi:10.1111/j.1747-5457.2007.00197.x \nCrossRefGoogle Scholar\n\n\nKiratzi A, Sokos E, Ganas A, Tselentis A, Benetatos C, Roumelioti Z, Serpetsidaki A, Andriopoulos G, Galanis O, Petrou P (2008) The April 2007 earthquake swarm near Lake Trichonis and implications for active tectonics in western Greece. Tectonophysics 452:51–65. doi:10.1016/j.tecto.2008.02.009 \nCrossRefGoogle Scholar\n\n\nKonstantinou KI, Melis NS, Lee SJ, Evangelidis CP, Boukouras K (2009) Rupture Process and Aftershocks Relocation of the 8 June 2008 M-w 6.4 Earthquake in Northwest Peloponnese, Western Greece. B Seismol Soc Am 99:3374–3389. doi:10.1785/0120080301 \nCrossRefGoogle Scholar\n\n\nLe Dortz K, Meyer B, Sebrier M, Braucher R, Bourles D, Benedetti L, Nazari H, Foroutan M (2012) Interpreting scattered in situ produced cosmogenic nuclide depth-profile data. Quat Geochronol 11:98–115. doi:10.1016/j.quageo.2012.02.020 \nCrossRefGoogle Scholar\n\n\nLe Pichon X, Chamot-Rooke N, Lallemant S, Noomen R, Veis G (1995) Geodetic determination of the kinematics of central Greece with respect to Europe: implications for eastern Mediterranean tectonics. J Geophys Res 100:12675–12690. doi:10.1029/95jb03170 \nCrossRefGoogle Scholar\n\n\nLouvari E, Kiratzi AA, Papazachos BC (1999) The Cephalonia Transform Fault and its extension to western Lefkada Island (Greece). Tectonophysics 308:223–236\nCrossRefGoogle Scholar\n\n\nMcNeill LC, Collier REL (2004) Uplift and slip rates of the eastern Eliki fault segment, Gulf of Corinth, Greece, inferred from Holocene and Pleistocene terraces. J Geol Soc Lond 161:81–92. doi:10.1144/0016-764903-029 \nCrossRefGoogle Scholar\n\n\nMelis NS, Burton PW (1988) Seismicity and crustal deformation in regions of Central Greece. Geophys J R Astr Soc 92:529\nGoogle Scholar\n\n\nNielsen C (2003) Etude des zones de subduction en convergence hyper-oblique: exemples de la ride méditerranéenne et de la marge indo-birmane. Université Paris-Sud (XI), Centre d'Orsay, France\nGoogle Scholar\n\n\nNishiizumi K, Imamura M, Caffee MW, Southon JR, Finkel RC, McAninch J (2007) Absolute calibration of Be-10 AMS standards. Nucl Instrum Meth B 258:403–413. doi:10.1016/j.nimb.2007.01.297 \nCrossRefGoogle Scholar\n\n\nPapanikolaou D, Alexandri M, Nomikou P (2006) Active faulting in the north Aegean basin. Geol S Am S 409:189–209. doi:10.1130/2006.2409(11) \nGoogle Scholar\n\n\nPapazachos B, Papazachou C (1997) The earthquakes of Greece. P. Ziti and Co, Thessaloniki\nGoogle Scholar\n\n\nPearce FD, Rondenay S, Sachpazi M, Charalampakis M, Royden LH (2012) Seismic investigation of the transition from continental to oceanic subduction along the western Hellenic Subduction Zone. J Geophys Res-Solid Earth. doi:10.1029/2011JB009023 \nGoogle Scholar\n\n\nPerouse E (2013) Cinématique et tectonique active de l’Ouest de la Grèce dans le cadre géodynamique de la Méditerranée Centrale et Orientale. Université Orsay - Paris Sud, Paris XI\nGoogle Scholar\n\n\nPerouse E, Chamot-Rooke N, Rabaute A, Briole P, Jouanne F, Georgiev I, Dimitrov D (2012) Bridging onshore and offshore present-day kinematics of central and eastern Mediterranean: implications for crustal dynamics and mantle flow. Geochem Geophy Geosy. doi:10.1029/2012gc004289 \nGoogle Scholar\n\n\nRohais S, Eschard R, Ford M, Guillocheau F, Moretti I (2007a) Stratigraphic architecture of the Plio-Pleistocene infill of the Corinth Rift: implications for its structural evolution. Tectonophysics 440:5–28. doi:10.1016/j.tecto.2006.11.006 \nCrossRefGoogle Scholar\n\n\nRohais S, Joannin S, Colin J-P, Suc J-P, Guillocheau F, Eschard R (2007b) Age and environmental evolution of the syn-rift fill of the southern coast of the Gulf of Corinth (Akrata-Derveni region, Greece). Bulletin de la Société géologique de France 178:231–243\nCrossRefGoogle Scholar\n\n\nSchimmelpfennig I, Benedetti L, Finkel R, Pik R, Blard PH, Bourles D, Burnard P, Williams A (2009) Sources of in situ Cl-36 in basaltic rocks. Implications for calibration of production rates. Quat Geochronol 4:441–461. doi:10.1016/j.quageo.2009.06.003 \nCrossRefGoogle Scholar\n\n\nSchimmelpfennig I, Benedetti L, Garreta V, Pik R, Blard PH, Burnard P, Bourles D, Finkel R, Ammon K, Dunai T (2011) Calibration of cosmogenic Cl-36 production rates from Ca and K spallation in lava flows from Mt. Etna (38 degrees N, Italy) and Payun Matru (36 degrees S, Argentina). Geochim Cosmochim Ac 75:2611–2632. doi:10.1016/j.gca.2011.02.013 \nCrossRefGoogle Scholar\n\n\nSerpetsidaki A, Elias P, Ilieva M, Bernard P, Briole P, Deschamps A, Lambotte S, Lyon-Caen H, Sokos E, Tselentis G-A (2014) New constraints from seismology and geodesy on the Mw = 6.4 2008 Movri (Greece) earthquake: evidence for a growing strike-slip fault system. Geophys J Int 198:1373–1386\nCrossRefGoogle Scholar\n\n\nSiame L, Bellier O, Braucher R, Sebrier M, Cushing M, Bourles D, Hamelin B, Baroux E, de Voogd B, Raisbeck G, Yiou F (2004) Local erosion rates versus active tectonics: cosmic ray exposure modelling in Provence (south-east France). Earth Planet Sci Lett 220:345–364. doi:10.1016/S0012-821x(04)00061-5 \nCrossRefGoogle Scholar\n\n\nSorel D (1976) Etude néotectonique dans l’arc Egéen externe occidental: les îles Ioniennes de Céphalonie et Zanthe et de l’Elide occidentale (Grèce). Université Paris-Sud (XI), Centre d'Orsay, France\nGoogle Scholar\n\n\nSorel D (1989) L’évolution structurale de la Grèce nord-occidentale depuis le Miocène, dans le cadre géodynamique de l’arc égéen. Université Paris-Sud (XI), Centre d'Orsay, France\nGoogle Scholar\n\n\nSperanza F, Minelli L, Pignatelli A, Chiappini M (2012) The Ionian Sea: the oldest in situ ocean fragment of the world? J Geophys Res-Solid Earth. doi:10.1029/2012jb009475 \nGoogle Scholar\n\n\nStiros S, Moschas F, Feng LJ, Newman A (2013) Long-term versus short-term deformation of the meizoseismal area of the 2008 Achaia-Elia (M-W 6.4) earthquake in NW Peloponnese, Greece: evidence from historical triangulation and morphotectonic data. Tectonophysics 592:150–158. doi:10.1016/j.tecto.2013.02.016 \nCrossRefGoogle Scholar\n\n\nStone JO, Allan GL, Fifield LK, Cresswell RG (1996) Cosmogenic chlorine-36 from calcium spallation. Geochim Cosmochim Acta 60:679–692. doi:10.1016/0016-7037(95)00429-7 \nCrossRefGoogle Scholar\n\n\nUnderhill JR (1989) Late Cenozoic deformation of the Hellenide foreland, western Greece. Geol Soc Am Bull 101:613–634\nCrossRefGoogle Scholar\n\n\nVassilakis E, Royden L, Papanikolaou D (2006) Extensional neotectonic structures adjacent and sub-parallel to the Hellenic trench. GSA Abstracts with Programs, Vol 38/7, Philadelphia\n\n\nVassilakis E, Royden L, Papanikolaou D (2011) Kinematic links between subduction along the Hellenic trench and extension in the Gulf of Corinth, Greece: a multidisciplinary analysis. Earth Planet Sci Lett 303:108–120. doi:10.1016/j.epsl.2010.12.054 \nCrossRefGoogle Scholar\n\n\nVermeesch P (2007) CosmoCalc: an excel add-in for cosmogenic nuclide calculations. Geochem Geophy Geosy. doi:10.1029/2006gc001530 \nGoogle Scholar\n\n\nWallace RE (1978) Geometry and rates of change of fault-generated range fronts, north-central Nevada. J Res US Geol Surv 6:637–649\nGoogle Scholar\n\n\nZerathe S, Braucher R, Lebourg T, Bourles D, Manetti M, Leanni L (2013) Dating chert (diagenetic silica) using in situ produced Be-10: possible complications revealed through a comparison with Cl-36 applied to coexisting limestone. Quat Geochronol 17:81–93. doi:10.1016/j.quageo.2013.01.003 \n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Pérouse, E., Sébrier, M., Braucher, R. et al. Int J Earth Sci (Geol Rundsch) (2017) 106: 967. doi:10.1007/s00531-016-1345-9","other_numbering_system":null,"funders":[{"agency":"Laboratoire de Géologie de l’Ecole Normale Supérieure","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}