{"title":"Bayesian system identification based on hierarchical sparse Bayesian learning and Gibbs sampling with application to structural damage assessment","uri":"","abstract":"Bayesian system identification has attracted substantial interest in recent years for inferring structural models based on measured dynamic response from a structural dynamical system. The focus in this paper is Bayesian system identification based on noisy incomplete modal data where we can impose spatially-sparse stiffness changes when updating a structural model. To this end, based on a similar hierarchical sparse Bayesian learning model from our previous work, we propose two Gibbs sampling algorithms. The algorithms differ in their strategies to deal with the posterior uncertainty of the equation-error precision parameter, but both sample from the conditional posterior probability density functions (PDFs) for the structural stiffness parameters and system modal parameters. The effective dimension for the Gibbs sampling is low because iterative sampling is done from only three conditional posterior PDFs that correspond to three parameter groups, along with sampling of the equation-error precision parameter from another conditional posterior PDF in one of the algorithms where it is not integrated out as a “nuisance” parameter. A nice feature from a computational perspective is that it is not necessary to solve a nonlinear eigenvalue problem of a structural model. The effectiveness and robustness of the proposed algorithms are illustrated by applying them to the IASE-ASCE Phase II simulated and experimental benchmark studies. The goal is to use incomplete modal data identified before and after possible damage to detect and assess spatially-sparse stiffness reductions induced by any damage. Our past and current focus on meeting challenges arising from Bayesian inference of structural stiffness serves to strengthen the capability of vibration-based structural system identification but our methods also have much broader applicability for inverse problems in science and technology where system matrices are to be inferred from noisy partial information about their eigenquantities.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252059","docid":252059,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256278","fileid":1256278,"datasetid":"document","objectid":252059,"filename":"1-s2.0-S0045782516305060-main.pdf","mime_type":"application/pdf","hash":"ef9d8a3b08daf762858e0f2221d6df08","hash_type":"MD5","filesize":3848152,"mtime":"2017-05-11 15:13:48","url":"http://authors.library.caltech.edu/77367/1/1-s2.0-S0045782516305060-main.pdf"}],"eprintid":77367,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"1-s2.0-S0045782516305060-main.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252060","docid":252060,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256280","fileid":1256280,"datasetid":"document","objectid":252060,"filename":"1701.03550.pdf","mime_type":"application/pdf","hash":"1ffbe23e96a346eabb400160113522a4","hash_type":"MD5","filesize":1411953,"mtime":"2017-05-11 15:14:14","url":"http://authors.library.caltech.edu/77367/2/1701.03550.pdf"}],"eprintid":77367,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1701.03550.pdf","content":"submitted"}],"note":"© 2017 Elsevier B.V. \n\nReceived 5 June 2016, Revised 14 January 2017, Accepted 26 January 2017, Available online 3 February 2017. \n\nThe first author acknowledges the financial support from the National Natural Science Foundation of China (NSFC grant no. 51308161) and the George W. Housner Research Fund at the California Institute of Technology. This research is also supported by the International Postdoctoral Exchange Fellowship Program 2014 by the Office of China Postdoctoral Council (No. 20140018), which partially supported the first author and this support is also gratefully acknowledged.","id":77367,"rev_number":9,"userid":772,"eprint_dir":"disk0/00/07/73/67","datestamp":"2017-05-12 22:54:04","lastmod":"2017-05-12 22:54:04","status_changed":"2017-05-12 22:54:04","type":"article","metadata_visibility":"show","creators":[{"given":"Yong","family":"Huang","id":"Huang-Yong","orcid":""},{"given":"James L.","family":"Beck","id":"Beck-J-L","orcid":""},{"given":"Hui","family":"Li","id":"Li-Hui","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Bayesian system identification; Sparse Bayesian learning; Hierarchical model; Gibbs sampling; Damage assessment; IASE-ASCE Phase II benchmark","date":"2017-05-01","date_type":"published","publication":"Computer Methods in Applied Mechanics and Engineering","volume":"318","number":"","pagerange":"382-411","id_number":"CaltechAUTHORS:20170511-081310764","refereed":true,"issn":"0045-7825","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170511-081310764","related_url":[{"url":"https://doi.org/10.1016/j.cma.2017.01.030","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0045782516305060","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1701.03550","type":"arxiv","description":"Discussion Paper"}],"referencetext":["[1] J.L. Beck, Bayesian system identification based on probability logic, Struct. Control Health Monit. 17 (7) (2010) 825–847.\n[2] G.F. Sirca, H. Adeli, System identification in structural engineering, Sci. Iran. 19 (6) (2012) 1355–1364.\n[3] G. Kerschen, K.Worden, A.F. Vakakis, J.C. Golinval, Past, present and future of nonlinear system identification in structural dynamics, Mech.\nSyst. Signal Process. 20 (2006) 505–592.\n[4] V. Klein, E.A. Morelli, Aircraft System Identification – Theory and Practice, in: AIAA Education Series, AIAA, 2006.\n[5] R. Ghanem, M. Shinozuka, Structural-system identification.1. Theory, J. Eng. Mech.-ASCE 121 (2) (1995) 225–264.\n[6] A. Tarantola, Inverse Problem Theory, Society for Industrial and Applied Mathematics, 2005.\n[7] J. Kaipio, E. Somersalo, Statistical and Computational Inverse Problems, Springer, 2005.\n[8] K.V. Yuen, Recent developments of Bayesian model class selection and applications in civil engineering, Struct. Saf. 32 (5) (2010) 338–346.\n[9] K. Worden, J.J. Hensman, Parameter estimation and model selection for a class of hysteretic systems using Bayesian inference, Mech. Syst.\nSignal Process. 32 (2012) 153–169.\n[10] P.L. Green, E.J. Cross, K. Worden, Bayesian system identification of dynamical systems using highly informative training data, Mech. Syst.\nSignal Process. 56–57 (2015) 109–122.\n[11] S.K. Au, F.L. Zhang, Fundamental two-stage formulation for Bayesian system identification, Part I: General theory, Mech. Syst. Signal\nProcess. 66–67 (2016) 31–42.\n[12] C.K. Oh, Bayesian learning for earthquake engineering applications and structural health monitoring (Ph.D. thesis), Caltech, Pasadena, CA,\n2007.\n[13] Y. Huang, J.L. Beck, Novel sparse Bayesian learning for structural health monitoring using incomplete modal data, in: Proceedings of 2013\nASCE International Workshop on Computing in Civil Engineering, 2013.\n[14] Y. Huang, J.L. Beck, Hierarchical sparse Bayesian learning for structural health monitoring with incomplete modal data, Int. J. Uncertain.\nQuant. 5 (2) (2015) 139–169.\n[15] Y. Huang, J.L. Beck, H. Li, Hierarchical sparse Bayesian learning for structural damage detection: Theory, computation and application,\nStruct. Saf. 64 (2017) 37–53.\n[16] Y. Huang, J.L. Beck, Sparse Bayesian learning with Gibbs sampling for structural health monitoring with noisy incomplete modal data, in:\nProceedings of 12th International Conference on Applications of Statistics and Probability in Civil Engineering, 2015.\n[17] M.E. Tipping, Sparse Bayesian learning and the relevance vector machine, J. Mach. Learn. Res. 1 (2001) 211–244.\n[18] Y. Huang, J.L. Beck, S. Wu, H. Li, Robust Bayesian compressive sensing for signals in structural health monitoring, Comput.-Aided Civ. Inf.\n29 (3) (2014) 160–179.\n[19] Y. Huang, J.L. Beck, S. Wu, H. Li, Bayesian compressive sensing for approximately sparse signals and application to structural health\nmonitoring signals for data loss recovery, Probab. Eng. Mech. 46 (2016) 62–79.\n[20] J.L. Beck, L.S. Katafygiotis, Updating models and their uncertainties. I: Bayesian statistical framework, J. Eng. Mech.-ASCE 124 (4) (1998)\n455–461.\n[21] C.P. Robert, G. Casella, in: S. Fienberg (Ed.), Monte Carlo Statistical Methods, second ed., Springer, 2004.\n[22] J.L. Beck, S.K. Au, Bayesian updating of structural models and reliability using Markov chain Monte Carlo simulation, J. Eng. Mech.-ASCE\n128 (2) (2002) 380–391.\n[23] K.V. Yuen, J.L. Beck, S.K. Au, Structural damage Detection and assessment using adaptive markov chain Monte Carlo simulation, Struct.\nControl Health 11 (4) (2004) 327–347.\n[24] J. Ching, Y.J. Chen, Transitional Markov chain Monte Carlo method for Bayesian model updating, model class selection, and model averaging,\nJ. Eng. Mech.-ASCE 133 (7) (2007) 816–832.\n[25] J.L. Beck, K.M. Zuev, Asymptotically independent Markov sampling: a new MCMC scheme for Bayesian inference, Int. J. Uncertain. Quant.\n3 (5) (2013) 445–474.\n[26] M. Chiachio, J.L. Beck, J. Chiachio, R. Guillermo, Approximate Bayesian computation by subset simulation, SIAM J. Sci. Comput. 36 (3)\n(2014) A1339–A1358.\n[27] D. Straub, I. Papaioannou, Bayesian updating with structural reliability methods, J. Eng. Mech. 141 (3) (2015) 04014134.\n[28] M.K. Vakilzadeh, Y. Huang, J.L. Beck, T. Abrahamsson, Approximate Bayesian computation by subset simulation using hierarchical statespace\nmodels, Mech. Syst. Signal Process. 84 (Part B) (2016) 2–20.\n[29] S. Geman, D. Geman, Stochastic relaxation, Gibbs distribution and the Bayesian restoration of images, IEEE Trans. Pattern Anal. 6 (1984)\n721–741.\n[30] J. Ching, M. Muto, J.L. Beck, Structural model updating and health monitoring with incomplete modal data using Gibbs Sampler, Comput.-\nAided Civ. Inf. 21 (4) (2006) 242–257.\n[31] M.W. Vanik, J.L. Beck, S.K. Au, Bayesian probabilistic approach to structural health monitoring, J. Eng. Mech.-ASCE 126 (7) (2000)\n738–745.\n[32] J.L. Beck, S.K. Au, M.W. Vanik, Monitoring structural health using a probabilistic measure, Comput.-Aided Civ. Inf. 16 (1) (2001) 1–11.\n[33] J. Ching, J.L. Beck, Two-step Bayesian structure health monitoring approach for IASC-ASCE phase II simulated and experimental benchmark\nstudies, Technical Report EERL 2003–02, Earthquake Engineering Research Laboratory, Caltech, 2003.\n[34] A. Gelman, J.B. Carlin, H.S. Stern, D.B. Dunson, A. Vehtari, D.B. Rubin, Bayesian Data Analysis, third ed., Chapman \u0026 Hall/CRC, 2013.\n[35] G. Ballesteros, P. Angelikopoulos, C. Papadimitriou, P. Koumoutsakos, Bayesian hierarchical models for uncertainty quantification in\nstructural dynamics, in: Proceedings of 2nd International Conference on Vulnerability and Risk Analysis and Management, and 6th\nInternational Symposium on Uncertainty, Modeling, and Analysis, 2014, pp. 1615–1624.\n[36] X.M. Jiang, S. Mahadevan, Bayesian hierarchical uncertainty quantification by structural equation modeling, Internat. J. Numer. Methods\nEngrg. 80 (6–7) (2009) 717–737.\n[37] J. Nagel, B. Sudret, Hamiltonian Monte Carlo and borrowing strength in hierarchical inverse problems, ASCE-ASME J. Risk Uncertain. Eng.\nSyst., Part A: Civ. Eng. 2 (3) (2015) B4015008.\n[38] I. Behmanesh, B. Moaveni, G. Lombaert, C. Papadimitriou, Hierarchical Bayesian model updating for structural identification, Mech. Syst.\nSignal Process. 64–65 (2015) 360–376.\n[39] S. Wu, P. Angelikopoulos, C. Papadimitriou, R. Moser, P. Koumoutsakos, A hierarchical Bayesian framework for force field selection in\nmolecular dynamics simulations, Phil. Trans. R. Soc. A 374 (2016) 20150032.\n[40] E.T. Jaynes, Probability Theory: The Logic of Science, Cambridge University Press, 2003.\n[41] D. Bernal, S.J. Dyke, H.F. Lam, J.L. Beck, Phase II of the ASCE benchmark study on SHM, in: Proceedings of 15th Eng. Mechanics Conf.,\nASCE, 2002, pp. 1048–1055.\n[42] J.L. Beck, P.C. Jennings, Structural identification using linear models and earthquake records, Earthq. Eng. Struct. Dyn. 8 (2) (1980) 145–160.\n[43] J.L. Beck, B.S. May, D.C. Polidori, Determination of modal parameters from ambient vibration data for structural health monitoring, in:\nProceedings of First World Conference on Structural Control, 1994, pp. TA3:3–TA3:12.\n[44] S.J. Dyke, D. Bernal, J.L. Beck, C. Ventura, Experimental phase II of the structural health monitoring benchmark problem, in: Proceedings of\n16th Eng. Mechanics Conf., ASCE, 2003."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Yong Huang, James L. Beck, Hui Li, Bayesian system identification based on hierarchical sparse Bayesian learning and Gibbs sampling with application to structural damage assessment, Computer Methods in Applied Mechanics and Engineering, Volume 318, 1 May 2017, Pages 382-411, ISSN 0045-7825, https://doi.org/10.1016/j.cma.2017.01.030.\n(http://www.sciencedirect.com/science/article/pii/S0045782516305060)","other_numbering_system":null,"funders":[{"agency":"National Natural Science Foundation of China","grant_number":"51308161"},{"agency":"Caltech George W. Housner Research Fund","grant_number":""},{"agency":"Office of China Postdoctoral Council","grant_number":"20140018"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}