{"title":"Exponential improvement in photon storage fidelities using subradiance and \"selective radiance\" in atomic arrays","uri":"","abstract":"A central goal within quantum optics is to realize efficient interactions\nbetween photons and atoms. A fundamental limit in nearly all applications based\non such systems arises from spontaneous emission, in which photons are absorbed\nby atoms and then re-scattered into undesired channels. In typical treatments\nof atomic ensembles, it is assumed that this re-scattering occurs\nindependently, and at a rate given by a single isolated atom, which in turn\ngives rise to standard limits of fidelity in applications such as quantum\nmemories or quantum gates. However, this assumption can be violated. In\nparticular, spontaneous emission of a collective atomic excitation can be\nsignificantly suppressed through strong interference in emission. Thus far the\nphysics underlying the phenomenon of subradiance and techniques to exploit it\nhave not been well-understood. In this work, we provide a comprehensive\ntreatment of this problem. First, we show that in ordered atomic arrays in free\nspace, subradiant states acquire an interpretation in terms of optical modes\nthat are guided by the array, which only emit due to scattering from the ends\nof the finite chain. We also elucidate the properties of subradiant states in\nthe many-excitation limit. Finally, we introduce the new concept of selective\nradiance. Whereas subradiant states experience a reduced coupling to all\noptical modes, selectively radiant states are tailored to simultaneously\nradiate efficiently into a desired channel while scattering into undesired\nchannels is suppressed, thus enabling an enhanced atom-light interface. We show\nthat these states naturally appear in chains of atoms coupled to nanophotonic\nstructures, and we analyze the performance of photon storage exploiting such\nstates. We find that selectively radiant states allow for a photon storage\nerror that scales exponentially better with number of atoms than previously\nknown bounds.\n","documents":[{"id":"http://authors.library.caltech.edu/id/document/252064","docid":252064,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256315","fileid":1256315,"datasetid":"document","objectid":252064,"filename":"1703.03382.pdf","mime_type":"application/pdf","hash":"0d800bfe2a37130d6f26d5acfd3267f0","hash_type":"MD5","filesize":3943079,"mtime":"2017-05-11 19:11:25","url":"http://authors.library.caltech.edu/77371/1/1703.03382.pdf"}],"eprintid":77371,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1703.03382.pdf","content":"submitted"}],"note":"We are grateful to C. Regal, A. M. Rey, A. Gorshkov, E. Polzik, S. Yelin, M. Lukin,\nH. Ritsch, E. Shahmoon, and J. Muniz for stimulating discussions. H.J.K. funding is provided by the AFOSR Quantum Many-Body Physics with Photons and QuMPASS MURI, NSF Grant PHY-1205729, the Office of Naval Research (ONR) Award N00014-16-1-2399; the ONR QOMAND MURI; and the IQIM, an NSF Physics Frontiers Center. A.A.-G. was supported by the IQIM Postdoctoral Fellowship and the Global Marie Curie Fellowship LANTERN (655701). D.E.C. acknowledges support from Fundació Privada Cellex, Marie Curie CIG ATOMNANO, Spanish MINECO Severo Ochoa Programme\nSEV-2015-0522, MINECO Plan Nacional Grant CANS, CERCA Programme/Generalitat de Catalunya,\nand ERC Starting Grant FOQAL.","id":77371,"rev_number":12,"userid":999,"eprint_dir":"disk0/00/07/73/71","datestamp":"2017-05-11 19:33:28","lastmod":"2017-05-11 20:49:08","status_changed":"2017-05-11 19:33:28","type":"monograph","metadata_visibility":"show","creators":[{"given":"A.","family":"Asenjo-Garcia","id":"Asenjo-Garcia-A","orcid":""},{"given":"M.","family":"Moreno-Cardoner","id":"Moreno-Cardoner-M","orcid":""},{"given":"A.","family":"Albrecht","id":"Albrecht-A","orcid":""},{"given":"H. J.","family":"Kimble","id":"Kimble-H-J","orcid":""},{"given":"D. E.","family":"Chang","id":"Chang-D-E","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2017-03-09","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170511-120626043","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170511-120626043","related_url":[{"url":"http://arxiv.org/abs/1703.03382","type":"arxiv","description":"Discussion Paper"}],"referencetext":["[1] K. Hammerer, A. S. Sørensen, and E. S. Polzik, Rev.\nMod. Phys. 82, 1041 (2010).\n[2] L. V. Hau, S. E. Harris, Z. Dutton, and C. H. Behroozi,\nNature 397, 594 (1999).\n[3] M. Fleischhauer, A. Imamoglu, and J. P. Marangos,\nRev. Mod. Phys. 77, 633 (2005).\n[4] B. Julsgaard, A. Kozhekin, and E. S. Polzik, Nature\n413, 400 (2001).\n[5] J. Pritchard, K. Weatherill, and C. Adams, Nonlinear\noptics using cold Rydberg atoms (Annual Review of Cold\nAtoms and Molecules, World Scientific, 2013).\n[6] T. Peyronel, O. Firstenberg, Q.-Y. Liang, S. Hofferberth,\nA. V. Gorshkov, T. Pohl, M. D. Lukin, and\nV. Vuletic, Nature 488, 57 (2012).\n[7] H. Gorniaczyk, C. Tresp, J. Schmidt, H. Fedder, and\nS. Hofferberth, Phys. Rev. Lett. 113, 053601 (2014).\n[8] D. Tiarks, S. Baur, K. Schneider, S. D¨urr, and\nG. Rempe, Phys. Rev. Lett. 113, 053602 (2014).\n[9] W. Wasilewski, K. Jensen, H. Krauter, J. J. Renema,\nM. V. Balabas, and E. S. Polzik, Phys. Rev. Lett. 104,\n133601 (2010).\n[10] I. D. Leroux, M. H. Schleier-Smith, and V. Vuletic,\nPhys. Rev. Lett. 104, 073602 (2010).\n[11] R. J. Sewell, M. Koschorreck, B. Dubost, N. Behbood,\nand M. W. Mitchell, Phys. Rev. Lett. 109, 253605\n(2012).\n[12] C. Noh and D. G. Angelakis, Rep. Prog. Phys. 80,\n016401 (2016).\n[13] R. H. Dicke, Phys. Rev. 93, 99 (1954).\n[14] M. Gross and S. Haroche, Phys. Rep. 93, 301 (1982).\n[15] S. Prasad and R. J. Glauber, Phys. Rev. A 61, 063814\n(2000).\n[16] A. A. Svidzinsky, J.-T. Chang, and M. O. Scully, Phys.\nRev. A 81, 053821 (2010).\n[17] D. Plankensteiner, L. Ostermann, H. Ritsch, and\nC. Genes, Sci. Rep. 5, 16231 (2015).\n[18] R. J. Bettles, S. A. Gardiner, and C. S. Adams, Phys.\nRev. A 92, 063822 (2015).\n[19] R. J. Bettles, S. A. Gardiner, and C. S. Adams, Phys.\nRev. A 94, 043844 (2016).\n[20] R. T. Sutherland and F. Robicheaux, PRA 94, 013847\n(2016).\n[21] H. Zoubi and H. Ritsch, EPL 90, 23001 (2010).\n[22] H. Zoubi and H. Ritsch, Phys. Rev. A 83, 063831\n(2011).\n[23] D. F. Kornovan, A. S. Sheremet, and M. I. Petrov, Phys.\nRev. B 94, 245416 (2016).\n[24] R. G. DeVoe and R. G. Brewer, Phys. Rev. Lett. 76,\n2049 (1996).\n[25] W. Guerin, M. Ara´ujo, and R. Kaiser, Phys. Rev. Lett.\n116, 083601 (2016).\n[26] E. Vetsch, D. Reitz, G. Sagu´e, R. Schmidt, S. Dawkins,\nand A. Rauschenbeutel, Phys. Rev. Lett. 104, 203603\n(2010).\n[27] A. Goban, K. S. Choi, D. J. Alton, C. Ding, C. Lacroute,\nM. Pototschnig, T. Thiele, N. P. Stern, and H. J. Kimble,\nPhys. Rev. Lett. 109, 033603 (2012).\n[28] J. A. Grover, P. Solano, L. A. Orozco, and S. L. Rolston,\nPhys. Rev. A 92, 013850 (2015).\n[29] H. L. Sørensen, J.-B. B´eguin, K. W. Kluge, I. Iakoupov,\nA. S. Sørensen, J. H. M¨uller, E. S. Polzik, and J. Appel,\nPhys. Rev. Lett. 117, 133604 (2016).\n[30] N. V. Corzo, B. Gouraud, A. Chandra, A. Goban, A. S.\nSheremet, D. V. Kupriyanov, and J. Laurat, Phys. Rev.\nLett. 117, 133603 (2016).\n[31] M. D. Lukin, Rev. Mod. Phys. 75, 457 (2003).\n[32] C. Sayrin, C. Clausen, B. Albrecht, P. Schneeweiss, and\nA. Rauschenbeutel, Optica 2, 2334 (2015).\n[33] B. Gouraud, D. Maxein, A. Nicolas, O. Morin, and\nJ. Laurat, Phys. Rev. Lett. 114, 180503 (2015).\n[34] A. V. Gorshkov, A. Andr´e, M. Fleischhauer, A. S.\nSørensen, and M. D. Lukin, Phys. Rev. Lett. 98, 123601\n(2007).\n[35] A. V. Gorshkov, A. Andr´e, M. D. Lukin, and A. S.\nSørensen, Phys. Rev. A 76, 033805 (2007).\n[36] N. A. R. Bhat and J. E. Sipe, Phys. Rev. A 73, 063808\n(2006).\n[37] T. Gruner and D.-G. Welsch, Phys. Rev. A 53, 1818\n(1996).\n[38] H. T. Dung, L. Kn¨oll, and D.-G. Welsch, Phys. Rev. A\n66, 063810 (2002).\n[39] S. Y. Buhmann and D.-G. Welsch, Prog. Quantum Electron.\n31, 51 (2007).\n[40] S. Y. Buhmann, Dispersion forces I (Springer-Verlag,\nBerlin, 2012).\n[41] L. Novotny and B. Hecht, Principles of Nano-Optics\n(Cambridge University Press, New York, 2006).\n[42] A. F. Oskooi, F. Ardavan, D. Roundy, M. Ibanescu,\nP. Bermel, J. D. Joannopoulos, and S. G. Johnson,\nComput. Phys. Commun. 181, 687 (2010).\n[43] V. S. C. Manga Rao and S. Hughes, Phys. Rev. B 75,\n205437 (2007).\n[44] J. D. Hood, A. Goban, A. Asenjo-Garcia, M. Lu, S.-P.\nYu, D. E. Chang, and H. J. Kimble, Proc. Natl. Acad.\nSci. 113, 10507 (2016).\n[45] A. Asenjo-Garcia, J. D. Hood, D. E. Chang, and H. J.\nKimble, arXiv:1606.04977.\n[46] T. Caneva, M. T. Manzoni, T. Shi, J. S. Douglas, J. I.\nCirac, and D. E. Chang, New J. Phys. 17, 113001\n(2015).\n[47] S. Xu and S. Fan, Phys. Rev. A 91, 043845 (2015).\n[48] D. E. Chang, L. Jiang, A. V. Gorshkov, and H. J. Kimble,\nNew J. Phys. 14, 063003 (2012).\n[49] T. Shi, D. E. Chang, and J. I. Cirac, Phys. Rev. A 92,\n053834 (2015).\n[50] R. J. Thompson, G. Rempe, and H. J. Kimble, Phys.\nRev. Lett. 68, 1132 (1992).\n[51] P. Meystre and M. Sargent, Elements of Quantum Optics\n(Springer-Verlag, Berlin, 2007).\n[52] V. A. Markel and A. K. Sarychev, Phys. Rev. B 75,\n085426 (2007).\n[53] R. R. Chance, A. Prock, and R. Silbey, Molecular Fluorescence\nand Energy Transfer Near Interfaces, vol. 37 of\nAdvances in Chemical Physics (John Wiley and Sons,\nHoboken, NJ, USA, 1978).\n[54] P. Lodahl, A. F. van Driel, I. S. Nikolaev, A. Irman,\nK. Overgaag, D. Vanmaekelbergh, and W. L. Vos, Nature\n430, 654 (2004).\n[55] D. Englund, D. Fattal, E. Waks, G. Solomon,\nB. Zhang, T. Nakaoka, Y. Arakawa, Y. Yamamoto, and\nJ. Vu˘ckovi`c, Phys. Rev. Lett. 95, 013904 (2005).\n34\n[56] N. J. Schilder, C. Sauvan, J.-P. Hugonin, S. Jennewein,\nY. R. P. Sortais, A. Browaeys, and J.-J. Greffet, Phys.\nRev. A 93, 063835 (2016).\n[57] S. Jennewein, M. Besbes, N. Schilder, S. Jenkins,\nC. Sauvan, J. Ruostekoski, J.-J. Greffet, Y. Sortais, and\nA. Browaeys, Phys. Rev. Lett. 116, 233601 (2016).\n[58] S. Jennewein, Y. R. P. Sortais, J.-J. Greffet, and\nA. Browaeys, Phys. Rev. A 394, 053828 (2016).\n[59] S. Bromley, B. Zhu, M. Bishof, X. Zhang, T. Bothwell,\nJ. Schachenmayer, T. Nicholson, R. Kaiser, S. Yelin,\nM. Lukin, et al., Nat. Commun. p. 11039 (2016).\n[60] W. Guerin and R. Kaiser, arXiv:1702.01053.\n[61] R. J. Bettles, S. A. Gardiner, and C. S. Adams, Phys.\nRev. Lett. 116, 103602 (2016).\n[62] E. Shahmoon, D. S. Wild, M. D. Lukin, S. F. Yelin,\narXiv:1610.00138.\n[63] J. D. Joannopoulos, R. D. Meade, and J. N. Winn, Photonic\nCrystals: Molding the Flow of Light (Princeton\nUniversity Press, Singapore, 2008).\n[64] J. R. Buck and H. J. Kimble, Phys. Rev. A 67, 033806\n(2003).\n[65] S. J. van Enk and H. J. Kimble, Phys. Rev. A 61, 051802\n(2000).\n[66] S. J. van Enk and H. J. Kimble, Phys. Rev. A 63, 023809\n(2001).\n[67] B. Darqui´e, M. P. A. Jones, J. Dingjan, J. Beugnon,\nS. Bergamini, Y. Sortais, G. Messin, A. Broaweys, and\nP. Grangier, Science 309, 454 (2005).\n[68] M. K. Tey, Z. Chen, S. A. Aljunid, B. Chng, F. Huber,\nG. Maslennikov, and C. Kurtsiefer, Nat. Phys. 4, 924\n(2008).\n[69] G. Wrigge, I. Gerhardt, J. Hwang, G. Zumofen, and\nV. Sandoghdar, Nat. Phys. 4, 60 (2008).\n[70] G. Hetet, L. Slodicka, M. Hennrich, and R. Blatt, Phys.\nRev. Lett. 107, 133002 (2011).\n[71] S. E. Harris, J. E. Field, and A. Imamoglu, Phys. Rev.\nLett. 64, 1107 (1990).\n[72] K.-J. Boller, A. Imamoglu, and S. E. Harris, Phys. Rev.\nLett. 66, 2593 (1991).\n[73] M. Fleischhauer and M. D. Lukin, Phys. Rev. Lett. 84,\n5094 (2000).\n[74] J. S. Douglas, H. H. Habibian, C.-L. Hung, A. V. Gorshkov,\nH. J. Kimble, and D. E. Chang, Nat. Photon. 9,\n326 (2015).\n[75] A. Gonz´alez Tudela, C.-L. Hung, D. E. Chang, J. I.\nCirac, and H. J. Kimble, Nat. Photon. 9, 320 (2015).\n[76] A. Goban, C.-L. Hung, J. D. Hood, S.-P. Yu, J. A. Muniz,\nO. Painter, and H. J. Kimble, Phys. Rev. Lett. 115,\n063601 (2015).\n[77] D. M. Sullivan, Electromagnetic Simulation Using the\nFDTD Method (Wiley-IEEE Press, New York, 2000).\n[78] J. A. Stratton, Electromagnetic Theory (McGraw-Hill,\nNew York, 1941).\n[79] C. Yeh and F. Shimabukuro, The essence of dielectric\nwaveguides (Springer, New York, 2008).\n[80] F. L. Kien, S. D. Gupta, V. I. Balykin, and K. Hakuta,\nPhys. Rev. A 72, 032509 (2005).\n[81] D. Dzsotjan, A. S. S¨orensen, and M. Fleischhauer, Phys.\nRev. B 82, 075427 (2010).\n[82] F. L. Kien and A. Rauschenbeutel, Phys. Rev. A 90,\n063816 (2014).\n[83] X. Qi, B. Q. Baragiola, I. H. Deutsch, and P. S. Jessen,\nPhys. Rev. A 93, 023817 (2016).\n[84] F. Le Kien and A. Rauschenbeutel, arXiv:1612.04516.\n[85] V. V. Klimov and M. Ducloy, Phys. Rev. A 69, 013812\n(2004).\n[86] J. G. Bohnet, Z. Chen, J. M. Weiner, D. Meiser, M. J.\nHolland, and J. K. Thompson, Nature 484, 78 (2012).\n[87] R. Reimann, W. Alt, T. Kampschulte, T. Macha,\nL. Ratschbacher, N. Thau, S. Yoon, and D. Meschede,\nPhys. Rev. Lett. 114, 023601 (2015).\n[88] B. Casabone, K. Friebe, B. Brandst¨atter, K. Sch¨uppert,\nR. Blatt, and T. E. Northup, Phys. Rev. Lett. 114,\n023602 (2015).\n[89] A. Gonz´alez Tudela, V. Paulisch, D. E. Chang, H. J.\nKimble, and J. I. Cirac, Phys. Rev. Lett. 115, 163603\n(2015).\n[90] I. H. Deutsch, R. J. C. Spreeuw, S. L. Rolston, and\nW. D. Phillips, Phys. Rev. A 52, 1394 (1995).\n[91] A. Schilke, C. Zimmermann, P. W. Courteille, and\nW. Guerin, Phys. Rev. Lett. 106, 2223903 (2011).\n[92] V. Paulisch, H. J. Kimble, and A. Gonz´alez Tudela, New\nJ. Phys. 18, 043041 (2016).\n[93] I. Moerman, P. P. V. Daele, and P. M. Demeester, IEEE\nJ. Sel. Top. Quantum Electron. 3, 1308 (1997).\n[94] V. R. Almeida, R. R. Panepucci, and M. Lipson, Opt.\nLett. 28, 1302 (2003).\n[95] D. E. Chang, A. H. Safavi-Naeini, M. Hafezi, and\nO. Painter, New J. Phys. 13, 023003 (2011).\n[96] J. Scheuer, G. T. Paloczi, J. K. S. Poon, and A. Yariv,\nOpt. Photonics News 16, 36 (2005).\n[97] M. Fleischhauer and M. D. Lukin, Phys. Rev. A 65,\n022314 (2002).\n[98] I. Bloch, Nat. Physics 1, 23 (2005).\n[99] W. S. Bakr, J. I. Gillen, A. Peng, S. F¨olling, and\nM. Greiner, Nature 465, 74 (2009).\n[100] W. S. Bakr, A. Peng, M. E. Tai, R. Ma, J. Simon, J. I.\nGillen, S. F¨olling, L. Pollet, and M. Greiner, Science\n329, 547 (2010).\n[101] D. Greif, M. F. Parsons, A. Mazurenko, C. S. Chiu,\nS. Blatt, F. Huber, G. Ji, and M. Greiner, Science 351,\n953 (2016).\n[102] M. Endres, H. Bernien, A. Keesling, H. Levine, E. R.\nAnschuetz, A. Krajenbrink, C. Senko, V. Vuletic,\nM. Greiner, and M. D. Lukin, Science p. DOI:\n0.1126/science.aah3752 (2016).\n[103] B. J. Lester, N. Luick, A. M. Kaufman, C. M. Reynolds,\nand C. A. Regal, Phys. Rev. Lett. 115, 073003 (2015).\n[104] D. Barredo, S. de L´es´eleuc, V. Lienhard, T. Lahaye,\nand A. Browaeys, Science p. 10.1126/science.aah3778\n(2016).\n[105] C.-L. Hung, S. M. Meenehan, D. E. Chang, O. Painter,\nand H. J. Kimble, New J. Phys. 15, 083026 (2013).\n[106] J. D. Thompson, T. G. Tiecke, N. P. de Leon, J. Feist,\nA. V. Akimov, M. Gullans, A. S. Zibrov, V. Vuletic, and\nM. D. Lukin, Science 6137, 1202 (2013).\n[107] A. Goban, C.-L. Hung, S.-P. Yu, J. D. Hood, J. A. Muniz,\nJ. H. Lee, M. J. Martin, A. C. McClung, K. S. Choi,\nD. E. Chang, et al., Nat. Comm. 5, 3808 (2014).\n[108] T. Lund-Hansen, S. Stobbe, B. Julsgaard,\nH. Thyrrestrup, T. S¨unner, M. Kamp, A. Forchel,\nand P. Lodahl, Phys. Rev. Lett. 101, 113903 (2008).\n[109] A. B. Young, A. C. T. Thijssen, D. M. Beggs, P. Androvitsaneas,\nL. Kuipers, J. G. Rarity, S. Hughes, and\nR. Oulton, Phys. Rev. Lett. 115, 153901 (2015).\n[110] P. Lodahl, S. Mahmoodian, and S. Stobbe, Rev. Mod.\nPhys. 87, 347 (2015).\n35\n[111] T. Kornher, K. Xia, R. Kolesov, N. Kukharchyk,\nR. Reuter, P. Siyushev, R. St¨ohr, M. Schreck, H.-W.\nBecker, B. Villa, et al., Appl. Phys. Lett. 108, 053108\n(2016).\n[112] G. Jacob, K. Groot-Berning, S. Wolf, S. Ulm, L. Couturier,\nS. T. Dawkins, U. G. Poschinger, F. SchmidtKaler,\nand K. Singer, Phys. Rev. Lett. 117, 043001\n(2016).\n[113] A. Sipahigil, R. E. Evans, D. D. Sukachev, M. J. Burek,\nJ. Borregaard, M. K. Bhaskar, C. T. Nguyen, J. L. .\nPacheco, H. A. Atikian, C. Meuwly, et al., Science 354,\n847 (2016).\n[114] M. Metcalf and P. van der Straten, Laser Cooling and\nTrapping (Springer-Verlag, New York, 1999).\n[115] X. Xu, T. H. Loftus, J. L. Hall, A. Gallagher, and J. Ye,\nJ. Opt. Soc. Am. B 20, 968 (2003).\n[116] S. Stellmer, F. Schreck, and T. C. Killian,\narXiv:1307.0601.\n[117] M. Hebenstreit, B. Kraus, L. Ostermann and H. Ritsch,\narXiv:1701.01471.\n[118] J. M. Bendickson, J. P. Dowling, and M. Scalora, Phys.\nRev. E 53, 4107 (1996).\n[119] J. S. Douglas, T. Caneva, and D. E. Chang, Phys. Rev.\nX 6, 031017 (2016)."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"PHY-1205729"},{"agency":"Office of Naval Research (ONR)","grant_number":"N00014-16-1-2399"},{"agency":"Institute for Quantum Information and Matter (IQIM)","grant_number":""},{"agency":"Marie Curie Fellowship","grant_number":"655701"},{"agency":"Ministerio de Economía, Industria y Competitividad (MINECO)","grant_number":"SEV-2015-0522"},{"agency":"European Research Council (ERC)","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"TD","local_group":["Institute for Quantum Information and Matter","IQIM"]}