{"title":"A Comparison of Three Ion Sensing Circuits in a Homogeneous Charge Compression Ignition Engine","uri":"","abstract":"The use of a spark plug ion sensor to detect combustion timing in a homogeneous charge compression ignition (HCCI) engine is a technique that could alleviate the need for pressure transducers, a more expensive alternative. One disadvantage of this approach is the difficulty in obtaining a strong signal at lower equivalence ratios. This article addresses and compares three ion sensing circuitries, namely a voltage follower, a notch filter circuit that removes the 60-Hz wall noise, and a notch filter whose output is coupled to a custom-built “integrator” circuit. The circuit optimizations are aimed at improving signal strength and reliability. The ion signal present in the combustion chamber is experimentally investigated in a 1.9-L Volkswagen engine, modified for HCCI operation and fueled with gasoline. Experiments are conducted across different intake temperatures, pressures, and equivalence ratios. It was found that the custom-built circuit provided the best ion signal strength and reliability.","documents":null,"note":"© 2017 Taylor \u0026 Francis. \n\nReceived 12 Jul 2016, Accepted 09 Feb 2017, Accepted author version posted online: 14 Feb 2017, Published online: 14 Feb 2017.","id":77380,"rev_number":6,"userid":18,"eprint_dir":"disk0/00/07/73/80","datestamp":"2017-05-12 23:15:00","lastmod":"2017-05-12 23:15:00","status_changed":"2017-05-12 23:15:00","type":"article","metadata_visibility":"show","creators":[{"given":"Tung M.","family":"Phan","id":"Phan-Tung-M","orcid":""},{"given":"J. Hunter","family":"Mack","id":"Mack-J-H","orcid":""},{"given":"Ryan H.","family":"Butt","id":"Butt-R-H","orcid":""},{"given":"Robert W.","family":"Dibble","id":"Dibble-R-W","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Circuits, Engine, Homogeneous charge compression ignition (HCCI), Ion signal, Sensor","date":"2017-02-14","date_type":"published","publication":"Combustion Science and Technology","volume":"189","number":"8","pagerange":"1294-1306","id_number":"CaltechAUTHORS:20170511-143747031","refereed":true,"issn":"0010-2202","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170511-143747031","related_url":[{"url":"http://dx.doi.org/10.1080/00102202.2017.1294587","type":"doi","description":"Article"},{"url":"http://www.tandfonline.com/doi/full/10.1080/00102202.2017.1294587","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}