{"title":"Spectral inequalities for Schrödinger operators with surface potentials","uri":"","abstract":"We prove sharp Lieb-Thirring inequalities for Schrödinger operators with potentials supported on a hyperplane and we show how these estimates are related to Lieb-Thirring inequalities for relativistic Schrödinger operators.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252108","docid":252108,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256591","fileid":1256591,"datasetid":"document","objectid":252108,"filename":"0711.3473.pdf","mime_type":"application/pdf","hash":"234e7b5de9d27b8fffd4e5c847ef853b","hash_type":"MD5","filesize":204577,"mtime":"2017-05-12 16:57:41","url":"http://authors.library.caltech.edu/77399/1/0711.3473.pdf"}],"eprintid":77399,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"0711.3473.pdf","content":"submitted"}],"note":"© 2007 by the authors. This paper may be reproduced, in its entirety, for non-commercial purposes. \n\n(Submitted on 21 Nov 2007) \n\nThis work has been supported by DAAD grant D/06/49117 (R. F.).","id":77399,"rev_number":9,"userid":772,"eprint_dir":"disk0/00/07/73/99","datestamp":"2017-05-12 23:35:32","lastmod":"2017-05-12 23:35:44","status_changed":"2017-05-12 23:35:32","type":"monograph","metadata_visibility":"show","creators":[{"given":"Rupert L.","family":"Frank","id":"Frank-R-L","orcid":""},{"given":"Ari","family":"Laptev","id":"Laptev-A","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2007-11-21","date_type":"submitted","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170512-095723566","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170512-095723566","related_url":[{"url":"https://arxiv.org/abs/0711.3473","type":"arxiv","description":"Discussion Paper"}],"referencetext":["[AL] M. Aizenman, E. Lieb, On semiclassical bounds for eigenvalues of Schr¨odinger operators. Phys. Lett.\nA 66 (1978), no. 6, 427–429.\n[B] F.A. Berezin, Covariant and contravariant symbols of operators [Russian]. Math. USSR Izv. 6 (1972),\n1117–1151.\n[BKS] M. S. Birman, L. S. Koplienko, M. Z. Solomyak, Estimates for the spectrum of the difference between\nfraction powers of two self-adjoint operators. Soviet Math. (Iz. VUZ) 19 (1975), no. 3, 1–6.\n[CL] E. Carlen, M. Loss, Competing symmetries of some functionals arising in mathematical physics. In:\nStochastic processes, physics and geometry (Ascona and Locarno, 1988), 277–288, World Sci. Publ.,\nTeaneck, NJ, 1990.\n[CS] L. Caffarelli, L. Silvestre, An extension problem related to the fractional Laplacian. Comm. Partial\nDifferential Equations 32 (2007), no. 8, 1245–1260.\n[D] I. Daubechies, An uncertainty principle for fermions with generalized kinetic energy. Comm. Math.\nPhys. 90 (1983), no. 4, 511–520.\n[DLL] J. Dolbeault, A. Laptev, M. Loss, Lieb-Thirring inequalities with improved constants. J. Eur. Math.\nSoc., to appear.\n[E] J. Escobar, Sharp constant in a Sobolev trace inequality. Indiana Univ. Math. J. 37 (1988), 687-698.\n[F] R. L. Frank, A remark on eigenvalue estimates and semigroup domination. In preparation.\n[FLLS] R. L. Frank, A. Laptev, E. H. Lieb, R. Seiringer, Lieb-Thirring inequalities for Schr¨odinger operators\nwith complex-valued potentials. Lett. Math. Phys. 77 (2006), 309–316.\n[FLS1] R. L. Frank, E. H. Lieb, R. Seiringer, Hardy-Lieb-Thirring inequalities for fractional Schr¨odinger\noperators. J. Amer. Math. Soc., to appear.\n[FLS2] R. L. Frank, E. H. Lieb, R. Seiringer, Number of bound states of Schr¨odinger operators with matrixvalued\npotentials. Lett. Math. Phys., to appear.\n[FS] R. L. Frank, R. G. Shterenberg, On the scattering theory of the Laplacian with a periodic boundary\ncondition. II. Additional channels of scattering. Doc. Math. 9 (2004), 57–77.\n[H1] D. Hundertmark, On the number of bound states for Schr¨odinger operators with operator-valued\npotentials. Ark. Mat. 40 (2002), 73–87.\n[H2] D. Hundertmark, Some bound state problems in quantum mechanics. In: Spectral theory and mathematical\nphysics: a Festschrift in honor of Barry Simon’s 60th birthday, 463–496, Proc. Sympos. Pure\nMath. 76, Part 1, Amer. Math. Soc., Providence, RI, 2007.\n[HLW] D. Hundertmark, A. Laptev and T. Weidl, New bounds on the Lieb-Thirring constants. Invent. Math.,\n40 (2000), 693–704.\n[L] A. Laptev, Dirichlet and Neumann eigenvalue problems on domains in Euclidean spaces. J. Funct.\nAnal. 151 (1997), no. 2, 531–545.\n[LW1] A. Laptev, T. Weidl, Sharp Lieb-Thirring inequalities in high dimensions. Acta Math. 184 (2000),\nno. 1, 87–111.\n[LW2] A. Laptev, T. Weidl, Recent results on Lieb-Thirring inequalities. Journ´ees ”´ Equations aux D´eriv´ees\nPartielles” (La Chapelle sur Erdre, 2000), Exp. No. XX, Univ. Nantes, Nantes, 2000.\n[LY] P. Li, S-T. Yau, On the Schr¨odinger equation and the eigenvalue problem. Comm. Math. Phys. 88\n(1983), 309–318.\n[LL] E. H. Lieb, M. Loss, Analysis. Second edition. Graduate Studies in Mathematics 14, American Mathematical\nSociety, Providence, RI, 2001.\n[LSS] E. H. Lieb, H. Siedentop, J. P. Solovej, Relativistic electrons in classical electromagnetic fields. J. Stat.\nPhys. 89 (1997), 37–59.\n[LT] E. H. Lieb, W. Thirring, Inequalities for the moments of the eigenvalues of the Schr¨odinger Hamiltonian\nand their relation to Sobolev inequalities. Studies in Mathematical Physics, 269–303. Princeton\nUniversity Press, Princeton, NJ, 1976.\n[P] G. P´olya, On the eigenvalues of vibrating membranes. Proc. London Math. Soc. 11 (1961), 419–433.\n[R] G. V. Rozenblyum, Domination of semigroups and estimates for eigenvalues. St. Petersburg Math.\nJ. 12 (2001), no. 5, 831–845.\n[S] B. Simon, Trace ideals and their applications, Second edition, Mathematical Surveys and Monographs\n120, American Mathematical Society, Providence, RI, 2005."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Deutscher Akademischer Austauschdienst (DAAD)","grant_number":"D/06/49117"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}