{"title":"Equilibrium measures and capacities in spectral theory","uri":"","abstract":"This is a comprehensive review of the uses of potential\ntheory in studying the spectral theory of orthogonal polynomials. Much of the article focuses on the Stahl–Totik theory of regular measures, especially the case of OPRL and OPUC. Links are made to the study of ergodic Schr¨odinger operators where one of our new results implies that, in complete generality, the spectral measure is supported on a set of zero Hausdorff dimension (indeed, of capacity zero) in the region of strictly positive Lyapunov exponent. There are many examples and some new conjectures and indications of new research directions. Included are appendices on potential theory and on Fekete–Szegő theory.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252099","docid":252099,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256546","fileid":1256546,"datasetid":"document","objectid":252099,"filename":"0711.2700.pdf","mime_type":"application/pdf","hash":"3b753f9e61c33593b6f55cd3df3021b8","hash_type":"MD5","filesize":758072,"mtime":"2017-05-12 16:15:56","url":"http://authors.library.caltech.edu/77394/1/0711.2700.pdf"}],"eprintid":77394,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"0711.2700.pdf","content":"submitted"}],"note":"August 23, 2007. \n\n(Submitted on 16 Nov 2007) \n\nSupported in part by NSF grants DMS-0140592 and DMS-0652919 and U.S.–Israel Binational Science Foundation (BSF) Grant No.2002068.","id":77394,"rev_number":9,"userid":772,"eprint_dir":"disk0/00/07/73/94","datestamp":"2017-05-12 23:45:58","lastmod":"2017-05-12 23:45:58","status_changed":"2017-05-12 23:45:58","type":"monograph","metadata_visibility":"show","creators":[{"given":"Barry","family":"Simon","id":"Simon-B","orcid":"0000-0003-2561-8539"}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"Potential theory, spectral theory, regular orthogonal polynomials","date":"2007-11-16","date_type":"submitted","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170512-091544520","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170512-091544520","related_url":[{"url":"https://arxiv.org/abs/0711.2700","type":"arxiv","description":"Discussion Paper"}],"referencetext":["[1] S. Agmon, Lectures on Exponential Decay of Solutions of Second-Order Elliptic\nEquations: Bounds on Eigenfunctions of N-body Schr¨odinger Operators,\nMathematical Notes, 29, Princeton Univ. Press, Princeton, N.J.; Univ. of\nTokyo Press, Tokyo, 1982.\n[2] P. W. Anderson, Absence of diffusion in certain random lattices, Phys. Rev.\n109 (1958), 1492–1505.\n[3] V. V. Andrievskii and H.-P. Blatt, Discrepancy of Signed Measures and\nPolynomial Approximation, Springer Monographs in Mathematics, Springer-\nVerlag, New York, 2002.\n[4] F. V. Atkinson, On the location of the Weyl circles, Proc. Roy. Soc. Edinburgh\nSect. A 88 (1981), 345–356.\n[5] S. Aubry, Metal insulator transition in one-dimensional deformable lattices,\nin “Bifurcation Phenomena in Mathematical Physics and Related Topics,”\n(C. Bardos and D. Bessis, eds.), pp. 163–184, NATO Advanced Study Institute\nSeries, Ser. C: Mathematical and Physical Sciences, 54, D. Reidel\nPublishing, Dordrecht-Boston, 1980.\n[6] A. Avila, in preparation.\n[7] A. Avila, in preparation.\n[8] A. Avila and D. Damanik, Absolute continuity of the integrated density of\nstates for the almost Mathieu operator with non-critical coupling, preprint.\n[9] A. Avila and S. Jitomirskaya, Almost localization and almost reducibility,\npreprint.\n[10] A. Avila and R. Krikorian, Reducibility or nonuniform hyperbolicity for\nquasiperiodic Schr¨odinger cocycles, Annals of Math. 164 (2006), 911–940.\n[11] J. Avron and B. Simon, Almost periodic Schr¨odinger operators. I. Limit periodic\npotentials, Comm. Math. Phys. 82 (1981/82), 101–120.\n[12] J. Avron and B. Simon, Almost periodic Schr¨odinger operators. II. The integrated\ndensity of states, Duke Math. J. 50 (1983), 369–391.\n[13] M. Benderskii and L. Pastur, The spectrum of the one-dimensional\nSchr¨odinger equation with a random potential, Math. USSR Sb. 11 (1970),\n245–256; Russian original in Mat. Sb. (N.S.) 82(124) (1970), 273–284.\n[14] Ju. M. Berezanski˘ı, Expansions in eigenfunctions of selfadjoint operators,\nTranslations of Mathematical Monographs, 17, American Mathematical Society,\nProvidence, R.I., 1968.\n[15] P. Borwein and T. Erd´elyi, Polynomials and Polynomial Inequalities, Graduate\nTexts in Mathematics, 161, Springer-Verlag, New York, 1995.\n[16] J. Bourgain, On the spectrum of lattice Schr¨odinger operators with deterministic\npotential, J. Anal. Math. 87 (2002), 37–75.\n[17] J. Bourgain, On the spectrum of lattice Schr¨odinger operators with deterministic\npotential. II., J. Anal. Math. 88 (2002), 221–254.\n[18] J. Bourgain, Green’s Function Estimates for Lattice Schr¨odinger Operators\nand Applications, Annals of Mathematics Studies, 158, Princeton University\nPress, Princeton, N.J., 2005.\n[19] J. Bourgain and S. Jitomirskaya, Continuity of the Lyapunov exponent for\nquasiperiodic operators with analytic potential, J. Statist. Phys. 108 (2002),\n1203–1218.\n[20] F. E. Browder, Eigenfunction expansions for formally self-adjoint partial differential\noperators. I, Proc. Nat. Acad. Sci. U.S.A. 42 (1956), 769–771.\n[21] R. Carmona and J. Lacroix, Spectral Theory of Random Schr¨odinger Operators.\nProbability and Its Applications, Birkh¨auser, Boston, 1990.\n[22] J. R. Choksi and M. G. Nadkarni, Genericity of certain classes of unitary\nand self-adjoint operators, Canad. Math. Bull. 41 (1998), 137–139.\n[23] S. Clark and F. Gesztesy, On Povzner–Wienholtz-type self-adjointness results\nfor matrix-valued Sturm–Liouville operators, Proc. Math. Soc. Edinburgh\n133A (2003), 747–758.\n[24] W. Craig, The trace formula for Schr¨odinger operators on the line, Comm.\nMath. Phys. 126 (1989), 379–407.\n[25] W. Craig and B. Simon, Subharmonicity of the Lyaponov index, Duke Math.\nJ. 50 (1983), 551–560.\n[26] H. L. Cycon, R. G. Froese, W. Kirsch, and B. Simon, Schr¨odinger Operators\nWith Application to Quantum Mechanics and Global Geometry, Texts and\nMonographs in Physics, Springer, Berlin, 1987.\n[27] D. Damanik, Lyapunov exponents and spectral analysis of ergodic Schr¨odinger\noperators: A survey of Kotani theory and its applications, in “Spectral Theory\nand Mathematical Physics: A Festschrift in Honor of Barry Simon’s 60th\nBirthday” (F. Gesztesy et al., eds.), pp. 539–563, Proc. Symp. Pure Math.,\n76.2, American Mathematical Society, Providence, R.I., 2007.\n[28] D. Damanik, Strictly ergodic subshifts and associated operators, in “Spectral\nTheory and Mathematical Physics: A Festschrift in Honor of Barry Simon’s\n60th Birthday” (F. Gesztesy et al., eds.), pp. 505–538, Proc. Symp. Pure\nMath., 76.2, American Mathematical Society, Providence, R.I., 2007.\n[29] D. Damanik, R. Killip, and B. Simon, Perturbations of orthogonal polynomials\nwith periodic recursion coefficients, preprint.\n[30] P. A. Deift and B. Simon, Almost periodic Schr¨odinger operators, III. The\nabsolutely continuous spectrum in one dimension, Comm. Math. Phys. 90\n(1983), 389–411.\n[31] R. del Rio, S. Jitomirskaya, Y. Last, and B. Simon, Operators with singular\ncontinuous spectrum, IV. Hausdorff dimensions, rank one perturbations, and\nlocalization, J. Anal. Math. 69 (1996), 153–200.\n[32] F. Delyon, B. Simon, and B. Souillard, From power pure point to continuous\nspectrum in disordered systems, Ann. Inst. H. Poincar´e 42 (1985), 283–309.\n[33] J. L. Doob, Measure Theory, Graduate Texts in Mathematics, 143, Springer-\nVerlag, New York, 1994.\n[34] P. Erd¨os and P. Tur´an, On interpolation. III. Interpolatory theory of polynomials,\nAnnals of Math. (2) 41 (1940), 510–553.\n[35] G. Faber, ¨Uber Tschebyscheffsche Polynome, J. Reine Angew. Math. 150\n(1919), 79–106.\n[36] A. Fedotov and F. Klopp, Strong resonant tunneling, level repulsion and spectral\ntype for one-dimensional adiabatic quasi-periodic Schr¨odinger operators,\nAnn. Sci. ´Ecole Norm. Sup. (4) 38 (2005), 889–950.\n[37] A. Fedotov and F. Klopp, Weakly resonant tunneling interactions for adiabatic\nquasi-periodic Schr¨odinger operators, M´em. Soc. Math. Fr. (N.S.),\nNo. 104 (2006).\n[38] M. Fekete, ¨U ber die Verteilung der Wurzeln bei gewissen algebraischen Gleichungen\nmit ganzzahligen Koeffizienten, Math. Z. 17 (1923), 228–249.\n[39] G. Freud, Orthogonal Polynomials, Pergamon Press, Oxford-New York, 1971.\n[40] L. G°arding, Eigenfunction expansions connected with elliptic differential operators,\nTolfte Skandinaviska Matematikerkongressen, Lund, 1953, pp. 44–55,\nLunds Universitets Matematiska Institution, Lund, 1954.\n[41] I. M. Gel′fand, Expansion in characteristic functions of an equation with\nperiodic coefficients, Dokl. Akad. Nauk SSSR (N.S.) 73, (1950), 1117–1120\n(Russian).\n[42] J. S. Geronimo, Polynomials orthogonal on the unit circle with random recurrence\ncoefficients, in “Methods of Approximation Theory in Complex Analysis\nand Mathematical Physics” (Leningrad, 1991), pp. 43–61, Lecture Notes in\nMath., 1550, Springer, Berlin, 1993.\n[43] Ya. L. Geronimus, On certain asymptotic properties of polynomials, Mat. Sb.\nN. S. 23(65), (1948), 77–88 (Russian).\n[44] Ya. L. Geronimus, Orthogonal Polynomials: Estimates, Asymptotic Formulas,\nand Series of Polynomials Orthogonal on the Unit Circle and on an Interval,\nConsultants Bureau, New York, 1961.\n[45] F. Gesztesy and B. Simon, A new approach to inverse spectral theory, II.\nGeneral real potentials and the connection to the spectral measure, Annals of\nMath. 152 (2000), 593–643.\n[46] L. Golinskii and S. Khrushchev, Ces`aro asymptotics for orthogonal polynomials\non the unit circle and classes of measures, J. Approx. Theory 115 (2002),\n187–237.\n[47] L. Golinskii and P. Nevai, Szeg˝o difference equations, transfer matrices and\northogonal polynomials on the unit circle, Comm. Math. Phys. 223 (2001),\n223–259.\n[48] G. M. Goluzin, Geometric Theory of Functions of a Complex Variable, Translations\nof Mathematical Monographs, 26, American Mathematical Society,\nProvidence, R.I., 1969.\n[49] A. Gordon, S. Jitomirskaya, Y. Last and B. Simon, Duality and singular\ncontinuous spectrum in the almost Mathieu equation, Acta Math. 178 (1997),\n169–183.\n[50] L. L. Helms, Introduction to Potential Theory, Pure and Applied Mathematics,\n22, Wiley-Interscience, New York, 1969.\n[51] D. Herbert and R. Jones, Localized states in disordered systems, J. Phys. C:\nSolid State Phys. 4 (1971), 1145–1161.\n[52] M. Herman, Une m´ethode pour minorer les exposants de Lyapounov et\nquelques exemples montrant le caractre local d’un th´eor`eme d’Arnol’d et de\nMoser sur le tore de dimension 2, Comment. Math. Helv. 58 (1983), 453–502.\n[53] K. Ishii, Localization of eigenstates and transport phenomena in the onedimensional\ndisordered system, Supp. Prog. Theor. Phys. 53 (1973), 77–138.\n[54] K. Ishii and H. Matsuda, Localization of normal modes and energy transport\nin the disordered harmonic chain, Suppl. Prog. Theor. Phys. 45 (1970), 56–86.\n[55] S. Jitomirskaya, Metal-insulator transition for the almost Mathieu operator,\nAnnals of Math. 150 (1999), 1159–1175.\n[56] S. Jitomirskaya, Ergodic Schr¨odinger Operators (on one foot), in “Spectral\nTheory and Mathematical Physics: A Festschrift in Honor of Barry Simon’s\n60th Birthday” (F. Gesztesy et al., eds.), pp. 613–647, Proc. Symp. Pure\nMath., 76.2, American Mathematical Society, Providence, R.I., 2007.\n[57] S. Jitomirskaya, private communication.\n[58] S. Jitomirskaya and M. Landrigan, Zero-dimensional spectral measures for\nquasi-periodic operators with analytic potential, J. Statist. Phys. 100 (2000),\n791–796.\n[59] S. Jitomirskaya and Y. Last, Power law subordinacy and singular spectra, II.\nLine operators, Comm. Math. Phys. 211 (2000), 643–658.\n[60] S. Jitomirskaya and B. Simon, Operators with singular continuous spectrum:\nIII. Almost periodic Schr¨odinger operators, Comm. Math. Phys. 165 (1994),\n201–205.\n[61] K. Johansson, On Szeg˝o’s asymptotic formula for Toeplitz determinants and\ngeneralizations, Bull. Sci. Math. (2) 112 (1988), 257–304.\n[62] G. I. Kac, Expansion in characteristic functions of self-adjoint operators,\nDokl. Akad. Nauk SSSR (N.S.) 119 (1958), 19–22 (Russian).\n[63] L. Kalm´ar, Az interpolatiorol, Mathematikai es Fizikai Lapok, 1927, pp. 120–\n149 (Hungarian).\n[64] Y. Katznelson, An Introduction to Harmonic Analysis, 2nd corrected edition,\nDover Publications, New York, 1976.\n[65] R. Killip, A. Kiselev, and Y. Last, Dynamical upper bounds on wavepacket\nspreading, Am. J. Math. 125 (2003), 1165–1198.\n[66] W. Kirsch and B. Metzger, The integrated density of states and random\nSchr¨odinger operators, in “Spectral Theory and Mathematical Physics: A\nFestschrift in Honor of Barry Simon’s 60th Birthday” (F. Gesztesy et al.,\neds.), pp. 649–696, Proc. Symp. Pure Math., 76.2, American Mathematical\nSociety, Providence, R.I., 2007.\n[67] A. Kiselev, Y. Last, and B. Simon, Modified Pr¨ufer and EFGP transforms\nand the spectral analysis of one-dimensional Schr¨odinger operators, Comm.\nMath. Phys. 194 (1998), 1–45.\n[68] P. P. Korovkin, The asymptotic representation of polynomials orthogonal over\na region, Dokl. Akad. Nauk SSSR (N.S.) 58 (1947), 1883–1885 (Russian).\n[69] S. Kotani, Ljapunov indices determine absolutely continuous spectra of stationary\nrandom one-dimensional Schr¨odinger operators, in “Stochastic Analysis”\n(Katata/Kyoto, 1982), pp. 225–247, North-Holland Math. Library, 32,\nNorth-Holland, Amsterdam, 1984.\n[70] S. Kotani, Jacobi matrices with random potentials taking finitely many values,\nRev. Math. Phys. 1 (1989), 129–133.\n[71] S. Kotani, Generalized Floquet theory for stationary Schr¨odinger operators in\none dimension, Chaos Solitons Fractals 8 (1997), 1817–1854.\n[72] H. Kunz and B. Souillard, Sur le spectre des op´erateurs aux diff´erences finies\nal´eatoires, Comm. Math. Phys. 78 (1980/81), 201–246.\n[73] N. S. Landkof, Foundations of Modern Potential Theory, Springer-Verlag,\nBerlin-New York, 1972.\n[74] Y. Last, On the measure of gaps and spectra for discrete 1D Schr¨odinger\noperators, Comm. Math. Phys. 149 (1992), 347–360.\n[75] Y. Last and B. Simon, Eigenfunctions, transfer matrices, and absolutely continuous\nspectrum of one-dimensional Schr¨odinger operators, Invent. Math.\n135 (1999), 329–367.\n[76] P. D. Lax, Functional Analysis, Wiley-Interscience, New York, 2002.\n[77] D. Lenz and P. Stollmann, Generic sets in spaces of measures and generic\nsingular continuous spectrum for Delone Hamiltonians, Duke Math. J. 131\n(2006), 203–217.\n[78] D. S. Lubinsky, Jump distributions on [−1, 1] whose orthogonal polynomials\nhave leading coefficients with given asymptotic behavior, Proc. Amer. Math.\nSoc. 104 (1988), 516–524.\n[79] D. S. Lubinsky, Singularly continuous measures in Nevai’s class M, Proc.\nAmer. Math. Soc. 111 (1991), 413–420.\n[80] A. P. Magnus andW. Van Assche, Sieved orthogonal polynomials and discrete\nmeasures with jumps dense in an interval, Proc. Amer.Math. Soc. 106 (1989),\n163–173.\n[81] A. Mart´ınez-Finkelshtein, Equilibrium problems of potential theory in the\ncomplex plane, in “Orthogonal Polynomials and Special Functions,” pp. 79–\n117, Lecture Notes in Math., 1883, Springer, Berlin, 2006.\n[82] H. N. Mhaskar and E. B. Saff, On the distribution of zeros of polynomials\northogonal on the unit circle, J. Approx. Theory 63 (1990), 30–38.\n[83] S. Molchanov, Multiscale averaging for ordinary differential equations. Applications\nto the spectral theory of one-dimensional Schr¨odinger operator with\nsparse potentials, in “Homogenization,” pp. 316–397, Ser. Adv. Math. Appl.\nSci., 50, World Scientific Publishing, River Edge, N.J., 1999.\n[84] S. N. Naboko, Schr¨odinger operators with decreasing potential and with dense\npoint spectrum, Soviet Math. Dokl. 29 (1984), 688–691; Russian original in\nDokl. Akad. Nauk SSSR 276 (1984), 1312–1315.\n[85] L. Pakula, Asymptotic zero distribution of orthogonal polynomials in sinusoidal\nfrequency estimation, IEEE Trans. Inform. Theory 33 (1987), 569–576.\n[86] L. A. Pastur, Spectral properties of disordered systems in the one-body approximation\nComm. Math. Phys. 75 (1980), 179–196.\n[87] L. Pastur and A. Figotin, Spectra of Random and Almost-Periodic Operators,\nGrundlehren der Mathematischen Wissenschaften [Fundamental Principles of\nMathematical Sciences], 297, Springer, Berlin, 1992.\n[88] T. Ransford, Potential Theory in the Complex Plane, Press Syndicate of the\nUnivesity of Cambridge, New York, 1995.\n[89] E. J. Remez, Sur une propri´et´e des polynˆomes de Tchebyscheff, Comm. Inst.\nSci. Kharkow 13 (1936), 93-95.\n[90] C. Remling, The absolutely continuous spectrum of Jacobi matrices, preprint.\n[91] E. B. Saff and V. Totik, Logarithmic Potentials With External Fields,\nGrundlehren der Mathematischen Wissenschaften [Fundamental Principles\nof Mathematical Sciences], 316, Springer-Verlag, Berlin, 1997.\n[92] J. C. Santos-Le´on, A Szeg˝o quadrature formula for a trigonometric polynomial\nmodification of the Lebesgue measure, Rev. Acad. Canaria Cienc. 11 (1999),\n183–191.\n[93] J. A. Shohat, Th´eorie G´en´erale des Polinomes Orthogonaux de Tchebichef,\nM´emorial des Sciences Math´ematiques, 66, pp. 1–69, Paris, 1934.\n[94] B. Simon, Schr¨odinger semigroups, Bull. Amer. Math. Soc. 7 (1982), 447–526.\n[95] B. Simon, Some Jacobi matrices with decaying potential and dense point spectrum,\nComm. Math. Phys. 87 (1982), 253–258.\n[96] B. Simon, Kotani theory for one dimensional stochastic Jacobi matrices,\nComm. Math. Phys. 89 (1983), 227–234.\n[97] B. Simon, Operators with singular continuous spectrum, I. General operators\nAnnals of Math. 141 (1995), 131–145.\n","[98] B. Simon, Orthogonal Polynomials on the Unit Circle, Part 1: Classical Theory,\nAMS Colloquium Series, 54.1, American Mathematical Society, Providence,\nR.I., 2005.\n[99] B. Simon, Orthogonal Polynomials on the Unit Circle, Part 2: Spectral Theory,\nAMS Colloquium Series, 54.2, American Mathematical Society, Providence,\nR.I., 2005.\n[100] B. Simon, Weak convergence of CD kernels and applications, preprint.\n[101] B. Simon, The Christoffel–Darboux kernel, in preparation.\n[102] B. Simon, Szeg˝o’s Theorem and Its Descendants: Spectral Theory for L2 Perturbations\nof Orthogonal Polynomials, in preparation; to be published by\nPrinceton University Press.\n[103] B. Simon and M. Taylor, Harmonic analysis on SL(2,R) and smoothness of\nthe density of states in the one-dimensional Anderson model, Comm. Math.\nPhys. 101 (1985), 1–19.\n[104] M. Sodin and P. Yuditskii, Almost periodic Jacobi matrices with homogeneous\nspectrum, infinite-dimensional Jacobi inversion, and Hardy spaces of\ncharacter-automorphic functions, J. Geom. Anal. 7 (1997), 387–435.\n[105] H. Stahl and V. Totik, General Orthogonal Polynomials, in “Encyclopedia of\nMathematics and its Applications,” 43, Cambridge University Press, Cambridge,\n1992.\n[106] T. Stieltjes, Sur les racines de l’´equation Xn = 0, Acta Math. 9 (1886),\n385–400; Oeuvres Compl`etes 2, 73–88.\n[107] G. Szeg˝o, Bemerkungen zu einer Arbeit von Herrn M. Fekete: ¨Uber die\nVerteilung der Wurzeln bei gewissen algebraischen Gleichungen mit ganzzahligen\nKoeffizienten, Math. Z. 21 (1924), 203–208.\n[108] G. Szeg˝o, Orthogonal Polynomials, Amer. Math. Soc. Colloq. Publ., 23,\nAmerican Mathematical Society, Providence, R.I., 1939; 3rd edition, 1967.\n[109] A. V. Teplyaev, The pure point spectrum of random orthogonal polynomials\non the circle, Soviet Math. Dokl. 44 (1992), 407–411; Russian original in\nDokl. Akad. Nauk SSSR 320 (1991), 49–53.\n[110] D. J. Thouless, Electrons in disordered systems and the theory of localization,\nPhys. Rep. 13 (1974), 93.\n[111] V. Totik, Orthogonal polynomials with ratio asymptotics, Proc. Amer. Math.\nSoc. 114 (1992), 491–495.\n[112] V. Totik and J. L. Ullman, Local asymptotic distribution of zeros of orthogonal\npolynomials, Trans. Amer. Math. Soc. 341 (1994), 881–894.\n[113] M. Tsuji, Potential Theory in Modern Function Theory, reprinting of the\n1959 original, Chelsea, New York, 1975.\n[114] J. L. Ullman, On the regular behaviour of orthogonal polynomials, Proc. London\nMath. Soc. (3) 24 (1972), 119–148.\n[115] J. L. Ullman, Orthogonal polynomials for general measures. I, in “Rational\nApproximation and Interpolation” (Tampa, FL, 1983), pp. 524–528, Lecture\nNotes in Math., 1105, Springer, Berlin, 1984.\n[116] J. L. Ullman, Orthogonal polynomials for general measures. II, in “Orthogonal\nPolynomials and Applications” (Bar-le-Duc, 1984), pp. 247–254, Lecture\nNotes in Math., 1171, Springer, Berlin, 1985\n[117] J. L. Ullman, Orthogonal polynomials for general measures, in “Orthogonal\nPolynomials and Their Applications” (Laredo, 1987), pp. 95–99, Lecture\nNotes in Pure and Appl. Math., 117, Dekker, New York, 1989.\n[118] J. L. Ullman and M. F. Wyneken, Weak limits of zeros of orthogonal polynomials,\nConstr. Approx. 2 (1986), 339–347.\n[119] J. L. Ullman, M. F. Wyneken, and L. Ziegler, Norm oscillatory weight measures,\nJ. Approx. Theory 46 (1986), 204–212.\n[120] W. Van Assche, Invariant zero behaviour for orthogonal polynomials on compact\nsets of the real line, Bull. Soc. Math. Belg. Ser. B 38 (1986), 1–13.\n[121] J. L. Walsh, Interpolation and Approximation by Rational Functions in the\nComplex Domain, fourth edition, American Mathematical Society Colloquium\nPublications, XX, American Mathematical Society, Providence, R.I.,\n1965.\n[122] H. Widom, Polynomials associated with measures in the complex plane, J.\nMath. Mech. 16 (1967), 997–1013.\n[123] M. F. Wyneken, On norm and zero asymptotics of orthogonal polynomials\nfor general measures. I, in “Constructive Function Theory” (Edmonton, AB,\n1986), Rocky Mountain J. Math. 19 (1989), 405–413."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"DMS-0140592"},{"agency":"NSF","grant_number":"DMS-0652919"},{"agency":"Binational Science Foundation (USA-Israel)","grant_number":"2002068"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}