{"title":"HAT-P-26b: A Neptune-mass exoplanet with a well-constrained heavy element abundance","uri":"","abstract":"A correlation between giant-planet mass and atmospheric heavy elemental abundance was first noted in the past century from observations of planets in our own Solar System and has served as a cornerstone of planet-formation theory. Using data from the Hubble and Spitzer Space Telescopes from 0.5 to 5 micrometers, we conducted a detailed atmospheric study of the transiting Neptune-mass exoplanet HAT-P-26b. We detected prominent H_2O absorption bands with a maximum base-to-peak amplitude of 525 parts per million in the transmission spectrum. Using the water abundance as a proxy for metallicity, we measured HAT-P-26b’s atmospheric heavy element content (4.8^(+21.5)_(-4.0) times solar). This likely indicates that HAT-P-26b’s atmosphere is primordial and obtained its gaseous envelope late in its disk lifetime, with little contamination from metal-rich planetesimals.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252104","docid":252104,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256568","fileid":1256568,"datasetid":"document","objectid":252104,"filename":"628.full.pdf","mime_type":"application/pdf","hash":"f45abedf3a19968ca0528baf2951bdd0","hash_type":"MD5","filesize":564579,"mtime":"2017-05-12 16:42:29","url":"http://authors.library.caltech.edu/77397/1/628.full.pdf"}],"eprintid":77397,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"628.full.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252107","docid":252107,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256582","fileid":1256582,"datasetid":"document","objectid":252107,"filename":"aah4668-Wakeford-SM.pdf","mime_type":"application/pdf","hash":"ab156cb751d17b30692e72ef6a39c050","hash_type":"MD5","filesize":1741791,"mtime":"2017-05-12 16:49:10","url":"http://authors.library.caltech.edu/77397/2/aah4668-Wakeford-SM.pdf"}],"eprintid":77397,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"aah4668-Wakeford-SM.pdf","content":"supplemental"}],"note":"© 2017 American Association for the Advancement of Science. \n\nReceived 30 June 2016; accepted 20 April 2017. \n\nThis work is based on observations made with the NASA/European Space Agency (ESA) Hubble Space Telescope, obtained at the Space Telescope Science Institute (STScI), which is operated by the Association of Universities for Research in Astronomy under NASA contract NAS 5-26555. The HST and Spitzer data are available at http://mast.stsci.edu under project numbers GO-14110 (PI:Sing) and GO-14260 (PI:Deming) and at http://sha.ipac.caltech.edu under project number 90092 (P.I. Jean- Michel Désert). The combined transmission spectrum is available in Table 1. Support for this work was provided by NASA through grants under the HST-GO-14260 program from the STSci. H.R.W. acknowledges support from the NASA Postdoctoral Program, administered by Universities Space Research Association through a contract with NASA. Several authors acknowledge funding from the European Research Council under the European Union Seventh Framework Program: D.K.S., T.K., N.N., and T.M.E. under grant 336792; E.D.L. under grant 313014; and P.T. and D.S.A. under grant 247060-PEPS. The authors thank J. Goyal and B. Drummond for their contributions to the ATMO model framework. The authors thank the anonymous reviewers for their contribution to this paper, including the statistical reviewer who provided an interesting expansion and discussion.","id":77397,"rev_number":12,"userid":18,"eprint_dir":"disk0/00/07/73/97","datestamp":"2017-05-12 22:29:06","lastmod":"2017-05-12 22:29:06","status_changed":"2017-05-12 22:29:06","type":"article","metadata_visibility":"show","creators":[{"given":"Hannah R.","family":"Wakeford","id":"Wakeford-H-R","orcid":""},{"given":"David K.","family":"Sing","id":"Sing-D-K","orcid":""},{"given":"Tiffany","family":"Kataria","id":"Kataria-T","orcid":""},{"given":"Drake","family":"Deming","id":"Deming-D","orcid":""},{"given":"Nikolay","family":"Nikolov","id":"Nikolov-N","orcid":""},{"given":"Eric D.","family":"Lopez","id":"Lopez-E-D","orcid":""},{"given":"Pascal","family":"Tremblin","id":"Tremblin-P","orcid":""},{"given":"David S.","family":"Amundsen","id":"Amundsen-D-S","orcid":""},{"given":"Nikole K.","family":"Lewis","id":"Lewis-N-K","orcid":""},{"given":"Avi M.","family":"Mandell","id":"Mandell-A-M","orcid":""},{"given":"Jonathan J.","family":"Fortney","id":"Fortney-J-J","orcid":""},{"given":"Heather","family":"Knutson","id":"Knutson-H-A","orcid":"0000-0002-0822-3095"},{"given":"Björn","family":"Benneke","id":"Benneke-B","orcid":""},{"given":"Thomas M.","family":"Evans","id":"Evans-T-M","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-12","date_type":"published","publication":"Science","volume":"356","number":"6338","pagerange":"628-631","id_number":"CaltechAUTHORS:20170512-094224055","refereed":true,"issn":"0036-8075","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170512-094224055","related_url":[{"url":"http://dx.doi.org/10.1126/science.aah4668","type":"doi","description":"Article"},{"url":"http://science.sciencemag.org/content/356/6338/628","type":"pub","description":"Article"},{"url":"http://www.sciencemag.org/content/356/6338/628/suppl/DC1","type":"pub","description":"Supplemental Materials"}],"referencetext":["↵ J. D. Hartman, G. Á. Bakos, D. M. Kipping, G. Torres, G. Kovács, R. W. Noyes, D. W. Latham, A. W. Howard, D. A. Fischer, J. A. Johnson, G. W. Marcy, H. Isaacson, S. N. Quinn, L. A. Buchhave, B. Béky, D. D. Sasselov, R. P. Stefanik, G. A. Esquerdo, M. Everett, G. Perumpilly, J. Lázár, I. Papp, P. Sári, HAT-P-26b: A low-density Neptune-mass planet transiting a K star. Astrophys. J. 728, 138 (2011). doi:10.1088/0004-637X/728/2/138Caltech ConnectCrossRefGoogle Scholar\n↵ N. M. Batalha, Exploring exoplanet populations with NASA’s Kepler Mission. Proc. Natl. Acad. Sci. U.S.A. 111, 12647–12654 (2014). doi:10.1073/pnas.1304196111pmid:25049406Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ L. A. Rogers, S. Seager, A framework for quantifying the degeneracies of exoplanet interior compositions. Astrophys. J. 712, 974–991 (2010). doi:10.1088/0004-637X/712/2/974Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\n↵ H. A. Knutson, B. Benneke, D. Deming, D. Homeier, A featureless transmission spectrum for the Neptune-mass exoplanet GJ 436b. Nature 505, 66–68 (2014). doi:10.1038/nature12887pmid:24380953Caltech ConnectCrossRefGeoRefPubMedWeb of ScienceGoogle Scholar\n↵ J. Fraine, D. Deming, B. Benneke, H. Knutson, A. Jordán, N. Espinoza, N. Madhusudhan, A. Wilkins, K. Todorov, Water vapour absorption in the clear atmosphere of a Neptune-sized exoplanet. Nature 513, 526–529 (2014). doi:10.1038/nature13785pmid:25254473Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ M. H. Wong, P. R. Mahaffy, S. K. Atreya, H. B. Niemann, T. C. Owen, Updated Galileo probe mass spectrometer measurements of carbon, oxygen, nitrogen, and sulfur on Jupiter. Icarus 171, 153–170 (2004). doi:10.1016/j.icarus.2004.04.010Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\n↵ L. N. Fletcher, G. S. Orton, N. A. Teanby, P. G. J. Irwin, G. L. Bjoraker, Methane and its isotopologues on Saturn from Cassini/CIRS observations. Icarus 199, 351–367 (2009). doi:10.1016/j.icarus.2008.09.019Caltech ConnectCrossRefGoogle Scholar\n↵ E. Karkoschka, M. G. Tomasko, The haze and methane distributions on Neptune from HST–STIS spectroscopy. Icarus 211, 780–797 (2011). doi:10.1016/j.icarus.2010.08.013Caltech ConnectCrossRefGoogle Scholar\n↵ L. A. Sromovsky, P. M. Fry, J. H. Kim, Methane on Uranus: The case for a compact CH4 cloud layer at low latitudes and a severe CH4 depletion at high-latitudes based on re-analysis of Voyager occultation measurements and STIS spectroscopy. Icarus 215, 292–312 (2011). doi:10.1016/j.icarus.2011.06.024Caltech ConnectCrossRefGoogle Scholar\n↵ J. J. Fortney, C. Mordasini, N. Nettelmann, E. M.-R. Kempton, T. P. Greene, K. Zahnle, A framework for characterizing the atmospheres of low-mass low-density transiting planets. Astrophys. J. 775, 80 (2013). doi:10.1088/0004-637X/775/1/80Caltech ConnectCrossRefGoogle Scholar\n↵ L. Kreidberg, J. L. Bean, J.-M. Désert, M. R. Line, J. J. Fortney, N. Madhusudhan, K. B. Stevenson, A. P. Showman, D. Charbonneau, P. R. McCullough, S. Seager, A. Burrows, G. W. Henry, M. Williamson, T. Kataria, D. Homeier, A precise water abundance measurement for the hot jupiter WASP-43b. Astrophys. J. 793, L27 (2014). doi:10.1088/2041-8205/793/2/L27Caltech ConnectCrossRefGoogle Scholar\n↵K. Bostroem, C. Proffitt, STIS Data Handbook (STScI, version 6.0, 2011).\n↵L. Dressel, Wide Field Camera 3 Instrument Handbook, version 9.0 (STScI, 2017).\n↵ G. G. Fazio, J. L. Hora, L. E. Allen, M. L. N. Ashby, P. Barmby, L. K. Deutsch, J.-S. Huang, S. Kleiner, M. Marengo, S. T. Megeath, G. J. Melnick, M. A. Pahre, B. M. Patten, J. Polizotti, H. A. Smith, R. S. Taylor, Z. Wang, S. P. Willner, W. F. Hoffmann, J. L. Pipher, W. J. Forrest, C. W. McMurty, C. R. McCreight, M. E. McKelvey, R. E. McMurray, D. G. Koch, S. H. Moseley, R. G. Arendt, J. E. Mentzell, C. T. Marx, P. Losch, P. Mayman, W. Eichhorn, D. Krebs, M. Jhabvala, D. Y. Gezari, D. J. Fixsen, J. Flores, K. Shakoorzadeh, R. Jungo, C. Hakun, L. Workman, G. Karpati, R. Kichak, R. Whitley, S. Mann, E. V. Tollestrup, P. Eisenhardt, D. Stern, V. Gorjian, B. Bhattacharya, S. Carey, B. O. Nelson, W. J. Glaccum, M. Lacy, P. J. Lowrance, S. Laine, W. T. Reach, J. A. Stauffer, J. A. Surace, G. Wilson, E. L. Wright, A. Hoffman, G. Domingo, M. Cohen, The Infrared Array Camera (IRAC) for the Spitzer Space Telescope. Astrophys. J. Suppl. 154, 10–17 (2004). doi:10.1086/422843Caltech ConnectCrossRefGoogle Scholar\n↵ N. Nikolov, D. K. Sing, A. S. Burrows, J. J. Fortney, G. W. Henry, F. Pont, G. E. Ballester, S. Aigrain, P. A. Wilson, C. M. Huitson, N. P. Gibson, J.-M. Desert, A. L. Etangs, A. P. Showman, A. Vidal-Madjar, H. R. Wakeford, K. Zahnle, HST hot-Jupiter transmission spectral survey: Haze in the atmosphere of WASP-6b. Mon. Not. R. Astron. Soc. 447, 463–478 (2015). doi:10.1093/mnras/stu2433Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ D. K. Sing, J. J. Fortney, N. Nikolov, H. R. Wakeford, T. Kataria, T. M. Evans, S. Aigrain, G. E. Ballester, A. S. Burrows, D. Deming, J.-M. Désert, N. P. Gibson, G. W. Henry, C. M. Huitson, H. A. Knutson, A. L. des Etangs, F. Pont, A. P. Showman, A. Vidal-Madjar, M. H. Williamson, P. A. Wilson, A continuum from clear to cloudy hot-Jupiter exoplanets without primordial water depletion. Nature 529, 59–62 (2016). doi:10.1038/nature16068pmid:26675732Caltech ConnectCrossRefGeoRefPubMedGoogle Scholar\n↵ H. R. Wakeford, D. K. Sing, T. Evans, D. Deming, A. Mandell, Marginalizing instrument systematics in HST WFC3 transit light curves. Astrophys. J. 819, 10 (2016). doi:10.3847/0004-637X/819/1/10Caltech ConnectCrossRefGoogle Scholar\n↵\nMaterials and methods are available as supplementary materials.\n↵ K. B. Stevenson, Quantifying and predicting the presence of clouds in exoplanet atmospheres. Astrophys. J. 817, L16 (2016). doi:10.3847/2041-8205/817/2/L16Caltech ConnectCrossRefGoogle Scholar\n↵ P. Tremblin, D. S. Amundsen, P. Mourier, I. Baraffe, G. Chabrier, B. Drummond, D. Homeier, O. Venot, Fingering convection and cloudless models for cool brown dwarf atmospheres. Astrophys. J. 804, L17 (2015). doi:10.1088/2041-8205/804/1/L17Caltech ConnectCrossRefGoogle Scholar\n↵ P. Tremblin, D. S. Amundsen, G. Chabrier, I. Baraffe, B. Drummond, S. Hinkley, P. Mourier, O. Venot, Cloudless atmospheres for L/T dwarfs and extrasolar giant planets. Astrophys. J. 817, L19 (2016). doi:10.3847/2041-8205/817/2/L19Caltech ConnectCrossRefGoogle Scholar\n↵ D. S. Amundsen, I. Baraffe, P. Tremblin, J. Manners, W. Hayek, N. J. Mayne, D. M. Acreman, Accuracy tests of radiation schemes used in hot Jupiter global circulation models. Astron. Astrophys. 564, A59 (2014). doi:10.1051/0004-6361/201323169Caltech ConnectCrossRefGoogle Scholar\n↵ O. Venot, E. Hébrard, M. Agúndez, M. Dobrijevic, F. Selsis, F. Hersant, N. Iro, R. Bounaceur, A chemical model for the atmosphere of hot jupiters. Astron. Astrophys. 546, A43 (2012). doi:10.1051/0004-6361/201219310Caltech ConnectCrossRefGoogle Scholar\n↵ M. R. Line, A. S. Wolf, X. Zhang, H. Knutson, J. A. Kammer, E. Ellison, P. Deroo, D. Crisp, Y. L. Yung, A systematic retrieval analysis of secondary eclipse spectra. I. A comparison of atmospheric retrieval techniques. Astrophys. J. 775, 137 (2013). doi:10.1088/0004-637X/775/2/137Caltech ConnectCrossRefGoogle Scholar\n↵ J. I. Moses, M. R. Line, C. Visscher, M. R. Richardson, N. Nettelmann, J. J. Fortney, T. S. Barman, K. B. Stevenson, N. Madhusudhan, Compositional diversity in the atmospheres of hot neptunes, with application to GJ 436b. Astrophys. J. 777, 34 (2013). doi:10.1088/0004-637X/777/1/34Caltech ConnectCrossRefGoogle Scholar\n↵ T. Kataria, A. P. Showman, J. J. Fortney, K. B. Stevenson, M. R. Line, L. Kreidberg, J. L. Bean, J.-M. Désert, The atmospheric circulation of the hot jupiter WASP-43b: Comparing three-dimensional models to spectrophotometric data. Astrophys. J. 801, 86 (2015). doi:10.1088/0004-637X/801/2/86Caltech ConnectCrossRefGoogle Scholar\n↵ T. Kataria, D. K. Sing, N. K. Lewis, C. Visscher, A. P. Showman, J. J. Fortney, M. S. Marley, The atmospheric circulation of a nine-hot-jupiter sample: probing circulation and chemistry over a wide phase space. Astrophys. J. 821, 9 (2016). doi:10.3847/0004-637X/821/1/9Caltech ConnectCrossRefGoogle Scholar\n↵ N. K. Lewis, A. P. Showman, J. J. Fortney, M. S. Marley, R. S. Freedman, K. Lodders, Atmospheric circulation of eccentric hot neptune GJ436b. Astrophys. J. 720, 344–356 (2010). doi:10.1088/0004-637X/720/1/344Caltech ConnectCrossRefGoogle Scholar\n↵ C. V. Morley, J. J. Fortney, M. S. Marley, C. Visscher, D. Saumon, S. K. Leggett, Neglected clouds in T and Y dwarf atmospheres. Astrophys. J. 756, 172 (2012). doi:10.1088/0004-637X/756/2/172Caltech ConnectCrossRefGoogle Scholar\n↵ L. Kreidberg, M. R. Line, J. L. Bean, K. B. Stevenson, J.-M. Désert, N. Madhusudhan, J. J. Fortney, J. K. Barstow, G. W. Henry, M. H. Williamson, A. P. Showman, A detection of water in the transmission spectrum of the hot jupiter WASP-12b and implications for its atmospheric composition. Astrophys. J. 814, 66 (2015). doi:10.1088/0004-637X/814/1/66Caltech ConnectCrossRefGoogle Scholar\n↵ E. D. Lopez, J. J. Fortney, Understanding the mass-radius relation for sub-neptunes: Radius as a proxy for composition. Astrophys. J. 792, 1 (2014). doi:10.1088/0004-637X/792/1/1Caltech ConnectCrossRefGoogle Scholar\n↵ E. D. Lopez, J. J. Fortney, The role of core mass in controlling evaporation: The Kepler radius distribution and the Kepler-36 density dichotomy. Astrophys. J. 776, 2 (2013). doi:10.1088/0004-637X/776/1/2Caltech ConnectCrossRefGoogle Scholar\n↵ C. Mordasini, Y. Alibert, W. Benz, H. Klahr, T. Henning, Extrasolar planet population synthesis. Astron. Astrophys. 541, A97 (2012). doi:10.1051/0004-6361/201117350Caltech ConnectCrossRefGoogle Scholar\n↵ E. J. Lee, E. Chiang, Breeding super-Earths and birthing super-puffs in transitional disks. Astrophys. J. 817, 90 (2016). doi:10.3847/0004-637X/817/2/90Caltech ConnectCrossRefGoogle Scholar\n↵ D. Deming, A. Wilkins, P. McCullough, A. Burrows, J. J. Fortney, E. Agol, I. Dobbs-Dixon, N. Madhusudhan, N. Crouzet, J.-M. Desert, R. L. Gilliland, K. Haynes, H. A. Knutson, M. Line, Z. Magic, A. M. Mandell, S. Ranjan, D. Charbonneau, M. Clampin, S. Seager, A. P. Showman, Infrared transmission spectroscopy of the exoplanets HD 209458b and XO-1b using the Wide Field Camera-3 on the Hubble Space Telescope. Astrophys. J. 774, 1 (2013). doi:10.1088/0004-637X/774/2/95Caltech ConnectCrossRefGoogle Scholar\nK. Mandel, E. Agol, Analytic light curves for planetary transit searches. Astrophys. J. 580, L171–L175 (2002). doi:10.1086/345520Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\nH. Wakeford, D. K. Sing, D. Deming, N. P. Gibson, J. J. Fortney, A. S. Burrows, G. Ballester, N. Nikolov, S. Aigrain, G. Henry, H. Knutson, A. Lecavelier des Etangs, F. Pont, A. P. Showman, A. Vidal-Madjar, K. Zahnle, HST hot jupiter transmission spectral survey: Detection of water in HAT-P-1b from WFC3 near-IR spatial scan observations. Mon. Not. R. Astron. Soc. 435, 3481–3493 (2013). doi:10.1093/mnras/stt1536Caltech ConnectAbstract/FREE Full TextGoogle Scholar\nN. P. Gibson, Reliable inference of exoplanet light-curve parameters using deterministic and stochastic systematics models. Mon. Not. R. Astron. Soc. 445, 3401–3414 (2014). doi:10.1093/mnras/stu1975Caltech ConnectAbstract/FREE Full TextGoogle Scholar\nC. B. Markwardt, Astronomical data analysis software and systems XVIII. Astron. Soc. Pac. Conf. Ser. 411, 251 (2009).Caltech ConnectGoogle Scholar\nJ. de Wit, H. R. Wakeford, M. Gillon, N. K. Lewis, J. A. Valenti, B.-O. Demory, A. J. Burgasser, A. Burdanov, L. Delrez, E. Jehin, S. M. Lederer, D. Queloz, A. H. M. J. Triaud, V. Van Grootel, A combined transmission spectrum of the Earth-sized exoplanets TRAPPIST-1 b and c. Nature 537, 69–72 (2016). doi:10.1038/nature18641pmid:27437572Caltech ConnectCrossRefPubMedGoogle Scholar\nN. Nikolov, D. K. Sing, F. Pont, A. S. Burrows, J. J. Fortney, G. E. Ballester, T. M. Evans, C. M. Huitson, H. R. Wakeford, P. A. Wilson, S. Aigrain, D. Deming, N. P. Gibson, G. W. Henry, H. Knutson, A. Lecavelier des Etangs, A. P. Showman, A. Vidal-Madjar, K. Zahnle, Hubble Space Telescope hot jupiter transmission spectral survey: A detection of Na and strong optical absorption in HAT-P-1b. Mon. Not. R. Astron. Soc. 437, 46–66 (2014). doi:10.1093/mnras/stt1859Caltech ConnectAbstract/FREE Full TextGoogle Scholar\nT. M. Evans, D. K. Sing, H. R. Wakeford, N. Nikolov, G. E. Ballester, B. Drummond, T. Kataria, N. P. Gibson, D. S. Amundsen, J. Spake, Detection of H2O and evidence for TiO/VO in an ultra-hot exoplanet atmosphere. Astrophys. J. 822, L4 (2016). doi:10.3847/2041-8205/822/1/L4Caltech ConnectCrossRefGoogle Scholar\nJ. Eastman, B. S. Gaudi, E. Agol, EXOFAST: A fast exoplanetary fitting suite in IDL. Publ. Astron. Soc. Pac. 125, 83–112 (2013). doi:10.1086/669497Caltech ConnectCrossRefGoogle Scholar\nK. Lodders, B. Fegley, Atmospheric chemistry in giant planets, brown dwarfs, and low-mass dwarf stars I. carbon, nitrogen, and oxygen. Icarus 155, 393–424 (2002). doi:10.1006/icar.2001.6740Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\nM. S. Marley, A. S. Ackerman, J. N. Cuzzi, D. Kitzmann, “Clouds and Hazes in Exoplanet Atmospheres,” Comparative Climate of Terrestrial Planets (Univ. Arizona Press, 2013).\nH. R. Wakeford, D. K. Sing, Transmission spectral properties of clouds for hot Jupiter exoplanets. Astron. Astrophys. 573, A122 (2015). doi:10.1051/0004-6361/201424207Caltech ConnectCrossRefGoogle Scholar\nA. Adcroft, J.-M. Campin, C. Hill, J. Marshall, Implementation of an atmosphere–ocean general circulation model on the expanded spherical cube. Mon. Weather Rev. 132, 2845–2863 (2004). doi:10.1175/MWR2823.1Caltech ConnectCrossRefGoogle Scholar\nM. S. Marley, C. P. McKay, Thermal structure of Uranus’ atmosphere. Icarus 138, 268–286 (1999). doi:10.1006/icar.1998.6071pmid:11542927Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\nT. Kataria, A. P. Showman, J. J. Fortney, M. S. Marley, R. S. Freedman, The atmospheric circulation of the super Earth GJ 1214b: Dependence on composition and metallicity. Astrophys. J. 785, 92 (2014). doi:10.1088/0004-637X/785/2/92Caltech ConnectCrossRefGoogle Scholar\nA. S. Ackerman, M. S. Marley, Precipitating condensation clouds in substellar atmospheres. Astrophys. J. 556, 872 (2001). doi:10.1086/321540Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\nJ. J. Fortney, The effect of condensates on the characterization of transiting planet atmospheres with transmission spectroscopy. Mon. Not. R. Astron. Soc. 364, 649–653 (2005). doi:10.1111/j.1365-2966.2005.09587.xCaltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ A. Mortier, N. C. Santos, S. G. Sousa, J. M. Fernandes, V. Z. Adibekyan, E. Delgado Mena, M. Montalto, G. Israelian, New and updated stellar parameters for 90 transit hosts. Astron. Astrophys. 558, A106 (2013). doi:10.1051/0004-6361/201322240"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"HAT-P-26b: A Neptune-mass exoplanet with a well-constrained heavy element abundance\nBY HANNAH R. WAKEFORD, DAVID K. SING, TIFFANY KATARIA, DRAKE DEMING, NIKOLAY NIKOLOV, ERIC D. LOPEZ, PASCAL TREMBLIN, DAVID S. AMUNDSEN, NIKOLE K. LEWIS, AVI M. MANDELL, JONATHAN J. FORTNEY, HEATHER KNUTSON, BJÖRN BENNEKE, THOMAS M. EVANS\nSCIENCE 12 MAY 2017 : 628-631","other_numbering_system":null,"funders":[{"agency":"NASA","grant_number":"NAS 5-26555"},{"agency":"NASA","grant_number":"HST-GO-14260"},{"agency":"NASA Postdoctoral Program","grant_number":""},{"agency":"European Research Council (ERC)","grant_number":"336792"},{"agency":"European Research Council (ERC)","grant_number":"313014 (ETAEARTH)"},{"agency":"European Research Council (ERC)","grant_number":"247060"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}