{"title":"The Energy of Heavy Atoms According to Brown and Ravenhall: The Scott Correction","uri":"","abstract":"We consider relativistic many-particle operators which – according to Brown and Ravenhall – describe the electronic states of heavy atoms. Their ground state energy is investigated in the limit of large nuclear charge and velocity of light. We show that the leading quasi-classical behavior given by the Thomas-Fermi theory is raised by a subleading correction, the Scott correction. Our result is valid for the maximal range of coupling constants, including the critical one. As a technical tool, a Sobolev-Gagliardo-Nirenberg type inequality is established for the critical atomic Brown-Ravenhall operator. Moreover, we prove sharp upper and lower bound on the eigenvalues of the hydrogenic Brown-Ravenhall operator up to and including the critical coupling constant.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252109","docid":252109,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256598","fileid":1256598,"datasetid":"document","objectid":252109,"filename":"0805.4441.pdf","mime_type":"application/pdf","hash":"f5db53cc37bc7f9372bca2e649d7e6c8","hash_type":"MD5","filesize":511485,"mtime":"2017-05-12 17:05:08","url":"http://authors.library.caltech.edu/77400/1/0805.4441.pdf"}],"eprintid":77400,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"0805.4441.pdf","content":"submitted"}],"note":"Last revised 23 Jul 2008 (this version, v2) \n\nWe thank Elliott Lieb and Robert Seiringer for supportive\ndiscussions. H.S. thanks the Departments of Mathematics and Physics of Princeton University and R.F. and S.W. thank the Department of Mathematics of LMU Munich for hospitality while parts of this work were done. We also thank Volker Bach for stimulating questions resulting in several improvements. The work has been partially supported by the Deutscher Akademischer Austauschdienst, grant D/06/49117 (R.F.), the U.S. National Science Foundation, grant PHY 01 39984 (H.S.), the Deutsche Forschungsgemeinschaft, grant SI 348/13-1 (H.S.), and a Sloan Fellowship (S.W.).","id":77400,"rev_number":8,"userid":772,"eprint_dir":"disk0/00/07/74/00","datestamp":"2017-05-12 23:34:50","lastmod":"2017-05-12 23:34:50","status_changed":"2017-05-12 23:34:50","type":"monograph","metadata_visibility":"show","creators":[{"given":"Rupert L.","family":"Frank","id":"Frank-R-L","orcid":""},{"given":"Heinz","family":"Siedentop","id":"Siedentop-H","orcid":""},{"given":"Simone","family":"Warzel","id":"Warzel-S","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"Heavy atoms, ground state energy, relativistic Coulomb system, Scott correction, Brown-Ravenhall operator.","date":"2008-07-23","date_type":"submitted","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170512-100456574","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170512-100456574","related_url":[{"url":"https://arxiv.org/abs/0805.4441","type":"arxiv","description":"Discussion paper"}],"referencetext":["[1] Volker Bach. Error bound for the Hartree-Fock energy of atoms and molecules. Comm. Math.\nPhys., 147:527–548, 1992.\n[2] A. A. Balinsky and W. D. Evans. On the virial theorem for the relativistic operator of Brown\nand Ravenhall, and the absence of embedded eigenvalues. Lett. Math. Phys., 44(3):233–248,\n1998.\n[3] Hans A. Bethe and Edwin E. Salpeter. Quantum mechanics of one- and two-electron atoms.\nIn S. Fl¨ugge, editor, Handbuch der Physik, XXXV, pages 88–436. Springer, Berlin, 1 edition,\n1957.\n[4] G. E. Brown and D. G. Ravenhall. On the interaction of two electrons. Proc. Roy. Soc.\nLondon Ser. A., 208:552–559, 1951.\n[5] Roch Cassanas and Heinz Siedentop. The ground-state energy of heavy atoms according\nto Brown and Ravenhall: absence of relativistic effects in leading order. J. Phys. A,\n39(33):10405–10414, 2006.\n[6] Charles G. Darwin. The wave equation of the electron. Proc. Roy. Soc. (London), 1928\n[7] Ingrid Daubechies. An uncertainty principle for Fermions with generalized kinetic energy.\nComm. Math. Phys., 90:511–520, September 1983.\n[8] Jean Dolbeault, Maria J. Esteban, and Eric S´er´e. On the eigenvalues of operators with gaps.\nApplication to Dirac operators. J. Funct. Anal., 174(1):208–226, 2000.\n[9] Berthold-Georg Englert. Semiclassical Theory of Atoms. Number 300 in Lecture Notes in\nPhysics. Springer-Verlag, Berlin, 1 edition, 1988.\n[10] Berthold-Georg Englert and Julian Schwinger. Statistical atom: Handling the strongly bound\nelectrons. Phys. Rev. A, 29(5):2331–2338, 1984.\n[11] Berthold-Georg Englert and Julian Schwinger. Statistical atom: Some quantum improvements.\nPhys. Rev. A, 29(5):2339–2352, 1984.\n[12] Berthold-Georg Englert and Julian Schwinger. Atomic-binding-energy oscillations. Phys. Rev.\nA, 32:47–63, 1985.\n[13] A. Erd´elyi, W. Magnus, F. Oberhettinger, and F. G. Tricomi. Tables of integral transforms.\nVol. II. McGraw-Hill Book Company, Inc., New York-Toronto-London, 1954. Based, in part,\non notes left by Harry Bateman.\n[14] William Desmond Evans, Peter Perry, and Heinz Siedentop. The spectrum of relativistic oneelectron\natoms according to Bethe and Salpeter. Comm. Math. Phys., 178(3):733–746, July\n1996.\n[15] C. Fefferman and L. Seco. Eigenfunctions and eigenvalues of ordinary differential operators.\nAdv. Math., 95(2):145–305, October 1992.\n[16] C. Fefferman and L. Seco. The density of a one-dimensional potential. Adv. Math., 107(2):187–\n364, September 1994.\n[17] C. Fefferman and L. Seco. The eigenvalue sum of a one-dimensional potential. Adv. Math.,\n108(2):263–335, October 1994.\n[18] C. Fefferman and L. Seco. On the Dirac and Schwinger corrections to the ground-state energy\nof an atom. Adv. Math., 107(1):1–188, August 1994.\n[19] C. Fefferman and L. Seco. The density in a three-dimensional radial potential. Adv. Math.,\n111(1):88–161, March 1995.\n[20] C. L. Fefferman and L. A. Seco. An upper bound for the number of electrons in a large ion.\nProc. Nat. Acad. Sci. USA, 86:3464–3465, 1989.\n[21] C. L. Fefferman and L. A. Seco. Asymptotic neutrality of large ions. Comm. Math. Phys.,\n128:109–130, 1990.\n[22] C. L. Fefferman and L. A. Seco. On the energy of a large atom. Bull. AMS, 23(2):525–530,\nOctober 1990.\n[23] Charles L. Fefferman and Luis A. Seco. Aperiodicity of the Hamiltonian flow in the Thomas-\nFermi potential. Revista Mathem´atica Iberoamericana, 9(3):409–551, 1993.\n[24] E. Fermi. Un metodo statistico per la determinazione di alcune propriet´a dell’atomo. Atti della\nReale Accademia Nazionale dei Lincei, Rendiconti, Classe di Scienze Fisiche, Matematiche\ne Naturali, 6(12):602–607, 1927.\n[25] E. Fermi. Eine statistische Begr¨undung zur Bestimmung einiger Eigenschaften des Atoms\nund ihre Anwendungen auf die Theorie des periodischen Systems der Elemente. Z. Phys.,\n48:73–79, 1928.\n[26] Rupert L. Frank, Elliott H. Lieb, and Robert Seiringer. Hardy-Lieb-Thirring inequalities for\nfractional Schr¨odinger operators. Journ. American Math. Soc., Online, 2008.\n[27] Rupert L. Frank, Heinz Siedentop, and Simone Warzel. The ground state energy of heavy\natoms: relativistic lowering of the leading energy correction. Comm. Math. Phys., 278(2):549–\n566, 2008.\n[28] Walter Gordon. Die Energieniveaus des Wasserstoffatoms nach der Diracschen Qauntentheorie.\nZ. Phys., 48:11–14, 1928.\n[29] Walter Greiner. Relativistic Quantum Mechanics, volume 3 of Theoretical Physics – Text and\nExcercise Books. Springer, Berlin, 1 edition, 1990.\n[30] Marcel Griesemer, Roger T. Lewis, and Heinz Siedentop. A minimax principle for eigenvalues\nin spectral gaps: Dirac operators with Coulomb potential. Doc. Math., 4:275–283, 1999.\n[31] Marcel Griesemer and Heinz Siedentop. A minimax principle for the eigenvalues in spectral\ngaps. J. London Math. Soc. (2), 60(2):490–500, 1999.\n[32] Heinrich Hellmann. Ein kombiniertes N¨aherungsverfahren zur Energieberechnung im Vielelektronenproblem.\nII. Acta Physicochim. U.S.S.R., 4:225–244, 1936.\n[33] Webster Hughes. An Atomic Energy Lower Bound that Gives Scott’s Correction. PhD thesis,\nPrinceton, Department of Mathematics, 1986.\n[34] Webster Hughes. An atomic lower bound that agrees with Scott’s correction. Adv. in Math.,\n79:213–270, 1990.\n[35] Tosio Kato. Perturbation Theory for Linear Operators, volume 132 of Grundlehren der mathematischen\nWissenschaften. Springer-Verlag, Berlin, 1 edition, 1966.\n[36] W. Lenz. ¨Uber die Awendbarkeit der statistischen Methode auf Ionengitter. Z. Phys., 77:713–\n721, 1932.\n[37] Elliott H. Lieb. Variational principle for many-fermion systems. Phys. Rev. Lett., 46(7):457–\n459, 1981.\n[38] Elliott H. Lieb and Michael Loss. Analysis, volume 14 of Graduate Studies in Mathematics.\nAmerican Mathematical Society, Providence, RI, second edition, 2001.\n[39] Elliott H. Lieb and Barry Simon. The Thomas-Fermi theory of atoms, molecules and solids.\nAdv. Math., 23:22–116, 1977.\n[40] Elliott H. Lieb and Walter E. Thirring. Inequalities for the moments of the eigenvalues of\nthe Schr¨odinger Hamiltonian and their relation to Sobolev inequalities. In Elliott H. Lieb,\nBarry Simon, and Arthur S. Wightman, editors, Studies in Mathematical Physics: Essays in\nHonor of Valentine Bargmann. Princeton University Press, Princeton, 1976.\n[41] Elliott H. Lieb and Horng-Tzer Yau. The stability and instability of relativistic matter.\nComm. Math. Phys., 118:177–213, 1988.\n[42] Paul Mancas, A. M. Klaus M¨uller, and Heinz Siedentop. The optimal size of the exchange\nhole and reduction to one-particle Hamiltonians. Theoretical Chemistry Accounts: Theory,\nComputation, and Modeling (Theoretica Chimica Acta), 111(1):49–53, February 2004.\n[43] Albert Messiah. M´ecanique Quantique, volume 1. Dunod, Paris, 2 edition, 1969.\n[44] Isaac Newton. Philosophiae naturalis principia mathematica. Vol. I. Harvard University\nPress, Cambridge, Mass., 1972. Reprinting of the third edition (1726) with variant readings,\nAssembled and edited by Alexandre Koyr´e and I. Bernard Cohen with the assistance of\nAnne Whitman.\n[45] Thomas Østergaard Sørensen. Towards a Relativistic Scott Correction. PhD thesis, Aarhus\nUniversitet, http://www.imf.au.dk/cgi-bin/viewers/viewpublications.cgi?id=79, October\n1998.\n[46] Thomas Østergaard Sørensen. The large-Z behavior of pseudorelativistic atoms. J. Math.\nPhys., 46(5):052307, 24, 2005.\n[47] Julian Schwinger. Thomas-Fermi model: The leading correction. Phys. Rev. A, 22(5):1827–\n1832, 1980.\n[48] Julian Schwinger. Thomas-Fermi model: The second correction. Phys. Rev. A, 24(5):2353–\n2361, 1981.\n[49] J. M. C. Scott. The binding energy of the Thomas-Fermi atom. Phil. Mag., 43:859–867, 1952.\n[50] Heinz Siedentop and Rudi Weikard. On the leading energy correction for the statistical model\nof the atom: Interacting case. Comm. Math. Phys., 112:471–490, 1987.\n[51] Heinz Siedentop and Rudi Weikard. Upper bound on the ground state energy of atoms that\nproves Scott’s conjecture. Phys. Lett. A, 120:341–342, 1987.\n[52] Heinz Siedentop and Rudi Weikard. On the leading energy correction of the statistical atom:\nLower bound. Europhysics Letters, 6:189–192, 1988.\n[53] Heinz Siedentop and Rudi Weikard. On the leading correction of the Thomas-Fermi model:\nLower bound – with an appendix by A. M. K. M¨uller. Invent. Math., 97:159–193, 1989.\n[54] Heinz Siedentop and RudiWeikard. A new phase space localization technique with application\nto the sum of negative eigenvalues of Schr¨odinger operators. Annales Scientifiques de l’´ Ecole\nNormale Sup´erieure, 24(2):215–225, 1991.\n[55] Heinz K. H. Siedentop. On the relation between the Hellmann energy functional and the\nground state energy of an N-Fermion system. Z. Phys. A, 302:213–218, 1981.\n[56] Heinz K. H. Siedentop and Rudi Weikard. On the leading energy correction for the statistical\nmodel of the atom: Non-interacting case. Abh. Braunschweig. Wiss. Ges., 38:145–158, 1986.\n[57] B. Simon. Fifteen problems in mathematical physics. In Perspectives in Mathematics.\nBirkh¨auser, 1984.\n[58] Barry Simon. Functional Integration and Quantum Physics. Academic Press Inc. [Harcourt\nBrace Jovanovich Publishers], New York, 1979.\n[59] Jan Philip Solovej. The relativistic Scott correction. In Maria J. Esteban, Claude Le Bris, and\nGustavo Scuseria, editors, Mathematical and Numerical Aspects of Quantum Chemistry Problems,\nvolume 47/2006 of Oberwolfach Report, pages 52–53. Mathematisches Forschungsinstitut\nOberwolfach, European Mathematical Society, September 2006.\n[60] Irene A. Stegun. Legendre functions. In Milton Abramowitz and Irene A. Stegun, editors,\nHandbook of Mathematical Functions with Formulas, Graphs, and Mathematical Tables,\nchapter 8, pages 331–353. Dover Publications, New York, 1965.\n[61] Elias M. Stein. Singular integrals and differentiability properties of functions. Princeton\nMathematical Series, No. 30. Princeton University Press, Princeton, N.J., 1970.\n[62] J. Sucher. Foundations of the relativistic theory of many-electron atoms. Phys. Rev. A,\n22(2):348–362, August 1980.\n[63] J. Sucher. Foundations of the relativistic theory of many-electron bound states. International\nJournal of Quantum Chemistry, 25:3–21, 1984.\n[64] J. Sucher. Relativistic many-electron Hamiltonians. Phys. Scripta, 36:271–281, 1987.\n[65] Walter Thirring. Lehrbuch der Mathematischen Physik 3: Quantenmechanik von Atomen\nund Molek¨ulen. Springer-Verlag, Wien, New York, 1 edition, 1979.\n[66] L. H. Thomas. The calculation of atomic fields. Proc. Camb. Phil. Soc., 23:542–548, 1927.\n[67] C. Tix. Lower bound for the ground state energy of the no-pair Hamiltonian. Phys. Lett. B,\n405(3-4):293–296, 1997.\n[68] C. Tix. Self-adjointness and spectral properties of a pseudo-relativistic Hamiltonian due to\nBrown and Ravenhall. Preprint, mp-arc: 97-441, 1997.\n[69] C. Tix. Strict positivity of a relativistic Hamiltonian due to Brown and Ravenhall. Bull.\nLondon Math. Soc., 30(3):283–290, 1998.\n[70] E. T. Whittaker and G. N. Watson. A Course of Modern Analysis; An Introduction to\nthe General Theory of Infinite Processes and of Analytic Functions, with an Account of\nthe Principal Transcendental Functions. Cambridge University Press, Cambridge, 4 edition,\n1927."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Deutscher Akademischer Austauschdienst (DAAD)","grant_number":"D/06/49117"},{"agency":"NSF","grant_number":"PHY-0139984"},{"agency":"Deutsche Forschungsgemeinschaft (DFG)","grant_number":"SI 348/13-1"},{"agency":"Alfred P. Sloan Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}