{"title":"Improved Ductility of B_(12) Icosahedra-Based Superhard Materials Through Icosahedral Slip","uri":"","abstract":"Boron carbide (B_4C) is superhard but suffers from brittle failure because shear stress leads to formation of amorphous shear bands in which the icosahedral clusters fracture, leading to amorphous regions with higher density than the crystal that results in tension induced cavitation and brittle failure. Based on our previous studies of related systems, we speculated that replacing the C-B-C chains with Si_2 and replacing cage C with Si might reduce or eliminate this amorphous shear band formation responsible for brittle failure, In this paper we consider (B_(10)Si_2)Si_2, using density functional theory (DFT) to examine its shear deformation. We find that the stress accumulated as shear increases is released by slip of the planes of icosahedra through breaking and then reforming the Si-Si chain bonds without fracturing (B_(10)Si_2) icosahedra. This is because the (B_(10)Si_2) icosahedra are more stable than the chain under highly stressed conditions. This chain disruption deformation mode prevents amorphous shear band formation, providing a strategy to dramatically improve the ductility of B_4C based materials. Our results suggest that making the icosahedra more stable than the chains structure can lead to slipping of the icosahedral planes while avoiding the icosahedral fracturing that leads to brittle failure.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252110","docid":252110,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1256602","fileid":1256602,"datasetid":"document","objectid":252110,"filename":"acs%2Ejpcc%2E7b01761.pdf","mime_type":"application/pdf","hash":"11aa77a9e5ab3fbfda7eefbbbb726fbb","hash_type":"MD5","filesize":1966113,"mtime":"2017-05-12 17:06:09","url":"http://authors.library.caltech.edu/77401/1/acs%252Ejpcc%252E7b01761.pdf"}],"eprintid":77401,"pos":1,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"acs%2Ejpcc%2E7b01761.pdf","content":"accepted"},{"id":"http://authors.library.caltech.edu/id/document/253121","docid":253121,"rev_number":4,"files":[{"id":"http://authors.library.caltech.edu/id/file/1266269","fileid":1266269,"datasetid":"document","objectid":253121,"filename":"acs%2Ejpcc%2E7b01761.pdf","mime_type":"application/pdf","hash":"78e0c61d1a1b7ee939feabcffc441576","hash_type":"MD5","filesize":5705091,"mtime":"2017-06-02 22:03:46","url":"http://authors.library.caltech.edu/77401/2/acs%252Ejpcc%252E7b01761.pdf"}],"eprintid":77401,"pos":2,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"acs%2Ejpcc%2E7b01761.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/253122","docid":253122,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1266273","fileid":1266273,"datasetid":"document","objectid":253122,"filename":"jp7b01761_si_001.pdf","mime_type":"application/pdf","hash":"374980d3b706e1426892885485627120","hash_type":"MD5","filesize":857403,"mtime":"2017-06-02 22:05:04","url":"http://authors.library.caltech.edu/77401/3/jp7b01761_si_001.pdf"}],"eprintid":77401,"pos":3,"placement":3,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"jp7b01761_si_001.pdf","content":"supplemental"}],"note":"© 2017 American Chemical Society. \n\nReceived: February 22, 2017; Revised: May 6, 2017; Published: May 9, 2017. \n\nThis work was initiated with support by the Defense Advanced Research Projects Agency (W31P4Q-13-1-0010 and W31P4Q1210008, program manager, John Paschkewitz) It was\ncompleted with support by the National Science Foundation (DMR-1436985, program manager, John Schlueter). Q.A. was also supported by the Army Research Laboratory under Cooperative Agreement Number W911NF-12-2-0022 and by the U. S. Nuclear Regulatory Commission (NRC-HQ-84-15-G-0028). \n\nThe authors declare no competing financial interests.","id":77401,"rev_number":17,"userid":18,"eprint_dir":"disk0/00/07/74/01","datestamp":"2017-05-12 22:27:44","lastmod":"2017-06-03 00:03:24","status_changed":"2017-06-03 00:03:24","type":"article","metadata_visibility":"show","creators":[{"given":"Qi","family":"An","id":"An-Qi","orcid":"0000-0003-4838-6232"},{"given":"William A., III","family":"Goddard","id":"Goddard-W-A-III","orcid":"0000-0003-0097-5716"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-06-01","date_type":"published","publication":"Journal of Physical Chemistry C","volume":"121","number":"21","pagerange":"11831-11838","id_number":"CaltechAUTHORS:20170512-100605335","refereed":true,"issn":"1932-7447","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170512-100605335","related_url":[{"url":"http://dx.doi.org/10.1021/acs.jpcc.7b01761","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/acs.jpcc.7b01761","type":"pub","description":"Article"},{"url":"http://pubs.acs.org/doi/suppl/10.1021/acs.jpcc.7b01761","type":"pub","description":"Supporting Information"}],"referencetext":["(1) Thevenot, F. Boron Carbide−A Comprehensive Review. J. Eur. Ceram. Soc. 1990, 6,\n205−225.\n(2) Domnich, V.; Reynaud, S.; Haber, R. A.; Chhowalla, M. Boron Carbide: Structure,\nProperties, and Stability under Stress. J. Am. Ceram. Soc. 2011, 94, 3605−3628.\n(3) The Chemistry of Boron and Its Compounds; Muetterties, E. L., Eds.; Wiley: New York,\n1967.\n(4) Suri, A. K.; Subramanian, C.; Sonber, J. K.; Murthy, T. Synthesis and Consolidation of\nBoron Carbide: A Review. Int. Mater. Rev. 2010, 55, 4−40.\n(5) Bourne, N. K. Shock−induced Brittle Failure of Boron Carbide. Proc. R. Soc. London,\nSer. A 2002, 458, 1999−2006.\n(6) Chen, M. W.; McCauley, J. W.; Hemker, K. J. Shock-Induced Localized Amorphization\nin Boron Carbide. Science 2003, 299, 1563−1566.\n(7) Reddy, K. M.; Liu, P.; Hirata, A.; Fujita, T.; Chen, M. W. Atomic Structure of\nAmorphous Shear Bands in Boron Carbide. Nat. Commun. 2013, 4, 2483.\n(8) Zhao, S. T.; Kada, B.; Remington, B. A.; LaSalviac, J. C.; Wehrenberg, C. E.; Behlerc,\nK. D.; Meyers, M. A. Directional Amorphization of Boron Carbide Subjected to Laser\nShock Compression. Proc. Natl. Acad. Sci. U.S.A. 2016, 113, 12088−12093.\n(9) Gosset, D.; Miro, S.; Doriot, S.; Victor, G.; Motte, V. Evidence of Amorphisation of B4C Boron Carbide under Slow, Heavy Ion Irradiation. Nucl. Instrum. Methods Phys. Res.,\nSect. B 2015, 365, 300–304.\n(10) Chen, M. W.; McCauley, J. W. Mechanical Scratching Induced Phase Transitions\nand Reactions of Boron Carbide. J. Appl. Phys. 2006, 100, 123517.\n(11) An, Q.; Goddard, W. A. III. Atomistic Origin of Brittle Failure of Boron Carbide\nfrom Large-Scale Reactive Dynamics Simulations: Suggestions toward Improved\nDuctility. Phys. Rev. Lett. 115, 2015, 105501.\n(12) An, Q.; Goddard, W. A. III; Cheng, T. Atomistic Explanation of Shear-Induced\nAmorphous Band Formation in Boron Carbide. Phys. Rev. Lett. 2014, 113, 095501.\n(13) Fanchini, G.; McCauley, J. W.; Chhowalla, M. Behavior of Disordered Boron\nCarbide under Stress. Phys. Rev. Lett. 2006, 97, 035502.\n(14) Yan, X. Q.; Tang, Z.; Zhang, L.; Guo, J. J.; Jin, C. Q.; Zhang, Y.; Goto, T.;\nMcCauley, J. W.; Chen, M. W. Depressurization Amorphization of Single-Crystal Boron\nCarbide. Phys. Rev. Lett. 2009, 102, 075505.\n(15) Chen, C.; He, D. W.; Kou, Z.; Peng, F.; Yao, L.; Yu, R.; Bi, Y. B6O-Based\nComposite to Rival Polycrystalline Cubic Boron Nitride. Adv. Mater. 2007, 19,\n4288−4291.\n(16) Nikzad, L.; Orru, R.; Licheri, R.; Cao, G. Fabrication and ̀ Formation Mechanism of\nB4C−TiB2 Composite by Reactive Spark Plasma Sintering Using Unmilled and Mechanically Activated Reactants. J. Am. Ceram. Soc. 2012, 95, 3463−3471.\n(17) An, Q.; Goddard, W. A. III. Boron Suboxide and Boron Subphosphide Crystals:\nHard Ceramics That Shear without Brittle Failure. Chem. Mater. 2015, 27, 2855–2860.\n(18) An, Q.; Goddard, W. A. III. Microalloying Boron Carbide with Silicon to Achieve\nDramatically Improved Ductility. J. Phys. Chem. Lett. 2014, 5, 4169–4174.\n(19) Tang, B.; An, Q.; Goddard, W. A. III. Improved Ductility of Boron Carbide by\nMicroalloying with Boron Suboxide. J. Phys. Chem. C 2015, 119, 24649–24656.\n(20) Subhash, G.; Awasthi, A. P.; Kunka, C.; Jannotti, P.; DeVries, M. In Search of\nAmorphization-Resistant Boron Carbide. Scr. Mater. 2016, 123, 158−162.\n(21) An, Q.; Reddy, K. M.; Qian, J.; Hemker, K. J.; Chen, M. W.; Goddard, W. A. III.\nNucleation of Amorphous Shear Bands at Nanotwins in Boron Suboxide. Nat. Comm.\n2016, 7, 11001.\n(22) Kresse, G.; Hafner, J. Ab Initio Molecular Dynamics for Liquid Metals. Phys. Rev.\nB 1993, 47, 558−561.\n(23) Kresse, G.; Furthmuller, J. Efficiency of Ab-Initio Total Energy Calculations for\nMetals and Semiconductors Using a Plane-Wave Basis Set. Comput. Mater. Sci. 1996, 6,\n15−50.\n(24) Kresse, G.; Furthmüller, J. Efficient Iterative Schemes for Ab Initio Total-Energy\nCalculations Using a Plane-Wave Basis Set. Phys. Rev. B 1996, 16, 11169−11186.\n(25) Kresse, G.; Joubert, D. From Ultrasoft Pseudopotentials to the Projector\nAugmented-Wave Method. Phys. Rev. B 1999, 59, 1758−1775.\n(26) Le Page, Y.; Saxe, P. Symmetry-General Least-Squares Extraction of Elastic Data\nfor Strained Materials from Ab Initio Calculations of Stress. Phys. Rev. B 2002, 65,\n104104.\n(27) Hill, R. The Elastic Behaviour of a Crystalline Aggregate. Proc. Phys. Soc. A 1952,\n65, 349−354.\n(28) Roundy, D.; Krenn, C. R.; Cohen, M. L.; Morris, J. W. Jr. Ideal Shear Strengths of\nfcc Aluminum and Copper. Phys. Rev. Lett. 1999, 82, 2713−2716.\n(29) Li, B.; Sun, H.; Chen, C. F. Large Indentation Strain-Stiffening in Nanotwinned\nCubic Boron Nitride. Nat. Commun. 2014, 5, 4965.\n(30) Jemmis, E. D.; Prasas, B. V.; Tsuzuki, S.; Tanabe, K. Analogy between Trivalent\nBoron and Divalent Silicon. J. Phys. Chem. 1990, 94, 5530−5535.\n(31) Jemmis, E. D.; Kiran, B.; Coffery, D. Jr. Ab Initio Studies on Disubstituted\ncloso-Icosahedral Heteroboranes, X2B10H12 (X = CH, SiH, N, P, and Sb). Chem. Ber.\n1997, 130, 1147−1150.\n(32) Chen, X. Q.; Niu, H. Y.; Li, D. Z.; Li, Y. Y. Modeling Hardness of Polycrystalline\nMaterials and Bulk Metallic Glasses. Intermetallics 2011, 19, 1275−1281.\n(33) Lyakhov, A. O.; Oganov, A. R. Evolutionary Search for Superhard Materials: Methodology and Applications to Forms of Carbon and TiO2. Phys. Rev. B 2011, 84,\n092103.\n(34) Farbaniec, L.; Hogan, J. D.; Xie, K. Y.; Shaeffer, M.; Hemker, K. J.; Ramesh, K. T.\nDamage Evolution of Hot-Pressed Boron Carbide under Confined Dynamic\nCompression, Int. J. Impact Eng. 2017, 99, 75−84."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Improved Ductility of B12 Icosahedra-based Superhard Materials through Icosahedral Slip\nQi An and William A. Goddard, III\nThe Journal of Physical Chemistry C 2017 121 (21), 11831-11838 \nDOI: 10.1021/acs.jpcc.7b01761","other_numbering_system":null,"funders":[{"agency":"Defense Advanced Research Projects Agency (DARPA)","grant_number":"W31P4Q-13-1-0010"},{"agency":"Defense Advanced Research Projects Agency (DARPA)","grant_number":"W31P4Q1210008"},{"agency":"NSF","grant_number":"DMR-1436985"},{"agency":"Army Research Laboratory","grant_number":"W911NF-12-2-0022"},{"agency":"Nuclear Regulatory Commission","grant_number":"NRC-HQ-84-15-G-0028"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}