{"title":"Evidence of cross-cutting and redox reaction in Khatyrka meteorite reveals metallic-Al minerals formed in outer space","uri":"","abstract":"We report on a fragment of the quasicrystal-bearing CV3 carbonaceous chondrite Khatyrka recovered from fine-grained, clay-rich sediments in the Koryak Mountains, Chukotka (Russia). We show higher melting-point silicate glass cross-cutting lower melting-point Al-Cu-Fe alloys, as well as unambiguous evidence of a reduction-oxidation reaction history between Al-Cu-Fe alloys and silicate melt. The redox reactions involve reduction of FeO and SiO_2 to Fe and Fe-Si metal, and oxidation of metallic Al to Al_2O_3, occurring where silicate melt was in contact with Al-Cu-Fe alloys. In the reaction zone, there are metallic Fe and Fe-Si beads, aluminous spinel rinds on the Al-Cu-Fe alloys, and Al_2O_3 enrichment in the silicate melt surrounding the alloys. From this and other evidence, we demonstrate that Khatyrka must have experienced at least two distinct events: first, an event as early as 4.564 Ga in which the first Al-Cu-Fe alloys formed; and, second, a more recent impact-induced shock in space that led to transformations of and reactions between the alloys and the meteorite matrix. The new evidence firmly establishes that the Al-Cu-Fe alloys (including quasicrystals) formed in outer space in a complex, multi-stage process.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252187","docid":252187,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257256","fileid":1257256,"datasetid":"document","objectid":252187,"filename":"art%3A10.1038%2Fs41598-017-01445-5.pdf","mime_type":"application/pdf","hash":"258a677bbc37066c734c4a13fbe00b45","hash_type":"MD5","filesize":3531464,"mtime":"2017-05-15 15:22:39","url":"http://authors.library.caltech.edu/77439/1/art%253A10.1038%252Fs41598-017-01445-5.pdf"}],"eprintid":77439,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"art%3A10.1038%2Fs41598-017-01445-5.pdf","content":"published"}],"note":"© 2017 The Author(s). This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in a credit line to the material. If material is not included in the article’s Creative Commons license and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/. \n\nReceived: 05 December 2016; Accepted: 22 March 2017; Published online: 09 May 2017. \n\nWe have benefitted from the thorough review and constructive comments by Christopher Hamann, who has been a great help in improving our manuscript. We thank Paul Asimow for his comments on the manuscript and Andrew Higgins for discussions on thermite-related processes. L.S.H. is grateful to the Department of Geosciences of Princeton University for the continuing support, in retirement, of his participation in the quasicrystal project. G.J.M. was partially supported by the Small Grants program at the Smithsonian Institution’s Museum of Natural History. L.B. thanks the “Progetto di Ateneo 2015” issued by the Università di Firenze, Italy. The Caltech GPS Division Analytical Facility (where SEM, EBSD and EPMA analyses were carried out) is supported, in part, by NSF Grants EAR-0318518 and DMR-0080065. \n\nAuthor Contributions: L.B. found Grain 126A from material recovered in the 2011 Chukotka expedition. L.B. performed the X-ray compositional maps. C.L., G.J.M., and C.M. performed the SEM studies. C.L. and C.M. performed the EPMA studies. C.M. performed the EBSD studies. C.L., L.S.H., L.B., and P.J.S. wrote the paper. All the authors discussed the results and commented on the manuscript. \n\nThe authors declare that they have no competing interests.","id":77439,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/74/39","datestamp":"2017-05-15 23:59:55","lastmod":"2017-05-15 23:59:55","status_changed":"2017-05-15 23:59:55","type":"article","metadata_visibility":"show","creators":[{"given":"Chaney","family":"Lin","id":"Lin-Chaney","orcid":""},{"given":"Lincoln S.","family":"Hollister","id":"Hollister-L-S","orcid":""},{"given":"Glenn J.","family":"MacPherson","id":"MacPherson-G-J","orcid":""},{"given":"Luca","family":"Bindi","id":"Bindi-L","orcid":""},{"given":"Chi","family":"Ma","id":"Ma-Chi-Geology","orcid":""},{"given":"Christopher L.","family":"Andronicos","id":"Andronicos-C-L","orcid":""},{"given":"Paul J.","family":"Steinhardt","id":"Steinhardt-P-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-09","date_type":"published","publication":"Scientific Reports","volume":"7","number":"1","pagerange":"Art. No. 1637","id_number":"CaltechAUTHORS:20170515-082229117","refereed":true,"issn":"2045-2322","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170515-082229117","related_url":[{"url":"http://dx.doi.org/10.1038/s41598-017-01445-5","type":"doi","description":"Article"},{"url":"http://www.nature.com/articles/s41598-017-01445-5","type":"pub","description":"Article"}],"referencetext":["\n1.\n\nBindi, L. et al. Evidence for the extraterrestrial origin of a natural quasicrystal. Proc. Nat. Acad. Sci 109, 1396–1401, doi:10.1073/pnas.1111115109 (2012).\n+ Show context\n\nADS\nCAS\nArticle\nPubMed\nPubMed Central\n\n\n\n2.\n\nMacPherson, G. J. et al. Khatyrka, a new CV3 find from the Koryak Mountains, Eastern Russia. Met. Planet. Sci 48, 1499–1514, doi:10.1111/maps.2013.48.issue-8 (2013).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n3.\n\nMcSween, H. Y. Jr. Petrographic variations among carbonaceous chondrites of the Vigarano type. Geoch. Cosmoch. Acta 41, 1777–1790, doi:10.1016/0016-7037(77)90210-1 (1977).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n4.\n\nWeinbruch, S., Palme, H., Müller, W. F. \u0026 El Goresy, A. FeO-rich rims and veins in Allende forsterite: Evidence for high temperature condensation at oxidizing conditions. Meteoritics 25, 115–125, doi:10.1111/maps.1990.25.issue-2 (1990).\n+ Show context\n\nADS\nArticle\n\n\n\n5.\n\nKrot, A. N., Scott, E. R. D. \u0026 Zolensky, M. E. Mineralogical and chemical modification of components in CV3 chondrites: Nebular or asteroidal processing? Meteoritics 30, 748–775, doi:10.1111/maps.1995.30.issue-6 (1995).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n6.\n\nScott, E. R. D. \u0026 Krot, A. N. Chondrites and Their Components. In Treatise on Geochemistry, 65–137 (Elsevier, 2003).\n+ Show context\n\n\n\n\n7.\n\nEbel, D. S. et al. Abundance, major element composition and size of components and matrix in CV, CO and Acfer 094 chondrites. Geoch. Cosmoch. Acta 172, 322–356, doi:10.1016/j.gca.2015.10.007 (2016).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n8.\n\nBrearley, A. J. \u0026 Jones, R. H. Chondritic meteorites. Rev. Min. Geoch 36, 1–398 (1998).\n+ Show context\n\n\n\n\n9.\n\nMacPherson, G. J. Calcium-aluminum-rich inclusions in chondritic meteorites. In Treatise on Geochemistry, 139–179 (Elsevier, 2014).\n+ Show context\n\n\n\n\n10.\n\nBindi, L., Steinhardt, P. J., Yao, N. \u0026 Lu, P. J. Natural Quasicrystals. Science 324, 1306–1309, doi:10.1126/science.1170827 (2009).\n+ Show context\n\nADS\nCAS\nArticle\nPubMed\n\n\n\n11.\n\nSteinhardt, P. J. \u0026 Bindi, L. In search of natural quasicrystals. Rep. Prog. Phys. 75, 092601, doi:10.1088/0034-4885/75/9/092601 (2012).\n+ Show context\n\nADS\nArticle\nPubMed\n\n\n\n12.\n\nBindi, L. \u0026 Steinhardt, P. J. The quest for forbidden crystals. Min. Mag 78, 467–482, doi:10.1180/minmag.2014.078.2.15 (2014).\n+ Show context\n\nCAS\nArticle\n\n\n\n13.\n\nBindi, L. et al. Natural quasicrystal with decagonal symmetry. Sci. Rep 5, 9111, doi:10.1038/srep09111 (2015).\n+ Show context\n\nArticle\nPubMed\nPubMed Central\n\n\n\n14.\n\nBindi, L., Lin, C., Ma, C. \u0026 Steinhardt, P. J. Collisions in outer space produced an icosahedral phase in the Khatyrka meteorite never observed previously in the laboratory. Sci. Rep 6, 38117, doi:10.1038/srep38117 (2016).\n+ Show context\n\nADS\nCAS\nArticle\nPubMed\nPubMed Central\n\n\n\n15.\n\nBindi, L. et al. Steinhardtite, a new body-centered-cubic allotropic form of aluminum from the Khatyrka CV3 carbonaceous chondrite. Am. Min 99, 2433–2436, doi:10.2138/am-2014-5108 (2014).\n+ Show context\n\nADS\nArticle\n\n\n\n16.\n\nMa, C., Lin, C., Bindi, L. \u0026 Steinhardt, P. J. Discovery of new Al-Cu-Fe minerals in the Khatyrka CV3 meteorite. 79 th Ann. Meet. Meteor. Soc., 6017 (2016).\n+ Show context\n\n\n\n\n17.\n\nMa, C., Lin, C., Bindi, L. \u0026 Steinhardt, P. J. Hollisterite (Al3Fe), kryachkoite (Al,Cu)6(Fe,Cu), and stolperite (AlCu): Three new minerals from the Khatyrka CV3 carbonaceous chondrite. Am. Min 102, 690–693, doi:10.2138/am-2017-5991 (2017).\n+ Show context\n\nADS\nArticle\n\n\n\n18.\n\nMeier, M. M. M. et al. Shedding Light on the Origin of the Quasicrystal-bearing Khatyrka Meteorite. 78 th Ann. Meet. Meteor. Soc., 5035 (2015).\n+ Show context\n\n\n\n\n19.\n\nMeier, M. M. M. et al. Cosmic-Ray Exposure and Shock Degassing Ages of the Quasicrystal-Bearing Khatyrka Meteorite. In Lunar Planet. Sci. Conf. XLVII 1226 (2016).\n+ Show context\n\n\n\n\n20.\n\nGrossman, L., Beckett, J. R., Fedkin, A. V., Simon, S. B. \u0026 Ciesla, F. J. Redox conditions in the solar nebula: Observational, experimental, and theoretical constraints. Rev. Min. Geoch 68, 93–140, doi:10.2138/rmg.2008.68.7 (2008).\n+ Show context\n\nCAS\nArticle\n\n\n\n21.\n\nHollister, L. S. et al. Redox reactions between Cu-Al metal and silicates in the Khatyrka meteorite. In Lunar Planet. Sci. Conf. XLVI 2394 (2015).\n+ Show context\n\n\n\n\n22.\n\nHollister, L. S. et al. Impact-induced shock and the formation of natural quasicrystals in the early solar system. Nature Comm 5, 1306, doi:10.1038/ncomms5040 (2014).\n+ Show context\n\nArticle\n\n\n\n23.\n\nMa, C. et al. Ahrensite, γ-Fe2SiO4, a new shock-metamorphic mineral from the Tissint meteorite: Implications for the Tissint shock event on Mars. Geoch. Cosmoch. Acta 184, 240–256, doi:10.1016/j.gca.2016.04.042 (2016).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n24.\n\nOhtaka, O., Tobe, H. \u0026 Yamanaka, T. Phase equilibria for the Fe2SiO4-Fe3O4 system under high pressure. Phys. Chem. Min 24, 555–560, doi:10.1007/s002690050072 (1997).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n25.\n\nStöffler, D., Keil, K. \u0026 Scott, E. R. D. Shock metamorphism of ordinary chondrites. Geoch. Cosmoch. Acta 55, 3845–3867, doi:10.1016/0016-7037(91)90078-J (1991).\n+ Show context\n\nADS\nArticle\n\n\n\n26.\n\nRubin, A. E. Metallic copper in ordinary chondrites. Meteoritics 29, 93–98, doi:10.1111/maps.1994.29.issue-1 (1994).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n27.\n\nTomkins, A. G. What metal-troilite textures can tell us about post-impact metamorphism in chondrite meteorites. Met. Planet. Sci 44, 1133–1149, doi:10.1111/j.1945-5100.2009.tb01213.x (2009).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n28.\n\nXie, X. \u0026 Chen, M. Suizhou Meteorite: Mineralogy and Shock Metamorphism (Springer-Verlag Berlin Heidelberg, 2016).\n+ Show context\n\n\n\n\n29.\n\nBancel, P. A. Order and disorder in icosahedral alloys. In Quasicrystals: the State of the Art, 17–56 (World Scientific, 1991).\n+ Show context\n\n\n\n\n30.\n\nStagno, V. et al. Icosahedral AlCuFe quasicrystal at high pressure and temperature and its implications for the stability of icosahedrite. Sci. Rep 4, 2477, doi:10.1038/srep05869 (2014).\n+ Show context\n\n\n\n\n31.\n\nStagno, V. et al. Quasicrystals at extreme conditions: The role of pressure in stabilizing icosahedral Al63Cu24Fe13 at high temperature. Am. Min 100, 2412–2418, doi:10.2138/am-2015-5412 (2015).\n+ Show context\n\nADS\nArticle\n\n\n\n32.\n\nRamsay, J. G. Folding and Fracturing of Rocks (McGraw-Hill, 1967).\n+ Show context\n\n\n\n\n33.\n\nShi, N. et al. Naquite, FeSi, a new mineral species from Luobusha, Tibet, Western China. Acta Geol. Sinica 86, 533–538 (2012).\n+ Show context\n\nCAS\n\n\n\n34.\n\nKeil, K., Berkley, J. L. \u0026 Fuchs, L. H. Suessite, Fe3Si, a new mineral in the North Haig ureilite. 43 rd Ann. Meet. Meteor. Soc., 154 (1980).\n+ Show context\n\n\n\n\n35.\n\nZuxiang, Y. Two new minerals gupeiite and xifengite in cosmic dusts from Yanshan. Acta Petrol. Min. Anal 3, 231–238 (1984).\n+ Show context\n\n\n\n\n36.\n\nHamann, C., Stöffler, D. \u0026 Reimold, W. U. Interaction of aluminum projectiles with quartz sand in impact experiments: Formation of khatyrkite (CuAl2) and reduction of SiO2 to Si. Geoch. Cosmoch. Acta 192, 295–317, doi:10.1016/j.gca.2016.07.018 (2016).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n37.\n\nChen, M., Sharp, T. G., Goresy, A. E., Wopenka, B. \u0026 Xie, X. The Majorite-Pyrope+ Magnesiowustite Assemblage: Constraints on the History of Shock Veins in Chondrites. Science 271, 1570–1573, doi:10.1126/science.271.5255.1570 (1996).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n38.\n\nFiske, P. S. et al. Pseudotachylites Generated in Shock Experiments: Implications for Impact Cratering Products and Processes. Science 270, 281–283, doi:10.1126/science.270.5234.281 (1995).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n39.\n\nHamann, C., Hecht, L., Ebert, M. \u0026 Wirth, R. Chemical projectile–target interaction and liquid immiscibility in impact glass from the Wabar craters, Saudi Arabia. Geoch. Cosmoch. Acta 121, 291–310, doi:10.1016/j.gca.2013.07.030 (2013).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n40.\n\nTomeoka, K., Yamahana, Y. \u0026 Sekine, T. Experimental shock metamorphism of the Murchison CM carbonaceous chondrite. Geoch. Cosmoch. Acta 63, 3683–3703, doi:10.1038/nature01567 (1999).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n41.\n\nBerman, R. G. Internally-consistent thermodynamic data for minerals in the system Na2O-K2O-CaO-MgO-FeO-Fe2O3-Al2O3-SiO2-TiO2-H2O-CO2. J. Petrol. 29, 445–522, doi:10.1093/petrology/29.2.445 (1988).\n+ Show context\n\nCAS\nArticle\n\n\n\n42.\n\nOttonello, G., Princivalle, F. \u0026 Della Giusta, A. Temperature, composition, and fO2 effects on intersite distribution of Mg and Fe2+ in olivines. Phys. Chem. Min 17, 301–312, doi:10.1007/BF00200125 (1990).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n43.\n\nSaâdi, N., Harmelin, M., Faudot, F. \u0026 Legendre, B. Enthalpy of formation of the Al0.63Cu0.25Fe0.12 icosahedral phase. J. Non Crystall. Sol 153–154, 500–503, doi:10.1016/0022-3093(93)90403-K (1993).\n+ Show context\n\nArticle\n\n\n\n44.\n\nBoesenberg, J. S. \u0026 Hewins, R. H. An experimental investigation into the metastable formation of phosphoran olivine and pyroxene. Geoch. Cosmoch. Acta 74, 1923–1941, doi:10.1107/S0909049512032414 (2010).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n45.\n\nVan Roosbroek, N. et al. Immiscible silicate liquids and phosphoran olivine in Netschaëvo IIE silicate: Analogue for planetesimal core–mantle boundaries. Geoch. Cosmoch. Acta 197, 378–395, doi:10.1016/j.gca.2016.10.042 (2017).\n+ Show context\n\nADS\nArticle\n\n\n\n46.\n\nZhang, L., Schneider, J. \u0026 Lück, R. Phase transformations and phase stability of the AlCuFe alloys with low-Fe content. Intermetallics 13, 1195–1206, doi:10.1016/j.intermet.2005.03.004 (2005).\n+ Show context\n\nCAS\nArticle\n\n\n\n47.\n\nBowen, N. L. \u0026 Schairer, J. F. The system MgO-FeO-SiO2. Am. J. Sci 170, 151–217, doi:10.2475/ajs.s5-29.170.151 (1935).\n+ Show context\n\nArticle\n\n\n\n48.\n\nLindholm, M. A thermodynamic description of the Fe-Cr-Si system with emphasis on the equilibria of the sigma (Σ) phase. J. Phase Equil 18, 432–440, doi:10.1007/BF02647699 (1997).\n+ Show context\n\nCAS\nArticle\n\n\n\n49.\n\nMurray, J. L. The aluminium-copper system. Intern. Met. Rev 30, 211–234, doi:10.1179/imr.1985.30.1.211 (1985).\n+ Show context\n\nCAS\nArticle\n\n\n\n50.\n\nMassalski, T. B., Okamoto, H., Subramanian, P. R. \u0026 Kacprzak, L. Binary alloy phase diagrams. vol. 3 (ASM International, 1990).\n+ Show context\n\n\n\n\n51.\n\nEssene, E. J. \u0026 Fisher, D. C. Lightning Strike Fusion: Extreme Reduction and Metal-Silicate Liquid Immiscibility. Science 234, 189–193, doi:10.1126/science.234.4773.189 (1986).\n+ Show context\n\nADS\nCAS\nArticle\nPubMed\n\n\n\n52.\n\nRowan, L. R. \u0026 Ahrens, T. J. Observations of impact-induced molten metal-silicate partitioning. Earth Planet. Sci. Lett. 122, 71–88, doi:10.1016/S0140-6736(16)30442-1 (1994).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n53.\n\nMeibom, A. et al. Shock melts in QUE 94411, Hammadah al Hamra 237, and Bencubbin: Remains of the missing matrix? Met. Planet. Sci 40, 1377–1391, doi:10.1111/j.1945-5100.2005.tb00408.x (2005).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n54.\n\nBischoff, A. \u0026 Stöffler, D. Shock metamorphism as a fundamental process in the evolution of planetary bodies: Information from meteorites. Eur. J. Min 4, 707–755, doi:10.1127/ejm/4/4/0707 (1992).\n+ Show context\n\nCAS\nArticle\n\n\n\n55.\n\nZhang, J., Williams, D. B. \u0026 Goldstein, J. I. The microstructure and formation of duplex and black plessite in iron meteorites. Geoch. Cosmoch. Acta 57, 3725–3735, doi:10.1016/0016-7037(93)90151-L (1993).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n56.\n\nAsimow, P. D. et al. Shock synthesis of quasicrystals with implications for their origin in asteroid collisions. Proc. Nat. Acad. Sci 113, 7077–7081, doi:10.1073/pnas.1600321113 (2016).\n+ Show context\n\nADS\nCAS\nArticle\nPubMed\nPubMed Central\n\n\n\n57.\n\nMa, C. \u0026 Rossman, G. R. Barioperovskite, BaTiO3, a new mineral from the Benitoite Mine, California. Am. Min 93, 154–157, doi:10.2138/am.2008.2636 (2008).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n58.\n\nMa, C. \u0026 Rossman, G. R. Tistarite, Ti2O3, a new refractory mineral from the Allende meteorite. Am. Min 94, 841–844, doi:10.2138/am.2009.3203 (2009).\n+ Show context\n\nADS\nCAS\nArticle\n\n\n\n59.\n\nFredriksson, K. \u0026 Kerridge, J. F. Carbonates and Sulfates in CI Chondrites: Formation by Aqueous Activity on the Parent Body. Meteoritics 23, 35–44, doi:10.1111/maps.1988.23.issue-1 (1988).\n+ Show context\n\nADS\nCAS\nArticle\nPubMed\n\n\n\n60.\n\nJarosewich, E. Chemical analyses of meteorites: A compilation of stony and iron meteorite analyses. Meteoritics 25, 323–337, doi:10.1111/maps.1990.25.issue-4 (1990).\n\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Smithsonian Institution","grant_number":""},{"agency":"Università di Firenze","grant_number":""},{"agency":"NSF","grant_number":"EAR-0318518"},{"agency":"NSF","grant_number":"DMR-0080065"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}