{"title":"Models for shock-induced ignition evaluated by detailed chemical kinetics for hydrogen/air in the context of deflagration-to-detonation transition","uri":"","abstract":"Deflagration-to-detonation transition can occur in industrial explosions involving highly reactive gas mixtures such as H_2/air. Large degrees of confinement and congestion support strong flame acceleration and the transition to detonation. Various mechanisms can accomplish the onset of detonation, such as mixing processes and instabilities or shock-induced ignition. This paper focuses on ignition by normal shock reflection. Two ignition modes behind reflected shock waves are distinguished: strong ignition, which enables direct detonation initiation; and weak ignition, leading to distributed ignition kernels (deflagrations). Models for the prediction of ignition modes by Voevodsky and Soloukhin, Meyer and Oppenheim, Radulescu et al., Grogan and Ihme, and Thomas et al., are evaluated and compared using a state-of-the-art detailed chemical kinetic scheme. Based on these models, critical incident shock Mach numbers leading to strong ignition are determined. Similarities and deviations between these models are discussed and strategies for future experimental work are proposed.","documents":null,"note":"© 2017 Elsevier B.V. \n\nReceived 3 October 2016, Revised 18 April 2017, Accepted 18 April 2017, Available online 22 April 2017.","id":77438,"rev_number":5,"userid":18,"eprint_dir":"disk0/00/07/74/38","datestamp":"2017-05-16 02:40:49","lastmod":"2017-05-16 02:40:49","status_changed":"2017-05-16 02:40:49","type":"article","metadata_visibility":"show","creators":[{"given":"L. R.","family":"Boeck","id":"Boeck-L-R","orcid":""},{"given":"R.","family":"Mével","id":"Mével-R","orcid":""},{"given":"T.","family":"Sattelmayer","id":"Sattelmayer-T","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"none","keywords":"Chemical kinetics; Deflagration-to-detonation transition; Hydrogen; Shock-induced ignition; Strong ignition; Weak ignition","date":"2017-04-22","date_type":"inpress","publication":"Journal of Loss Prevention in the Process Industries","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170515-074958854","refereed":true,"issn":"0950-4230","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170515-074958854","related_url":[{"url":"https://doi.org/10.1016/j.jlp.2017.04.018","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0950423017303807","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"L.R. Boeck, R. Mével, T. Sattelmayer, Models for shock-induced ignition evaluated by detailed chemical kinetics for hydrogen/air in the context of deflagration-to-detonation transition, Journal of Loss Prevention in the Process Industries, Available online 22 April 2017, ISSN 0950-4230, https://doi.org/10.1016/j.jlp.2017.04.018.\n(http://www.sciencedirect.com/science/article/pii/S0950423017303807)","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}