{"title":"Challenges and emerging directions in single-cell analysis","uri":"","abstract":"Single-cell analysis is a rapidly evolving approach to characterize genome-scale molecular information at the individual cell level. Development of single-cell technologies and computational methods has enabled systematic investigation of cellular heterogeneity in a wide range of tissues and cell populations, yielding fresh insights into the composition, dynamics, and regulatory mechanisms of cell states in development and disease. Despite substantial advances, significant challenges remain in the analysis, integration, and interpretation of single-cell omics data. Here, we discuss the state of the field and recent advances and look to future opportunities.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252204","docid":252204,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257342","fileid":1257342,"datasetid":"document","objectid":252204,"filename":"art%3A10.1186%2Fs13059-017-1218-y.pdf","mime_type":"application/pdf","hash":"97b592f9b4029846facb0efd5519143c","hash_type":"MD5","filesize":421665,"mtime":"2017-05-15 17:38:00","url":"http://authors.library.caltech.edu/77447/1/art%253A10.1186%252Fs13059-017-1218-y.pdf"}],"eprintid":77447,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"art%3A10.1186%2Fs13059-017-1218-y.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252205","docid":252205,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257346","fileid":1257346,"datasetid":"document","objectid":252205,"filename":"127761.full.pdf","mime_type":"application/pdf","hash":"430112c0df2cdf7025e184c82d7c38d8","hash_type":"MD5","filesize":158839,"mtime":"2017-05-15 17:42:33","url":"http://authors.library.caltech.edu/77447/2/127761.full.pdf"}],"eprintid":77447,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"127761.full.pdf","content":"submitted"}],"note":"© 2017 The Author(s). This article is distributed under the terms of the Creative Commons Attribution 4.0 International License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium, provided you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. The Creative Commons Public Domain Dedication waiver (http://creativecommons.org/publicdomain/zero/1.0/) applies to the data made available in this article, unless otherwise stated. \n\nReceived: 18 December 2016; Accepted: 21 April 2017; Published online: 08 May 2017. \n\nThis article is a result of the discussions at the Radcliffe Institute Exploratory Seminar on “Theoretical Challenges in Single-Cell Analysis” in June 2016. We are grateful for the Radcliffe Institute’s generous financial and logistical support. \n\nThe work was supported by a Radcliffe Institute Exploratory Seminar Award and by the NIH grants R13-CA124365 and R01-DK081113S1. \n\nAvailability of data and materials: Not applicable. \n\nAuthors’ contributions: GCY conceived the study. All authors participated in the discussions and writing of the manuscript. All authors read and approved the final manuscript. \n\nThe authors declare that they have no competing interests. \n\nEthics approval and consent to participate: Not applicable.","id":77447,"rev_number":10,"userid":18,"eprint_dir":"disk0/00/07/74/47","datestamp":"2017-05-16 02:34:23","lastmod":"2017-05-16 02:34:23","status_changed":"2017-05-16 02:34:23","type":"article","metadata_visibility":"show","creators":[{"given":"Guo-Cheng","family":"Yuan","id":"Yuan-Guo-Cheng","orcid":""},{"given":"Long","family":"Cai","id":"Cai-Long","orcid":"0000-0002-7154-5361"},{"given":"Michael","family":"Elowitz","id":"Elowitz-M-B","orcid":"0000-0002-1221-0967"},{"given":"Tariq","family":"Enver","id":"Enver-T","orcid":""},{"given":"Guoping","family":"Fan","id":"Fan-Guoping","orcid":""},{"given":"Guoji","family":"Guo","id":"Guo-Guoji","orcid":""},{"given":"Rafael","family":"Irizarry","id":"Irizarry-R","orcid":""},{"given":"Peter","family":"Kharchenko","id":"Kharchenko-P","orcid":""},{"given":"Junhyong","family":"Kim","id":"Kim-Junhyong","orcid":""},{"given":"Stuart","family":"Orkin","id":"Orkin-S","orcid":""},{"given":"John","family":"Quackenbush","id":"Quackenbush-J","orcid":""},{"given":"Assieh","family":"Saadatpour","id":"Saadatpour-A","orcid":""},{"given":"Timm","family":"Schroeder","id":"Schroeder-T","orcid":""},{"given":"Ramesh","family":"Shivdasani","id":"Shivdasani-R","orcid":""},{"given":"Itay","family":"Tirosh","id":"Tirosh-I","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-08","date_type":"published","publication":"Genome Biology","volume":"18","number":"1","pagerange":"Art. No. 84","id_number":"CaltechAUTHORS:20170515-103755842","refereed":true,"issn":"1474-760X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170515-103755842","related_url":[{"url":"http://dx.doi.org/10.1186/s13059-017-1218-y","type":"doi","description":"Article"},{"url":"http://genomebiology.biomedcentral.com/articles/10.1186/s13059-017-1218-y","type":"pub","description":"Article"},{"url":"http://biorxiv.org/content/early/2017/04/15/127761","type":"org","description":"Discussion Paper"},{"url":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5421338/","type":"pmc","description":"Article"}],"referencetext":["Eberwine J, Sul JY, Bartfai T, Kim J. The promise of single-cell sequencing. Nat Methods. 2014;11:25–7.\nView ArticlePubMedGoogle Scholar\n\n2.Blainey PC, Quake SR. Dissecting genomic diversity, one cell at a time. Nat Methods. 2014;11:19–21.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n3.Sandberg R. Entering the era of single-cell transcriptomics in biology and medicine. Nat Methods. 2014;11:22–4.\nView ArticlePubMedGoogle Scholar\n\n4.Spitzer MH, Nolan GP. Mass cytometry: single cells, many features. Cell. 2016;165:780–91.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n5.Zenobi R. Single-cell metabolomics: analytical and biological perspectives. Science. 2013;342:1243259.\nView ArticlePubMedGoogle Scholar\n\n6.Treutlein B, Brownfield DG, Wu AR, Neff NF, Mantalas GL, Espinoza FH, et al. Reconstructing lineage hierarchies of the distal lung epithelium using single-cell RNA-seq. Nature. 2014;509:371–5.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n7.Zeisel A, Munoz-Manchado AB, Codeluppi S, Lonnerberg P, La Manno G, Jureus A, et al. Brain structure. Cell types in the mouse cortex and hippocampus revealed by single-cell RNA-seq. Science. 2015;347:1138–42.\nView ArticlePubMedGoogle Scholar\n\n8.Shekhar K, Lapan SW, Whitney IE, Tran NM, Macosko EZ, Kowalczyk M, et al. Comprehensive classification of retinal bipolar neurons by single-cell transcriptomics. Cell. 2016;166:1308–23. e1330.\nView ArticlePubMedGoogle Scholar\n\n9.Trapnell C, Cacchiarelli D, Grimsby J, Pokharel P, Li S, Morse M, et al. The dynamics and regulators of cell fate decisions are revealed by pseudotemporal ordering of single cells. Nat Biotechnol. 2014;32:381–6.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n10.Bendall SC, Davis KL, Amir e-AD, Tadmor MD, Simonds EF, Chen TJ, et al. Single-cell trajectory detection uncovers progression and regulatory coordination in human B cell development. Cell. 2014;157:714–25.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n11.Marco E, Karp RL, Guo G, Robson P, Hart AH, Trippa L, et al. Bifurcation analysis of single-cell gene expression data reveals epigenetic landscape. Proc Natl Acad Sci U S A. 2014;111:E5643–50.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n12.Setty M, Tadmor MD, Reich-Zeliger S, Angel O, Salame TM, Kathail P, et al. Wishbone identifies bifurcating developmental trajectories from single-cell data. Nat Biotechnol. 2016;34:637–45.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n13.Haghverdi L, Buttner M, Wolf FA, Buettner F, Theis FJ. Diffusion pseudotime robustly reconstructs lineage branching. Nat Methods. 2016;13:845–8.\nView ArticlePubMedGoogle Scholar\n\n14.Guo G, Luc S, Marco E, Lin TW, Peng C, Kerenyi MA, et al. Mapping cellular hierarchy by single-cell analysis of the cell surface repertoire. Cell Stem Cell. 2013;13:492–505.\nView ArticlePubMedGoogle Scholar\n\n15.Paul F, Arkin Y, Giladi A, Jaitin DA, Kenigsberg E, Keren-Shaul H, et al. Transcriptional heterogeneity and lineage commitment in myeloid progenitors. Cell. 2015;163:1663–77.\nView ArticlePubMedGoogle Scholar\n\n16.Olsson A, Venkatasubramanian M, Chaudhri VK, Aronow BJ, Salomonis N, Singh H, et al. Single-cell analysis of mixed-lineage states leading to a binary cell fate choice. Nature. 2016;537:698–702.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n17.Hoppe PS, Schwarzfischer M, Loeffler D, Kokkaliaris KD, Hilsenbeck O, Moritz N, et al. Early myeloid lineage choice is not initiated by random PU.1 to GATA1 protein ratios. Nature. 2016;535:299–302.\nView ArticlePubMedGoogle Scholar\n\n18.Kim TK, Sul JY, Peternko NB, Lee JH, Lee M, Patel VV, et al. Transcriptome transfer provides a model for understanding the phenotype of cardiomyocytes. Proc Natl Acad Sci U S A. 2011;108:11918–23.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n19.Kim J, Eberwine J. RNA: state memory and mediator of cellular phenotype. Trends Cell Biol. 2010;20:311–8.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n20.Ni X, Zhuo M, Su Z, Duan J, Gao Y, Wang Z, et al. Reproducible copy number variation patterns among single circulating tumor cells of lung cancer patients. Proc Natl Acad Sci U S A. 2013;110:21083–8.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n21.Wang Y, Waters J, Leung ML, Unruh A, Roh W, Shi X, et al. Clonal evolution in breast cancer revealed by single nucleus genome sequencing. Nature. 2014;512:155–60.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n22.Gawad C, Koh W, Quake SR. Dissecting the clonal origins of childhood acute lymphoblastic leukemia by single-cell genomics. Proc Natl Acad Sci U S A. 2014;111:17947–52.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n23.Tirosh I, Izar B, Prakadan SM, Wadsworth 2nd MH, Treacy D, Trombetta JJ, et al. Dissecting the multicellular ecosystem of metastatic melanoma by single-cell RNA-seq. Science. 2016;352:189–96.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n24.Bacher R, Kendziorski C. Design and computational analysis of single-cell RNA-sequencing experiments. Genome Biol. 2016;17:63.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n25.Skylaki S, Hilsenbeck O, Schroeder T. Challenges in long-term imaging and quantification of single-cell dynamics. Nat Biotechnol. 2016;34:1137–44.\nView ArticlePubMedGoogle Scholar\n\n26.Wagner A, Regev A, Yosef N. Revealing the vectors of cellular identity with single-cell genomics. Nat Biotechnol. 2016;34:1145–60.\nView ArticlePubMedGoogle Scholar\n\n27.Buettner F, Natarajan KN, Casale FP, Proserpio V, Scialdone A, Theis FJ, et al. Computational analysis of cell-to-cell heterogeneity in single-cell RNA-sequencing data reveals hidden subpopulations of cells. Nat Biotechnol. 2015;33:155–60.\nView ArticlePubMedGoogle Scholar\n\n28.Kharchenko PV, Silberstein L, Scadden DT. Bayesian approach to single-cell differential expression analysis. Nat Methods. 2014;11:740–2.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n29.Lun AT, Bach K, Marioni JC. Pooling across cells to normalize single-cell RNA sequencing data with many zero counts. Genome Biol. 2016;17:75.\nView ArticlePubMedGoogle Scholar\n\n30.Finak G, McDavid A, Yajima M, Deng J, Gersuk V, Shalek AK, et al. MAST: a flexible statistical framework for assessing transcriptional changes and characterizing heterogeneity in single-cell RNA sequencing data. Genome Biol. 2015;16:278.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n31.Hicks SC, Teng M, Irizarry RA. On the widespread and critical impact of systematic bias and batch effects in single-cell RNA-Seq data. bioRxiv. 2015. doi:10.1101/025528.\nGoogle Scholar\n\n32.Marinov GK, Williams BA, McCue K, Schroth GP, Gertz J, Myers RM, et al. From single-cell to cell-pool transcriptomes: stochasticity in gene expression and RNA splicing. Genome Res. 2014;24:496–510.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n33.Dueck H, Khaladkar M, Kim TK, Spaethling JM, Francis C, Suresh S, et al. Deep sequencing reveals cell-type-specific patterns of single-cell transcriptome variation. Genome Biol. 2015;16:122.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n34.Baker SC, Bauer SR, Beyer RP, Brenton JD, Bromley B, Burrill J, et al. The external RNA controls consortium: a progress report. Nat Methods. 2005;2:731–4.\nView ArticlePubMedGoogle Scholar\n\n35.Svensson V, Natarajan KN, Ly LH, Miragaia RJ, Labalette C, Macaulay IC, et al. Power analysis of single-cell RNA-sequencing experiments. Nat Methods. 2017;14:381–7.\nView ArticlePubMedGoogle Scholar\n\n36.Femino AM, Fay FS, Fogarty K, Singer RH. Visualization of single RNA transcripts in situ. Science. 1998;280:585–90.\nView ArticlePubMedGoogle Scholar\n\n37.Raj A, Peskin CS, Tranchina D, Vargas DY, Tyagi S. Stochastic mRNA synthesis in mammalian cells. PLoS Biol. 2006;4:e309.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n38.Betzig E, Patterson GH, Sougrat R, Lindwasser OW, Olenych S, Bonifacino JS, et al. Imaging intracellular fluorescent proteins at nanometer resolution. Science. 2006;313:1642–5.\nView ArticlePubMedGoogle Scholar\n\n39.Rust MJ, Bates M, Zhuang X. Sub-diffraction-limit imaging by stochastic optical reconstruction microscopy (STORM). Nat Methods. 2006;3:793–5.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n40.Lubeck E, Cai L. Single-cell systems biology by super-resolution imaging and combinatorial labeling. Nat Methods. 2012;9:743–8.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n41.Lubeck E, Coskun AF, Zhiyentayev T, Ahmad M, Cai L. Single-cell in situ RNA profiling by sequential hybridization. Nat Methods. 2014;11:360–1.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n42.Ke R, Mignardi M, Pacureanu A, Svedlund J, Botling J, Wahlby C, et al. In situ sequencing for RNA analysis in preserved tissue and cells. Nat Methods. 2013;10:857–60.\nView ArticlePubMedGoogle Scholar\n\n43.Lee JH, Daugharthy ER, Scheiman J, Kalhor R, Yang JL, Ferrante TC, et al. Highly multiplexed subcellular RNA sequencing in situ. Science. 2014;343:1360–3.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n44.Chen KH, Boettiger AN, Moffitt JR, Wang S, Zhuang X. RNA imaging. Spatially resolved, highly multiplexed RNA profiling in single cells. Science. 2015;348:aaa6090.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n45.Moffitt JR, Hao J, Wang G, Chen KH, Babcock HP, Zhuang X. High-throughput single-cell gene-expression profiling with multiplexed error-robust fluorescence in situ hybridization. Proc Natl Acad Sci U S A. 2016;113:11046–51.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n46.Shah S, Lubeck E, Schwarzkopf M, He TF, Greenbaum A, Sohn CH, et al. Single-molecule RNA detection at depth by hybridization chain reaction and tissue hydrogel embedding and clearing. Development. 2016;143:2862–7.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n47.Choi HM, Chang JY, le Trinh A, Padilla JE, Fraser SE, Pierce NA. Programmable in situ amplification for multiplexed imaging of mRNA expression. Nat Biotechnol. 2010;28:1208–12.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n48.Shah S, Lubeck E, Zhou W, Cai L. In situ transcription profiling of single cells reveals spatial organization of cells in the mouse hippocampus. Neuron. 2016;92:342–57.\nView ArticlePubMedGoogle Scholar\n\n49.Legant WR, Shao L, Grimm JB, Brown TA, Milkie DE, Avants BB, et al. High-density three-dimensional localization microscopy across large volumes. Nat Methods. 2016;13:359–65.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n50.Satija R, Farrell JA, Gennert D, Schier AF, Regev A. Spatial reconstruction of single-cell gene expression data. Nat Biotechnol. 2015;33:495–502.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n51.Chen F, Tillberg PW, Boyden ES. Optical imaging. Expansion microscopy. Science. 2015;347:543–8.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n52.Coskun AF, Cai L. Dense transcript profiling in single cells by image correlation decoding. Nat Methods. 2016;13:657–60.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n53.Etzrodt M, Endele M, Schroeder T. Quantitative single-cell approaches to stem cell research. Cell Stem Cell. 2014;15:546–58.\nView ArticlePubMedGoogle Scholar\n\n54.McKenna A, Findlay GM, Gagnon JA, Horwitz MS, Schier AF, Shendure J. Whole-organism lineage tracing by combinatorial and cumulative genome editing. Science. 2016;353:aaf7907.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n55.Junker JP, Spanjaard B, Peterson-Maduro J, Alemany A, Hu B, Florescu M, et al. Massively parallel whole-organism lineage tracing using CRISPR/Cas9 induced genetic scars. bioRxiv. 2016. doi:10.1101/056499.\nGoogle Scholar\n\n56.Perli SD, Cui CH, Lu TK. Continuous genetic recording with self-1 targeting CRISPR-Cas in human cells. Science. 2016;353:aag0511.\nView ArticlePubMedGoogle Scholar\n\n57.Schmidt ST, Zimmerman SM, Wang J, Kim SK, Quake SR. Quantitative analysis of synthetic cell lineage tracing using nuclease barcoding. ACS Synth Biol. 2017. doi:10.1021/acssynbio.6b00309.\nGoogle Scholar\n\n58.Kalhor R, Mali P, Church GM. Rapidly evolving homing CRISPR barcodes. Nat Methods. 2017;14:195–200.\nView ArticlePubMedGoogle Scholar\n\n59.Macaulay IC, Haerty W, Kumar P, Li YI, Hu TX, Teng MJ, et al. G\u0026T-seq: parallel sequencing of single-cell genomes and transcriptomes. Nat Methods. 2015;12:519–22.\nView ArticlePubMedGoogle Scholar\n\n60.Dey SS, Kester L, Spanjaard B, Bienko M, van Oudenaarden A. Integrated genome and transcriptome sequencing of the same cell. Nat Biotechnol. 2015;33:285–9.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n61.Angermueller C, Clark SJ, Lee HJ, Macaulay IC, Teng MJ, Hu TX, et al. Parallel single-cell sequencing links transcriptional and epigenetic heterogeneity. Nat Methods. 2016;13:229–32.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n62.Hu Y, Huang K, An Q, Du G, Hu G, Xue J, et al. Simultaneous profiling of transcriptome and DNA methylome from a single cell. Genome Biol. 2016;17:88.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n63.Hou Y, Guo H, Cao C, Li X, Hu B, Zhu P, et al. Single-cell triple omics sequencing reveals genetic, epigenetic, and transcriptomic heterogeneity in hepatocellular carcinomas. Cell Res. 2016;26:304–19.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n64.Cheow LF, Courtois ET, Tan Y, Viswanathan R, Xing Q, Tan RZ, et al. Single-cell multimodal profiling reveals cellular epigenetic heterogeneity. Nat Methods. 2016;13:833–6.\nView ArticlePubMedGoogle Scholar\n\n65.Genshaft AS, Li S, Gallant CJ, Darmanis S, Prakadan SM, Ziegler CG, et al. Multiplexed, targeted profiling of single-cell proteomes and transcriptomes in a single reaction. Genome Biol. 2016;17:188.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n66.Cabili MN, Dunagin MC, McClanahan PD, Biaesch A, Padovan-Merhar O, Regev A, et al. Localization and abundance analysis of human lncRNAs at single-cell and single-molecule resolution. Genome Biol. 2015;16:20.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n67.Wang S, Su JH, Beliveau BJ, Bintu B, Moffitt JR, Wu CT, et al. Spatial organization of chromatin domains and compartments in single chromosomes. Science. 2016;353:598–602.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n68.Levine JH, Simonds EF, Bendall SC, Davis KL, el Amir AD, Tadmor MD, et al. Data-driven phenotypic dissection of AML reveals progenitor-like cells that correlate with prognosis. Cell. 2015;162:184–97.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n69.Xu C, Su Z. Identification of cell types from single-cell transcriptomes using a novel clustering method. Bioinformatics. 2015;31:1974–80.\nView ArticlePubMedGoogle Scholar\n\n70.Grun D, Lyubimova A, Kester L, Wiebrands K, Basak O, Sasaki N, et al. Single-cell messenger RNA sequencing reveals rare intestinal cell types. Nature. 2015;525:251–5.\nView ArticlePubMedGoogle Scholar\n\n71.Jiang L, Chen H, Pinello L, Yuan GC. GiniClust: detecting rare cell types from single-cell gene expression data with Gini index. Genome Biol. 2016;17:144.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n72.Prabhakaran S, Azizi E, Carr A, Pe’er D. Dirichlet process mixture model for correcting technical variation in single-cell gene expression data. J Mach Learn Res. 2016;48:1070–9.\nGoogle Scholar\n\n73.Haas S, Hansson J, Klimmeck D, Loeffler D, Velten L, Uckelmann H, et al. Inflammation-induced emergency megakaryopoiesis driven by hematopoietic stem cell-like megakaryocyte progenitors. Cell Stem Cell. 2015;17:422–34.\nView ArticlePubMedGoogle Scholar\n\n74.Macaulay IC, Svensson V, Labalette C, Ferreira L, Hamey F, Voet T, et al. Single-cell RNA-sequencing reveals a continuous spectrum of differentiation in hematopoietic cells. Cell Rep. 2016;14:966–77.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n75.Kauffman SA. Metabolic stability and epigenesis in randomly constructed genetic nets. J Theor Biol. 1969;22:437–67.\nView ArticlePubMedGoogle Scholar\n\n76.Grun D, Muraro MJ, Boisset JC, Wiebrands K, Lyubimova A, Dharmadhikari G, et al. De Novo prediction of stem cell identity using single-cell transcriptome data. Cell Stem Cell. 2016;19:266–77.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n77.Teschendorff AE. Single-cell entropy for quantification of differentiation potency from a cell’s transcriptome. bioRxiv. 2016. doi:10.1101/084202.\nGoogle Scholar\n\n78.Wilson NK, Kent DG, Buettner F, Shehata M, Macaulay IC, Calero-Nieto FJ, et al. Combined single-cell functional and gene expression analysis resolves heterogeneity within stem cell populations. Cell Stem Cell. 2015;16:712–24.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n79.Grover A, Sanjuan-Pla A, Thongjuea S, Carrelha J, Giustacchini A, Gambardella A, et al. Single-cell RNA sequencing reveals molecular and functional platelet bias of aged haematopoietic stem cells. Nat Commun. 2016;7:11075.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n80.Shalem O, Sanjana NE, Hartenian E, Shi X, Scott DA, Mikkelsen TS, et al. Genome-scale CRISPR-Cas9 knockout screening in human cells. Science. 2014;343:84–7.\nView ArticlePubMedGoogle Scholar\n\n81.Wang T, Wei JJ, Sabatini DM, Lander ES. Genetic screens in human cells using the CRISPR-Cas9 system. Science. 2014;343:80–4.\nView ArticlePubMedGoogle Scholar\n\n82.Dixit A, Parnas O, Li B, Chen J, Fulco CP, Jerby-Arnon L, et al. Perturb-Seq: dissecting molecular circuits with scalable single-cell RNA profiling of pooled genetic screens. Cell. 2016;167:1853–66. e1817.\nView ArticlePubMedGoogle Scholar\n\n83.Jaitin DA, Weiner A, Yofe I, Lara-Astiaso D, Keren-Shaul H, David E, et al. Dissecting immune circuits by linking CRISPR-pooled screens with single-cell RNA-Seq. Cell. 2016;167:1883–96. e1815.\nView ArticlePubMedGoogle Scholar\n\n84.Adamson B, Norman TM, Jost M, Cho MY, Nunez JK, Chen Y, et al. A multiplexed single-cell CRISPR screening platform enables systematic dissection of the unfolded protein response. Cell. 2016;167:1867–82. e1821.\nView ArticlePubMedGoogle Scholar\n\n85.Datlinger P, Rendeiro AF, Schmidl C, Krausgruber T, Traxler P, Klughammer J, et al. Pooled CRISPR screening with single-cell transcriptome readout. Nat Methods. 2017;14:297–301.\nView ArticlePubMedGoogle Scholar\n\n86.Patel AP, Tirosh I, Trombetta JJ, Shalek AK, Gillespie SM, Wakimoto H, et al. Single-cell RNA-seq highlights intratumoral heterogeneity in primary glioblastoma. Science. 2014;344:1396–401.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n87.Saadatpour A, Lai S, Guo G, Yuan GC. Single-cell analysis in cancer genomics. Trends Genet. 2015;31:576–86.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n88.Tsoucas D, Yuan GC. Recent progress in single-cell cancer genomics. Curr Opin Genet Dev. 2017;42:22–32.\nView ArticlePubMedGoogle Scholar\n\n89.Tirosh I, Venteicher AS, Hebert C, Escalante LE, Patel AP, Yizhak K, et al. Single-cell RNA-seq supports a developmental hierarchy in human oligodendroglioma. Nature. 2016;539:309–13.\nView ArticlePubMedGoogle Scholar\n\n90.van den Bos H, Spierings DC, Taudt AS, Bakker B, Porubsky D, Falconer E, et al. Single-cell whole genome sequencing reveals no evidence for common aneuploidy in normal and Alzheimer’s disease neurons. Genome Biol. 2016;17:116.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n91.Gaudilliere B, Fragiadakis GK, Bruggner RV, Nicolau M, Finck R, Tingle M, et al. Clinical recovery from surgery correlates with single-cell immune signatures. Sci Transl Med. 2014;6:255ra131.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n92.Saadatpour A, Guo G, Orkin SH, Yuan GC. Characterizing heterogeneity in leukemic cells using single-cell gene expression analysis. Genome Biol. 2014;15:525.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n93.Van Noorden R. Interdisciplinary research by the numbers. Nature. 2015;525:306–7.\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Radcliffe Institute","grant_number":""},{"agency":"NIH","grant_number":"R13-CA124365"},{"agency":"NIH","grant_number":"R01-DK081113S1"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}