{"title":"In vivo structures of an intact type VI secretion system revealed by electron cryotomography","uri":"","abstract":"The type VI secretion system (T6SS) is a versatile molecular weapon used by many bacteria against eukaryotic hosts or prokaryotic competitors. It consists of a cytoplasmic bacteriophage tail‐like structure anchored in the bacterial cell envelope via a cytoplasmic baseplate and a periplasmic membrane complex. Rapid contraction of the sheath in the bacteriophage tail‐like structure propels an inner tube/spike complex through the target cell envelope to deliver effectors. While structures of purified contracted sheath and purified membrane complex have been solved, because sheaths contract upon cell lysis and purification, no structure is available for the extended sheath. Structural information about the baseplate is also lacking. Here, we use electron cryotomography to directly visualize intact T6SS structures inside Myxococcus xanthus cells. Using sub‐tomogram averaging, we resolve the structure of the extended sheath and membrane‐associated components including the baseplate. Moreover, we identify novel extracellular bacteriophage tail fiber‐like antennae. These results provide new structural insights into how the extended sheath prevents premature disassembly and how this sophisticated machine may recognize targets.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252194","docid":252194,"rev_number":4,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257289","fileid":1257289,"datasetid":"document","objectid":252194,"filename":"embr.201744072.full.pdf","mime_type":"application/pdf","hash":"6da99909699ff02c2d9312c7f43328ac","hash_type":"MD5","filesize":2721888,"mtime":"2017-05-15 16:55:24","url":"http://authors.library.caltech.edu/77443/1/embr.201744072.full.pdf"}],"eprintid":77443,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"embr.201744072.full.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252196","docid":252196,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257297","fileid":1257297,"datasetid":"document","objectid":252196,"filename":"inline-supplementary-material-1.pdf","mime_type":"application/pdf","hash":"89a63fa30ca73f01a4d87e3db2fbbd03","hash_type":"MD5","filesize":782454,"mtime":"2017-05-15 16:59:22","url":"http://authors.library.caltech.edu/77443/2/inline-supplementary-material-1.pdf"}],"eprintid":77443,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"inline-supplementary-material-1.pdf","content":"supplemental"}],"note":"© 2017 The Authors. \n\nPublished online 09.05.2017. \n\nWe thank Prof. Hong Z. Zhou and Dr. Peng Ge for providing the initial concept of how to place the MyTssBC model in the sub‐tomogram average of extended T6SS sheath and Dr. Catherine Oikonomou for discussions and editorial assistance. This work was supported by NIH grant R01 AI127401 to G.J.J.\n\nFunding: HHS|NIH|National Institute of Allergy and Infectious Diseases (NIAID) R01 AI127401. \n\nAuthor contributions: Y‐WC and LAR collected, processed, and analyzed the electron cryotomography data. Y‐WC built the models. DRO performed the bioinformatics analysis. Y‐WC, DRO and GJJ wrote the paper.\n\nThe authors declare that they have no conflict of interest. \n\nData availability: The sub‐tomogram averages of the M. xanthus T6SS that support the findings of this study have been deposited in the Electron Microscopy Data Bank with accession codes EMD‐8600 (membrane‐associated region), EMD‐8601 (extended sheath), EMD‐8602 (contracted sheath). The coordinates of the extended and contracted sheath models have been deposited in the Protein Data Bank with accession code 5URW and 5URX, respectively.","id":77443,"rev_number":11,"userid":18,"eprint_dir":"disk0/00/07/74/43","datestamp":"2017-05-16 00:01:03","lastmod":"2017-05-16 00:01:03","status_changed":"2017-05-16 00:01:03","type":"article","metadata_visibility":"show","creators":[{"given":"Yi‐Wei","family":"Chang","id":"Chang-Yi-Wei","orcid":""},{"given":"Lee A.","family":"Rettberg","id":"Rettberg-L-A","orcid":""},{"given":"Davi R.","family":"Ortega","id":"Ortega-D-R","orcid":""},{"given":"Grant J.","family":"Jensen","id":"Jensen-G-J","orcid":"0000-0003-1556-4864"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"bacterial molecular weapon; contractile bacteriophage tail; electron cryotomography; sub-tomogram averaging; type VI secretion system","date":"2017-05-09","date_type":"published","publication":"EMBO reports","volume":"18","number":"5","pagerange":"Art. No. e201744072","id_number":"CaltechAUTHORS:20170515-095516428","refereed":true,"issn":"1469-3178","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170515-095516428","related_url":[{"url":"http://dx.doi.org/10.15252/embr.201744072","type":"doi","description":"Article"},{"url":"http://embor.embopress.org/content/early/2017/05/09/embr.201744072","type":"pub","description":"Article"}],"referencetext":["1.↵Cianfanelli FR, Monlezun L, Coulthurst SJ (2016) Aim, load, fire: the type VI secretion system, a bacterial nanoweapon. Trends Microbiol 24: 51–62CrossRefPubMedGoogle Scholar\n2.↵Ho BT, Dong TG, Mekalanos JJ (2014) A view to a kill: the bacterial type VI secretion system. Cell Host Microbe 15: 9–21CrossRefPubMedWeb of ScienceGoogle Scholar\n3.↵Zoued A, Brunet YR, Durand E, Aschtgen MS, Logger L, Douzi B, Journet L, Cambillau C, Cascales E (2014) Architecture and assembly of the Type VI secretion system. Biochim Biophys Acta 1843: 1664–1673CrossRefGoogle Scholar\n4.↵Basler M, Pilhofer M, Henderson GP, Jensen GJ, Mekalanos JJ (2012) Type VI secretion requires a dynamic contractile phage tail‐like structure. Nature 483: 182–186CrossRefPubMedWeb of ScienceGoogle Scholar\n5.↵Basler M, Ho BT, Mekalanos JJ (2013) Tit‐for‐tat: type VI secretion system counterattack during bacterial cell‐cell interactions. Cell 152: 884–894CrossRefPubMedWeb of ScienceGoogle Scholar\n6.↵Basler M, Mekalanos JJ (2012) Type 6 secretion dynamics within and between bacterial cells. Science 337: 815Abstract/FREE Full TextGoogle Scholar\n7.↵Kube S, Wendler P (2015) Structural comparison of contractile nanomachines. AIMS Biophysics 2: 88–115Google Scholar\n8.↵Vettiger A, Basler M (2016) Type VI secretion system substrates are transferred and reused among sister cells. Cell 167: 99–110.e112Google Scholar\n9.↵Pietrosiuk A, Lenherr ED, Falk S, Bonemann G, Kopp J, Zentgraf H, Sinning I, Mogk A (2011) Molecular basis for the unique role of the AAA+ chaperone ClpV in type VI protein secretion. J Biol Chem 286: 30010–30021Abstract/FREE Full TextGoogle Scholar\n10.↵Kapitein N, Bonemann G, Pietrosiuk A, Seyffer F, Hausser I, Locker JK, Mogk A (2013) ClpV recycles VipA/VipB tubules and prevents non‐productive tubule formation to ensure efficient type VI protein secretion. Mol Microbiol 87: 1013–1028CrossRefPubMedGoogle Scholar\n11.↵Ge P, Scholl D, Leiman PG, Yu X, Miller JF, Zhou ZH (2015) Atomic structures of a bactericidal contractile nanotube in its pre‐ and postcontraction states. Nat Struct Mol Biol 22: 377–382CrossRefPubMedGoogle Scholar\n12.↵Kudryashev M, Wang RY, Brackmann M, Scherer S, Maier T, Baker D, DiMaio F, Stahlberg H, Egelman EH, Basler M (2015) Structure of the type VI secretion system contractile sheath. Cell 160: 952–962CrossRefPubMedGoogle Scholar\n13.↵Clemens DL, Ge P, Lee BY, Horwitz MA, Zhou ZH (2015) Atomic structure of T6SS reveals interlaced array essential to function. Cell 160: 940–951CrossRefPubMedGoogle Scholar\n14.↵Oikonomou CM, Chang Y‐W, Jensen GJ (2016) A new view into prokaryotic cell biology from electron cryotomography. Nat Rev Microbiol 14: 205–220CrossRefPubMedGoogle Scholar\n15.↵Chang YW, Chen S, Tocheva EI, Treuner‐Lange A, Lobach S, Sogaard‐Andersen L, Jensen GJ (2014) Correlated cryogenic photoactivated localization microscopy and cryo‐electron tomography. Nat Methods 11: 737–739CrossRefPubMedGoogle Scholar\n16.↵Ding HJ, Oikonomou CM, Jensen GJ (2015) The Caltech Tomography Database and Automatic Processing Pipeline. J Struct Biol 192: 279–286Google Scholar\n17.↵Durand E, Nguyen VS, Zoued A, Logger L, Pehau‐Arnaudet G, Aschtgen MS, Spinelli S, Desmyter A, Bardiaux B, Dujeancourt A et al (2015) Biogenesis and structure of a type VI secretion membrane core complex. Nature 523: 555–560CrossRefPubMedGoogle Scholar\n18.↵Bartual SG, Otero JM, Garcia‐Doval C, Llamas‐Saiz AL, Kahn R, Fox GC, van Raaij MJ (2010) Structure of the bacteriophage T4 long tail fiber receptor‐binding tip. Proc Natl Acad Sci U S A 107: 20287–20292Abstract/FREE Full TextGoogle Scholar\n19.↵Thomassen E, Gielen G, Schutz M, Schoehn G, Abrahams JP, Miller S, van Raaij MJ (2003) The structure of the receptor‐binding domain of the bacteriophage T4 short tail fibre reveals a knitted trimeric metal‐binding fold. J Mol Biol 331: 361–373CrossRefPubMedWeb of ScienceGoogle Scholar\n20.↵Yap ML, Rossmann MG (2014) Structure and function of bacteriophage T4. Future Microbiol 9: 1319–1327CrossRefPubMedGoogle Scholar\n21.↵Jobichen C, Chakraborty S, Li M, Zheng J, Joseph L, Mok YK, Leung KY, Sivaraman J (2010) Structural basis for the secretion of EvpC: a key type VI secretion system protein from Edwardsiella tarda. PLoS ONE 5: e12910CrossRefPubMedGoogle Scholar\n22.↵Kube S, Kapitein N, Zimniak T, Herzog F, Mogk A, Wendler P (2014) Structure of the VipA/B type VI secretion complex suggests a contraction‐state‐specific recycling mechanism. Cell Rep 8: 20–30CrossRefPubMedGoogle Scholar\n23.↵Zoued A, Durand E, Brunet YR, Spinelli S, Douzi B, Guzzo M, Flaugnatti N, Legrand P, Journet L, Fronzes R et al (2016) Priming and polymerization of a bacterial contractile tail structure. Nature 531: 59–63CrossRefPubMedGoogle Scholar\n24.↵Taylor NM, Prokhorov NS, Guerrero‐Ferreira RC, Shneider MM, Browning C, Goldie KN, Stahlberg H, Leiman PG (2016) Structure of the T4 baseplate and its function in triggering sheath contraction. Nature 533: 346–352CrossRefGoogle Scholar\n25.↵Zoued A, Durand E, Bebeacua C, Brunet YR, Douzi B, Cambillau C, Cascales E, Journet L (2013) TssK is a trimeric cytoplasmic protein interacting with components of both phage‐like and membrane anchoring complexes of the type VI secretion system. J Biol Chem 288: 27031–27041Abstract/FREE Full TextGoogle Scholar\n26.↵Kanamaru S, Leiman PG, Kostyuchenko VA, Chipman PR, Mesyanzhinov VV, Arisaka F, Rossmann MG (2002) Structure of the cell‐puncturing device of bacteriophage T4. Nature 415: 553–557CrossRefPubMedWeb of ScienceGoogle Scholar\n27.↵Shneider MM, Buth SA, Ho BT, Basler M, Mekalanos JJ, Leiman PG (2013) PAAR‐repeat proteins sharpen and diversify the type VI secretion system spike. Nature 500: 350–353CrossRefPubMedWeb of ScienceGoogle Scholar\n28.↵Lin JS, Ma LS, Lai EM (2013) Systematic dissection of the agrobacterium type VI secretion system reveals machinery and secreted components for subcomplex formation. PLoS ONE 8: e67647CrossRefPubMedGoogle Scholar\n29.↵Bondage DD, Lin JS, Ma LS, Kuo CH, Lai EM (2016) VgrG C terminus confers the type VI effector transport specificity and is required for binding with PAAR and adaptor‐effector complex. Proc Natl Acad Sci U S A 113: E3931–E3940Abstract/FREE Full TextGoogle Scholar\n30.↵Alteri CJ, Himpsl SD, Pickens SR, Lindner JR, Zora JS, Miller JE, Arno PD, Straight SW, Mobley HL (2013) Multicellular bacteria deploy the type VI secretion system to preemptively strike neighboring cells. PLoS Pathog 9: e1003608CrossRefPubMedGoogle Scholar\n31.↵Koskiniemi S, Lamoureux JG, Nikolakakis KC, t'Kint de Roodenbeke C, Kaplan MD, Low DA, Hayes CS (2013) Rhs proteins from diverse bacteria mediate intercellular competition. Proc Natl Acad Sci U S A 110: 7032–7037Abstract/FREE Full TextGoogle Scholar\n32.↵Whitney JC, Quentin D, Sawai S, LeRoux M, Harding BN, Ledvina HE, Tran BQ, Robinson H, Goo YA, Goodlett DR et al (2015) An interbacterial NAD(P)(+) glycohydrolase toxin requires elongation factor Tu for delivery to target cells. Cell 163: 607–619CrossRefPubMedGoogle Scholar\n33.↵Chang YW, Rettberg LA, Treuner‐Lange A, Iwasa J, Sogaard‐Andersen L, Jensen GJ (2016) Architecture of the type IVa pilus machine. Science 351: aad2001Abstract/FREE Full TextGoogle Scholar\n34.↵Chang YW, Kjaer A, Ortega DR, Kovacikova G, Sutherland JA, Rettberg LA, Taylor RK, Jensen GJ (2017) Architecture of the Vibrio cholerae toxin‐coregulated pilus machine revealed by electron cryotomography. Nat Microbiol 2: 16269Google Scholar\n35.↵Tivol WF, Briegel A, Jensen GJ (2008) An improved cryogen for plunge freezing. Microsc Microanal 14: 375–379CrossRefPubMedWeb of ScienceGoogle Scholar\n36.↵Zheng SQ, Keszthelyi B, Branlund E, Lyle JM, Braunfeld MB, Sedat JW, Agard DA (2007) UCSF tomography: an integrated software suite for real‐time electron microscopic tomographic data collection, alignment, and reconstruction. J Struct Biol 157: 138–147CrossRefPubMedWeb of ScienceGoogle Scholar\n37.↵Kremer JR, Mastronarde DN, McIntosh JR (1996) Computer visualization of three‐dimensional image data using IMOD. J Struct Biol 116: 71–76CrossRefPubMedWeb of ScienceGoogle Scholar\n38.↵Agulleiro JI, Fernandez JJ (2011) Fast tomographic reconstruction on multicore computers. Bioinformatics 27: 582–583Abstract/FREE Full TextGoogle Scholar\n39.↵Nicastro D, Schwartz C, Pierson J, Gaudette R, Porter ME, McIntosh JR (2006) The molecular architecture of axonemes revealed by cryoelectron tomography. Science 313: 944–948Abstract/FREE Full TextGoogle Scholar\n40.↵Marchler‐Bauer A, Bo Y, Han L, He J, Lanczycki CJ, Lu S, Chitsaz F, Derbyshire MK, Geer RC, Gonzales NR et al (2017) CDD/SPARCLE: functional classification of proteins via subfamily domain architectures. Nucleic Acids Res 45: D200–D203Abstract/FREE Full TextGoogle Scholar\n41.↵Camacho C, Coulouris G, Avagyan V, Ma N, Papadopoulos J, Bealer K, Madden TL (2009) BLAST+: architecture and applications. BMC Bioinformatics 10: 421CrossRefPubMedGoogle Scholar\n42.↵Ulrich LE, Zhulin IB (2010) The MiST2 database: a comprehensive genomics resource on microbial signal transduction. Nucleic Acids Res 38: D401–D407Abstract/FREE Full TextGoogle Scholar\n43.↵Ulrich LE, Zhulin IB (2014) SeqDepot: streamlined database of biological sequences and precomputed features. Bioinformatics 30: 295–297Abstract/FREE Full TextGoogle Scholar\n44.↵Adebali O, Ortega DR, Zhulin IB (2015) CDvist: a webserver for identification and visualization of conserved domains in protein sequences. Bioinformatics 31: 1475–1477\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":"R01 AI127401"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}