{"title":"Physical principles for DNA tile self-assembly","uri":"","abstract":"DNA tiles provide a promising technique for assembling structures with nanoscale resolution through self-assembly by basic interactions rather than top-down assembly of individual structures. Tile systems can be programmed to grow based on logical rules, allowing for a small number of tile types to assemble large, complex assemblies that can retain nanoscale resolution. Such algorithmic systems can even assemble different structures using the same tiles, based on inputs that seed the growth. While programming and theoretical analysis of tile self-assembly often makes use of abstract logical models of growth, experimentally implemented systems are governed by nanoscale physical processes that can lead to very different behavior, more accurately modeled by taking into account the thermodynamics and kinetics of tile attachment and detachment in solution. This review discusses the relationships between more abstract and more physically realistic tile assembly models. A central concern is how consideration of model differences enables the design of tile systems that robustly exhibit the desired abstract behavior in realistic physical models and in experimental implementations. Conversely, we identify situations where self-assembly in abstract models can not be well-approximated by physically realistic models, putting constraints on physical relevance of the abstract models. To facilitate the discussion, we introduce a unified model of tile self-assembly that clarifies the relationships between several well-studied models in the literature. Throughout, we highlight open questions regarding the physical principles for DNA tile self-assembly.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252200","docid":252200,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257313","fileid":1257313,"datasetid":"document","objectid":252200,"filename":"c6cs00745g.pdf","mime_type":"application/pdf","hash":"e3b391e90dbad8548db0314b57106e39","hash_type":"MD5","filesize":5175728,"mtime":"2017-05-15 17:18:50","url":"http://authors.library.caltech.edu/77444/1/c6cs00745g.pdf"}],"eprintid":77444,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"c6cs00745g.pdf","content":"inpress"}],"note":"© 2017 The Royal Society of Chemistry. \n\nReceived 15th October 2016; First published on 10th May 2017. \n\nThis work was partially supported by National Science Foundation awards 0832824, 1162589, and 1317694.","id":77444,"rev_number":11,"userid":18,"eprint_dir":"disk0/00/07/74/44","datestamp":"2017-05-15 23:40:22","lastmod":"2017-05-15 23:40:22","status_changed":"2017-05-15 23:40:22","type":"article","metadata_visibility":"show","creators":[{"given":"Constantine G.","family":"Evans","id":"Evans-C-G","orcid":"0000-0002-7053-1670"},{"given":"Erik","family":"Winfree","id":"Winfree-E","orcid":"0000-0002-5899-7523"}],"ispublished":"inpress","subjects":null,"full_text_status":"none","keywords":"","date":"2017-05-10","date_type":"inpress","publication":"Chemical Society Reviews","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170515-101843093","refereed":true,"issn":"0306-0012","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170515-101843093","related_url":[{"url":"http://dx.doi.org/10.1039/c6cs00745g","type":"doi","description":"Article"},{"url":"http://pubs.rsc.org/en/Content/ArticleLanding/2017/CS/C6CS00745G","type":"pub","description":"Article"}],"referencetext":["1.K. G. Libbrecht, The physics of snow crystals, Rep. Prog. Phys., 2005, 68, 855 CrossRef .\n2.D. Vavylonis, Q. Yang and B. O'Shaughnessy, Actin polymerization kinetics, cap structure, and fluctuations, Proc. Natl. Acad. Sci. U. S. A., 2005, 102, 8543–8548 CrossRef CAS PubMed .\n3.J. S. Lindsey, Self-assembly in synthetic routes to molecular devices. Biological principles and chemical perspectives: a review, New J. Chem., 1991, 15, 153–180 CAS .\n4.B. Grünbaum and G. C. Shephard, Tilings and Patterns, W. H. Freeman \u0026 Co., New York, NY, USA, 1986 Search PubMed .\n5.C. Janot, Quasicrystals: a primer, Oxford Univ. Press, Oxford, UK, 1994 Search PubMed .\n6.M. Senechal, Quasicrystals and geometry, Cambridge Univ. Press, Cambridge, UK, 1996 Search PubMed .\n7.H. Wang, An unsolvable problem on dominoes, Harvard Computation Laboratory, Technical Report BL30 (II-15), 1962.\n8.R. Berger, The undecidability of the domino problem, Memoirs of the AMS, 1966, vol. 66, pp. 1–72 Search PubMed .\n9.W. Hanf, Nonrecursive tilings of the plane I, J. Symbolic Logic, 1974, 39, 283–285 CrossRef .\n10.D. Myers, Nonrecursive tilings of the plane II, J. Symbolic Logic, 1974, 39, 286–294 CrossRef .\n11.D. Doty, Theory of algorithmic self-assembly, Commun. ACM, 2012, 55, 78–88 CrossRef .\n12.M. J. Patitz, An introduction to tile-based self-assembly and a survey of recent results, Nat. Comput., 2004, 13, 195–224 CrossRef .\n13.C. G. Evans, R. F. Hariadi and E. Winfree, Direct atomic force microscopy observation of DNA tile crystal growth at the single-molecule level, J. Am. Chem. Soc., 2012, 134, 10485–10492 CrossRef CAS PubMed .\n14.B. Wei, M. Dai and P. Yin, Complex shapes self-assembled from single stranded DNA tiles, Nature, 2012, 485, 623–626 CrossRef CAS PubMed .\n15.C. G. Evans, PhD thesis, Crystals that count! Physical principles and experimental investigations of DNA tile self-assembly, California Institute of Technology, 2014 Search PubMed .\n16.A. L. Mackay, Generalised crystallography, Izvj. Jugosl. Centr. Krist., 1975, 10, 15–36 Search PubMed .\n17.J.-M. Lehn, Toward self-organization and complex matter, Science, 2002, 295, 2400–2403 CrossRef CAS PubMed .\n18.E. Nogales and H.-W. Wang, Structural mechanisms underlying nucleotide-dependent self-assembly of tubulin and its relatives, Curr. Opin. Struct. Biol., 2006, 16, 221–229 CrossRef CAS PubMed .\n19.P. G. Leiman, S. Kanamaru, V. V. Mesyanzhinov, F. Arisaka and M. G. Rossmann, Structure and morphogenesis of bacteriophage T4, CMLS, Cell. Mol. Life Sci., 2003, 60, 2356–2370 CrossRef CAS PubMed .\n20.C. Lin, Y. Liu, S. Rinker and H. Yan, DNA tile based self-assembly: Building complex nanoarchitectures, ChemPhysChem, 2006, 7, 1641–1647 CrossRef CAS PubMed .\n21.T. J. Fu and N. C. Seeman, DNA double-crossover molecules, Biochemistry, 1993, 32, 3211–3220 CrossRef CAS PubMed .\n22.E. Winfree, F. Liu, L. A. Wenzler and N. C. Seeman, Design and self assembly of two-dimensional DNA crystals, Nature, 1998, 394, 539–544 CrossRef CAS PubMed .\n23.P. Yin, R. F. Hariadi, S. Sahu, H. M. T. Choi, S. H. Park, T. H. LaBean and J. H. Reif, Programming DNA tube circumferences, Science, 2008, 321, 824–826 CrossRef CAS PubMed .\n24.C. G. Evans and E. Winfree, DNA sticky end design and assignment for robust algorithmic self-assembly, in DNA Computing and Molecular Programming (DNA), ed. D. Soloveichik and B. Yurke, Lecture Notes in Computer Science (LNCS), Springer, Berlin, 2013, vol. 8141, pp. 61–75 Search PubMed .\n25.Y. Ke, L. L. Ong, W. M. Shih and P. Yin, Three-dimensional structures self-assembled from DNA bricks, Science, 2012, 338, 1177–1183 CrossRef CAS PubMed .\n26.E. Winfree, Simulations of computing by self-assembly, tech. rep. CaltechCSTR:1998.22, Pasadena, CA, 1998.\n27.R. Schulman and E. Winfree, Programmable control of nucleation for algorithmic self-assembly, SIAM J. Comput., 2010, 39, 1581–1616 CrossRef .\n28.P. W. K. Rothemund, N. Papadakis and E. Winfree, Algorithmic self-assembly of DNA sierpinski triangles, PLoS Biol., 2004, 2, e424 Search PubMed .\n29.R. D. Barish, P. W. K. Rothemund and E. Winfree, Two computational primitives for algorithmic self-assembly: copying and counting, Nano Lett., 2005, 5, 2586–2592 CrossRef CAS PubMed .\n30.K. Fujibayashi, R. Hariadi, S. H. Park, E. Winfree and S. Murata, Toward reliable algorithmic self-assembly of DNA tiles: a fixed-width cellular automaton pattern, Nano Lett., 2008, 8, 1791–1797 CrossRef CAS PubMed .\n31.R. D. Barish, R. Schulman, P. W. K. Rothemund and E. Winfree, An information-bearing seed for nucleating algorithmic self-assembly, Proc. Natl. Acad. Sci. U. S. A., 2009, 106, 6054–6059 CrossRef CAS PubMed .\n32.L. Adleman, Q. Cheng, A. Goel, M.-D. Huang, D. Kempe, P. M. de Espanés and P. W. K. Rothemund, Combinatorial optimization problems in self-assembly, Symposium on the Theory of Computing (STOC), ACM, Montreal, Quebec, Canada, 2002, pp. 23–32 Search PubMed .\n33.P. W. K. Rothemund and E. Winfree, The program-size complexity of self-assembled squares, Symposium on the Theory of Computing (STOC), ACM, Portland, Oregon, USA, 2000, pp. 459–468 Search PubMed .\n34.L. Adleman, Q. Cheng, A. Goel and M.-D. Huang, Running time and program size for self-assembled squares, Symposium on the Theory of Computing (STOC), ACM, Hersonissos, Greece, 2001, pp. 740–748 Search PubMed .\n35.D. Soloveichik and E. Winfree, Complexity of self-assembled shapes, SIAM J. Comput., 2007, 36, 1544–1569 CrossRef .\n36.D. Doty, M. J. Patitz and S. M. Summers, Limitations of self-assembly at temperature 1, Theor. Comput. Sci., 2011, 412, 145–158 CrossRef .\n37.A. M. Mohammed and R. Schulman, Directing self-assembly of DNA nanotubes using programmable seeds, Nano Lett., 2013, 13, 4006–4013 CrossRef CAS PubMed .\n38.R. Schulman and E. Winfree, Synthesis of crystals with a programmable kinetic barrier to nucleation, Proc. Natl. Acad. Sci. U. S. A., 2007, 104, 15236–15241 CrossRef CAS PubMed .\n39.H.-L. Chen, R. Schulman, A. Goel and E. Winfree, Reducing facet nucleation during algorithmic self-assembly, Nano Lett., 2007, 7, 2913–2919 CrossRef CAS PubMed .\n40.S. Woo and P. W. Rothemund, Self-assembly of two-dimensional DNA origami lattices using cation-controlled surface diffusion, Nat. Commun., 2014, 5, 4889 CrossRef CAS PubMed .\n41.S. Hamada and S. Murata, Substrate-assisted assembly of interconnected single-duplex DNA nanostructures, Angew. Chem., Int. Ed., 2009, 48, 6820–6823 CrossRef CAS PubMed .\n42.S. Hamada and S. Murata, Theoretical model of substrate-assisted self-assembly of DNA nanostructures, RSC Adv., 2012, 2, 7406–7412 RSC .\n43.H.-L. Chen, A. Goel and C. Luhrs, Dimension augmentation and combinatorial criteria for efficient error-resistant DNA self-assembly, Symposium on Discrete Algorithms (SODA), SIAM, San Francisco, California, 2008, pp. 409–418 Search PubMed .\n44.J. C. Mitchell, J. R. Harris, J. Malo, J. Bath and A. J. Turberfield, Self-assembly of chiral DNA nanotubes, J. Am. Chem. Soc., 2004, 126, 16342–16343 CrossRef CAS PubMed .\n45.K. Fujibayashi and S. Murata, Precise simulation model for DNA tile self-assembly, IEEE Trans. Nanotechnol., 2009, 8, 361–368 CrossRef .\n46.R. Schulman, C. Wright and E. Winfree, Increasing redundancy exponentially reduces error rates during algorithmic self-assembly, ACS Nano, 2015, 9, 5760–5771 CrossRef CAS PubMed .\n47.M. J. Patitz, Simulation of self-assembly in the abstract tile assembly model with ISU TAS, 2011, arXiv:1101.5151 [cs.MS].\n48.The Xgrow Simulator, http://dna.caltech.edu/Xgrow/.\n49.H.-L. Chen and A. Goel, Error free self-assembly using error prone tiles, DNA Computing (DNA), Lecture Notes in Computer Science (LNCS), Springer, 2005, vol. 3384, pp. 702–707 Search PubMed .\n50.D. Soloveichik and E. Winfree, Complexity of compact proofreading for self-assembled patterns, DNA Computing (DNA), Lecture Notes in Computer Science (LNCS), 2006, vol. 3892, pp. 125–135 Search PubMed .\n51.J. SantaLucia and D. Hicks, The thermodynamics of DNA structural motifs, Annu. Rev. Biophys. Biomol. Struct., 2004, 33, 415–440 CrossRef CAS PubMed .\n52.P. Gàcs, Reliable cellular automata with self-organization, J. Stat. Phys., 2001, 103, 45–267 CrossRef .\n53.D. Lubrich, S. J. Green and A. J. Turberfield, Kinetically controlled self-assembly of DNA oligomers, J. Am. Chem. Soc., 2009, 131, 2422–2423 CrossRef CAS PubMed .\n54.R. M. Dirks and N. A. Pierce, Triggered amplification by hybridization chain reaction, Proc. Natl. Acad. Sci. U. S. A., 2004, 101, 15275–15278 CrossRef CAS PubMed .\n55.J. E. Padilla, M. J. Patitz, R. Pena, R. T. Schweller, N. C. Seeman, R. Sheline, S. M. Summers and X. Zhong, Asynchronous signal passing for tile self-assembly: fuel efficient computation and efficient assembly of shapes, Unconventional Computation and Natural Computation (UCNC), Lecture Notes in Computer Science (LNCS), Springer, 2013, vol. 7956, pp. 174–185 Search PubMed .\n56.N. Jonoska and D. Karpenko, Active tile self-assembly, part 1: universality at temperature 1, Int. J. Found. Comput. Sci., 2014, 25, 141–163 CrossRef .\n57.K. Fujibayashi, D. Zhang, E. Winfree and S. Murata, Error suppression mechanisms for DNA tile self-assembly and their simulation, English, Nat. Comput., 2009, 8, 589–612 CrossRef .\n58.U. Majumder, T. H. LaBean and J. H. Reif, Activatable tiles: compact, robust programmable assembly and other applications, DNA Computing (DNA), Lecture Notes in Computer Science (LNCS), Springer, 2008, vol. 4848, pp. 15–25 Search PubMed .\n59.J. E. Padilla, R. Sha, M. Kristiansen, J. Chen, N. Jonoska and N. C. Seeman, A signal-passing DNA-strand-exchange mechanism for active self-assembly of DNA nanostructures, Angew. Chem., Int. Ed., 2015, 54, 5939–5942 CrossRef CAS PubMed .\n60.E. Winfree and R. Bekbolatov, Proofreading tile sets: error correction for algorithmic self-assembly, DNA Computing (DNA), Lecture Notes in Computer Science (LNCS), Springer, 2004, vol. 2943, pp. 126–144 Search PubMed .\n61.D. Soloveichik, M. Cook and E. Winfree, Combining self-healing and proofreading in self-assembly, Nat. Comput., 2008, 7, 203–218 CrossRef .\n62.R. Schulman, B. Yurke and E. Winfree, Robust self-replication of combinatorial information via crystal growth and scission, Proc. Natl. Acad. Sci. U. S. A., 2012, 109, 6405–6410 CrossRef CAS PubMed .\n63.J. H. Reif, S. Sahu and P. Yin, Compact error-resilient computational DNA tiling assemblies, DNA Computing (DNA), Lecture Notes in Computer Science (LNCS), Springer, 2005, vol. 3384, pp. 293–307 Search PubMed .\n64.D. W. Oxtoby, Homogeneous nucleation: theory and experiment, J. Phys.: Condens. Matter, 1992, 4, 7627–7650 CrossRef .\n65.D. Kashchiev and G. M. van Rosmalen, Review: Nucleation in solutions revisited, Cryst. Res. Technol., 2003, 38, 555–574 CrossRef CAS .\n66.V. I. Kalikmanov, Multi-component nucleation, Nucleation Theory, Springer, Netherlands, Dordrecht, 2013, pp. 239–251 Search PubMed .\n67.Nucleation, ed. A. Zettlemoyer, Marcel Dekker, New York, 1969 Search PubMed .\n68.R. Schulman, S. Lee, N. Papadakis and E. Winfree, One dimensional boundaries for DNA tile self-assembly, in DNA Computing (DNA), Madison, WI, USA, June 1–3, 2003, ed. J. Chen and J. Reif, Lecture Notes in Computer Science (LNCS), Springer Berlin Heidelberg, 2004, vol. 2943, pp. 108–125.\n69.H.-L. Chen and M.-Y. Kao, Optimizing tile concentrations to minimize errors and time for DNA tile self-assembly systems, DNA Computing and Molecular Programming (DNA), Lecture Notes in Computer Science (LNCS), Springer, 2011, vol. 6518, pp. 13–24 Search PubMed .\n70.R. P. Sear, Quantitative studies of crystal nucleation at constant supersaturation: experimental data and models, CrystEngComm, 2014, 16, 6506–6522 RSC .\n71.T. Witten and L. Sander, Diffusion-limited aggregation, a kinetic critical phenomenon, Phys. Rev. Lett., 1981, 47, 1400–1403 CrossRef CAS .\n72.J. P. Hirth and J. Lothe, Theory of Dislocations, Wiley, New York, 1982 Search PubMed .\n73.R. F. Hariadi, E. Winfree and B. Yurke, Determining hydrodynamic forces in bursting bubbles using DNA nanotube mechanics, Proc. Natl. Acad. Sci. U. S. A., 2015, 112, E6086–E6095 CrossRef CAS PubMed  , [eqn (13) of main text].\n74.J. Zenk, C. Tuntivate and R. Schulman, Kinetics and thermodynamics of Watson-Crick base pairing driven DNA origami dimerization, J. Am. Chem. Soc., 2016, 138, 3346–3354 CrossRef CAS PubMed .\n75.H.-L. Chen and D. Doty, Parallelism and time in hierarchical self-assembly, Symposium on Discrete Algorithms (SODA), SIAM, Kyoto, Japan, 2012, pp. 1163–1182.\n76.M. Patitz, R. Schweller and S. Summers, Exact shapes and turing universality at temperature 1 with a single negative glue, in DNA Computing and Molecular Programming (DNA), ed. L. Cardelli and W. Shih, Lecture Notes in Computer Science (LNCS), Springer, Berlin, Heidelberg, 2011, vol. 6937, pp. 175–189 Search PubMed .\n77.J. Reif, S. Sahu and P. Yin, Complexity of graph self-assembly in accretive systems and self-destructible systems, in DNA Computing (DNA), ed. A. Carbone and N. A. Pierce, Lecture Notes in Computer Science (LNCS), Springer, Berlin, Heidelberg, 2006, vol. 3892, pp. 257–274 Search PubMed .\n78.D. T. Gillespie, Exact stochastic simulation of coupled chemical reactions, J. Phys. Chem., 1977, 81, 2340–2361 CrossRef CAS .\n79.F. Horn and R. Jackson, General mass action kinetics, Arch. Ration. Mech. Anal., 1972, 47, 81–116 CrossRef .\n80.J. A. A. W. Elemans, A. E. Rowan and R. J. M. Nolte, Mastering molecular matter. Supramolecular architectures by hierarchical self-assembly, J. Mater. Chem., 2003, 13, 2661–2670 RSC .\n81.O. Ikkala and G. ten Brinke, Hierarchical self-assembly in polymeric complexes: towards functional materials, Chem. Commun., 2004, 2131–2137 RSC .\n82.F. F. V. Chevance and K. T. Hughes, Coordinating assembly of a bacterial macromolecular machine, Nat. Rev. Microbiol., 2008, 6, 455–465 CrossRef CAS PubMed .\n83.P. Aldridge and K. T. Hughes, Regulation of flagellar assembly, Curr. Opin. Microbiol., 2002, 5, 160–165 \n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"CCF-0832824"},{"agency":"NSF","grant_number":"CCF-1162589"},{"agency":"NSF","grant_number":"CCF-1317694"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}