{"title":"The countable admissible ordinal equivalence relation","uri":"","abstract":"Let F_(ω1) be the countable admissible ordinal equivalence relation defined on ^ω2 by x F_(ω1) y if and only if  ω_1^x=ω_1^y. Some invariant descriptive set theoretic properties of F_(ω1) will be explored using infinitary logic in countable admissible fragments as the main tool. Marker showed F_(ω1) is not the orbit equivalence relation of a continuous action of a Polish group on ^ω2. Becker stengthened this to show F_(ω1) is not even the orbit equivalence relation of a Δ_1^1 action of a Polish group. However, Montalbán has shown that F_(ω1) is Δ_1^1 reducible to an orbit equivalence relation of a Polish group action, in fact, F_(ω1) is classifiable by countable structures. It will be shown here that F_(ω1) must be classified by structures of high Scott rank. Let E_(ω1) denote the equivalence of order types of reals coding well-orderings. If E and F are two equivalence relations on Polish spaces X and Y, respectively, E ≤ aΔ_1^1 F denotes the existence of a Δ_1^1 function f:X→Y which is a reduction of E to F, except possibly on countably many classes of E. Using a result of Zapletal, the existence of a measurable cardinal implies E_(ω1) ≤ aΔ_1^1 F_(ω1). However, it will be shown that in Gödel's constructible universe L (and set generic extensions of L), E_(ω1) ≤ aΔ_1^1 F_(ω1) is false. Lastly, the techniques of the previous result will be used to show that in L (and set generic extensions of L), the isomorphism relation induced by a counterexample to Vaught's conjecture cannot be Δ_1^1 reducible to F_(ω1). This shows the consistency of a negative answer to a question of Sy-David Friedman.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252188","docid":252188,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257263","fileid":1257263,"datasetid":"document","objectid":252188,"filename":"1601.07924.pdf","mime_type":"application/pdf","hash":"9143ba42b63293914ce86707239bb02c","hash_type":"MD5","filesize":338773,"mtime":"2017-05-15 15:46:14","url":"http://authors.library.caltech.edu/77440/1/1601.07924.pdf"}],"eprintid":77440,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1601.07924.pdf","content":"submitted"}],"note":"© 2016 Elsevier B.V. \n\nReceived 6 February 2016, Revised 14 December 2016, Accepted 16 December 2016, Available online 21 December 2016. \n\nResearch partially supported by NSF grants DMS-1464475 and EMSW21-RTG DMS-1044448.","id":77440,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/74/40","datestamp":"2017-05-15 23:36:35","lastmod":"2017-05-15 23:36:35","status_changed":"2017-05-15 23:36:35","type":"article","metadata_visibility":"show","creators":[{"given":"William","family":"Chan","id":"Chan-William","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Admissible sets; Scott rank; Vaught's conjecture; Borel reducibility; Constructibility\n","date":"2017-06","date_type":"published","publication":"Annals of Pure and Applied Logic","volume":"168","number":"6","pagerange":"1224-1246","id_number":"CaltechAUTHORS:20170515-084610472","refereed":true,"issn":"0168-0072","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170515-084610472","related_url":[{"url":"https://doi.org/10.1016/j.apal.2016.12.002","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0168007216301798","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1601.07924","type":"arxiv","description":"Discussion Paper"}],"referencetext":["1. J. Barwise and S. Feferman (eds.), Model-theoretic logics, Perspectives in Mathematical Logic, Springer-Verlag, New York,\n1985. MR 819531 (87g:03033)\n2. Jon Barwise, Admissible sets and structures, Springer-Verlag, Berlin-New York, 1975, An approach to definability theory,\nPerspectives in Mathematical Logic. MR 0424560 (54 #12519)\n3. Howard Becker, The topological Vaught’s conjecture and minimal counterexamples, J. Symbolic Logic 59 (1994), no. 3,\n757–784. MR 1295968 (95k:03077)\n4. Wesley Calvert, Julia F. Knight, and Jessica Millar, Computable trees of Scott rank !CK\n1 , and computable approximation,\nJ. Symbolic Logic 71 (2006), no. 1, 283–298. MR 2210068 (2006j:03057)\n5. Su Gao, Invariant descriptive set theory, Pure and Applied Mathematics (Boca Raton), vol. 293, CRC Press, Boca Raton,\nFL, 2009. MR 2455198 (2011b:03001)\n6. Leo Harrington, A powerless proof of a theorem of silver, Unpublished.\n7. Joseph Harrison, Recursive pseudo-well-orderings, Trans. Amer. Math. Soc. 131 (1968), 526–543. MR 0244049 (39 #5366)\n8. R. Bj¨orn Jensen, Admissible sets, http://www.mathematik.hu-berlin.de/~%20raesch/org/jensen.html.\n9. S. C. Kleene, On the forms of the predicates in the theory of constructive ordinals. II, Amer. J. Math. 77 (1955), 405–428.\nMR 0070595 (17,5a)\n10. P. B. Larson, Scott processes, ArXiv e-prints (2014).\n11. M. Makkai, An example concerning Scott heights, J. Symbolic Logic 46 (1981), no. 2, 301–318. MR 613284 (82m:03049)\n12. Richard Mansfield and Galen Weitkamp, Recursive aspects of descriptive set theory, Oxford Logic Guides, vol. 11, The\nClarendon Press, Oxford University Press, New York, 1985, With a chapter by Stephen Simpson. MR 786122 (86g:03003)\n13. DavidMarker, Scott ranks of counterexamples to vaught’s conjecture, http://homepages.math.uic.edu/~marker/harrington-vaught.pdf.\n14. David Marker, An analytic equivalence relation not arising from a Polish group action, Fund. Math. 130 (1988), no. 3,\n225–228. MR 970906 (89k:03056)\n15. , Model theory, Graduate Texts in Mathematics, vol. 217, Springer-Verlag, New York, 2002, An introduction.\nMR 1924282 (2003e:03060)\n16. Mark Nadel, Scott sentences and admissible sets, Ann. Math. Logic 7 (1974), 267–294. MR 0384471 (52 #5348)\n17. Gerald E. Sacks, Countable admissible ordinals and hyperdegrees, Advances inMath. 20 (1976), no. 2, 213–262. MR 0429523\n(55 #2536)\n18. , On the number of countable models, Southeast Asian conference on logic (Singapore, 1981), Stud. Logic Found.\nMath., vol. 111, North-Holland, Amsterdam, 1983, pp. 185–195. MR 723338 (85i:03095)\n19. , Higher recursion theory, Perspectives in Mathematical Logic, Springer-Verlag, Berlin, 1990. MR 1080970\n(92a:03062)\n20. Jindˇrich Zapletal, Forcing borel reducibility invariants, http://people.clas.ufl.edu/zapletal/files/t3.pdf."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"William Chan, The countable admissible ordinal equivalence relation, Annals of Pure and Applied Logic, Volume 168, Issue 6, June 2017, Pages 1224-1246, ISSN 0168-0072, https://doi.org/10.1016/j.apal.2016.12.002.\n(http://www.sciencedirect.com/science/article/pii/S0168007216301798)","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"DMS-1464475"},{"agency":"NSF","grant_number":"DMS-1044448"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}