{"title":"Characterizing Dust Attenuation in Local Star-forming Galaxies: Near-infrared Reddening and Normalization","uri":"","abstract":"We characterize the near-infrared dust attenuation for a sample of ~5500 local (z ≾ 0.1) star-forming galaxies and obtain an estimate of their average total-to-selective attenuation k(λ). We utilize data from the United Kingdom Infrared Telescope and the Two-Micron All Sky Survey, which is combined with previously measured UV–optical data for these galaxies. The average attenuation curve is slightly lower in the far-ultraviolet than in local starburst galaxies by roughly 15% but appears similar at longer wavelengths with a total-to-selective normalization of R_V = 3.67_(-0.35)^(+0.44). Under the assumption of energy balance, the total attenuated energy inferred from this curve is found to be broadly consistent with the observed infrared dust emission (L_(TIR)) in a small sample of local galaxies for which far-infrared measurements are available. However, the significant scatter in this quantity among the sample may reflect large variations in the attenuation properties of individual galaxies. We also derive the attenuation curve for subpopulations of the main sample, separated according to mean stellar population age (via D_n4000), specific star formation rate, stellar mass, and metallicity, and find that they show only tentative trends with low significance, at least over the range that is probed by our sample. These results indicate that a single curve is reasonable for applications seeking to broadly characterize large samples of galaxies in the local universe, while applications to individual galaxies would yield large uncertainties and is not recommended.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252216","docid":252216,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257418","fileid":1257418,"datasetid":"document","objectid":252216,"filename":"Battisti_2017_ApJ_840_109.pdf","mime_type":"application/pdf","hash":"590c9b92209fb314da126665f77d61c6","hash_type":"MD5","filesize":2754378,"mtime":"2017-05-15 18:59:49","url":"http://authors.library.caltech.edu/77456/1/Battisti_2017_ApJ_840_109.pdf"}],"eprintid":77456,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Battisti_2017_ApJ_840_109.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252217","docid":252217,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257421","fileid":1257421,"datasetid":"document","objectid":252217,"filename":"1704.07426.pdf","mime_type":"application/pdf","hash":"1e04c1c5983430216e11966227d911d7","hash_type":"MD5","filesize":2794137,"mtime":"2017-05-15 19:00:52","url":"http://authors.library.caltech.edu/77456/2/1704.07426.pdf"}],"eprintid":77456,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1704.07426.pdf","content":"submitted"}],"note":"© 2017 American Astronomical Society. \n\nReceived 2016 December 21. Accepted 2017 April 24. Published 2017 May 15. \n\nThe authors thank the anonymous referee whose suggestions helped clarify and improve the content of this work. AJB also thanks K. Grasha and V. Wild for comments that improved the clarity of this paper.\n\nPart of this work has been supported by NASA, via the Jet Propulsion Laboratory Euclid Project Office, as part of the \"Science Investigations as Members of the Euclid Consortium and Euclid Science Team\" program. \n\nThis work is based on observations made with the NASA Galaxy Evolution Explorer (GALEX). GALEX is operated for NASA by the California Institute of Technology under NASA contract NAS5-98034. This work has made use of Sloan Digital Sky Survey (SDSS) data. Funding for the SDSS and SDSS-II has been provided by the Alfred P. Sloan Foundation, the Participating Institutions, the National Science Foundation, the U.S. Department of Energy, NASA, the Japanese Monbukagakusho, the Max Planck Society, and the Higher Education Funding Council for England. The SDSS website is http://www.sdss.org/. The SDSS is managed by the Astrophysical Research Consortium for the Participating Institutions. This work has made use of data obtained with the United Kingdom Infrared Telescope (UKIRT). UKIRT is supported by NASA and operated under an agreement among the University of Hawaii, the University of Arizona, and the Lockheed Martin Advanced Technology Center; operations are enabled through the cooperation of the East Asian Observatory. When the data reported here were acquired, UKIRT was operated by the Joint Astronomy Centre on behalf of the Science and Technology Facilities Council of the U.K. This publication makes use of data products from the Two-Micron All Sky Survey, which is a joint project of the University of Massachusetts and the Infrared Processing and Analysis Center/California Institute of Technology, funded by NASA and the National Science Foundation.","id":77456,"rev_number":10,"userid":772,"eprint_dir":"disk0/00/07/74/56","datestamp":"2017-05-15 22:34:20","lastmod":"2017-05-15 23:44:34","status_changed":"2017-05-15 22:34:20","type":"article","metadata_visibility":"show","creators":[{"given":"A. J.","family":"Battisti","id":"Battisti-A-J","orcid":""},{"given":"D.","family":"Calzetti","id":"Calzetti-D","orcid":""},{"given":"R.-R.","family":"Chary","id":"Chary-R-R","orcid":"0000-0001-7583-0621"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"dust, extinction; galaxies: evolution; galaxies: general; galaxies: ISM","date":"2017-05-10","date_type":"published","publication":"Astrophysical Journal","volume":"840","number":"2","pagerange":"109","id_number":"CaltechAUTHORS:20170515-115922531","refereed":true,"issn":"0004-637X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170515-115922531","related_url":[{"url":"https://doi.org/10.3847/1538-4357/aa6fb2","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-4357/aa6fb2","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1704.07426","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Abazajian, K. N., Adelman-McCarthy, J. K., Agüeros, M. A., et al. 2009,\nApJS, 182, 543\nBattisti, A. J., Calzetti, D., \u0026 Chary, R.-R. 2016, ApJ, 818, 13\nBianchi, L., Clayton, G. C., Bohlin, R. C., Hutchings, J. B., \u0026 Massey, P.\n1996, ApJ, 471, 203\nBianchi, L., Conti, A., \u0026 Shiao, B. 2014, AdSpR, 53, 900\nBrammer, G. B., van Dokkum, P. G., \u0026 Coppi, P. 2008, ApJ, 686, 1503\nBrinchmann, J., Charlot, S., White, S. D. M., et al. 2004, MNRAS, 351, 1151\nCalzetti, D. 1997, in AIP Conf. Proc. 408, The Ultraviolet Universe at Low and\nHigh Redshift, ed. W. H. Waller (Melville, NY: AIP), 403\nCalzetti, D. 2001, PASP, 113, 1449\nCalzetti, D., Armus, L., Bohlin, R. C., et al. 2000, ApJ, 533, 682\nCalzetti, D., Kinney, A. L., \u0026 Storchi-Bergmann, T. 1994, ApJ, 429, 582\nCardelli, J. A., Clayton, G. C., \u0026 Mathis, J. S. 1989, ApJ, 345, 245\nCasali, M., Adamson, A., Alves de Oliveira, C., et al. 2007, A\u0026A, 467, 777\nCasey, C. M., Scoville, N. Z., Sanders, D. B., et al. 2014, ApJ, 796, 95\nCharlot, S., \u0026 Fall, S. M. 2000, ApJ, 539, 718\nCharlot, S., \u0026 Longhetti, M. 2001, MNRAS, 323, 887\nChevallard, J., Charlot, S., Wandelt, B., \u0026 Wild, V. 2013, MNRAS, 432, 2061\nClayton, G. C., Gordon, K. D., Bianchi, L. C., et al. 2015, ApJ, 815, 14\nConroy, C. 2013, ARA\u0026A, 51, 393\nCutri, R. M., Skrutskie, M. F., van Dyk, S., et al. 2003, 2MASS All Sky\nCatalog of Point Sources (Pasadena, CA: NASA/IPAC)\nDopita, M. A., Groves, B. A., Sutherland, R. S., \u0026 Kewley, L. J. 2003, ApJ,\n583, 727\nDraine, B. T. 2003, ARA\u0026A, 41, 241\nDraine, B. T., Dale, D. A., Bendo, G., et al. 2007, ApJ, 663, 866\nDraine, B. T., \u0026 Li, A. 2007, ApJ, 657, 810\nElbaz, D., Dickinson, M., Hwang, H. S., et al. 2011, A\u0026A, 533, A119\nFitzpatrick, E. L. 1999, PASP, 111, 63\nGalametz, M., Kennicutt, R. C., Calzetti, D., et al. 2013, MNRAS, 431, 1956\nGarn, T., \u0026 Best, P. N. 2010, MNRAS, 409, 421\nGordon, K. D., Calzetti, D., \u0026 Witt, A. N. 1997, ApJ, 487, 625\nGordon, K. D., Clayton, G. C., Misselt, K. A., et al. 2003, ApJ, 594, 279\nHambly, N. C., Collins, R. S., Cross, N. J. G., et al. 2008, MNRAS, 384, 637\nHewett, P. C., Warren, S. J., Leggett, S. K., \u0026 Hodgkin, S. T. 2006, MNRAS,\n367, 454\nHill, D. T., Driver, S. P., Cameron, E., et al. 2010, MNRAS, 404, 1215\nHirashita, H., Buat, V., \u0026 Inoue, A. K. 2003, A\u0026A, 410, 83\nHodgkin, S. T., Irwin, M. J., Hewett, P. C., \u0026 Warren, S. J. 2009, MNRAS,\n394, 675\nHopkins, A. M., Connolly, A. J., Haarsma, D. B., \u0026 Cram, L. E. 2001, AJ,\n122, 288\nHopkins, A. M., Miller, C. J., Nichol, R. C., et al. 2003, ApJ, 599, 971\nInoue, A. K. 2001, AJ, 122, 1788\nInoue, A. K., Hirashita, H., \u0026 Kamaya, H. 2001, ApJ, 555, 613\nJarrett, T. H., Chester, T., Cutri, R., et al. 2000, AJ, 119, 2498\nJohnson, B. D., Schiminovich, D., Seibert, M., et al. 2007a, ApJS, 173, 377\nJohnson, B. D., Schiminovich, D., Seibert, M., et al. 2007b, ApJS, 173, 392\nJuneau, S., Bournaud, F., Charlot, S., et al. 2014, ApJ, 788, 88\nKauffmann, G., Heckman, T. M., White, S. D. M., et al. 2003a, MNRAS,\n341, 54\nKauffmann, G., Heckman, T. M., White, S. D. M., et al. 2003b, MNRAS,\n341, 33\nKewley, L. J., \u0026 Dopita, M. A. 2002, ApJS, 142, 35\nKobulnicky, H. A., \u0026 Kewley, L. J. 2004, ApJ, 617, 240\nKreckel, K., Groves, B., Schinnerer, E., et al. 2013, ApJ, 771, 62\nKroupa, P. 2001, MNRAS, 322, 231\nLawrence, A., Warren, S. J., Almaini, O., et al. 2007, MNRAS, 379, 1599\nLe Floch, E., Papovich, C., Dole, H., et al. 2005, ApJ, 632, 169\nLeitherer, C., Schaerer, D., Goldader, J. D., et al. 1999, ApJS, 123, 3\nLiu, G., Calzetti, D., Hong, S., et al. 2013, ApJL, 778, L41\nMadau, P., \u0026 Dickinson, M. 2014, ARA\u0026A, 52, 415\nMagnelli, B., Elbaz, D., Chary, R. R., et al. 2009, A\u0026A, 496, 57\nMartin, D. C., Fanson, J., Schiminovich, D., et al. 2005, ApJL, 619, L1\nMorrissey, P., Conrow, T., Barlow, T. A., et al. 2007, ApJS, 173, 682\nMurphy, E. J., Chary, R.-R., Dickinson, M., et al. 2011, ApJ, 732, 126\nNatale, G., Popescu, C. C., Tuffs, R. J., et al. 2015, MNRAS, 449, 243\nOsterbrock, D. E. 1989, Astrophysics of Gaseous Nebulae and Active Galactic\nNuclei (Mill Valley, CA: Univ. Science Books)\nOsterbrock, D. E., \u0026 Ferland, G. J. 2006, Astrophysics of Gaseous Nebulae\nand Active Galactic Nuclei (Sausalito, CA: Univ. Science Books)\nPierini, D., Gordon, K. D., Witt, A. N., \u0026 Madsen, G. J. 2004, ApJ, 617, 1022\nReddy, N. A., Dickinson, M., Elbaz, D., et al. 2012, ApJ, 744, 154\nReddy, N. A., Kriek, M., Shapley, A., et al. 2015, ApJ, 806, 259\nReddy, N. A., Steidel, C. C., Pettini, M., \u0026 Bogosavljević, M. 2016, ApJ,\n828, 107\nSalim, S., Rich, R. M., Charlot, S., et al. 2007, ApJS, 173, 267\nSkrutskie, M. F., Cutri, R. M., Stiening, R., et al. 2006, AJ, 131, 1163\nSomerville, R. S., \u0026 Davé, R. 2015, ARA\u0026A, 53, 51\nTremonti, C. A., Heckman, T. M., Kauffmann, G., et al. 2004, ApJ, 613, 898\nTuffs, R. J., Popescu, C. C., Völk, H. J., Kylafis, N. D., \u0026 Dopita, M. A. 2004,\nA\u0026A, 419, 821\nWang, B., \u0026 Heckman, T. M. 1996, ApJ, 457, 645\nWeingartner, J., \u0026 Draine, B. T. 2001, ApJ, 548, 296\nWild, V., Charlot, S., Brinchmann, J., et al. 2011, MNRAS, 417, 1760\nWitt, A. N., Thronson, H. A. J., \u0026 Capuano, J. M. J. 1992, ApJ, 393, 611\nXue, M., Jiang, B. W., Gao, J., et al. 2016, ApJS, 224, 23"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"A. J. Battisti et al 2017 ApJ 840 109","other_numbering_system":null,"funders":[{"agency":"JPL Euclid Project Office","grant_number":""},{"agency":"NASA","grant_number":"NAS5-98034"},{"agency":"Alfred P. Sloan Foundation","grant_number":""},{"agency":"NSF","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"Joy Painter","local_group":["Infrared Processing and Analysis Center (IPAC)"]}