{"title":"Psi4 1.1: An Open-Source Electronic Structure Program Emphasizing Automation, Advanced Libraries, and Interoperability","uri":"","abstract":"Psi4 is an ab initio electronic structure program providing methods such as Hartree–Fock, density functional theory, configuration interaction, and coupled-cluster theory. The 1.1 release represents a major update meant to automate complex tasks, such as geometry optimization using complete-basis-set extrapolation or focal-point methods. Conversion of the top-level code to a Python module means that Psi4 can now be used in complex workflows alongside other Python tools. Several new features have been added with the aid of libraries providing easy access to techniques such as density fitting, Cholesky decomposition, and Laplace denominators. The build system has been completely rewritten to simplify interoperability with independent, reusable software components for quantum chemistry. Finally, a wide range of new theoretical methods and analyses have been added to the code base, including functional-group and open-shell symmetry adapted perturbation theory (F-SAPT and O-SAPT), density-fitted coupled cluster with frozen natural orbitals [DF-FNO-CCSD(T)], orbital-optimized perturbation and coupled-cluster methods (e.g., OO-MP2 and OO-CCSD), density-fitted multiconfigurational self-consistent field (DF-MCSCF), density cumulant functional theory (DCT), algebraic-diagrammatic construction [ADC(2)] excited states, improvements to the geometry optimizer, and the \"X2C\" approach to relativistic corrections, among many other improvements.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252221","docid":252221,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257456","fileid":1257456,"datasetid":"document","objectid":252221,"filename":"acs%2Ejctc%2E7b00174.pdf","mime_type":"application/pdf","hash":"fd173beeca40b74e8ba9b0e47126c88f","hash_type":"MD5","filesize":4636315,"mtime":"2017-05-15 19:52:55","url":"http://authors.library.caltech.edu/77457/1/acs%252Ejctc%252E7b00174.pdf"}],"eprintid":77457,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"acs%2Ejctc%2E7b00174.pdf","content":"accepted"}],"note":"© 2017 American Chemical Society. \n\nReceived 17 February 2017. Published online 10 May 2017. \n\nWe are grateful to the contributors of all earlier versions of the Psi program. Brandon Bakr provided Figure 2, and Michael Zott provided a figure element for the TOC. Several of the co-authors have been supported in their development of Psi4 and affiliated projects by the U.S. National Science Foundation, through grants ACI-1147843, CHE-1300497, CHE-1351978, CHE-1361178, ACI-1449723, ACI-1450169, ACI-1465149, CHE-1566192, and ACI-1609842; by the U.S. Department of Energy through grants DE-SC0015512 and DE-SC0016004; and by the U.S. Department of Defense through a HPCMP Applications Software Initiative (HASI) grant. U. B. acknowledges support from the Scientific and Technological Research Council of Turkey (Grant No.TUBITAK-114Z786) and the European Cooperation in Science and Technology (Grant No. CM1405). R. D. R. acknowledges support from the Research Council of Norway through a Centre of Excellence Grant (Grant No. 179568/V30). J. F. G. acknowledges the postdoctoral fellowship No P2ELP2_155351 from the Swiss NSF. The authors thank Prof. Stefan Grimme for consultations in validating HF-3c and PBEh-3c.","id":77457,"rev_number":12,"userid":772,"eprint_dir":"disk0/00/07/74/57","datestamp":"2017-05-15 23:55:04","lastmod":"2017-05-15 23:55:04","status_changed":"2017-05-15 23:55:04","type":"article","metadata_visibility":"show","creators":[{"given":"Robert M.","family":"Parrish","id":"Parrish-R-M","orcid":""},{"given":"Alexander Yu.","family":"Sokolov","id":"Sokolov-A-Yu","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-10","date_type":"inpress","publication":"Journal of Chemical Theory and Computation","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170515-125238896","refereed":true,"issn":"1549-9618","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170515-125238896","related_url":[{"url":"http://dx.doi.org/10.1021/acs.jctc.7b00174","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/acs.jctc.7b00174","type":"pub","description":"Article"}],"referencetext":["(1) Wilson, E. K. Chemical and Engineering News 2014, 92, 26.\n(2) Valeev, E. F.; Fermann, J. T. Libint: A high-perforrmance library for computing Gaussian\nintegrals in quantum mechanics; 2017. https://github.com/evaleev/libint\n(accessed May 8, 2017).\n(3) Kaliman, I. A.; Slipchenko, L. V. libefp; http://libefp.github.io (accessed May 8,\n2017).\n(4) Kaliman, I. A.; Slipchenko, L. V. J. Comput. Chem. 2013, 34, 2284–2292.\n(5) S.Wouters, CheMPS2: A Spin-Adapted Implementation of DMRG for ab initio Quantum\nChemistry. http://github.com/SebWouters/CheMPS2 (accessed May 8, 2017).\n(6) Wouters, S.; Poelmans, W.; Ayers, P. W.; Van Neck, D. Comput. Phys. Commun.\n2014, 185, 1501–1514.\n(7) Wouters, S.; Van Neck, D. Eur. Phys. J. D 2014, 68, 272.\n(8) Pritchard, B. P.; Chow, E. Simint. https://github.com/simint-chem.\n(9) Pritchard, B. P.; Chow, E. J. Comp. Chem. 2016, 37, 2537–2546.\n(10) Marques, M. A. L.; Oliveira, M.; Burnus, T.; Madsen, G.; Andrade, X.; Strubbve, D.;\nLehtola, S. Libxc, a library of exchange-correlation functionals for density-functional\ntheory. Version 3.0.0; 2016. http://octopus-code.org/wiki/Libxc (accessed May\n8, 2017).\n(11) Marques, M. A. L.; Oliveira, M. J. T.; Burnus, T. Comp. Phys. Commun. 2012, 183,\n2272–2281.\n(12) Wolf, A.; Reiher, M.; Hess, B. A. J. Chem. Phys. 2002, 117, 9215–9226\n(1) Wilson, E. K. Chemical and Engineering News 2014, 92, 26.\n(2) Valeev, E. F.; Fermann, J. T. Libint: A high-perforrmance library for computing Gaussian\nintegrals in quantum mechanics; 2017. https://github.com/evaleev/libint\n(accessed May 8, 2017).\n(3) Kaliman, I. A.; Slipchenko, L. V. libefp; http://libefp.github.io (accessed May 8,\n2017).\n(4) Kaliman, I. A.; Slipchenko, L. V. J. Comput. Chem. 2013, 34, 2284–2292.\n(5) S.Wouters, CheMPS2: A Spin-Adapted Implementation of DMRG for ab initio Quantum\nChemistry. http://github.com/SebWouters/CheMPS2 (accessed May 8, 2017).\n(6) Wouters, S.; Poelmans, W.; Ayers, P. W.; Van Neck, D. Comput. Phys. Commun.\n2014, 185, 1501–1514.\n(7) Wouters, S.; Van Neck, D. Eur. Phys. J. D 2014, 68, 272.\n(8) Pritchard, B. P.; Chow, E. Simint. https://github.com/simint-chem.\n(9) Pritchard, B. P.; Chow, E. J. Comp. Chem. 2016, 37, 2537–2546.\n(10) Marques, M. A. L.; Oliveira, M.; Burnus, T.; Madsen, G.; Andrade, X.; Strubbve, D.;\nLehtola, S. Libxc, a library of exchange-correlation functionals for density-functional\ntheory. Version 3.0.0; 2016. http://octopus-code.org/wiki/Libxc (accessed May\n8, 2017).\n(11) Marques, M. A. L.; Oliveira, M. J. T.; Burnus, T. Comp. Phys. Commun. 2012, 183,\n2272–2281.\n(12) Wolf, A.; Reiher, M.; Hess, B. A. J. Chem. Phys. 2002, 117, 9215–9226\nGroup, University of Illinois at Urbana-Champaign, 2017. http://www.ks.uiuc.edu/\nResearch/vmd/ (accessed May 8, 2017).\n(23) Humphrey, W.; Dalke, A.; Schulten, K. J. Mol. Graphics 1996, 14, 33–38.\n(24) GitHub. https://github.com/ (accessed May 8, 2017).\n(25) Wang, L.-P.; Song, C. GeomeTRIC, a geometry optimization code that includes the\nTRIC coordinate system; 2017. http://github.com/leeping/geomeTRIC (accessed\nMay 8, 2017).\n(26) Wang, L.-P.; Song, C. J. Chem. Phys. 2016, 144, 214108.\n(27) Reed, A. E.; Weinstock, R. B.; Weinhold, F. J. Chem. Phys. 1985, 83, 735–746.\n(28) JANPA, A Freeware Program Package for Performing Natual Population Analysis;\nVersion 1.04; 2016. http://janpa.sourceforge.net/ (accessed May 8, 2017).\n(29) Nikolaienko, I. Y.; Bulavin, L. A.; Hovorun, D. M. Comput. Theor. Chem. 2014, 1050,\n15–22.\n(30) McGibbon, R. T. RESP2, Restrained Electrostatic Potential Fitting for Psi4; 2016.\nhttp://github.com/rmcgibbo/resp2 (accessed May 8, 2017).\n(31) Bayly, C. I.; Cieplak, P.; Cornell, W. D.; Kollman, P. A. J. Phys. Chem. 1993, 97,\n10269–10280.\n(32) Doerr, S.; Harvey, M. J.; Noé, F.; Fabritiis, G. D. J. Chem. Theory Comput. 2016,\n12, 1845–1852.\n(33) Whitten, J. L. J. Chem. Phys. 1973, 58, 4496–4501.\n(34) Dunlap, B. I.; Connolly, J. W. D.; Sabin, J. R. Int. J. Quantum Chem. Symp. 1977,\n12, 81.","(35) Dunlap, B. I.; Connolly, J. W. D.; Sabin, J. R. J. Chem. Phys. 1979, 71, 3396–3402.\n(36) Komornicki, A.; Fitzgerald, G. J. Chem. Phys. 1993, 98, 1398–1421.\n(37) Feyereisen, M.; Fitzgerald, G.; Komornicki, A. Chem. Phys. Lett. 1993, 208, 359–363.\n(38) Vahtras, O.; Almlöf, J.; Feyereisen, M. W. Chem. Phys. Lett. 1993, 213, 514–518.\n(39) Rendell, A. P.; Lee, T. J. J. Chem. Phys. 1994, 101, 400–408.\n(40) Kendall, R. A.; Fruchtl, H. A. Theor. Chem. Acc. 1997, 97, 158–163.\n(41) Weigend, F. Phys. Chem. Chem. Phys. 2002, 4, 4285–4291.\n(42) Beebe, N. H. F.; Linderberg, J. Int. J. Quantum Chem. 1977, 12, 683–705.\n(43) Roeggen, I.; Wisloff-Nilssen, E. Chem. Phys. Lett. 1986, 132, 154–160.\n(44) Koch, H.; Sánchez de Meras, A.; Pedersen, T. B. J. Chem. Phys. 2003, 118, 9481–\n9484.\n(45) Aquilante, F.; Pedersen, T. B.; Lindh, R. J. Chem. Phys. 2007, 126, 194106.\n(46) Aquilante, F.; Gagliardi, L.; Pedersen, T. B.; Lindh, R. J. Chem. Phys. 2009, 130,\n154107.\n(47) Turney, J. M.; Simmonett, A. C.; Parrish, R. M.; Hohenstein, E. G.; Evangelista, F. A.;\nFermann, J. T.; Mintz, B. J.; Burns, L. A.; Wilke, J. J.; Abrams, M. L.; Russ, N. J.;\nLeininger, M. L.; Janssen, C. L.; Seidl, E. T.; Allen, W. D.; Schaefer, H. F.; King, R. A.;\nValeev, E. F.; Sherrill, C. D.; Crawford, T. D. WIREs Comput. Mol. Sci. 2012, 2,\n556–565.\n(48) Crawford, T. D.; Sherrill, C. D.; Valeev, E. F.; Fermann, J. T.; King, R. A.;\nLeininger, M. L.; Brown, S. T.; Janssen, C. L.; Seidl, E. T.; Kenny, J. P.; Allen, W. D.\nJ. Comput. Chem. 2007, 28, 1610–1616.\n(49) Bolton, E. E.; Wang, Y.; Thiessen, P. A.; Bryant, S. H. In Annual Reports in Computational\nChemistry; Wheeler, R. A., Spellmeyer, D. C., Eds.; Elsevier: Amsterdam,\n2005; Vol. 4; pp 217–241.\n(50) Hehre, W. J.; Stewart, R. F.; Pople, J. A. J. Chem. Phys. 1969, 51, 2657–2664.\n(51) Werner, H.-J.; Knowles, P. J.; Manby, F. R.; Schütz, M.; Celani, P.; Knizia, G.;\nKorona, T.; Lindh, R.; Mitrushenkov, A.; Rauhut, G.; Adler, T. B.; Amos, R. D.;\nBernhardsson, A.; Berning, A.; Cooper, D. L.; Deegan, M. J. O.; Dobbyn, A. J.;\nEckert, F.; Goll, E.; Hampel, C.; Hesselmann, A.; Hetzer, G.; Hrenar, T.; Jansen, G.;\nKöppl, C.; Liu, Y.; Lloyd, A. W.; Mata, R. A.; May, A. J.; Tarroni, R.; Thorsteinsson,\nT.; Wang, M.; Wolf, A. MOLPRO, version 2010.1; 2010. http://www.molpro.net\n(accessed May 8, 2017).\n(52) Dunning, T. H. J. Chem. Phys. 1989, 90, 1007–1023.\n(53) Kendall, R. A.; Dunning, T. H.; Harrison, R. J. J. Chem. Phys. 1992, 96, 6796–6806.\n(54) Halkier, A.; Helgaker, T.; Jorgensen, P.; Klopper, W.; Olsen, J. Chem. Phys. Lett.\n1999, 302, 437–446.\n(55) Halkier, A.; Helgaker, T.; Jørgensen, P.; Klopper, W.; Koch, H.; Olsen, J.; Wilson,\nA. K. Chem. Phys. Lett. 1998, 286, 243–252.\n(56) Boys, S. F.; Bernardi, F. Mol. Phys. 1970, 19, 553–566.\n(57) Valiron, P.; Mayer, I. Chem. Phys. Lett. 1997, 275, 46–55.\n(58) BOOST C++ Libraries. http://www.boost.org (accessed May 8, 2017).\n(59) Jakob, W.; Rhinelander, J.; Moldovan, D. pybind11 âĂŤ Seamless operability between\nC++11 and Python. 2017; https://github.com/pybind/pybind11 (accessed May 8,\n2017).","(60) Smith, D. G. A.; Sirianni, D. A.; Burns, L. A.; Patkowski, K.; Sherrill, C. D.\npsi4/psi4numpy: Beta Release. 2017; https://doi.org/10.5281/zenodo.293020.\n(61) van der Walt, S.; Colbert, S. C.; Varoquaux, G. Computing in Science Engineering\n2011, 13, 22–30.\n(62) Perez, F.; Granger, B. E. Computing in Science Engineering 2007, 9, 21–29.\n(63) CMake, a cross-platform family of tools designed to buid, test and package software.\nhttp://cmake.org (accessed May 8, 2017).\n(64) Anaconda; Continuum IO, 2017. https://www.continuum.io/ (accessed May 8,\n2017). (190) Sphinx, Python Documentation Generator. http://www.sphinx-doc.org/en/1.5.\n2/index.html (accessed May 8, 2017).\n(191) Psi4 YouTube videos. https://www.youtube.com/user/psitutorials (accessed\nMay 8, 2017).\n(192) Psi4 User Forum. http://forum.psicode.org (accessed May 8, 2017).\n(193) Psi4 Website. http://www.psicode.org (accessed May 8, 2017).\n(194) Psi4Education. http://www.psicode.org/labs.php (accessed May 8, 2017).\n(195) Fortenberry, R. C.; McDonald, A. R.; Shepherd, T. D.; Kennedy, M.; Sherrill, C. D.\nIn The Promise of Chemical Education: Addressing our Students’ Needs; Daus, K.,\nRigsby, R., Eds.; American Chemical Society: Washington, D.C., 2015; Vol. 1193; pp\n85–98.\n(65) Any system libraries not linked statically fall within the purview of https://www.\npython.org/dev/peps/pep-0513/#id38.\n(66) Smith, D. G. A.; Burns, L. A.; Patkowski, K.; Sherrill, C. D. J. Phys. Chem. Lett.\n2016, 7, 2197–2203.\n(67) Sure, R.; Grimme, S. Journal of Computational Chemistry 2013, 34, 1672–1685.\n(68) Grimme, S.; Brandenburg, J. G.; Bannwarth, C.; Hansen, A. The Journal of Chemical\nPhysics 2015, 143, 054107.\n(69) Miertuš, S.; Scrocco, E.; Tomasi, J. Chem. Phys. 1981, 55, 117–129.\n(70) Tomasi, J.; Persico, M. Chem. Rev. 1994, 94, 2027–2094.\n(71) Tomasi, J.; Mennucci, B.; Cammi, R. Chem. Rev. 2005, 105, 2999–3093.\n(72) Mennucci, B.; Cammi, R. Continuum Solvation Models in Chemical Physics: From\nTheory to Applications; Wiley, 2008.\n(73) Cancès, E.; Mennucci, B. J. Math. Chem. 1998, 23, 309–326\n(74) Corni, S.; Tomasi, J. J. Chem. Phys. 2002, 117, 7266.\n(75) Frediani, L.; Cammi, R.; Corni, S.; Tomasi, J. J. Chem. Phys. 2004, 120, 3893–3907.\n(76) Delgado, A.; Corni, S.; Goldoni, G. J. Chem. Phys. 2013, 139, 024105.\n(77) Di Remigio, R.; Mozgawa, K.; Cao, H.; Weijo, V.; Frediani, L. J. Chem. Phys. 2016,\n144, 124103.\n(78) Gordon, M. S.; Freitag, M. A.; Bandyopadhyay, P.; Jensen, J. H.; Kairys, V.;\nStevens, W. J. J. Phys. Chem. A 2001, 105, 293–307.\n(79) Ghosh, D.; Kosenkov, D.; Vanovschi, V.; Williams, C. F.; Herbert, J. M.; Gordon,\nM. S.; Schmidt, M. W.; Slipchenko, L. V.; Krylov, A. I. J. Phys. Chem. A\n2010, 114, 12739–12754.\n(80) Flocke, N.; Lotrich, V. J. Comput. Chem. 2008, 29, 2722–2736.\n(81) White, S. R.; Martin, R. L. J. Chem. Phys. 1999, 110, 4127–4130.\n(82) Chan, G. K. L.; Head-Gordon, M. J. Chem. Phys. 2002, 116, 4462–4476.\n(83) Wouters, S.; Bogaerts, T.; der Voort, P. V.; Speybroeck, V. V.; Van Neck, D. J. Chem.\nPhys. 2014, 140, 241103.\n(84) Wouters, S.; Speybroeck, V. V.; Van Neck, D. J. Chem. Phys. 2016, 145, 054120.\n(85) Stone, A. J. GDMA, A Program to Perform Distributed Multipole Analysis, Version\n2.2.11, 2015. http://www-stone.ch.cam.ac.uk/programs.html (accessed May\n8, 2017).\n(86) DePrince, A. E.; v2rdm-CASSCF, A variational 2-RDM-driven CASSCF plugin to\nPsi4; 2016. http://github.com/edeprince3/v2rdm_casscf (accessed May 8, 2017).\n(87) Fosso-Tande, J.; Nguyen, T.-S.; Gidofalvi, G.; DePrince III, A. E. J. Chem. Theory\nComput. 2016, 12, 2260–2271.\n(88) Turney, J. M. AMBIT, A C++ Library for the Implementation of Tensor Product\nCalculations through a Clean, Concise User Interaface; 2017. http://github.com/\njturney/ambit (accessed May 8, 2017).\n(89) Stanton, J. F.; Gauss, J.; Harding, M. E.; Szalay, P. G. cfour, Coupled-Cluster Techniques\nfor Computational Chemistry. With contributions from Auer, A. A.; Bartlett,\nR. J.; Benedikt, U.; Berger, C.; Bernholdt, D. E.; Bomble, Y. J.; Cheng, L.; Christiansen,\nO.; Heckert, M.; Heun, O.; Huber, C.; Jagau, T.-C.; Jonsson, D.; Jusélius, J.;\nKlein, K.; Lauderdale, W. J.; Lipparini, F.; Matthews, D. A.; Metzroth, T.; Mück, L.\nA.; O’Neill, D. P.; Price, D. R.; Prochnow, E.; Puzzarini, C.; Ruud, K.; Schiffmann,\nF.; Schwalbach, W.; Simmons, C.; Stopkowicz, S.; Tajti, A.; Vázquez, J.; Wang,\nF.; Watts, J. D.; and the integral packages MOLECULE (Almlöf, J. and Taylor,\nP. R.), PROPS (Taylor, P. R.), ABACUS (Helgaker, T.; Aa. Jensen, H. J.; Jørgensen,\nP.; and Olsen, J.), and ECP routines by Mitin, A. V. and van Wüllen, C.\nhttp://www.cfour.de (accessed May 8, 2017).\n(90) Forte, a suite of quantum chemistry methods for strongly correlated electrons; Evangelista\nResearch Group: Emory University, Atlanta, GA, 2016. https://github.com/\nevangelistalab/forte (accessed May 8, 2017).\n(91) Evangelista, F. A. J. Chem. Phys. 2014, 141, 054109.\n(92) Li, C.; Evangelista, F. A. J. Chem. Theory Comput. 2015, 11, 2097–2108.\n(93) Hannon, K. P.; Li, C.; Evangelista, F. A. J. Chem. Phys. 2016, 144, 204111.\n(94) Li, C.; Evangelista, F. A. J. Chem. Phys. 2016, 144, 164114.\n(95) Schriber, J. B.; Evangelista, F. A. J. Chem. Phys. 2016, 144, 161106.\n(96) Zhang, T.; Evangelista, F. A. J. Chem. Theory Comput. 2016, 12, 4326–4337.\n(97) TravisCI. https://travis-ci.org/ (accessed May 8, 2017).\n(98) CodeCov. https://codecov.io/ (accessed May 8, 2017).\n(99) McMurchie, L. E.; Davidson, E. R. J. Comput. Phys. 1978, 26, 218 – 231.\n(100) Rys, J.; Dupuis, M.; King, H. F. J. Comput. Chem. 1983, 4, 154–157.\n(101) Obara, S.; Saika, A. J. Chem. Phys. 1986, 84, 3963–3974.\n(102) Raffenetti, R. C. Chem. Phys. Lett. 1973, 20, 335–338.\n(103) Jeziorski, B.; Moszynski, R.; Szalewicz, K. Chem. Rev. 1994, 94, 1887–1930.\n(104) Szalewicz, K. WIREs Comput. Mol. Sci. 2012, 2, 254–272.\n(105) Hohenstein, E. G.; Sherrill, C. D. WIREs Comput. Mol. Sci. 2012, 2, 304–326.\n(106) Sherrill, C. D. Acc. Chem. Res. 2013, 46, 1020–1028.\n(107) Hohenstein, E. G.; Sherrill, C. D. J. Chem. Phys. 2010, 132, 184111.\n(108) Hohenstein, E. G.; Parrish, R. M.; Sherrill, C. D.; Turney, J. M.; Schaefer, H. F. J.\nChem. Phys. 2011, 135, 174107.\n(109) Hohenstein, E. G.; Sherrill, C. D. J. Chem. Phys. 2010, 133, 014101.\n(110) Hohenstein, E. G.; Sherrill, C. D. J. Chem. Phys. 2010, 133, 104107.\n(111) Parrish, R. M.; Hohenstein, E. G.; Sherrill, C. D. J. Chem. Phys. 2013, 139, 174102.\n(112) Parrish, R. M.; Sherrill, C. D. J. Chem. Phys. 2014, 141, 044115.\n(113) Parrish, R. M.; Parker, T. M.; Sherrill, C. D. J. Chem. Theory Comput. 2014, 10,\n4417–4431.\n(114) Bakr, B. W.; Sherrill, C. D. Phys. Chem. Chem. Phys. 2016, 18, 10297–10308.\n(115) Parrish, R. M.; Gonthier, J. F.; Corminboeuf, C.; Sherrill, C. D. J. Chem. Phys. 2015,\n143, 051103.\n(116) Manby, F. R.; Stella, M.; Goodpaster, J. D.; Miller, T. F. J. Chem. Theory Comput.\n2012, 8, 2564–2568.\n(117) Gonthier, J. F.; Sherrill, C. D. J. Chem. Phys. 2016, 145, 134106.\n(118) Hapka, M.; Żuchowski, P. S.; Szczęśniak, M. M.; Chałasiński, G. J. Chem. Phys. 2012,\n137, 164104–12.\n(119) Żuchowski, P. S.; Podeszwa, R.; Moszyński, R.; Jeziorski, B.; Szalewicz, K. J. Chem.\nPhys. 2008, 129, 084101–17.\n(120) Purvis, G. D.; Bartlett, R. J. J. Chem. Phys. 1982, 76, 1910–1918.\n(121) Sosa, C.; Geersten, J.; Trucks, G. W.; Barlett, R. J.; Franz, J. A. Chem. Phys. Lett.\n1989, 159, 148–154.\n(122) Klopper, W.; Noga, J.; Koch, H.; Helgaker, T. Theor. Chem. Acc. 1997, 97, 164–176.\n(123) Taube, A. G.; Bartlett, R. J. Collect. Czech. Chem. Commun. 2005, 70, 837–850.\n(124) Landau, A.; Khistyaev, K.; Dolgikh, S.; Krylov, A. I. J. Chem. Phys. 2010, 132,\n014109.\n(125) Jurečka, P.; Šponer, J.; Černý, J.; Hobza, P. Phys. Chem. Chem. Phys. 2006, 8,\n1985–1993.\n(126) DePrince, A. E.; Sherrill, C. D. J. Chem. Theory Comput. 2013, 9, 293–299.\n(127) DePrince, A. E.; Sherrill, C. D. J. Chem. Theory Comput. 2013, 9, 2687–2696\n(128) Kennedy, M. R.; Ringer McDonald, A.; DePrince, A. E.; Marshall, M. S.;\nPodeszwa, R.; Sherrill, C. D. J. Chem. Phys. 2014, 140, 121104.\n(129) DePrince, A. E.; Kennedy, M. R.; Sumpter, B. G.; Sherrill, C. D. Mol. Phys. 2014,\n112, 844–852.\n(130) Aquilante, F.; Vico, L. D.; Ferre, N.; Ghigo, G.; Malmqvist, P.; Neogrady, P.; Pedersen,\nT. B.; Pitonak, M.; Reiher, M.; Roos, B. O.; Serrano-Andres, L.; Urban, M.;\nVeryazov, V.; Lindh, R. J. Comput. Chem. 2010, 31, 224–247.\n(131) Shao, Y.; Gan, Z.; Epifanovsky, E.; Gilbert, A. T. B.; Wormit, M.; Kussmann, J.;\nLange, A. W.; Behn, A.; Deng, J.; Feng, X.; Ghosh, D.; Goldey, M.; Horn, P. R.; Jacobson,\nL. D.; Kaliman, I.; Khaliullin, R. Z.; Kus, T.; Landau, A.; Liu, J.; Proynov, E. I.;\nRhee, Y. M.; Richard, R. M.; Rohrdanz, M. A.; Steele, R. P.; Sundstrom, E. J.;\nWoodcock, H. L.; Zimmerman, P. M.; Zuev, D.; Albrecht, B.; Alguire, E.; Austin, B.;\nBeran, G. J. O.; Bernard, Y. A.; Berquist, E.; Brandhorst, K.; Bravaya, K. B.;\nBrown, S. T.; Casanova, D.; Chang, C.; Chen, Y.; Chien, S. H.; Closser, K. D.; Crittenden,\nD. L.; Diedenhofen, M.; DiStasio, R. A.; Do, H.; Dutoi, A. D.; Edgar, R. G.;\nFatehi, S.; Fusti-Molnar, L.; Ghysels, A.; Golubeva-Zadorozhnaya, A.; Gomes, J.;\nHanson-Heine, M. W. D.; Harbach, P. H. P.; Hauser, A. W.; Hohenstein, E. G.;\nHolden, Z. C.; Jagau, T.; Ji, H.; Kaduk, B.; Khistyaev, K.; Kim, J.; Kim, J.;\nKing, R. A.; Klunzinger, P.; Kosenkov, D.; Kowalczyk, T.; Krauter, C. M.; Lao, K. U.;\nLaurent, A. D.; Lawler, K. V.; Levchenko, S. V.; Lin, C. Y.; Liu, F.; Livshits, E.;\nLochan, R. C.; Luenser, A.; Manohar, P.; Manzer, S. F.; Mao, S.; Mardirossian, N.;\nMarenich, A. V.; Maurer, S. A.; Mayhall, N. J.; Neuscamman, E.; Oana, C. M.;\nOlivares-Amaya, R.; O’Neill, D. P.; Parkhill, J. A.; Perrine, T. M.; Peverati, R.;\nProciuk, A.; Rehn, D. R.; Rosta, E.; Russ, N. J.; Sharada, S. M.; Sharma, S.;\nSmall, D. W.; Sodt, A.; Stein, T.; Stueck, D.; Su, Y.; Thom, A. J. W.; Tsuchimochi, T.;\nVanovschi, V.; Vogt, L.; Vydrov, O.; Wang, T.; Watson, M. A.; Wenzel, J.; White, A.; Williams, C. F.; Yang, J.; Yeganeh, S.; Yost, S. R.; You, Z.; Zhang, I. Y.; Zhang, X.;\nZhao, Y.; Brooks, B. R.; Chan, G. K. L.; Chipman, D. M.; Cramer, C. J.; Goddard,\nW. A.; Gordon, M. S.; Hehre, W. J.; Klamt, A.; Schaefer, H. F.; Schmidt, M. W.;\nSherrill, C. D.; Truhlar, D. G.; Warshel, A.; Xu, X.; Aspuru-Guzik, A.; Baer, R.;\nBell, A. T.; Besley, N. A.; Chai, J.; Dreuw, A.; Dunietz, B. D.; Furlani, T. R.; Gwaltney,\nS. R.; Hsu, C.; Jung, Y.; Kong, J.; Lambrecht, D. S.; Liang, W.; Ochsenfeld, C.;\nRassolov, V. A.; Slipchenko, L. V.; Subotnik, J. E.; Voorhis, T. V.; Herbert, J. M.;\nKrylov, A. I.; Gill, P. M. W.; Head-Gordon, M. Mol. Phys. 2015, 113, 184–215.\n(132) Pitonak, M.; Aquilante, F.; Hobza, P.; Neogrady, P.; Noga, J.; Urban, M. Collect.\nCzech. Chem. Commun. 2011, 76, 713–742.\n(133) Epifanovsky, E.; Zuev, D.; Feng, X.; Khistyaev, K.; Shao, Y.; Krylov, A. I. J. Chem.\nPhys. 2013, 139, 134105.\n(134) Bozkaya, U.; Sherrill, C. D. J. Chem. Phys. 2014, 141, 204105.\n(135) Pitoňák, M.; Neogrády, P.; Černý, J.; Grimme, S.; Hobza, P. ChemPhysChem 2009,\n10, 282–289.\n(136) Burns, L. A.; Marshall, M. S.; Sherrill, C. D. J. Chem. Phys. 2014, 141, 234111.\n(137) Bozkaya, U.; Sherrill, C. D. J. Chem. Phys. 2016, 144, 174103.\n(138) Bozkaya, U. J. Chem. Phys. 2014, 141, 124108.\n(139) Adamowicz, L.; Bartlett, R. J. J. Chem. Phys. 1987, 86, 6314–6324.\n(140) Lochan, R. C.; Head-Gordon, M. J. Chem. Phys. 2007, 126, 164101.\n(141) Lochan, R. C.; Shao, Y.; Head-Gordon, M. J. Chem. Theory Comput. 2007, 3, 988–\n1003.\n(142) Neese, F.; Schwabe, T.; Kossmann, S.; Schirmer, B.; Grimme, S. J. Chem. Theory\nComput. 2009, 5, 3060–3073.\n(143) Scuseria, G. E.; Schaefer, H. F. Chem. Phys. Lett. 1987, 142, 354–358.\n(144) Sherrill, C. D.; Krylov, A. I.; Byrd, E. F. C.; Head-Gordon, M. J. Chem. Phys. 1998,\n109, 4171–4181.\n(145) Jankowski, K.; Rubiniec, K.; Wasilewski, J. Chem. Phys. Lett. 2001, 343, 365–374.\n(146) Stanton, J. F.; Gauss, J.; Bartlett, R. J. J. Chem. Phys. 1992, 97, 5554–5559.\n(147) Barnes, L. A.; Lindh, R. Chem. Phys. Lett. 1994, 223, 207–214.\n(148) Bozkaya, U.; Turney, J. M.; Yamaguchi, Y.; Schaefer, H. F.; Sherrill, C. D. J. Chem.\nPhys. 2011, 135, 104103.\n(149) Bozkaya, U. J. Chem. Phys. 2011, 135, 224103.\n(150) Bozkaya, U.; Sherrill, C. D. J. Chem. Phys. 2013, 138, 184103.\n(151) Bozkaya, U.; Sherrill, C. D. J. Chem. Phys. 2013, 139, 054104.\n(152) Kucharski, S. A.; Bartlett, R. J. J. Chem. Phys. 1998, 108, 5243–5254.\n(153) Crawford, T.; Stanton, J. Int. J. Quantum Chem. 1998, 70, 601–611.\n(154) Bozkaya, U.; Schaefer, H. F. J. Chem. Phys. 2012, 136, 204114.\n(155) Bozkaya, U. J. Chem. Phys. 2013, 139, 104116.\n(156) Bozkaya, U. J. Chem. Theory Comput. 2014, 10, 2371–2378.\n(157) Bozkaya, U. J. Chem. Theory Comput. 2016, 12, 1179–1188.\n(158) Bozkaya, U. Phys. Chem. Chem. Phys. 2016, 18, 11362–11373\n(159) Hohenstein, E. G.; Luehr, N.; Ufimtsev, I. S.; Martínez, T. J. J. Chem. Phys. 2015,\n142, 224103–10.\n(160) Aquilante, F.; Pedersen, T. B.; Lindh, R.; Roos, B. O.; Sánchez de Merás, A.; Koch, H.\nJ. Chem. Phys. 2008, 129, 024113–8.\n(161) Kutzelnigg, W. J. Chem. Phys. 2006, 125, 171101.\n(162) Simmonett, A. C.; Wilke, J. J.; Schaefer, H. F.; Kutzelnigg, W. J. Chem. Phys. 2010,\n133, 174122.\n(163) Sokolov, A. Y.; Simmonett, A. C.; Schaefer, H. F. J. Chem. Phys. 2013, 138, 024107–\n024107–9.\n(164) Sokolov, A. Y.; Schaefer, H. F. J. Chem. Phys. 2013, 139, 204110.\n(165) Sokolov, A. Y.; Schaefer, H. F.; Kutzelnigg, W. J. Chem. Phys. 2014, 141, 074111.\n(166) Copan, A. V.; Sokolov, A. Y.; Schaefer, H. F. J. Chem. Theory Comput. 2014, 10,\n2389–2398.\n(167) Mullinax, J. W.; Sokolov, A. Y.; Schaefer, H. F. J. Chem. Theory Comput. 2015, 11,\n2487–2495.\n(168) Sokolov, A. Y.; Wilke, J. J.; Simmonett, A. C.; Schaefer, H. F. J. Chem. Phys. 2012,\n137, 054105–054105–7.\n(169) Wang, X.; Sokolov, A. Y.; Turney, J. M.; Schaefer, H. F. J. Chem. Theory Comput.\n2016, 12, 4833–4842.\n(170) Trofimov, A. B.; Krivdina, I. L.; Weller, J.; Schirmer, J. Chem. Phys. 2006, 329, 1–10.\n(171) Saitow, M.; Mochizuki, Y. Chem. Phys. Lett. 2012, 525, 144–149.\n(172) Besalu, E.; Bofill, J. M. Theor. Chem. Acc. 1998, 100, 265–274\n(173) Banerjee, A.; Adams, N.; Simons, J.; Shepard, R. J. Phys. Chem. 1985, 89, 52–57.\n(174) Lindh, R.; Bernhardsson, A.; Karlstrøm, G.; Malmqvist, P.-Å. Chem. Phys. Lett.\n1995, 241, 423–428.\n(175) Carson, B. E.; Parker, T. M.; Hohenstein, E. G.; Brizius, G. L.; Komorner, W.;\nKing, R. A.; Collard, D. M.; Sherrill, C. D. Chem. Eur. J. 2015, 21, 19168–19175.\n(176) Dyall, K. G. J. Chem. Phys. 1997, 106, 9618–9626.\n(177) Dyall, K. G. J. Chem. Phys. 2001, 115, 9136–9143.\n(178) Kutzelnigg, W. Chem. Phys. 1997, 225, 203–222.\n(179) Kutzelnigg, W.; Liu, W. J. Chem. Phys. 2005, 123, 241102.\n(180) Kutzelnigg, W.; Liu, W. Mol. Phys. 2006, 104, 2225–2240.\n(181) Liu, W.; Kutzelnigg, W. J. Chem. Phys. 2007, 126, 114107.\n(182) Liu, W.; Peng, D. J. Chem. Phys. 2009, 131, 031104.\n(183) Iliaš, M.; Saue, T. J. Chem. Phys. 2007, 126, 064102.\n(184) Zou, W.; Filatov, M.; Cremer, D. J. Chem. Phys. 2011, 134, 244117.\n(185) Cheng, L.; Gauss, J. J. Chem. Phys. 2011, 135, 084114.\n(186) Foldy, L. L.; Wouthuysen, S. A. Phys. Rev. 1950, 78, 29–36.\n(187) Evangelista, F. A.; Shushkov, P.; Tully, J. C. J. Phys. Chem. A 2013, 117, 7378–7392.\n(188) Verma, P.; Derricotte, W. D.; Evangelista, F. A. J. Chem. Theory Comput. 2016, 12,\n144–156.\n(189) Psi4 Manual. http://psicode.org/psi4manual/master/index.html (accessed May\n8, 2017)."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Psi4 1.1: An Open-Source Electronic Structure Program Emphasizing Automation, Advanced Libraries, and Interoperability\nRobert M. Parrish, Lori A. Burns, Daniel G. A. Smith, Andrew C. Simmonett, A. Eugene DePrince, Edward G. Hohenstein, Ugur Bozkaya, Alexander Yu. Sokolov, Roberto Di Remigio, Ryan Matthew Richard, Jérôme F Gonthier, Andrew M. James, Harley R. McAlexander, Ashutosh Kumar, Masaaki Saitow, Xiao Wang, Benjamin P. Pritchard, Prakash Verma, Henry F. Schaefer, Konrad Patkowski, Rollin A. King, Edward F. Valeev, Francesco A Evangelista, Justin M. Turney, T. Daniel Crawford, and C. David Sherrill\nJournal of Chemical Theory and Computation Just Accepted Manuscript\nDOI: 10.1021/acs.jctc.7b00174","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"ACI-1147843"},{"agency":"NSF","grant_number":"CHE-1300497"},{"agency":"NSF","grant_number":"CHE-1351978"},{"agency":"NSF","grant_number":"CHE-1361178"},{"agency":"NSF","grant_number":"ACI-1449723"},{"agency":"NSF","grant_number":"ACI-1450169"},{"agency":"NSF","grant_number":"ACI-1465149"},{"agency":"NSF","grant_number":"CHE-1566192"},{"agency":"NSF","grant_number":"ACI-1609842"},{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0015512"},{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0016004"},{"agency":"Department of Defense HPCMP Applications Software Initiative","grant_number":""},{"agency":"Türkiye Bilimsel ve Teknolojik Araştırma Kurumu (TÜBİTAK)","grant_number":"114Z786"},{"agency":"European Cooperation in Science and Technology","grant_number":"CM1405"},{"agency":"Research Council of Norway","grant_number":"179568/V30"},{"agency":"Swiss National Science Foundation (SNSF)","grant_number":"P2ELP2_155351"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}