{"title":"Finite Temperature Density Matrix Embedding Theory","uri":"","abstract":"Density Matrix Embedding Theory (DMET) provides a powerful and less expensive framework to treat strongly correlated ground-state problems in both solids and molecules, by reproducing the entanglement between the fragment and its environment at mean-field level, while the fragment is treated at a more accurate level. In this talk, I will extend the ground-state DMET to finite temperature DMET (FT-DMET), by solving both the mean-field problem and impurity problem at finite temperature T, and reconstructing bath orbitals from the mean-field solution. The finite temperature Lanczos algorithm as an alternative of full configuration interaction (FCI) is used to implement the impurity solver, and a cutoff is introduced to the selection of bath orbitals from the mixed mean-field solution. We assess the performance of FT-DMET by several benchmark calculations on both molecules and lattices. The results are compared to other well-established finite temperature methods, such as quantum Monte Carlo (QMC), dynamical mean-field theory (DMFT), and so forth.","documents":null,"note":"","id":77455,"rev_number":5,"userid":5227,"eprint_dir":"disk0/00/07/74/55","datestamp":"2017-05-16 02:30:01","lastmod":"2017-05-16 02:30:01","status_changed":"2017-05-16 02:30:01","type":"conference_item","metadata_visibility":"show","creators":[{"given":"Chong","family":"Sun","id":"Sun-Chong","orcid":""},{"given":"Garnet","family":"Chan","id":"Chan-Garnet-K-L","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-03-17","date_type":"published","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170515-115731063","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170515-115731063","related_url":[{"url":"http://meetings.aps.org/Meeting/MAR17/Session/X20.2","type":"pub","description":"Abstract"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}