{"title":"Towards the solution of the many-electron problem in real materials: equation of state of the hydrogen chain with state-of-the-art many-body methods","uri":"","abstract":"We present numerical results for the equation of state of an infinite chain of hydrogen atoms. A variety of modern many-body methods are employed, with exhaustive cross-checks and validation. Approaches for reaching the continuous space limit and the thermodynamic limit are investigated, proposed, and tested. The detailed comparisons provide a benchmark for assessing the current state of the art in many-body computation, and for the development of new methods. The ground-state energy per atom in the linear chain is accurately determined versus bondlength, with a confidence bound given on all uncertainties.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252213","docid":252213,"rev_number":4,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257397","fileid":1257397,"datasetid":"document","objectid":252213,"filename":"1705.01608.pdf","mime_type":"application/pdf","hash":"7a313186e92e20a592707d5e23dbe32f","hash_type":"MD5","filesize":835260,"mtime":"2017-05-15 18:48:38","url":"http://authors.library.caltech.edu/77450/1/1705.01608.pdf"}],"eprintid":77450,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1705.01608.pdf","content":"submitted"}],"note":"We gratefully acknowledge the Simons Foundation for funding. We thank E. Kozik, H. Krakauer, M. van Schilfgaarde, H. Shi, B. Svistunov and N. Tubman for valuable interactions. Support from NSF (Grant no. DMR-1409510) is acknowledged for method development work at William \u0026 Mary. F. M. was also supported by DOE (Grant no. de-sc0001303). The work at the California Institute of Technology was supported by the Department of Energy, through doe-sc0008624. G. K.-L. C. is a Simons Investigator. The work at Rice University was supported by Grant No. NSF-CHE-1462434. J. A. G. acknowledges support from the National Science Foundation Graduate Research Fellowship Program (DGE-1450681). G. E. S. is a Welch Foundation Chair (C-0036). I. S. T. and N. V. P. acknowledge NFS under the grant PHY-1314735. S. S. acknowledges computational resources provided through the HPCI System Research Project (Nos. hp160126) on the HOKUSAI GreatWave computer under project G16026. S. R. W. and E. M. S. acknowledge support from the U. S. Department of Energy, Office of Science, Basic Energy Sciences under award #DE-SC008696. E. G. was also supported by DOE Grant No. ER 46932, J. L. by NSF DMR 1606348, and computer resources were provided by TGDMR130036. D. Z. and T. N. L. were also supported from DOE Grant no. ER16391.","id":77450,"rev_number":9,"userid":5227,"eprint_dir":"disk0/00/07/74/50","datestamp":"2017-05-16 02:39:06","lastmod":"2017-05-16 02:39:06","status_changed":"2017-05-16 02:39:06","type":"monograph","metadata_visibility":"show","creators":[{"given":"Mario","family":"Motta","id":"Motta-M","orcid":""},{"given":"David M.","family":"Ceperley","id":"Ceperley-D-M","orcid":""},{"given":"Garnet Kin-Lic","family":"Chan","id":"Chan-Garnet-K-L","orcid":""},{"given":"John A.","family":"Gomez","id":"Gomez-J-A","orcid":""},{"given":"Emanuel","family":"Gull","id":"Gull-E","orcid":""},{"given":"Sheng","family":"Guo","id":"Guo-Sheng","orcid":""},{"given":"Carlos","family":"Jiménez-Hoyos","id":"Jiménez-Hoyos-C-A","orcid":""},{"given":"Tran Nguyen","family":"Lan","id":"Lan-Tran-Nguyen","orcid":""},{"given":"Jia","family":"Li","id":"Li-Jia","orcid":""},{"given":"Fengjie","family":"Ma","id":"Ma-Fengjie","orcid":""},{"given":"Andrew J.","family":"Millis","id":"Millis-A-J","orcid":""},{"given":"Nikolay V.","family":"Prokof'ev","id":"Prokof'ev-N-V","orcid":""},{"given":"Ushnish","family":"Ray","id":"Ray-U","orcid":""},{"given":"Gustavo E.","family":"Scuseria","id":"Scuseria-G-E","orcid":""},{"given":"Sandro","family":"Sorella","id":"Sorella-S","orcid":""},{"given":"Edwin M.","family":"Stoudenmire","id":"Stoudenmire-E-M","orcid":""},{"given":"Qiming","family":"Sun","id":"Sun-Qiming","orcid":""},{"given":"Igor S.","family":"Tupitsyn","id":"Tupitsyn-I-S","orcid":""},{"given":"Steven R.","family":"White","id":"White-S-R","orcid":""},{"given":"Dominika","family":"Zgid","id":"Zgid-D","orcid":""},{"given":"Shiwei","family":"Zhang","id":"Zhang-Shiwei","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-01","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170515-110107095","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170515-110107095","related_url":[{"url":"http://arxiv.org/abs/1705.01608","type":"arxiv","description":"Article"}],"referencetext":["[1] P. A. M. Dirac, “Quantum mechanics of many-electron systems,” Proceedings of the Royal Society of London A: Mathematical, Physical and Engineering Sciences, vol. 123, no. 792, pp. 714–733, 1929.\n[2] J. P. F. LeBlanc, A. E. Antipov, F. Becca, I. W. Bulik, G. K.-L. Chan, C.-M. Chung, Y. Deng, M. Ferrero, T. M. Henderson, C. A. Jiménez-Hoyos, E. Kozik, X.-W. Liu, A. J. Millis, N. V. Prokof’ev, M. Qin, G. E. Scuseria, H. Shi, B. V. Svistunov, L. F. Tocchio, I. S. Tupitsyn, S. R. White, S. Zhang, B.-X. Zheng, Z. Zhu, and E. Gull, “Solutions of the two-dimensional Hubbard model: Benchmarks and results from a wide range of numerical algorithms,” Physical Review X, vol. 5, p. 041041, Dec 2015.\n[3] B.-X. Zheng, C.-M. Chung, P. Corboz, G. Ehlers, R. M. Noack, H. Shi, S. R. White, S. Zhang, and G. K.-L. Chan, “Stripe order in the underdoped region of the two-dimensional Hubbard model,” arXiv:1701.00054, 2017.\n[4] J. Hachmann, W. Cardoen, and G. K.-L. Chan, “Multireference correlation in long molecules with the quadratic scaling density matrix renormalization group,” The Journal of Chemical Physics, vol. 125, no. 14, p. 144101, 2006.\n[5] W. A. Al-Saidi, S. Zhang, and H. Krakauer, “Bond breaking with auxiliary-field quantum Monte Carlo,” The Journal of Chemical Physics, vol. 127, no. 14, p. 144101, 2007.\n[6] T. Tsuchimochi and G. E. Scuseria, “Strong correlations via constrained-pairing mean-field theory,” The Journal of Chemical Physics, vol. 131, no. 12, p. 121102, 2009.\n[7] A. V. Sinitskiy, L. Greenman, and D. A. Mazziotti, “Strong correlation in Hydrogen chains and lattices using the variational two-electron reduced density matrix method,” The Journal of Chemical Physics, vol. 133, no. 1, p. 014104, 2010.\n[8] D. A. Mazziotti, “Large-scale semidefinite programming for many-electron quantum mechanics,” Physical Review Letters, vol. 106, p. 083001, Feb 2011.\n[9] N. Lin, C. A. Marianetti, A. J. Millis, and D. R. Reichman, “Dynamical mean-field theory for quantum Chemistry,” Physical Review Letters, vol. 106, p. 096402, Mar 2011.\n[10] L. Stella, C. Attaccalite, S. Sorella, and A. Rubio, “Strong electronic correlation in the Hydrogen chain: A variational Monte Carlo study,” Physical Review B, vol. 84, p. 245117, Dec 2011.\n[11] M. Motta et al, “Github repository (link to be finalized).”\n[12] W. Kutzelnigg, “R12-dependent terms in the wave function as closed sums of partial wave amplitudes for large l,” Theoretica Chimica Acta, vol. 68, no. 6, pp. 445–469, 1985.\n[13] L. Kong and E. F. Valeev, “Perturbative correction for the basis set incompleteness error of complete-activespace self-consistent field,” The Journal of Chemical Physics, vol. 133, no. 17, p. 174126, 2010.\n[14] R. Blankenbecler, D. J. Scalapino, and R. L. Sugar, “Monte Carlo calculations of coupled boson-fermion systems. I,” Physical Review D, vol. 24, pp. 2278–2286, Oct 1981.\n[15] S. Zhang, J. Carlson, and J. E. Gubernatis, “Constrained path Monte Carlo method for fermion ground states,” Physical Review B, vol. 55, pp. 7464–7477, Mar 1997.\n[16] S. Zhang and H. Krakauer, “Quantum Monte Carlo method using phase-free random walks with Slater determinants,” Physical Review Letters, vol. 90, p. 136401, Apr 2003.\n[17] K. Van Houcke, E. Kozik, N. Prokof’ev, and B. Svistunov, “Diagrammatic Monte Carlo,” Physics Procedia, vol. 6, p. 95, 2010.\n[18] S. A. Kulagin, N. Prokof’ev, O. A. Starykh, B. Svistunov, and C. N. Varney, “Bold diagrammatic Monte Carlo method applied to fermionized frustrated spins,” Physical Review Letters, vol. 110, p. 070601, Feb 2013.\n[19] I. S. Tupitsyn, A. S. Mishchenko, N. Nagaosa, and N. Prokof’ev, “Coulomb and electron-phonon interactions in metals,” Physical Review B, vol. 94, p. 155145, Oct 2016.\n[20] G. Knizia and G. K.-L. Chan, “Density matrix embedding: A simple alternative to dynamical mean-field theory,” Physical Review Letters, vol. 109, p. 186404, 2012. \n[21] G. Knizia and G. K.-L. Chan, “Density matrix embedding: A strong-coupling quantum embedding theory,” Journal of Chemical Theory and Computation, vol. 9, pp. 1428–1432, 2013.\n[22] S. Wouters, C. A. Jimenez-Hoyos, Q. Sun, and G. K.-L. Chan, “A practical guide to density matrix embedding theory in quantum Chemistry,” Journal of Chemical Theory and Computation, vol. 12, no. 6, pp. 2706–2719, 2016. PMID: 27159268.\n[23] S. R. White, “Density matrix formulation for quantum renormalization groups,” Physical Review Letters, vol. 69, no. 19, p. 2863, 1992.\n[24] S. R. White and R. L. Martin, “Ab initio quantum Chemistry using the density matrix renormalization group,” The Journal of Chemical Physics, vol. 110, no. 9, pp. 4127–4130, 1999.\n[25] G. K.-L. Chan and M. Head-Gordon, “Highly correlated calculations with a polynomial cost algorithm: A study of the density matrix renormalization group,” The Journal of Chemical Physics, vol. 116, no. 11, pp. 4462–4476, 2002.\n[26] G. K.-L. Chan, A. Keselman, N. Nakatani, Z. Li, and S. R. White, “Matrix product operators, matrix product states, and ab initio density matrix renormalization group algorithms,” The Journal of Chemical Physics, vol. 145, no. 1, p. 014102, 2016.\n[27] J. J. Phillips and D. Zgid, “Communication: The description of strong correlation within self-consistent Green’s function second-order perturbation theory,” The Journal of Chemical Physics, vol. 140, no. 24, p. 241101, 2014.\n[28] A. A. Rusakov and D. Zgid, “Self-consistent secondorder Green’s function perturbation theory for periodic systems,” The Journal of Chemical Physics, vol. 144, no. 5, p. 054106, 2016.\n[29] J. J. Phillips, A. A. Kananenka, and D. Zgid, “Fractional charge and spin errors in self-consistent Green’s function theory,” The Journal of Chemical Physics, vol. 142, no. 19, p. 194108, 2015.\n[30] A. R. Welden, A. A. Rusakov, and D. Zgid, “Exploring connections between statistical mechanics and Green’s functions for realistic systems. temperature dependent electronic entropy and internal energy from a self-consistent second-order Green’s function,” The\nJournal of Chemical Physics, vol. 145, p. 204106, 2016.\n[31] N. E. Dahlen and U. von Barth, “Variational energy functionals tested on atoms,” Physical Review B, vol. 69, p. 195102, May 2004.\n[32] N. E. Dahlen and U. von Barth, “Variational second-order Møller-Plesset theory based on the Luttinger-Ward functional,” The Journal of Chemical Physics, vol. 120, no. 15, pp. 6826–6831, 2004.\n[33] M. Casula, C. Filippi, and S. Sorella, “Diffusion Monte Carlo method with lattice regularization,” Physical Review Letters, vol. 95, p. 100201, Sep 2005.\n[34] P. Reynolds, D. Ceperley, B. Alder, and J. Lester, “Fixed-node quantum Monte Carlo for molecules,” The Journal of Chemical Physics, vol. 77, pp. 5593–5603, 1982.\n[35] H.-J. Werner and P. J. Knowles, “An efficient internally contracted multiconfiguration-reference configuration interaction method,” The Journal of Chemical Physics, vol. 89, no. 9, pp. 5803–5814, 1988.\n[36] P. J. Knowles and H.-J. Werner, “An efficient method for the evaluation of coupling coefficients in configuration interaction calculations,” Chemical Physics Letters, vol. 145, no. 6, pp. 514–522, 1988.\n[37] C. Angeli, M. Pastore, and R. Cimiraglia, “New perspectives in multireference perturbation theory: the N-electron valence state approach,” Theoretical Chemistry Accounts: Theory, Computation, and Modeling (Theoretica Chimica Acta), vol. 117, no. 5, pp. 743–754, 2007.\n[38] J. Paldus and X. Li, “A critical assessment of coupled cluster method in quantum Chemistry,” Advances in Chemical Physics, vol. 110, p. 1, 1999.\n[39] R. J. Bartlett and M. Musial, “Coupled-cluster theory in quantum Chemistry,” Reviews of Modern Physics, vol. 79, p. 291, February 2007.\n[40] I. Shavitt and R. J. Bartlett, Many-Body Methods in Chemistry and Physics. New York: Cambridge University Press, 2009.\n[41] C. C. J. Roothaan, “Self-consistent field theory for open shells of electronic systems,” Rev. Mod. Phys., vol. 32, pp. 179–185, Apr 1960.\n[42] E. Stoudenmire and S. R. White, “Sliced basis density matrix renormalization group for electronic structure,” arXiv:1702.03650, 2017.\n[43] C.-O. Almbladh, U. V. Barth, and R. V. Leeuwen, “Variational total energies from Φ-and Ψ-derivable theories,” International Journal of Modern Physics B, vol. 13, no. 05n06, pp. 535–541, 1999.\n[44] A. Stan, N. E. Dahlen, and R. van Leeuwen, “Fully self-consistent GW calculations for atoms and molecules,” EPL (Europhysics Letters), vol. 76, no. 2, p. 298, 2006.\n[45] A. Stan, N. E. Dahlen, and R. van Leeuwen, “Levels of self–consistency in the GW approximation,” The Journal of Chemical Physics, vol. 130, no. 11, p. 114105, 2009.\n[46] A. A. Kananenka, E. Gull, and D. Zgid, “Systematically improvable multiscale solver for correlated electron systems,” Physical Review B, vol. 91, no. 12, p. 121111, 2015.\n[47] T. N. Lan, A. A. Kananenka, and D. Zgid, “Communication: Towards ab initio self-energy embedding theory in quantum Chemistry,” The Journal of Chemical Physics, vol. 143, no. 24, p. 241102, 2015.\n[48] T. Nguyen Lan, A. A. Kananenka, and D. Zgid, “Rigorous ab initio quantum embedding for quantum Chemistry using Green’s function theory: Screened interaction, nonlocal self-energy relaxation, orbital basis, and chemical accuracy,” Journal of Chemical Theory and Computation, vol. 12, no. 10, pp. 4856–4870, 2016.\n[49] D. Zgid and E. Gull, “Finite temperature quantum embedding theories for correlated systems,” New Journal of Physics, vol. 19, no. 2, p. 023047, 2017.\n[50] T. N. Lan and D. Zgid, “Generalized self-energy embedding theory,” arXiv:1703.06981, 2017.\n[51] J. A. Pople and R. K. Nesbet, “Self-consistent orbitals for radicals,” The Journal of Chemical Physics, vol. 22, no. 3, pp. 571–572, 1954.\n[52] W. L. McMillan, “Ground state of liquid He4,” Physical Reviews, vol. 138, pp. A442–A451, Apr 1965.\n[53] D. Ceperley, G. V. Chester, and M. H. Kalos, “Monte carlo simulation of a many-fermion study,” Physical Review B, vol. 16, pp. 3081–3099, Oct 1977.\n[54] B.-X. Zheng, J. S. Kretchmer, H. Shi, S. Zhang, and G. K.-L. Chan, “Cluster size convergence of the density matrix embedding theory and its dynamical cluster formulation: A study with an auxiliary-field quantum Monte Carlo solver,” Physical Review B, vol. 95, p. 045103, Jan 2017.\n[55] T. H. D. Jr., “Gaussian basis sets for use in correlated molecular calculations. I. the atoms Boron through Neon and Hydrogen,” The Journal of Chemical Physics, vol. 90, no. 2, pp. 1007–1023, 1989.\n[56] D. Feller, “Application of systematic sequences of wave functions to the water dimer,” The Journal of Chemical Physics, vol. 96, no. 8, pp. 6104–6114, 1992. \n[57] T. Helgaker, W. Klopper, H. Koch, and J. Noga, “Basisset convergence of correlated calculations on water,” The Journal of Chemical Physics, vol. 106, no. 23, pp. 9639–9646, 1997.\n[58] E. Stoudenmire and S. R. White, “Studying two-dimensional systems with the density matrix renormalization group,” Annual Review of Condensed Matter Physics, vol. 3, no. 1, pp. 111–128, 2012.\n[59] S. Chiesa, D. M. Ceperley, R. M. Martin, and M. Holzmann, “Finite-size error in many-body simulations with long-range interactions,” Physical Review Letters, vol. 97, p. 076404, Aug 2006.\n[60] G. D. Purvis III and R. J. Bartlett, “A full coupled-cluster singles and doubles model: The inclusion of disconnected triples,” The Journal of Chemical Physics, vol. 76, p. 1910, 1982.\n[61] G. E. Scuseria, A. C. Scheiner, T. J. Lee, J. E. Rice, and H. F. Schaefer III, “The closed-shell coupled cluster single and double excitation (CCSD) model for the description of electron correlation. a comparison with configuration interaction (CISD) results,” The Journal of Chemical Physics, vol. 86, p. 2881, 1987.\n[62] J. A. Pople, M. Head-Gordon, and K. Rghavachari, “Quadratic configuration interaction. A general technique for determining electron correlation energies,” The Journal of Chemical Physics, vol. 87, p. 5968, 1987.\n[63] M. Frisch, G. W. Trucks, H. B. Schlegel, G. E. Scuseria, et al., Gaussian 09, Revision D.01. Wallingford, CT: Gaussian, Inc., 2013.\n[64] H. Koch, O. Christiansen, R. Kobayashi, P. Jorgensen, and T. Helgaker, “A direct atomic orbital driven implementation of the coupled cluster singles and doubles (ccsd) model,” Chemical Physics Letters, vol. 228, no. 1-3, pp. 233–238, 1994.\n[65] S. Wouters and D. Van Neck, “The density matrix renormalization group for ab initio quantum chemistry,” The European Physical Journal D, vol. 68, no. 9, p. 272, 2014.\n[66] R. Olivares-Amaya, W. Hu, N. Nakatani, S. Sharma, J. Yang, and G. K.-L. Chan, “The ab-initio density matrix renormalization group in practice,” The Journal of Chemical Physics, vol. 142, no. 3, p. 034102, 2015.\n[67] G. Barcza, Ö. Legeza, K. H. Marti, and M. Reiher, “Quantum-information analysis of electronic states of different molecular structures,” Physical Review A, vol. 83, no. 1, p. 012508, 2011.\n[68] H.-J. Werner, P. J. Knowles, G. Knizia, F. R. Manby, and M. Schütz, “Molpro: a general-purpose quantum Chemistry program package,” Wiley Interdisciplinary Reviews: Computational Molecular Science, vol. 2, no. 2, pp. 242–253, 2012.\n[69] T. Shiozaki, G. Knizia, and H.-J. Werner, “Explicitly correlated multireference configuration interaction: MRCI-F12,” The Journal of Chemical Physics, vol. 134, no. 3, p. 034113, 2011.\n[70] T. Shiozaki and H.-J. Werner, “Multireference explicitly correlated F12 theories,” Molecular Physics, vol. 111, no. 5, pp. 607–630, 2013.\n[71] T. Shiozaki and H.-J. Werner, “Explicitly correlated multireference configuration interaction with multiple reference functions: Avoided crossings and conical intersections,” The Journal of Chemical Physics, vol. 134, no. 18, p. 184104, 2011.\n[72] K. G. Dyall, “The choice of a zeroth-order Hamiltonian for second-order perturbation theory with a complete active space self-consistent-field reference function,” The Journal of Chemical Physics, vol. 102, no. 12, pp. 4909–4918, 1995.\n[73] S. Guo, M. A. Watson, W. Hu, Q. Sun, and G. K.-L. Chan, “N-electron valence state perturbation theory based on a density matrix renormalization group reference function, with applications to the Chromium dimer and a trimer model of poly (p-phenylenevinylene),” Journal of Chemical Theory and Computation, vol. 12, no. 4, pp. 1583–1591, 2016.\n[74] S. Sharma and G. Chan, “Communication: A flexible multi-reference perturbation theory by minimizing the Hylleraas functional with matrix product states.,” The Journal of Chemical Physics, vol. 141, no. 11, pp. 111101–111101, 2014.\n[75] S. Sharma, G. Knizia, S. Guo, and A. Alavi, “Combining internally contracted states and matrix product states to perform multireference perturbation theory,” Journal of Chemical Theory and Computation, 2017.\n[76] R. L. Stratonovich, “On a method of calculating quantum distribution functions,” Soviet Physics Doklady, vol. 2, p. 416, July 1957.\n[77] J. Hubbard, “Calculation of partition functions,” Physical Review Letters, vol. 3, pp. 77–78, Jul 1959.\n[78] S. Zhang, Auxiliary-Field Quantum Monte Carlo for Correlated Electron Systems. Forschungszentrum Jülich, Inst. for Advanced Simulation, 2013.\n[79] M. Qin, H. Shi, and S. Zhang, “Coupling quantum Monte Carlo and independent-particle calculations: Self-consistent constraint for the sign problem based on the density or the density matrix,” Physical Review B, vol. 94, p. 235119, Dec 2016.\n[80] W. Purwanto, H. Krakauer, and S. Zhang, “Pressure-induced diamond to β-tin transition in bulk Silicon: A quantum Monte Carlo study,” Physical Review B, vol. 80, p. 214116, Dec 2009.\n[81] Y. Virgus, W. Purwanto, H. Krakauer, and S. Zhang, “Stability, energetics, and magnetic states of Cobalt adatoms on graphene,” Physical Review Letters, vol. 113, p. 175502, Oct 2014.\n[82] W. Purwanto, S. Zhang, and H. Krakauer, “Excited state calculations using phaseless auxiliary-field quantum Monte Carlo: Potential energy curves of low-lying C2 singlet states,” The Journal of Chemical Physics, vol. 130, no. 9, p. 094107, 2009.\n[83] F. Ma, S. Zhang, and H. Krakauer, “Auxiliary-field quantum monte carlo calculations with multiple-projector pseudopotentials,” Phys. Rev. B, vol. 95, p. 165103, Apr 2017.\n[84] W. A. Al-Saidi, S. Zhang, and H. Krakauer, “Auxiliary-field quantum Monte Carlo calculations of molecular systems with a Gaussian basis,” The Journal of Chemical Physics, vol. 124, no. 22, p. 224101, 2006.\n[85] F. Ma, W. Purwanto, S. Zhang, and H. Krakauer, “Quantum Monte Carlo calculations in solids with downfolded Hamiltonians,” Physical Review Letters, vol. 114, p. 226401, Jun 2015.\n[86] W. Purwanto, H. Krakauer, Y. Virgus, and S. Zhang, “Assessing weak Hydrogen binding on Ca+ centers: An accurate many-body study with large basis sets,” The Journal of Chemical Physics, vol. 135, no. 16, p. 164105, 2011.\n[87] M. Casula, S. Moroni, S. Sorella, and C. Filippi, “Size-consistent variational approaches to nonlocal pseudopotentials: Standard and lattice regularized diffusion Monte Carlo methods revisited,” The Journal of Chemical Physics, vol. 132, no. 15, p. 154113, 2010.\n[88] S. Sorella, “TurboRVB quantum Monte Carlo package.”\n[89] R. Dovesi, R. Orlando, A. Erba, C. M. Zicovich-Wilson, B. Civalleri, S. Casassa, L. Maschio, M. Ferrabone, M. D. L. Pierre, P. D’Arco, Y. Noel, M. Causa, M. Rerat, and B. Kirtman, “CRYSTAL14: A program for the ab initio investigation of crystalline solids,” International Journal of Quantum Chemistry, vol. 114, p. 1287, 2014.\n[90] A. Zen, Y. Luo, S. Sorella, and L. Guidoni, “Molecular properties by quantum Monte Carlo: An investigation on the role of the wave function Ansatz and the basis set in the water molecule,” Journal of Chemical Theory and Computation, vol. 9, pp. 4332–4350, Oct. 2013.\n[91] M. Marchi, S. Azadi, M. Casula, and S. Sorella, “Resonating valence bond wave function with molecular orbitals: Application to first-row molecules,” The Journal of Chemical Physics, vol. 131, no. 15, p. 154116, 2009.\n[92] G. Knizia, “Intrinsic atomic orbitals: An unbiased bridge between quantum theory and chemical concepts,” Journal of Chemical Theory and Computation, vol. 9, pp. 4834–4843, 2013.\n[93] S. Wouters, C. A. Jiménez-Hoyos, Q. Sun, and G. K.-L. Chan, “A practical guide to density matrix embedding theory in quantum Chemistry,” Journal of Chemical Theory and Computation, vol. 12, pp. 2706–2719, 2016.\n[94] L. Hedin, “New method for calculating the one-particle Green’s function with application to the electron-gas problem,” Physical Review, vol. 139, pp. A796–A823, Aug 1965.\n[95] A. A. Rusakov, J. J. Phillips, and D. Zgid, “Local Hamiltonians for quantitative Green’s function embedding methods,” The Journal of Chemical Physics, vol. 141, no. 19, p. 194105, 2014.\n[96] A. A. Kananenka, A. R. Welden, T. N. Lan, E. Gull, and D. Zgid, “Efficient temperature-dependent Green’s function methods for realistic systems: Using cubic spline interpolation to approximate Matsubara Green’s functions,” Journal of Chemical Theory and Computation, vol. 12, no. 5, pp. 2250–2259, 2016.\n[97] L. Hedin, “New method for calculating the one-particle Green’s function with application to the electron-gas problem,” Physical Review, vol. 139, pp. A796–A823, Aug 1965.\n[98] J. M. Luttinger and J. C. Ward, “Ground-state energy of a many-fermion system. II,” Physical Review, vol. 118, pp. 1417–1427, Jun 1960.\n[99] G. Baym, “Self-consistent approximations in many-body systems,” Physical Review, vol. 127, pp. 1391–1401, Aug 1962.\n[100] A. A. Kananenka, J. J. Phillips, and D. Zgid, “Efficient temperature-dependent Green’s functions methods for realistic systems: compact grids for orthogonal polynomial transforms,” Journal of Chemical Theory and Computation, 2016.\n[101] F. Caruso, P. Rinke, X. Ren, A. Rubio, and M. Scheffler, “Self-consistent GW: All-electron implementation with localized basis functions,” Physical Review B, vol. 88, p. 075105, Aug 2013.\n[102] A. Gaenko, A. E. Antipov, G. Carcassi, T. Chen, X. Chen, Q. Dong, L. Gamper, J. Gukelberger, R. Igarashi, S. Iskakov, M. Könz, J. P. F. LeBlanc, R. Levy, P. N. Ma, J. E. Paki, H. Shinaoka, S. Todo, M. Troyer, and E. Gull, “Updated Core Libraries of the ALPS Project,” ArXiv e-prints, Sept. 2016.\n[103] E. F. Valeev, “LIBINT: A library for the evaluation of molecular integrals of many-body operators over Gaussian functions (version 2.1.0).” http://libint.valeyev.net/, 2014.\n[104] N. Prokof’ev and B. Svistunov, “Bold diagrammatic Monte Carlo technique: When the sign problem is welcome,” Physical Review Letters, vol. 99, p. 250201, Dec 2007.\n[105] R. Rossi, “Determinant diagrammatic Monte Carlo in the thermodynamic limit,” arXiv:1612.05184, 2016.\n[106] R. Rossi, N. V. Prokof’ev, B. Svistunov, K. Van Houcke, and F. Werner, “Polynomial complexity despite the fermionic sign,” arXiv:1703.10141, 2017.\n[107] I. S. Tupitsyn and N. V. Prokof’ev, “Stability of Dirac liquids with strong Coulomb interaction,” Physical Review Letters, vol. 118, p. 026403, Jan 2017.\n[108] For R = 1.0 and 1.2 aB we performed fragment size extrapolations on H1200, which is not converged with respect to the full system size. Our extrapolated result includes a correction due to the full system size determined from calculations on larger systems with a fragment of size [22]."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"DMR-1409510"},{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0001303"},{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0008624"},{"agency":"Simons Foundation","grant_number":""},{"agency":"NSF","grant_number":"CHE-1462434"},{"agency":"NSF","grant_number":"DGE-1450681"},{"agency":"Robert A. Welch Foundation","grant_number":"C-0036"},{"agency":"NSF","grant_number":"PHY-1314735"},{"agency":"HPCI System Research Project","grant_number":"G16026"},{"agency":"Department of Energy (DOE)","grant_number":"DE-SC008696"},{"agency":"Department of Energy (DOE)","grant_number":"ER 46932"},{"agency":"NSF","grant_number":"DMR-1606348"},{"agency":"NSF","grant_number":"DMR-130036"},{"agency":"Department of Energy (DOE)","grant_number":"ER 16391"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}