{"title":"Smoothed Least-laxity-first Algorithm for EV Charging","uri":"","abstract":"We formulate EV charging as a feasibility problem that meets all EVs' energy demands before departure under charging rate constraints and total power constraint. We propose an online algorithm, the smoothed least-laxity-first (sLLF) algorithm, that decides on the current charging rates based on only the information up to the current time. We characterize the performance of the sLLF algorithm analytically and numerically. Numerical experiments with real-world data show that it has significantly higher rate of generating feasible EV charging than several other common EV charging algorithms.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252320","docid":252320,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258387","fileid":1258387,"datasetid":"document","objectid":252320,"filename":"p242-Nakahira.pdf","mime_type":"application/pdf","hash":"70d7de241f674807d6cec8581e8f691d","hash_type":"MD5","filesize":1387996,"mtime":"2017-05-16 22:05:32","url":"http://authors.library.caltech.edu/77462/1/p242-Nakahira.pdf"}],"eprintid":77462,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"p242-Nakahira.pdf","content":"published"}],"note":"© 2017 ACM.","id":77462,"rev_number":12,"userid":207,"eprint_dir":"disk0/00/07/74/62","datestamp":"2017-05-16 22:07:08","lastmod":"2017-05-16 22:07:08","status_changed":"2017-05-16 22:07:08","type":"book_section","metadata_visibility":"show","creators":[{"given":"Yorie","family":"Nakahira","id":"Nakahira-Yorie","orcid":""},{"given":"Niangjun","family":"Chen","id":"Chen-Niangjun","orcid":""},{"given":"Lijun","family":"Chen","id":"Chen-Lijun","orcid":""},{"given":"Steven H.","family":"Low","id":"Low-S-H","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Online algorithm, online feasibility, resource augmentation, electric vehicle charging","date":"2017-05","date_type":"published","publication":"","volume":"","number":"","pagerange":"242-251","id_number":"CaltechAUTHORS:20170515-140123828","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170515-140123828","related_url":[{"url":"https://doi.org/10.1145/3077839.3077864","type":"doi","description":"Article"},{"url":"http://dl.acm.org/citation.cfm?id=3077864","type":"pub","description":"Article"}],"referencetext":[" 1\n\t\nInternational Energy Agency. 2016. Global EV outlook 2016. https://www.iea.org/publications/freepublications/publication/Global_EV_Outlook_2016.pdf. (2016).\n  \t\n2\n\t\nRui Carvalho, Lubos Buzna, Richard Gibbens, and Frank Kelly. 2015. Congestion control in charging of electric vehicles. arXiv preprint arXiv:1501.06957 (2015).\n  \t\n3\n\t\nOptimal Online Adaptive Electric Vehicle Charging. Electric vehicle public charging-time vs. energy.\n  \t\n4\n\t\nNiangjun Chen, Chee Wei Tan, and Tony QS Quek. 2014. Electric vehicle charging in smart grid: Optimality and valley-filling algorithms. IEEE Journal of Selected Topics in Signal Processing 8, 6 (2014), 1073--1083.\n  \t\n5\n\t\nShiyao Chen, Yuting Ji, and Lang Tong. 2012. Large scale charging of electric vehicles. In 2012 IEEE Power and Energy Society General Meeting. IEEE, 1--9.\n  \t\n6\n\t\nRobert I Davis and Alan Burns. 2011. A survey of hard real-time scheduling for multiprocessor systems. ACM Computing Surveys (CSUR) 43, 4 (2011), 35.\n  \t\n7\n\t\nMichael L. Dertouzos and Aloysius K. Mok. 1989. Multiprocessor online scheduling of hard-real-time tasks. IEEE Transactions on software engineering 15, 12 (1989), 1497--1506.\n  \t\n8\n\t\nLingwen Gan, Ufuk Topcu, and Steven H Low. 2013. Optimal decentralized protocol for electric vehicle charging. IEEE Transactions on Power Systems 28, 2 (2013), 940--951.\n  \t\n9\n\t\nLingwen Gan, Adam Wierman, Ufuk Topcu, Niangjun Chen, and Steven H Low. 2013. Real-time deferrable load control: handling the uncertainties of renewable generation. In Proceedings of the fourth international conference on Future energy systems. ACM, 113--124.\n  \t\n10\n\t\nSungjin Im, Janardhan Kulkarni, and Kamesh Munagala. 2014. Competitive algorithms from competitive equilibria: non-clairvoyant scheduling under polyhedral constraints. In Proceedings of the 46th Annual ACM Symposium on Theory of Computing. ACM, 313--322.\n  \t\n11\n\t\nSungjin Im, Janardhan Kulkarni, Kamesh Munagala, and Kirk Pruhs. 2014. Selfish-migrate: A scalable algorithm for non-clairvoyantly scheduling heterogeneous processors. In Foundations of Computer Science (FOCS), 2014 IEEE 55th Annual Symposium on. IEEE, 531--540.\n  \t\n12\n\t\nBala Kalyanasundaram and Kirk Pruhs. 2000. Speed is as powerful as clairvoyance. Journal of the ACM (JACM) 47, 4 (2000), 617--643.\n  \t\n13\n\t\nFanxin Kong, Qiao Xiang, Linghe Kong, and Xue Liu. 2016. On-Line Event-Driven Scheduling for Electric Vehicle Charging via Park-and-Charge. In 2016 IEEE Real-Time Systems Symposium (RTSS)2016 IEEE. IEEE, 69--78.\n  \t\n14\n\t\nGeorge Lee, Ted Lee, Zhi Low, Steven H. Low, and Christine Ortega. 2016. Adaptive Charging Network for Electric Vehicles. In Proceedings of the IEEE Global Conference on Signal and Information Processing (GlobalSIP). Washington, DC.\n  \t\n15\n\t\nChung Laung Liu and James W Layland. 1973. Scheduling algorithms for multiprogramming in a hard-real-time environment. Journal of the ACM (JACM) 20, 1 (1973), 46--61.\n  \t\n16\n\t\nZhongjing Ma, Duncan Callaway, and Ian Hiskens. 2010. Decentralized charging control for large populations of plug-in electric vehicles. In 49th IEEE conference on decision and control (CDC). IEEE, 206--212.\n  \t\n17\n\t\nPhillips, Stein, Torng, and Wein. 2002. Optimal Time-Critical Scheduling via Resource Augmentation. Algorithmica 32, 2 (2002), 163--200. DOI:http://dx.doi.org/10.1007/s00453-001-0068-9\n  \t\n18\n\t\nPeter Richardson, Damian Flynn, and Andrew Keane. 2012. Local versus centralized charging strategies for electric vehicles in low voltage distribution systems. IEEE Transactions on Smart Grid 3, 2 (2012), 1020--1028.\n  \t\n19\n\t\nLui Sha, Tarek Abdelzaher, Karl-Erik Årzén, Anton Cervin, Theodore Baker, Alan Burns, Giorgio Buttazzo, Marco Caccamo, John Lehoczky, and Aloysius K Mok. 2004. Real time scheduling theory: A historical perspective. Real-time systems 28, 2--3 (2004), 101--155.\n  \t\n20\n\t\nJohn A. Stankovic, Krithi Ramamritham, and Marco Spuri. 1998. Deadline Scheduling for Real-Time Systems: EDF and Related Algorithms. Kluwer Academic Publishers, Norwell, MA, USA.\n  \t\n21\n\t\nJohn A Stankovic, Marco Spuri, Krithi Ramamritham, and Giorgio C Buttazzo. 2012. Deadline scheduling for real-time systems: EDF and related algorithms. Vol. 460. Springer Science \u0026 Business Media.\n  \t\n22\n\t\nSebastian Stein, Enrico Gerding, Valentin Robu, and Nicholas R. Jennings. 2012. A Model-based Online Mechanism with Pre-commitment and Its Application to Electric Vehicle Charging. In Proceedings of the 11th International Conference on Autonomous Agents and Multiagent Systems - Volume 2 (AAMAS '12). International Foundation for Autonomous Agents and Multiagent Systems, Richland, SC, 669--676. http://dl.acm.org/citation.cfm?id=2343776.2343792\n  \t\n23\n\t\nAnand Subramanian, Manuel J Garcia, Duncan S Callaway, Kameshwar Poolla, and Pravin Varaiya. 2013. Real-time scheduling of distributed resources. IEEE Transactions on Smart Grid 4, 4 (2013), 2122--2130.\n  \t\n24\n\t\nOlle Sundström and Carl Binding. 2010. Planning electric-drive vehicle charging under constrained grid conditions. In Power System Technology (POWERCON), 2010 International Conference on. IEEE, 1--6.\n  \t\n25\n\t\nPeter Whittle. 1988. Restless bandits: Activity allocation in a changing world. Journal of applied probability 25, A (1988), 287--298.\n  \t\n26\n\t\nZhe Yu, Yunjian Xu, and Lang Tong. 2016. Deadline Scheduling as Restless Bandits. arXiv preprint arXiv:1610.00399 (2016). "],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Yorie Nakahira, Niangjun Chen, Lijun Chen, and Steven H. Low. 2017. Smoothed Least-laxity-first Algorithm for EV Charging. In Proceedings of the Eighth International Conference on Future Energy Systems (e-Energy '17). ACM, New York, NY, USA, 242-251. DOI: https://doi.org/10.1145/3077839.3077864","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}