{"title":"Chain Epimerization during Propylene Polymerization with Metallocene Catalysts: Mechanistic Studies Using a Doubly Labeled Propylene","uri":"","abstract":"The mechanisms of chain epimerization during propylene polymerization with methylaluminoxane-activated rac-(EBTHI)ZrCl_2 and rac-(EBI)ZrCl_2 catalysts (EBTHI = ethylenebis(η^5-tetrahydroindenyl); EBI = ethylenebis(η^5-indenyl)) have been studied using specifically isotopically labeled propylene: CH_2═CD^(13)CH_3. These isospecific catalysts provide predominantly the expected [mmmm] pentads with [−CH_2CD^(13)CH_3-] repeating units (^(13)C NMR). Under relatively low propylene concentrations at 50 and 75 °C, where stereoerrors attributable to chain epimerization are prevalent, ^(13)C NMR spectra reveal ^(13)C-labeled methylene groups along the polymer main chain, together with [CD^(13)CH_3] units in [mmmr], [mmrr], and [mrrm] pentads and [CH^(13)CH_3] units in [mmmmmm] and [mmmmmr] heptads, as well as [mrrm] pentads. The isotopomeric regiomisplacements and stereoerrors are consistent with a mechanism involving β-D elimination, olefin rotation and enantiofacial interconversions, and insertion to a tertiary alkyl intermediate [Zr−C(CH_2D)(^(13)CH_3)P] (P = polymer chain), followed by the reverse steps to yield two stereoisomers of [Zr−CHDCH(^(13)CH_3)P] and [Zr−^(13)CH_2CH(CH_2D)P], as well as unrearranged [Zr−CH_2CD(^(13)CH_3)P]. The absence of observable [−CH2CH13CH2D−] in the [mrrm] pentad region of the ^(13)C NMR spectra provides evidence that an allyl/dihydrogen complex does not mediate chain epimerization.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252241","docid":252241,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257623","fileid":1257623,"datasetid":"document","objectid":252241,"filename":"ja0123296.pdf","mime_type":"application/pdf","hash":"59948eb69639901cd7a21894b86d43c2","hash_type":"MD5","filesize":143142,"mtime":"2017-05-15 22:50:17","url":"http://authors.library.caltech.edu/77469/1/ja0123296.pdf"}],"eprintid":77469,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"ja0123296.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252260","docid":252260,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257802","fileid":1257802,"datasetid":"document","objectid":252260,"filename":"ja0123296_s.pdf","mime_type":"application/pdf","hash":"1d582c4dd895f928084a38bbbbdea302","hash_type":"MD5","filesize":107638,"mtime":"2017-05-16 13:39:12","url":"http://authors.library.caltech.edu/77469/2/ja0123296_s.pdf"}],"eprintid":77469,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"ja0123296_s.pdf","content":"supplemental"}],"note":"© 2002 American Chemical Society. \n\nReceived 10 October 2001. Published online 20 February 2002. Published in print 1 March 2002. \n\nThis work has been funded by the USDOE Office of Basic Energy Sciences (Grant No. DE-FG03-88ER13431). We wish to gratefully acknowledge the expert assistance of Dr. Peter Green and Dr. Nathan Daleska with the GC-MS experiments.","id":77469,"rev_number":12,"userid":772,"eprint_dir":"disk0/00/07/74/69","datestamp":"2017-05-16 16:22:08","lastmod":"2017-05-16 16:22:08","status_changed":"2017-05-16 16:22:08","type":"article","metadata_visibility":"show","creators":[{"given":"Jeffrey C.","family":"Yoder","id":"Yoder-J-C","orcid":""},{"given":"John E.","family":"Bercaw","id":"Bercaw-J-E","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2002-03-20","date_type":"published","publication":"Journal of the American Chemical Society","volume":"124","number":"11","pagerange":"2548-2555","id_number":"CaltechAUTHORS:20170515-152616804","refereed":true,"issn":"0002-7863","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170515-152616804","related_url":[{"url":"http://dx.doi.org/10.1021/ja0123296","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/ja0123296","type":"pub","description":"Article"},{"url":"http://pubs.acs.org/doi/suppl/10.1021/ja0123296","type":"pub","description":"Supporting Information"}],"referencetext":["(a) Resconi, L.; Camurati, I.; Sudmeijer, O. Top. Catal. 1999, 7, 145.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Busico, V.; Cipullo, R. J. Am. Chem. Soc. 1994, 116, 9329.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Busico, V.; Cipullo, R. J. Organomet. Chem. 1995, 497, 113.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Resconi, L.; Fait, A.; Piemontesi, F.; Colonnesi, M.; Rychlicki, H.; Zeigler, R. Macromolecules 1995, 28, 6667.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (e) Jungling, S.; Mulhaupt, R.; Stehling, U.; Brintinger, H.-H.; Fischer, D.; Langhauser, F. J. Polym. Sci., Part A:  Polym. Chem. 1995, 33, 1305.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (f) Schneider, M. J.; Kaji, E.; Uozumi, T.; Soga, K. Macromol. Chem. Phys. 1997, 198, 2899.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (g) Moscardi, G.; Resconi, L.; Cavallo, L. Organometallics 2001, 20, 1918.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(2) (a) Shmulinson, M.; Galan-Fereres, M.; Lisovskii, A.; Nelkenbaum, E.; Semiat, R.; Eisen, M. S. Organometallics 2000, 19, 1208.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Volkis, V.; Shmulinson, M.; Avefbuj, C.; Lisovskii, A.; Edelmann, F. T.; Eisen, M. S. Organometallics 1998, 17, 3155.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(3) (a) Leclerc, M. K.; Brintzinger, H.-H. J. Am. Chem. Soc. 1995, 117, 1651.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Leclerc, M. K.; Brintzinger, H.-H. J. Am. Chem. Soc. 1996, 118, 9024.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(4) Busico, V.; Caporaso, L.; Cipullo, R.; Landriani, L.; Angelini, G.; Margonelli, A.; Segre, A. L. J. Am. Chem. Soc. 1996, 118, 2105.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(5) Busico, V.; Brita, D.; Caporaso, L.; Cipullo, R.; Vacatello, M. Macromolecules 1997, 30, 3971.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(6) Prosenc, M.-H.; Brintzinger, H.-H. Organometallics 1997, 16, 3889.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(7) Resconi, L. J. Mol. Catal., A 1999, 146, 167.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(8) (a) Karol, F. J.; Kao, S.-C.; Wasserman, E. P.; Brady, R. C. New J. Chem. 1997, 21, 797.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Wasserman, E.; Hsi, E.; Young, W.-T. Polym. Prepr. 1998, 39 (2), 45.OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Yoder, J. C. Ph.D. Thesis, California Institute of Technology, 2000.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(9) Abrams, M. B.; Yoder, J. C.; Loeber, C.; Day, M. W.; Bercaw, J. E. Organometallics 1999, 18, 1389.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nLieber, S.; Prosenc, M.-H.; Brintzinger, H.-H. Organometallics 2000, 19, 377.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(11) (a) Margl, P. M.; Woo, T. K.; Blöchl, P. E.; Ziegler, T. J. Am. Chem. Soc. 1998, 120, 2174.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Margl, P. M.; Woo, T. K.; Ziegler, T. Organometallics 1998, 17, 4997.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(12) Under these polymerization conditions the only operative chain termination pathway is β-H elimination which gives rise to equal amounts of vinyl and n-propyl chain end groups. Regioerror enchainments are exclusively of the 1,3-misinsertion type. Resonances were identified for those carbons expected to be 13C labeled for all of these groups (see Supporting Infromation). Integrations of the resonances due to vinyl and n-propyl end groups are of similar intensity as required. Signals observed for the terminal carbons of both the vinyl end group (δ 110 ppm) and the n-propyl end group (δ 14 ppm) are not shown in Figure 2. Assignments of the resonances are according to those described in the following:  (a) Rieger, B.; Reinmuth, A.; Röll, W.; Brintzinger, H. H. J. Mol. Catal. 1993, 82, 67. (b) Busico, V.; Cipullo, R.; Talarico, G.; Caporaso, L. Macromolecules 1998, 31, 2387.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(13) Another distinguishing feature of the two mechanisms concerns rearrangements that place deuterium in the (non-13C-labeled) methylene units along the main chain. Schemes 3 and 6 predict such, and Schemes 4 and 7 do not. 2H NMR spectra for this polymer and the others from Table 2 do display broad resonances at chemical shifts assignable to the anti (δ 1.27) and syn (δ 0.8) methylene deuteriums. However, these signals are not sufficiently well resolved from nearby methine and m diad methyl deuteriums to assign them as methylene deuteriums with confidence.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(14) Observation of a 1:1:1 triplet in the 13C NMR spectra of the poly(2-d-3-13C-propylene) samples could also arise from crossover of the terminally unsaturated polymer chain, i.e. by interchange of gem-olefins between zirconium−hydride units. While olefin crossover may seem a rather unlikely scenario, given the expected very low concentration of the olefin/hydride intermediates and the much higher reactivity toward a zirconium hydride expected for propylene vs a gem-disubstituted olefin. Since there is no evidence for a doubly labeled [13CH2D] methyl group, this is effectively a nonissue.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(15) It is likely that one of the three roughly equal intensity peaks in this region is due to natural abundance [−CH2CD13CH3-] units with correct stereochemistry. Unfortunately, the specific assignments of resonances in the methylene carbon region have not been made. See:  Busico, V.; Cipullo, R.; Monaco, G.; Vacatello, M.; Segre, A. L. Macromolecules 1997, 30, 6251.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(16) Ewen, J. A. J. Am. Chem. Soc. 1984, 106, 6355[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(17) As might be noted, the movement of deuterium into the methylene positions is consistent only with the tertiary alkyl mechanism (Schemes 3 and 6), and thus, the observation of an increase in these 2H NMR signals with increasing chain epimerization also argues against the allyl/H2 mechanism (Schemes 4 and 7). Unfortunately, the 2H NMR spectra were not sufficiently well resolved to unambiguously distinguish the methylene from the methyl signals.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(18) Peng, T.-S.; Gladysz, J. A. J. Am. Chem. Soc. 1992, 114, 4174.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(19) (a) Casey, C. P.; Lee, T.-Y.; Tunge, J. A.; Carpenetti, D. W., II. J. Am. Chem. Soc. 2001, 123, 10762.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Grubbs, R. H.; Coates, G. W. Acc. Chem. Res. 1996, 29, 85 and references therein.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Strazisar, S. A.; Wolczanski, P. T. J. Am. Chem. Soc. 2001, 123, 4728.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Chirik, P. J. Ph.D. Thesis, California Institute of Technology, 2000.OpenURL CALIFORNIA INST OF TECHNOLOGY (e) Margl, P.; Deng, L.; Ziegler, T. Organometallics 1998, 17, 933.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nBurger, B. J.; Bercaw, J. E. New Developments in the Synthesis, Manipulation, and Characterization of Organometallic Compounds; Wayda, A., Darensbourg, M. Y., Eds.; American Chemical Society:  Washington, DC, 1987; Vol. 357.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(21) Marvich, R. H.; Brintzinger, H. H. J. Am. Chem. Soc. 1971, 93, 2046.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(22) Buchwald, S. L.; Lamaire, S. J.; Nielsen, R. B.; Watson, B. T.; King, S. M. Tetrahedron Lett. 1987, 28, 3895."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Chain Epimerization during Propylene Polymerization with Metallocene Catalysts:  Mechanistic Studies Using a Doubly Labeled Propylene\nJeffrey C. Yoder and John E. Bercaw\nJournal of the American Chemical Society 2002 124 (11), 2548-2555\nDOI: 10.1021/ja0123296","other_numbering_system":null,"funders":[{"agency":"Department of Energy (DOE)","grant_number":"DE-FG03-88ER13431"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}