{"title":"Syntheses and Properties of Two-Dimensional Charged Nonlinear Optical Chromophores Incorporating Redox-Switchable cis-Tetraammineruthenium(II) Centers","uri":"","abstract":"In this article, we describe a series of new complex salts in which electron-donating cis-{Ru^(II)(NH_3)_4}^(2+) centers are connected to two electron-accepting N-methyl/aryl-pyridinium groups. These V-shaped complexes contain either monodentate 4,4‘-bipyridyl-derived ligands or related chelates based on 2,2‘:4,4‘ ‘:4‘,4‘ ‘‘-quaterpyridyl and have been characterized by using various techniques including electronic absorption spectroscopy and cyclic voltammetry. Molecular quadratic nonlinear optical (NLO) responses β have been determined by using hyper-Rayleigh scattering at 800 nm and also via Stark (electroabsorption) spectroscopic studies on the intense, visible d → π^* metal-to-ligand charge-transfer bands. These experiments reveal that these dipolar pseudo-C_(2v) chromophores exhibit two substantial components of the β tensor, β_(zzz) and β_(zyy), with the difference between them being most marked for the nonchelated systems. Time-dependent density-functional theory and finite field calculations serve to further illuminate the electronic structures and associated linear and NLO properties of the new chromophoric salts.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252282","docid":252282,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257922","fileid":1257922,"datasetid":"document","objectid":252282,"filename":"ja0424124.pdf","mime_type":"application/pdf","hash":"2c68ff626329972b18fb72c120313518","hash_type":"MD5","filesize":403481,"mtime":"2017-05-16 16:01:25","url":"http://authors.library.caltech.edu/77482/1/ja0424124.pdf"}],"eprintid":77482,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"ja0424124.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252283","docid":252283,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257977","fileid":1257977,"datasetid":"document","objectid":252283,"filename":"ja0424124rom20050105_095444.cif","mime_type":"text/plain","hash":"3589e6683306691b4aa9baea3cff76ad","hash_type":"MD5","filesize":13860,"mtime":"2017-05-16 16:53:52","url":"http://authors.library.caltech.edu/77482/2/ja0424124rom20050105_095444.cif"}],"eprintid":77482,"pos":2,"placement":2,"mime_type":"text/plain","format":"chemical/x-cif","language":"en","security":"public","license":"other","main":"ja0424124rom20050105_095444.cif","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/252284","docid":252284,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1257979","fileid":1257979,"datasetid":"document","objectid":252284,"filename":"ja0424124si20050105_095346.pdf","mime_type":"application/pdf","hash":"bc3af92e8fb00f7247510fe601a4f5d9","hash_type":"MD5","filesize":84636,"mtime":"2017-05-16 16:53:57","url":"http://authors.library.caltech.edu/77482/3/ja0424124si20050105_095346.pdf"}],"eprintid":77482,"pos":3,"placement":3,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"ja0424124si20050105_095346.pdf","content":"supplemental"}],"note":"© 2005 American Chemical Society. \n\nReceived 17 December 2004. Published online 10 March 2005. Published in print 1 April 2005. \n\nWe thank the EPSRC for support (Grants GR/M93864 and GR/R54293) and also the Fund for Scientific Research-Flanders (FWO-V, G.0297.04), the University of Leuven (GOA/2000/3), the Belgian Government (IUAP P5/3), MCyT-FEDER (BQU2002-00219), and Gobierno de Aragon-Fondo Social Europeo (P009-2001 and E39). This research was partially carried out at Brookhaven National Laboratory under Contract No. DE-AC02-98CH10886 with the U.S. Department of Energy and supported by its Division of Chemical Sciences, Office of Basic Energy Sciences. Dr. Kurt Wostyn is thanked for his assistance with some of the HRS measurements, and we are very grateful to Profs. David P. Shelton (UNLV) and Santo Di Bella (Università di Catania) for some helpful comments regarding the physical aspects of these studies.","id":77482,"rev_number":15,"userid":772,"eprint_dir":"disk0/00/07/74/82","datestamp":"2017-05-16 19:34:58","lastmod":"2017-05-16 19:34:58","status_changed":"2017-05-16 19:34:58","type":"article","metadata_visibility":"show","creators":[{"given":"Benjamin J.","family":"Coe","id":"Coe-B-J","orcid":""},{"given":"James A.","family":"Harris","id":"Harris-J-A","orcid":""},{"given":"Lathe A.","family":"Jones","id":"Jones-L-A","orcid":""},{"given":"Bruce S.","family":"Brunschwig","id":"Brunschwig-B-S","orcid":"0000-0002-6135-6727"},{"given":"Kai","family":"Song","id":"Song-Kai","orcid":""},{"given":"Koen","family":"Clays","id":"Clays-K","orcid":""},{"given":"Javier","family":"Garín","id":"Garín-J","orcid":""},{"given":"Jesús","family":"Orduna","id":"Orduna-J","orcid":""},{"given":"Simon J.","family":"Coles","id":"Coles-S-J","orcid":""},{"given":"Michael B.","family":"Hursthouse","id":"Hursthouse-M-B","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2005-04-06","date_type":"published","publication":"Journal of the American Chemical Society","volume":"127","number":"13","pagerange":"4845-4859","id_number":"CaltechAUTHORS:20170516-072218600","refereed":true,"issn":"0002-7863","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170516-072218600","related_url":[{"url":"http://dx.doi.org/10.1021/ja0424124","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/ja0424124","type":"pub","description":"Article"},{"url":"http://pubs.acs.org/doi/suppl/10.1021/ja0424124","type":"pub","description":"Supporting Information"}],"referencetext":["(1) (a) Nonlinear Optical Properties of Organic Molecules and Crystals; Chemla, D. S., Zyss, J., Eds.; Academic Press:  Orlando, FL, 1987; Vols. 1 and 2.OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Zyss, J. Molecular Nonlinear Optics:  Materials, Physics and Devices; Academic Press:  Boston, 1994.OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Organic Nonlinear Optical Materials; Bosshard, Ch., Sutter, K., Prêtre, Ph., Hulliger, J., Flörsheimer, M., Kaatz, P., Günter, P., Eds.; Advances in Nonlinear Optics, Vol. 1; Gordon \u0026 Breach:  Amsterdam, The Netherlands, 1995.OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Nonlinear Optics of Organic Molecules and Polymers; Nalwa, H. S., Miyata, S., Eds.; CRC Press:  Boca Raton, FL, 1997.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(2) (a) Nalwa, H. S. Appl. Organomet. Chem. 1991, 5, 349−377.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Marder, S. R. In Inorganic Materials, 2nd ed.; Bruce, D. W., O'Hare, D., Eds.; Wiley:  Chichester; 1992; pp 121−169.OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Kanis, D. R.; Ratner, M. A.; Marks, T. J. Chem. Rev. 1994, 94, 195−242.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Long, N. J. Angew. Chem., Int. Ed. Engl. 1995, 34, 21−38.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (e) Whittall, I. R.; McDonagh, A. M.; Humphrey M. G.; Samoc, M. Adv. Organomet. Chem. 1998, 42, 291−362.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (f) Whittall, I. R.; McDonagh, A. M.; Humphrey M. G.; Samoc, M. Adv. Organomet. Chem. 1998, 43, 349−405.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (g) Heck, J.; Dabek, S.; Meyer-Friedrichsen, T.; Wong, H. Coord. Chem. Rev. 1999, 190−192, 1217−1254.OpenURL CALIFORNIA INST OF TECHNOLOGY (h) Gray, G. M.; Lawson, C. M. In Optoelectronic Properties of Inorganic Compounds; Roundhill, D. M.; Fackler, J. P., Jr., Eds.; Plenum:  New York, 1999; pp. 1−27.OpenURL CALIFORNIA INST OF TECHNOLOGY (i) Shi, S. In Optoelectronic Properties of Inorganic Compounds; Roundhill, D. M.; Fackler, J. P., Jr., Eds.; Plenum:  New York, 1999; pp. 55−105.OpenURL CALIFORNIA INST OF TECHNOLOGY (j) Le Bozec, H.; Renouard, T. Eur. J. Inorg. Chem. 2000, 229−239.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (k) Barlow, S.; Marder, S. R. Chem. Commun. 2000, 1555−1562.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (l) Lacroix, P. G. Eur. J. Inorg. Chem. 2001, 339−348.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (m) Di Bella, S. Chem. Soc. Rev. 2001, 30, 355−366.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (n) Coe, B. J. In Comprehensive Coordination Chemistry II; McCleverty J. A., Meyer, T. J., Eds.; Elsevier Pergamon:  Oxford, 2004; Vol. 9, pp 621−687.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(3) Selected examples:  (a) Wortmann, R.; Krämer, P.; Glania, C.; Lebus S.; Detzer, N. Chem. Phys. 1993, 173, 99−108. (b) Zyss, J. J. Chem. Phys. 1993, 98, 6583−6599. (c) Zyss J.; Ledoux, I. Chem. Rev. 1994, 94, 77−105. (d) Moylan, C. R.; Ermer, S.; Lovejoy, S. M.; McComb, I.-H.; Leung, D. S.; Wortmann, R.; Krdmer P.; Twieg, R. J. J. Am. Chem. Soc. 1996, 118, 8, 12950−12955. (e) Wortmann, R.; Glania, C.; Krämer, P.; Matschiner, R.; Wolff, J. J.; Kraft, S.; Treptow, B.; Barbu, E.; Längle D.; Görlitz, G. Chem. Eur. J. 1997, 3, 1765−1773. (f) Wolff, J. J.; Längle, D.; Hillenbrand, D.; Wortmann, R.; Matschiner, R.; Glania, C.; Krämer, P. Adv. Mater. 1997, 9, 138−143. (g) Tomonari, M.; Ookubo N.; Takada, T. Chem. Phys. Lett. 1997, 266, 488−498. (h) Wolff J. J.; Wortmann, R. Adv. Phys. Org. Chem. 1999, 32, 121−217. (i) Liu, Y.-J.; Liu, Y.; Zhang, D.-J.; Hu, H.-Q.; Liu, C.-B. J. Mol. Struct. 2001, 570, 43−51. (j) Ostroverkhov, V.; Petschek, R. G.; Singer, K. D.; Twieg, R. J. Chem. Phys. Lett. 2001, 340, 109−115. (k) Yang M.-L.; Champagne, B. J. Phys. Chem. A 2003, 107, 3942−3951. (l) Wortmann, R.; Lebus-Henn, S.; Reis, H.; Papadopoulos, M. G. J. Mol. Struct. (THEOCHEM) 2003, 633, 217−226.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(4) Selected examples:  (a) Lacroix, P. G.; Di Bella, S.; Ledoux, I. Chem. Mater. 1996, 8, 541−545. (b) Di Bella, S.; Fragalà, I.; Ledoux, I.; Diaz-Garcia, M. A.; Marks, T. J. J. Am. Chem. Soc. 1997, 119, 9550−9557. (c) Averseng, F.; Lacroix, P. G.; Malfant, I.; Lenoble, G.; Cassoux, P.; Nakatani, K.; Maltey-Fanton, I.; Delaire, J. A.; Aukauloo, A. Chem. Mater. 1999, 11, 995−1002. (d) Briel, O.; Sünkel, K.; Krossing, I.; Nöth, H.; Schmälzlin, E.; Meerholz, K.; Bräuchle, C.; Beck, W. Eur. J. Inorg. Chem. 1999, 483−490. (e) Hilton, A.; Renouard, T.; Maury, O.; Le Bozec, H.; Ledoux, I.; Zyss, J. Chem. Commun. 1999, 2521−2522. (f) Di Bella, S.; Fragalà, I.; Ledoux, I.; Zyss, J. Chem. Eur. J. 2001, 7, 3738−3743. (g) Di Bella, S.; Fragalà, I. New J. Chem. 2002, 26, 285−290. (h) Di Bella, S.; Fragalà, I. Eur. J. Inorg. Chem. 2003, 2606−2611. (i) Maya, E. M.; García-Frutos, E. M.; Vázquez, P.; Torres, T.; Martín, G.; Rojo, G.; Agulló-López, F.; González-Jonte, R. H.; Ferro, V. R.; García de la Vega, J. M.; Ledoux, I.; Zyss, J. J. Phys. Chem. A 2003, 107, 2110−2117. (j) Di Bella, S.; Fragalà, I.; Guerri, A.; Dapporto, P.; Nakatani, K. Inorg. Chim. Acta 2004, 357, 1161−1167.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(5) (a) Coe, B. J.; Chamberlain, M. C.; Essex-Lopresti, J. P.; Gaines, S.; Jeffery, J. C.; Houbrechts, S.; Persoons, A. Inorg. Chem. 1997, 36, 3284−3292.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Coe, B. J.; Essex-Lopresti, J. P.; Harris, J. A.; Houbrechts S.; Persoons, A. Chem. Commun. 1997, 1645−1646.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Coe, B. J.; Harris, J. A.; Harrington, L. J.; Jeffery, J. C.; Rees, L. H.; Houbrechts S.; Persoons, A. Inorg. Chem. 1998, 37, 3391−3399.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Coe, B. J.; Harris, J. A.; Asselberghs, I.; Persoons, A.; Jeffery, J. C.; Rees, L. H.; Gelbrich T.; Hursthouse, M. B. J. Chem. Soc., Dalton Trans. 1999, 3617−3625.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (e) Coe, B. J.; Harris, J. A.; Brunschwig, B. S. J. Phys. Chem. A 2002, 106, 897−905.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (f) Coe, B. J.; Jones, L. A.; Harris, J. A.; Brunschwig, B. S.; Asselberghs, I.; Clays, K.; Persoons, A. J. Am. Chem. Soc. 2003, 125, 862−863.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (g) Coe, B. J.; Jones, L. A.; Harris, J. A.; Sanderson, E. E.; Brunschwig, B. S.; Asselberghs, I.; Clays, K.; Persoons, A. Dalton Trans. 2003, 2335−2341.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (h) Coe, B. J.; Jones, L. A.; Harris, J. A.; Brunschwig, B. S.; Asselberghs, I.; Clays, K.; Persoons, A.; Garín, J.; Orduna, J. J. Am. Chem. Soc. 2004, 126, 3880−3891.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(6) (a) Coe, B. J.; Houbrechts, S.; Asselberghs I.; Persoons, A. Angew. Chem., Int. Ed. 1999, 38, 366−369.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Coe, B. J. Chem. Eur. J. 1999, 5, 2464−2471.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(7) (a) Terhune, R. W.; Maker, P. D.; Savage, C. M. Phys. Rev. Lett. 1965, 14, 681−684.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Clays, K.; Persoons, A. Phys. Rev. Lett. 1991, 66, 2980−2983.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Clays, K.; Persoons, A. Rev. Sci. Instrum. 1992, 63, 3285−3289.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Hendrickx, E.; Clays, K.; Persoons, A. Acc. Chem. Res. 1998, 31, 675−683.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(8) (a) Liptay, W. In Excited States; Lim, E. C., Ed.; Academic Press:  New York, 1974; Vol. 1, pp 129−229.OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Bublitz, G. U.; Boxer, S. G. Annu. Rev. Phys. Chem. 1997, 48, 213−242.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(9) Coe, B. J.; Harris, J. A.; Brunschwig, B. S. Dalton Trans. 2003, 2384−2386.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nBoggs, S. E.; Clarke R. E.; Ford, P. C. Inorg. Chim. Acta 1996, 247, 129−130.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(11) Curtis, J. C.; Sullivan, B. P.; Meyer, T. J. Inorg. Chem. 1983, 22, 224−236.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(12) Morgan R. J.; Baker, A. D. J. Org. Chem. 1990, 55, 1986−1993.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(13) Hooft, R. Collect, Data collection software; Nonius BV:  Delft, The Netherlands, 1998.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(14) Otwinowski, Z.; Minor, W. Methods Enzymol. 1997, 276, 307−326.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(15) (a) Blessing, R. H. Acta Crystallogr., Sect. A 1995, 51, 33−37.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Blessing, R. H. J. Appl. Crystallogr. 1997, 30, 421−426.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(16) Mackay, S.; Gilmore, C. J.; Edwards, C.; Tremayne, M.; Stewart, N.; Shankland, K. MAXUS, a computer program for the solution and refinement of crystal structures from diffraction data; University of Glasgow:  Glasgow, U.K., Nonius BV, Delft, The Netherlands and MacScience Co. Ltd., Yokohama, Japan, 1998.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(17) Sheldrick, G. M. Acta Crystallogr., Sect. A 1990, 46, 467−473.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(18) Sheldrick, G. M. SHELXL 97, Program for crystal structure refinement; University of Göttingen:  Göttingen, Germany, 1997.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(19) Clays, K.; Olbrechts, G.; Munters, T.; Persoons, A.; Kim O.-K.; Choi, L.-S. Chem. Phys. Lett. 1998, 293, 337−342.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nOlbrechts, G.; Strobbe, R.; Clays K.; Persoons, A. Rev. Sci. Instrum. 1998, 69, 2233−2241.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(21) Heesink, G. J. T.; Ruiter, A. G. T.; van Hulst, N. F.; Bölger, B. Phys. Rev. Lett. 1993, 71, 999−1002.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(22) Hendrickx, E.; Boutton, C.; Clays, K.; Persoons, A.; van Es, S.; Biemans, T.; Meijer, B. Chem. Phys. Lett. 1997, 270, 241−244.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(23) Boutton, C.; Clays, K.; Persoons, A.; Wada, T.; Sasabe, H. Chem. Phys. Lett. 1998, 286, 101−106.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(24) Shin, Y. K.; Brunschwig, B. S.; Creutz, C.; Sutin, N. J. Phys. Chem. 1996, 100, 8157−8169.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(25) Frisch, M. J. et al. Gaussian 03, revision B.05; Gaussian, Inc.:  Pittsburgh, PA, 2003.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(26) The B3P86 Functional consists of Becke's three parameter hybrid functional (Becke, A. D. J. Chem. Phys. 1993, 98, 5648−5652) with the nonlocal correlation provided by the Perdew 86 expression:  Perdew, J. P. Phys. Rev. B 1986, 33, 8822−8824.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(27) D95 on first row:  Dunning, T. H.; Hay P. J. In Modern Theoretical Chemistry; Schaefer, H. F. III, Ed.; Plenum:  New York, 1976, Vol. 3, p 1. Los Alamos ECP plus DZ on Na−Bi:  (a) Hay, P. J.; Wadt, W. R. J. Chem. Phys. 1985, 82, 270−283. (b) Wadt, W. R.; Hay, P. J. J. Chem. Phys. 1985, 82, 284−298. (c) Hay, P. J.; Wadt, W. R. J. Chem. Phys. 1985, 82, 299−310.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(28) Portmann, S.; Lüthi, H. P. Chimia 2000, 54, 766−770.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(29) Hayes, M. A.; Meckel, C.; Schatz E.; Ward, M. D. J. Chem. Soc., Dalton Trans. 1992, 703−708.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(a) Ford P. C.; Sutton, C. Inorg. Chem. 1969, 8, 1544−1546.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Zwickel A. M.; Creutz, C. Inorg. Chem. 1971, 10, 2395−2399.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Pavanin, L. A.; Giesbrecht E.; Tfouni, E. Inorg. Chem. 1985, 24, 4444−4446.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Pavanin, L. A.; Novais da Rocha, Z.; Giesbrecht E.; Tfouni, E. Inorg. Chem. 1991, 30, 2185−2190.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(31) Alvarez, V. E.; Allen, R. J.; Matsubara T.; Ford, P. C. J. Am. Chem. Soc. 1974, 96, 7686−7692.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(32) Selected examples:  (a) Mines, G. A.; Roberts J. A.; Hupp, J. T. Inorg. Chem. 1992, 31, 125−128. (b) Streiff, J. H.; Edwards W. D.; McHale, J. L. Chem. Phys. Lett. 1999, 312, 369−375. (c) Endicott, J. F.; Schlegel, H. B.; Uddin Md. J.; Seniveratne, D. S. Coord. Chem. Rev. 2002, 229, 95−106.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(33) Ando, I.; Ishimura, D.; Ujimoto K.; Kurihara, H. Inorg. Chem. 1996, 35, 3504−3508.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(34) Bublitz, G. U.; Ortiz, R.; Marder S. R.; Boxer, S. G. J. Am. Chem. Soc. 1997, 119, 3365−3376.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(35) (a) Karki L.; Hupp, J. T. Inorg. Chem. 1997, 36, 3318−3321.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Karki, L.; Williams, R. D.; Hupp, J. T.; Allan, C. B.; Spreer, L. O. Inorg. Chem. 1998, 37, 2837−2840.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Bublitz, G. U.; Laidlaw, W. M.; Denning R. G.; Boxer, S. G. J. Am. Chem. Soc. 1998, 120, 6068−6075.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Walters, K. A.; Premvardhan, L. L.; Liu, Y.; Peteanu L. A.; Schanze, K. S. Chem. Phys. Lett. 2001, 339, 255−262.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(36) Vance F. W.; Hupp, J. T. J. Am. Chem. Soc. 1999, 121, 4047−4053. Note, however, that in this case the chromophore is a 3D pseudo-octopolar derivative of [RuII(2,2‘-bpy)3]2+ which has a complex electronic structure in which β is dominated by intra-ligand CT, rather than MLCT processes.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(37) Note that in our previous communication,9 (somewhat smaller) β0 values for 1−4 were derived by using μ12 values which were adjusted to take into account the angles θ (ca. 20−50°) between μ12 and Δμ12 estimated from the Stark measurements. However, the theoretical analyses (see below) indicate that for the low-energy transitions Δμ12 lies along the z axis, whilst μ12 is perpendicular and along the y axis. For the high-energy transitions, Δμ12 and μ12 are parallel and lie along the z axis. The angles between μ12 and Δμ12 should therefore be 90° and 0° for the low- and high-energy transitions, respectively. Use of the component of μ12 along the Δμ12 directions in the two-state model will necessarily give a β0 of 0 for a transition where μ12 is perpendicular to Δμ12, which is evidently nonsensical. Furthermore, we can find no literature precedent for using directionally adjusted μ12 values in the two-state approximation (see, for example:  ref 3a, eqs 40 and 41 in which μy is used with Δμz). We have therefore used the as-measured μ12 values here to derive β0 values which should be viewed as replacements for those previously reported.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(38) Richardson, D. E.; Walker, D. D.; Sutton, J. E.; Hodgson, K. O.; Taube, H. Inorg. Chem. 1979, 18, 2216−2221.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(39) A full unrestricted geometry optimization of the cation in 12 resulted in the pyridinium rings being rotated by ca. 38° with respect to the pyridyl rings. However, the properties calculated for this geometry are similar to those reported in Table 8 for the completely planar conformation:  Emax = 2.79 and 2.88 eV.; βzyy = 42 × 10-30 esu; βzzz = 30 × 10-30 esu.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(a) Albert, I. D. L.; Marks, T. J.; Ratner, M. A. J. Am. Chem. Soc. 1997, 119, 3155−3156.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Albert, I. D. L.; Marks, T. J.; Ratner, M. A. J. Am. Chem. Soc. 1998, 120, 11174−11181.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(41) McDonagh, A. M.; Whittall, I. R.; Humphrey, M. G.; Skelton, B. W.; White, A. H. J. Organomet. Chem. 1996, 519, 229−235.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(42) Note however that the observation that the Stark-derived θ value is, in every case, considerably larger for the lower-energy transition than for the higher-energy one9 is consistent with the assignment of the former transition as corresponding with the βzyy component for which μ12 is perpendicular to Δμ12 (i.e. θ = 90°).OpenURL CALIFORNIA INST OF TECHNOLOGY\n(43) Kaatz, P.; Shelton, D. P. J. Chem. Phys. 1996, 105, 3918−3929."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Syntheses and Properties of Two-Dimensional Charged Nonlinear Optical Chromophores Incorporating Redox-Switchable cis-Tetraammineruthenium(II) Centers\nBenjamin J. Coe, James A. Harris, Lathe A. Jones, Bruce S. Brunschwig, Kai Song, Koen Clays, Javier Garín, Jesús Orduna, Simon J. Coles, and Michael B. Hursthouse\nJournal of the American Chemical Society 2005 127 (13), 4845-4859\nDOI: 10.1021/ja0424124","other_numbering_system":null,"funders":[{"agency":"Engineering and Physical Sciences Research Council (EPSRC)","grant_number":"GR/M93864"},{"agency":"Engineering and Physical Sciences Research Council (EPSRC)","grant_number":"GR/R54293"},{"agency":"Fonds Wetenschappelijk Onderzoek - Vlaanderen (FWO)","grant_number":"G.0297.04"},{"agency":"University of Leuven","grant_number":"GOA/2000/3"},{"agency":"Belgian Government","grant_number":"IUAP P5/3"},{"agency":"MCyT-FEDER","grant_number":"BQU2002-00219"},{"agency":"Gobierno de Aragon-Fondo Social Europeo","grant_number":"P009-2001"},{"agency":"Gobierno de Aragon-Fondo Social Europeo","grant_number":"E39"},{"agency":"Department of Energy (DOE)","grant_number":"DE-AC02-98CH10886"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}