{"title":"New Approaches to Olefin Cross-Metathesis","uri":"","abstract":"New methodology for the selective cross-metathesis (CM) of terminal olefins employing ruthenium benzylidene 1 is described.1 CM with symmetric internal olefins was found to provide a useful means for homologating terminal olefins to protected allylic alcohols, amines, and esters. Due to the limited commercial availability of symmetric internal olefins, a two-step CM procedure was developed in which terminal olefins were first homodimerized prior to the CM reaction. Terminal olefins with allylic methyl substituents were observed to provide CM products in diminished yield albeit with markedly improved trans-selectivity. Reaction rates were measured for CM reactions utilizing butenediol and allyl alcohol derivatives, and the results demonstrated distinct advantages in reaction rate and stereoselectivity for reactions employing the disubstituted olefins. In the course of studies of substrates with allylic oxygen substituents, a new CM application was discovered involving the metathesis of acrolein acetal derivatives with terminal olefins. Acrolein acetals, including asymmetric variants derived from tartaric acid, proved to be exceptionally robust and trans-selective CM substrates. In related work, a pinacol-derived vinyl boronate was also found to be a reactive CM partner, providing a novel means for converting terminal olefins into precursors for the Suzuki coupling reaction.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252308","docid":252308,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258228","fileid":1258228,"datasetid":"document","objectid":252308,"filename":"ja993063u.pdf","mime_type":"application/pdf","hash":"8b74d0e81837f319822063ac5c91719f","hash_type":"MD5","filesize":541957,"mtime":"2017-05-16 20:18:00","url":"http://authors.library.caltech.edu/77504/1/ja993063u.pdf"}],"eprintid":77504,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"ja993063u.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252309","docid":252309,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258251","fileid":1258251,"datasetid":"document","objectid":252309,"filename":"ja993063u_s.pdf","mime_type":"application/pdf","hash":"c3777bf5fbef8e4845aef07f84065549","hash_type":"MD5","filesize":1606873,"mtime":"2017-05-16 20:31:10","url":"http://authors.library.caltech.edu/77504/2/ja993063u_s.pdf"}],"eprintid":77504,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"ja993063u_s.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/252310","docid":252310,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258255","fileid":1258255,"datasetid":"document","objectid":252310,"filename":"ja993063u_sa.pdf","mime_type":"application/pdf","hash":"d6c06c185de815482ad764221d4531b1","hash_type":"MD5","filesize":464561,"mtime":"2017-05-16 20:31:17","url":"http://authors.library.caltech.edu/77504/3/ja993063u_sa.pdf"}],"eprintid":77504,"pos":3,"placement":3,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"ja993063u_sa.pdf","content":"supplemental"}],"note":"© 2000 American Chemical Society. \n\nReceived 23 August 1999. Published online 21 December 1999. Published in print 1 January 2000. \n\nWork at Caltech was generously supported by grants from the National Institutes of Health (NIH) and Zeneca Pharmaceuticals. Work at Pomona College was supported by grants from the National Science Foundation (NSF). H.E.B. thanks the ACS Division of Organic Chemistry for a Graduate Fellowship (supported by Pfizer, Inc.). D.J.O. thanks Pomona College for provision of a Steele junior faculty leave. R.A.W. thanks the Caltech SURF Program and the Pomona College Chemistry Department for a summer fellowship. Dr. Katsukiyo Miura is acknowledged for his assistance in the acrolein acetal cross-metathesis portion of this work. We thank the referees for their insightful comments.","id":77504,"rev_number":11,"userid":772,"eprint_dir":"disk0/00/07/75/04","datestamp":"2017-05-16 20:39:49","lastmod":"2017-05-16 20:39:49","status_changed":"2017-05-16 20:39:49","type":"article","metadata_visibility":"show","creators":[{"given":"Helen E.","family":"Blackwell","id":"Blackwell-H-E","orcid":""},{"given":"Daniel J.","family":"O'Leary","id":"O'Leary-D-J","orcid":""},{"given":"Arnab K.","family":"Chatterjee","id":"Chatterjee-A-K","orcid":""},{"given":"Rebecca A.","family":"Washenfelder","id":"Washenfelder-R-A","orcid":"0000-0002-8106-3702"},{"given":"D. Andrew","family":"Bussmann","id":"Bussmann-D-A","orcid":""},{"given":"Robert H.","family":"Grubbs","id":"Grubbs-R-H","orcid":"0000-0002-0057-7817"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2000-01-12","date_type":"published","publication":"Journal of the American Chemical Society","volume":"122","number":"1","pagerange":"58-71","id_number":"CaltechAUTHORS:20170516-131732124","refereed":true,"issn":"0002-7863","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170516-131732124","related_url":[{"url":"http://dx.doi.org/10.1021/ja993063u","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/ja993063u","type":"pub","description":"Article"},{"url":"http://pubs.acs.org/doi/suppl/10.1021/ja993063u","type":"pub","description":"Supporting Information"}],"referencetext":["(1) For preliminary accounts of this work, see:  (a) O'Leary, D. J.; Blackwell, H. E.; Washenfelder, R. A.; Grubbs, R. H. Tetrahedron Lett. 1998, 39, 7427−7430. (b) O'Leary, D. J.; Blackwell, H. E.; Washenfelder, R. A.; Miura, K.; Grubbs, R. H. Tetrahedron Lett. 1999, 40, 1091−1094. (c) Blackwell, H. E. Ph.D. Thesis, California Institute of Technology, 1999.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(2) For general olefin metathesis references, see:  (a) Ivin, K. J.; Mol, J. C. Olefin Metathesis and Metathesis Polymerization, 2nd ed.; Academic:  San Diego, 1997. (b) Grubbs, R. H.; Pine, S. H. In Comprehensive Organic Synthesis; Trost, B. M., Ed.; Pergamon:  New York:  1991; Vol. 5, Chapter 9.3.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(3) For details of the present accepted mechanism of olefin metathesis involving formation of a metallocyclobutane intermediate, see:  Herrison, J. L.; Chauvin, Y. Makromol. Chem. 1971, 141, 161−176.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(4) For leading references, see:  (a) Feldman, J.; Schrock, R. R. Prog. Inorg. Chem. 1991, 39, 1−74. (b) Grubbs, R. H.; Tumas, W. Science 1989, 243, 907−915.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(5) For recent reviews of RCM in organic synthesis, see:  (a) Grubbs, R. H.; Chang, S. Tetrahedron 1998, 54, 4413−4450. (b) Schuster, M.; Blechert, S. Angew. Chem., Int. Ed. Engl. 1997, 36, 2036−2056. (c) Schmalz, H.-G. Angew. Chem., Int. Ed. Engl. 1995, 34, 1833−1836. (d) Grubbs, R. H.; Miller, S. J.; Fu, G. C. Acc. Chem. Res. 1995, 28, 446−552.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(6) PCy3 = tricyclohexylphosphine. For the preparation and characterization of catalyst 1, see:  (a) Schwab, P.; France, M. B.; Ziller, J. W.; Grubbs, R. H. Angew. Chem., Int. Ed. Engl. 1995, 34, 2039−2041. (b) Schwab, P.; Grubbs, R. H.; Ziller, J. W. J. Am. Chem. Soc. 1996, 118, 100−110. (c) Belderrain, T. R.; Grubbs, R. H. Organometallics 1997, 16, 4001−4003.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(7) (a) Schrock, R. R.; Murdzek, J. S.; Bazan, G. C.; Robbins, J.; DiMare, M.; O'Regan, M. J. Am. Chem. Soc. 1990, 112, 3875−3886.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Bazan, G. C.; Khosravi, E.; Schrock, R. R.; Feast, W. J.; Gibson, V. C.; O'Regan, M. B.; Thomas, J. K.; Davis, W. M. J. Am. Chem. Soc. 1990, 112, 8378−8387.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Bazan, G. C.; Oskam, J. H.; Cho, H.-N.; Park, L. Y.; Schrock, R. R. J. Am. Chem. Soc. 1991, 113, 6899−6907.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(8) Issues of poor selectivity plagued early CM efforts employing “classical” catalysts. For a recent review of CM using “classical” catalysts, see:  Finkel'shtein, E. S.; Bykov, V. I.; Portnykh, E. B. J. Mol. Catal. 1992, 76, 33−52.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(9) (a) Rossi, R. Synthesis 1977, 817−836.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Banasiak, D. S. J. Mol. Catal. 1985, 28, 107−115.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Crisp, G. T.; Collis, M. P. Aust. J. Chem. 1988, 41, 935−942.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Bykov, V. I.; Butenko, T. A.; Finkel'shtein, E. S.; Henderson, P. T. J. Mol. Catal. 1994, 90, 111−116.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (e) Bykov, V. I.; Finkel'shtein, E. S. J. Mol. Catal. A 1998, 133, 17−37.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nCrowe, W. E.; Zhang, Z. J. J. Am. Chem. Soc. 1993, 115, 10998−10999.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(11) Crowe, W. E.; Goldberg, D. R. J. Am. Chem. Soc. 1995, 117, 5162−5163.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(12) Crowe, W. E.; Goldberg, D. R.; Zhang, Z. J. Tetrahedron Lett. 1996, 37, 2117−2120.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(13) For the ruthenium-catalyzed CM of functionalized terminal olefins with allyldimethylsilyl-derivatized polystyrene resin, see:  Schuster, M.; Lucas, N.; Blechert, S. Chem. Commun. 1997, 823−824.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(14) Brümmer, O.; Rückert, A.; Blechert, S. Chem. Eur. J. 1997, 3, 441−446.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(15) Highly functionalized silsesquioxanes and spherosilicates have been prepared via the CM of various alkenes with vinyl-substituted silsesquioxane and spherosilicate frameworks employing molybdenum alkylidene 2. The lack of homodimerization of the vinyl-substituted silicon frameworks was attributed to steric bulk. See:  Feher, F. J.; Soulivong, D.; Eklund, A. G.; Wyndham, K. D. J. Chem. Soc., Chem. Commun. 1997, 1185−1186.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(16) (a) Gibson, S. E.; Gibson, V. C.; Keen, S. P. Chem. Commun. 1997, 1107−1108.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Baigini, S. C. G.; Gibson, S. E.; Keen, S. P. J. Chem. Soc., Perkin Trans. 1 1998, 16, 2485−2499.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(17) For solution-phase yne−ene metathesis employing alkylidene 1, see:  (a) Stragies, R.; Schuster, M.; Blechert, S. Angew. Chem., Int. Ed. Engl. 1997, 36, 2518−2520. For solid-phase yne−ene metathesis employing catalyst 1, see:  (b) Schürer, S. C.; Blechert, S. Synlett 1998, 166−168. (c) Schuster, M.; Blechert, S. Tetrahedron Lett. 1998, 39, 2295−2298.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(18) For recent ROM references, see:  (a) Randall, M. L.; Tallarico, J. A.; Snapper, M. L. J. Am. Chem. Soc. 1995, 117, 9610−9611. (b) Schneider, M. F.; Blechert, S. Angew. Chem., Int. Ed. Engl. 1996, 35, 411−412. (c) Schneider, M. F.; Lucas, N.; Velder, J.; Blechert, S. Angew. Chem., Int. Ed. Engl. 1997, 36, 257−259. (d) Snapper, M. L.; Tallarico, J. A.; Randall, M. L. J. Am. Chem. Soc. 1997, 119, 1478−1479. (e) Tallarico, J. A.; Bonitatebus, P. J.; Snapper, M. L. J. Am. Chem. Soc. 1997, 119, 7157−7158. (f) Tallarico, J. A.; Randall, M. L.; Snapper, M. L. Tetrahedron 1997, 53, 16511−16520. (g) Cuny, G. D.; Cao, J.; Hauske, J. R. Tetrahedron Lett. 1997, 38, 5237−5240. (h) Cao, J.; Cuny, G. D.; Hauske, J. R. Mol. Divers. 1998, 3, 173−179.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(19) For a novel variant of ROM including a tandem RCM reaction, see:  Stragies, R.; Blechert, S. Synlett 1998, 169−170.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(a) Boger, D. L.; Chai, W.; Ozer, R. S.; Anderson, C.-M. Biorg. Med. Chem. Lett. 1997, 7, 463−468.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Boger, D. L.; Chai, W. Tetrahedron 1998, 54, 3955−3970.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Boger, D. L.; Chai, W.; Jin, Q. J. Am. Chem. Soc. 1998, 120, 7220−7225.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Giger, T.; Wigger, M.; Audétat, S.; Benner, S. A. Synlett 1998, 688−691.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (e) Brändli, C.; Ward, T. R. Helv. Chim. Acta 1998, 81, 1616−1621.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(21) For a recent report from these laboratories, see:  Hillmyer, M. A.; Nguyen, S. T.; Grubbs, R. H. Macromolecules 1997, 30, 718−721 and references therein.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(22) Prepared according to a general literature procedure:  Schlessinger, R. H.; Lopes, A. J. Org. Chem. 1981, 46, 5252−5253.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(23) Full experimental details of the CM and self-metathesis reactions and full characterization of the products (1H NMR, 13C NMR, and HRMS) can be found in the Supporting Information.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(24) This is the exact opposite effect that Blechert et al. observed in the ROM of cyclic olefins with monosubstituted olefins versus disubstituted olefins. A large excess (up to 10-fold) of the less reactive disubstituted olefin was required to suppress the ROMP of the strained cyclic olefin substrates, while only 1 equiv of the corresponding monosubstituted olefin was required to effect analogous yields. See ref 18b.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(25) Ullman, M.; Grubbs, R. H. Organometallics 1998, 17, 2484−2489.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(26) Prepared according to a standard literature procedure:  Lardon, A.; Reichstein, T. Helv. Chim. Acta 1954, 37, 443−450.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(27) Prepared using a general method:  Alexakis, A.; Gardette, M.; Colin, S. Tetrahedron Lett. 1988, 29, 2951−2954.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(28) Prepared using a general method:  Chaudary, S. K.; Hernandez, O. Tetrahedron Lett. 1979, 2, 95−98.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(29) Prepared by a general procedure:  Forster, R. C.; Owen, L. N. J. Chem. Soc., Perkin Trans. 1 1978, 822−829.OpenURL CALIFORNIA INST OF TECHNOLOGY\nPrepared using a general method:  Corey, E. J.; Venkateswarlu, A. J. Am. Chem. Soc. 1972, 94, 6190−6191.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(31) Prepared according to a modified literature procedure. See:  Zuwen, H.; Nadkarni, D. V.; Sayre, L. M.; Greenaway, F. T. Biochim. Biophys. Acta 1995, 1253, 117−127.[PubMed]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(32) This corroborated well with the observation of Blechert et al. that trans-disubstituted internal olefins are reactive substrates for ROM. See ref 18b.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(33) Prepared according to a literature procedure:  Gassman, P. G.; Bonser, S. M.; Mlinaric-Majerski, K. J. Am. Chem. Soc. 1989, 111, 2652−2662.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(34) Prepared via a DCC coupling between trans-β-hydromuconic acid and N,O-dimethylhydroxylamine hydrochloride. See:  Nahm, S.; Weinreb, S. M. Tetrahedron Lett. 1981, 22, 3815−3818.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(35) Prepared according to a general literature procedure:  Zhdanov, R. I.; Zhenodarova, S. M. Synthesis 1975, 222−245.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(36) Nubel, P. O.; Yokelson, H. B.; Lutman, C. A.; Bouslog, W. G.; Behrends, R. T.; Runge, K. D. J. Mol. Catal. A 1997, 115, 43−50.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(37) The self-metathesis of terminal olefins employing “classical” olefin metathesis catalysts has been utilized previously in the synthesis of symmetrically disubstituted olefins. The majority of these applications involved the synthesis of structurally simple, aliphatic internal alkenes. See:  (a) Marciniec, B.; Gulinski, J. J. Organomet. Chem. 1984, 266, C19−C21. (b) Marciniec, B.; Maciejewski, H.; Gullinski, J.; Rzejak, Z. J. Organomet. Chem. 1989, 362, 273−279. (c) Marciniec, B.; Pietraszuk, C.; Foltynowicz, Z. J. Organomet. Chem. 1994, 474, 83−87.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(38) Prepared via a DCC coupling between N-Boc-glycine-OH and 9-decen-1-ol.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(39) Moderate trans selectivity has been consistently observed in almost all intermolecular metathesis accounts employing benzylidene 1 to date. This selectivity is consistent with preferential formation of trans-α,β-disubstituted metallocyclobutane intermediates. We made the assumption that the predominant olefin regioisomer for these symmetrical homodimers was trans in our NMR spectroscopic analyses.OpenURL CALIFORNIA INST OF TECHNOLOGY\nAllyl benzene (27) has been previously reported by Benner et al. to be an excellent substrate for the synthesis of combinatorial libraries via CM. See ref 20d.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(41) The allyl ether was introduced into 1-ferrocene methanol using a standard literature procedure:  Corey, E. J.; Suggs, J. W. J. Org. Chem. 1973, 38, 3224.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(42) Evidence for assigning the major isomer as trans is based upon comparison of 1H NMR and mp data (30:  91 °C, lit. mp 94−94.5 °C) with the known E-1,4-bis(pentafluorophenyl)-2-butene:  Filler, R.; Choe, E. W. Can. J. Chem. 1975, 53, 1491−1495.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(43) (O)-Allyl ethers of l-serine, l-homoserine, and l-tyrosine have been previously employed in the synthesis of peptide macrocycles via RCM. See:  (a) Miller, S. J.; Blackwell, H. E.; Grubbs, R. H. J. Am. Chem. Soc. 1996, 118, 9606−9614. (b) Blackwell, H. E.; Grubbs, R. H. Angew. Chem., Int. Ed. 1998, 37, 3281−3284.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(44) O'Leary, D. J.; Miller, S. J.; Grubbs, R. H. Tetrahedron Lett. 1998, 39, 1689−1690.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(45) For the synthesis of C-allylglucoside 43, see:  Lewis, M. D.; Cha, J. K.; Kishi, Y. J. Am. Chem. Soc. 1982, 104, 4976−4978.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(46) For recent CM and RCM applications in carbohydrate synthesis, see:  (a) Feng, J.; Schuster, M.; Blechert, S. Synlett 1997, 129−130. (b) El Sukkari, H.; Gesson, J.-P.; Renoux, B. Tetrahedron Lett. 1998, 39, 4043−4046. (c) Fürstner, A.; Müller, T. J. Org. Chem. 1998, 63, 424−425. (d) Calimente, D.; Postema, M. H. D. J. Org. Chem. 1999, 64, 1770−1771. (e) Postema, M. H. D.; Calimente, D. Tetrahedron Lett. 1999, 40, 4755−4759.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(47) For leading references to peptide RCM, see refs 5a and 43.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(48) Terminal olefin derived sugars and amino acids have previously been employed in CM with other terminal olefins. See refs 13 and 46b.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(49) For recent syntheses of carbon−carbon linked glycosyl amino acids, see:  (a) Dondoni, A.; Marra, A.; Massi, A. J. Chem. Soc., Chem Commun. 1998, 1741−1742. (b) Dondoni, A.; Massi, A.; Marra, A. Tetrahedron Lett. 1998, 39, 6601−6604. (c) Hu, Y.-J.; Roy, R. Tetrahedron Lett. 1999, 40, 3305−3308.OpenURL CALIFORNIA INST OF TECHNOLOGY\nRacemic allylic-substituted terminal olefins were employed in these CM studies.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(51) Prepared according to a literature procedure:  Hanessian, S.; Lavallee, P. Can. J. Chem. 1975, 53, 2975−2977.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(52) The methylidene content was found to diminish when the NMR tubes were periodically purged with argon.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(53) Chelation of functionality in the allylic position of the metal alkylidene to the metal center should be disfavored because this would form a strained, four-membered ring.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(54) The poorer performance of disubstituted “isolated” olefins in CM reactions could also be due to a slower rate of CM, a rate that becomes competitive with the intrinsic rate of catalyst decomposition.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(55) Another role of the disubstituted olefin may be to limit formation of a particular metallacycle that reduces catalytic efficiency because it is either less unreactive or readily decomposes. Because this type of role relates directly to the nature of the olefin substituent, it appears to be more consistent with the unique behavior exhibited by olefins containing proximal polar or sterically bulky groups. Two possibilities for the “unfavored” metallacycle, requiring a monosubstituted olefin for its formation, are as follows:OpenURL CALIFORNIA INST OF TECHNOLOGY\n(56) For recent reviews, see:  (a) Kelly, S. E. In Comprehensive Organic Synthesis; Trost, B. M., Ed.; Pergamon Press:  New York, 1991; Vol. 1, Chapter 3, pp 755−782. (b) Maryanoff, B. E.; Reitz, A. B. Chem. Rev. 1989, 89, 863−927.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(57) Bestmann, H. J.; Vostrowsky, O.; Paulus, H.; Billman, W.; Stransky, W. Tetrahedron Lett. 1977, 121−124.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(58) Daubresse, N.; Francesch, C.; Rolando, C. Tetrahedron 1998, 54, 10761−10770.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(59) Meyers, A. I.; Tomioka, K.; Fleming, M. P. J. Org. Chem. 1978, 43, 3788−3789.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nWollenberg, R. H.; Albizati, K. F.; Peries, R. J. Am. Chem. Soc. 1977, 99, 7365−7367.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(61) Wittig, G.; Reiff, H. Angew. Chem., Int. Ed. Engl. 1968, 80, 8−15.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(62) Meyers, A. I.; Nabeya, A.; Adickes, H. W.; Politzer, I. R.; Malone, G. R.; Kovelesky, A. C.; Nolen, R. L.; Portnoy, R. C. J. Org. Chem. 1973, 38, 36−56.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(63) For a recent example of an acrolein acetal used in an RCM reaction, see:  (a) Crimmins, M. T.; King, B. W. J. Am. Chem. Soc. 1998, 120, 9084−9085. For the recent report of the ROM of cyclopropenone ketal with terminal olefins, see:  (b) Michaut, M.; Parrain, J.-L.; Santelli, M. Chem. Commun. 1998, 2567−2568.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(64) Allylbenzene has recently been reported to efficiently undergo CM reactions with acrolein, acrolein dimethyl acetal, and acrylonitrile catalyzed by ruthenium benzylidene 1. We have not observed productive CM with olefin 3 and either acrolein or acrylonitrile in our laboratory. See:  Blanco, O. M.; Castedo, L. Synlett 1999, 557−558.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(65) Gemal, A. L.; Luche, J. L. Tetrahedron Lett. 1981, 4077−4080.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(66) Prepared via a literature procedure. See:  Gassman, P. G.; Chavan, S. J. Chem. Soc., Chem. Commun. 1989, 837−839.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(67) Prepared via a literature procedure. See:  Gassman, P. G.; Burns, S. J.; Pfister, K. B. J. Org. Chem. 1993, 58, 1449−1457.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(68) Cyclic diacetals of fumaraldehyde have been prepared previously. See:  Sokolov, G. P.; Hillers, S. Khim. Geterotsikl. Soedin. 1969, 1, 32−35.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(69) For an example of an asymmetric Simmons−Smith reaction using tartrate-derived α,β-unsaturated acetals, see:  Mori, A.; Arai, I.; Yamamoto, H. Tetrahedron 1986, 42, 6447−6458.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nTsuzuki, T.; Koyama, M.; Tanabe, K. Bull. Chem. Soc. Jpn. 1967, 40, 1008−1013.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(71) The trans/cis ratio was determined by 1H NMR of the crude tartrate CM product 80. The yield of tartrate CM product 80 was determined after acid hydrolysis of the acetal to afford aldehyde 69.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(72) (a) Fujimura, O.; dela Mata, F. J.; Grubbs, R. H. Organometallics 1996, 15, 1865−1871.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Fujimura, O.; Grubbs, R. H. J. Am. Chem. Soc. 1996, 118, 2499−2500.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Fujimura, O.; Grubbs, R. H. J. Org. Chem. 1998, 63, 824−832.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Alexander, J. B.; La, D. S.; Cefalo, D. R.; Hoveyda, A. H.; Schrock, R. R. J. Am. Chem. Soc. 1998, 120, 4041−4042.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (e) La, D. S.; Alexander, J. B.; Cefalo, D. R.; Graf, D. D.; Hoveyda, A. H.; Schrock, R. R. J. Am. Chem. Soc. 1998, 120, 9720−9721.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(73) For a recent example of the synthesis of cyclic alkenylboronates via RCM employing ruthenium catalyst 1, see:  Renaud, J.; Ouellet, S. G. J. Am. Chem. Soc. 1998, 120, 7995−7996.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(74) Prepared according to a literature procedure:  Hunt, A. R.; Stewart, S. K.; Whiting, A. Tetrahedron Lett. 1993, 34, 3599−3602.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(75) Suzuki, A. Pure Appl. Chem. 1986, 58, 629−638.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(76) Converting a terminal olefin to a vinylboronic acid or protected variant for the Suzuki coupling reaction often requires a three-step procedure involving (1) oxidative cleavage to the aldehyde, (2) subsequent reaction with dimethyl diazomethylphosphonate to provide the terminal alkyne, and (3) finally, conversion to the vinylboronate by hydroboration. For a recent example, see:  Scheidt, K. A.; Tasaka, A.; Bannister, T. D.; Wendt, M. D.; Roush, W. R. Angew. Chem., Int. Ed. 1999, 38, 1652−1655.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(77) The natural product FK506 was recently homodimerized employing 1 through its endogenous C(28) allyl group to yield a cell-permeable protein dimerizer, FK1012. See:  Diver, S. T.; Schreiber, S. L. J. Am. Chem. Soc. 1997, 119, 5106−5109.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(78) For the RCM of alkenyl phosphonates employing 1, see:  Hanson, P. R.; Stoianova, D. S. Tetrahedron Lett. 1998, 39, 3939−3942.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(79) Preliminary results from these laboratories show that alkenyl ester derivatives of cysteine are active substrates for CM.OpenURL CALIFORNIA INST OF TECHNOLOGY\nStill, W. C.; Kahn, M.; Mitra, A. J. Org. Chem. 1978, 43, 2923−2925.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(81) The solvent columns are composed of activated alumina (A-2) and supported copper redox catalyst (Q-5 reactant). See:  Pangborn, A. B.; Giardello, M. A.; Grubbs, R. H.; Rosen, R. K.; Timmers, F. J. Organometallics 1996, 15, 1518−1520.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(82) For the allylation procedure, see:  Sugano, H.; Miyoshi, M. J. Org. Chem. 1976, 41, 2352−2353. For the methyl ester formation, see:  Hirai, Y.; Aida, T.; Inoue, S. J. Am. Chem. Soc. 1989, 111, 3062−3063.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(83) Bodansky, M. Peptide Chemistry; Springer-Verlag:  New York, 1988; pp 55−146 and references therein.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(84) Prepared according to a general literature procedure:  Schlessinger, R. H.; Lopes, A. J. Org. Chem. 1981, 46, 5252−5253."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"New Approaches to Olefin Cross-Metathesis\nHelen E. Blackwell, Daniel J. O'Leary, Arnab K. Chatterjee, Rebecca A. Washenfelder, D. Andrew Bussmann, and Robert H. Grubbs\nJournal of the American Chemical Society 2000 122 (1), 58-71\nDOI: 10.1021/ja993063u","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":""},{"agency":"Zeneca Pharmaceuticals","grant_number":""},{"agency":"NSF","grant_number":""},{"agency":"Pfizer, Inc.","grant_number":""},{"agency":"Caltech Summer Undergraduate Research Fellowship (SURF)","grant_number":""},{"agency":"Pomona College","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}