{"title":"EPR Detection of Guanine Radicals in a DNA Duplex under Biological Conditions: Selective Base Oxidation by Ru(phen)_2dppz^(3+)Using the Flash-Quench Technique","uri":"","abstract":"Continuous-wave X-band EPR spectroscopy has been employed in examining the guanine radical within a DNA duplex at ambient temperature using the flash-quench technique. Guanine was selectively oxidized by DNA-bound [Ru(phen)_2dppz]^(3+) (dppz = dipyridophenazine, phen = 1,10-phenanthroline) generated in situ by photolysis in the presence of [Co(NH_3)_5Cl]^(2+) as the oxidative quencher. An EPR signal centered at g_(iso) = 2.0048 is observed in experiments with poly(dG-dC) as substrate. Comparable signals are also detected with a 13-mer oligonucleotide duplex containing only one guanine base and with calf thymus DNA, but no signal is observed with poly(dA-dT) or poly(dI-dC). These observations reflect the base selectivity of the reaction in forming the guanine radical. With ruthenium hexaammine as oxidative quencher, no signal is observed, while, with methyl viologen, a strong signal with hyperfine pattern is seen, characteristic of the reduced viologen radical and indicating that [Ru(phen)_2dppz]^(3+) was generated. The guanine radical signal, once formed upon continuous irradiation in argon-saturated aqueous buffer solution (pH 7), decays with a half-life of 30 s, but vanishes instantaneously in the dark or upon introduction of oxygen. Spin trapping experiments with N-tert-butyl-α-phenylnitrone substantiate the selectivity in generating the guanine radical; in the presence of poly(dG-dC), calf thymus DNA, the 13-mer oligonucleotide but not with poly(dA-dT) and poly(dI-dC), the detected nitroxide EPR signals are the same with g_(iso) = 2.0059, 〈a_N〉 = 15.05 G, and 〈a_H〉 = 3.11 G. Upon titration of the ruthenium intercalator into poly(dG-dC), the signal intensity increases smoothly as the [base pair]/[intercalator] ratio decreases from 100 to 25, at which point the signal intensity decreases markedly; this result may be an indication of an antiferromagnetic exchange interaction between guanine radicals. Indeed, using the flash-quench technique, EPR spectroscopy of guanine radicals within DNA now will permit the evaluation of how radicals within the DNA base stack may be coupled under biological conditions.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252352","docid":252352,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258642","fileid":1258642,"datasetid":"document","objectid":252352,"filename":"jp000725p.pdf","mime_type":"application/pdf","hash":"0acf7c4b773837c928a251ec224498db","hash_type":"MD5","filesize":138456,"mtime":"2017-05-17 15:44:50","url":"http://authors.library.caltech.edu/77519/1/jp000725p.pdf"}],"eprintid":77519,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"jp000725p.pdf","content":"published"}],"note":"© 2000 American Chemical Society. \n\nReceived 24 February 2000. Published online 6 July 2000. Published in print 1 August 2000. \n\nWe are grateful to the NIH (to J.K.B.) and NSF (to N.J.T.) for their financial support of this work. O.S. also thanks the Deutsche Forschungsgemeinschaft for a postdoctoral fellowship. We are grateful also to E.D.A. Stemp for helpful discussions and S. Jockusch and M. Kleinman for technical assistance.","id":77519,"rev_number":10,"userid":772,"eprint_dir":"disk0/00/07/75/19","datestamp":"2017-05-17 16:47:26","lastmod":"2017-05-17 16:47:26","status_changed":"2017-05-17 16:47:26","type":"article","metadata_visibility":"show","creators":[{"given":"Olav","family":"Schiemann","id":"Schiemann-O","orcid":""},{"given":"Nicholas J.","family":"Turro","id":"Turro-N-J","orcid":""},{"given":"Jacqueline K.","family":"Barton","id":"Barton-J-K","orcid":"0000-0001-9883-1600"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2000-08-03","date_type":"published","publication":"Journal of Physical Chemistry B","volume":"104","number":"30","pagerange":"7214-7220","id_number":"CaltechAUTHORS:20170517-070820804","refereed":true,"issn":"1520-6106","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170517-070820804","related_url":[{"url":"http://dx.doi.org/10.1021/jp000725p","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/full/10.1021/jp000725p","type":"pub","description":"Article"}],"referencetext":["(1) (a) Kelley, S. O.; Barton, J. K. Met. Ions Biol. Syst. 1999, 36, 211.[PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Holmlin, R. E.; Dandliker, P. J.; Barton, J. K. Angew. Chem., Int. Ed. Engl. 1997, 36, 2714.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) O'Neill, P.; Fielden, E. M. Adv. Rad. Biol. 1993, 17, 53.OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Murphy, C. J.; Arkin, M. R.; Jenkins, Y.; Ghatlia, N. D.; Bossmann, S. H.; Turro, N. J.; Barton, J. K. Science 1993, 262, 1025.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Gasper, S. M.; Schuster, G. B. J. Am. Chem. Soc. 1997, 119, 12762.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (f) Lewis, F. D.; Wu, T.; Zhang, Y.; Letsinger, R. L.; Greenfield, S. R.; Wasielewski, M. R. Science 1997, 277, 673.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (g) Meade, T. J.; Kayyem, J. F. Angew. Chem., Int. Ed. Engl. 1995, 34, 358.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY (h) Meggers E.; Kusch D.; Spichty, U.; Giese, B. Angew. Chem., Int. Ed. Engl. 1998, 37, 460.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (i) Fukui, K.; Tanaka, K. Angew. Chem., Int. Ed. Engl. 1998, 37, 158.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (j) Beratan, D. N.; Priyadarshy, S.; Risser, S. M. J. Biol. Chem. 1998, 3, 196.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (k) Fink, H.-W.; Schönenberger, C. Nature 1999, 398, 407.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (l) Harriman, A. Angew. Chem., Int. Ed. Engl. 1999, 38, 945.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(2) (a) Kelley, S. O.; Barton, J. K. Science 1999, 283, 375.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Wan, C.; Fiebig, T.; Kelley, S. O.; Treadway, C. R.; Barton, J. K.; Zewail, A. H. Proc. Nat. Acad. Sci. U.S.A. 1999, 96, 6014.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Kelley, S. O.; Holmlin, R. E.; Stemp, E. D. A.; Barton, J. K. J. Am. Chem. Soc. 1997, 119, 9861.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(3) (a) Kelley, S. O.; Jackson, N. M.; Hill, M. G.; Barton, J. K. Angew. Chem., Int. Ed. Engl. 1999, 111, 991.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(4) (a) Nùñez, M. E.; Hall, D. B.; Barton, J. K. Chem. Biol. 1999, 6, 85.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Hall, D. B.; Holmlin, R. E.; Barton, J. K. Nature 1996, 382, 731.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Hall, D. B.; Barton, J. K. J. Am. Chem. Soc. 1997, 119, 5045.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Hall, D. B.; Kelley, S. O.; Barton, J. K. Biochemistry 1998, 37, 5708.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(5) (a) Dandliker, P. J.; Holmlin, R. E.; Barton, J. K. Science 1997, 275, 1465.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Dandliker, P. J.; Nùñez, M. E.; Barton, J. K. Biochemistry 1998, 37, 6491.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(6) Rajski, S. R.; Kumar, S.; Roberts, R. J.; Barton, J. K. J. Am. Chem. Soc. 1999, 121, 5615.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(7) Fielden, E. M.; Lillicrap, S. C.; Robins, A. B. Radiat. Res. 1971, 48, 421.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(8) Cullis, P. M.; McClymont, J. D.; Symons, M. C. R. J. Chem. Soc., Faraday Trans. 1990, 86, 591.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(9) (a) Miller, J. H.; Frasco, D. L.; Swanberg, C. E.; Rupprecht, A. In Radiation Research:  A Twentieth Century Perspective; Chapman, J. D., Dewey, W. C., Witmore, G. F., Eds.; Academic Press:  San Diego, CA, 1992; Vol. 2.OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Debije, M. G.; Milano, M. T.; Bernhard, W. A. Angew. Chem., Int. Ed. Engl. 1999, 38, 2752.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Messer, A.; Carpenter, K.; Forzley, K.; Buchanan, J.; Yang, S.; Razskazovskii, Y.; Cai, Z.; Sevilla, M. D. J. Phys. Chem. B 2000, 104, 1128.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nHouee-Levin, C.; Gardes-Albert, M.; Rouscilles, A.; Ferradini, C.; Hickel, B. Biochemistry 1991, 30, 8216.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(11) (a) Hildenbrand, K.; Behrens, G.; Schulte-Frohlinde, D.; Herak, J. N. J. Chem. Soc., Perkin Trans. 1989, 2, 283.OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Catterall, H.; Davies, M. J.; Gilbert, B. C. J. Chem. Soc., Perkin. Trans. 1992, 2, 1379.OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Novais, H. M.; Steenken, S. J. Am. Chem. Soc. 1986, 108, 1.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Novais, H. M.; Steenken, S. J. Phys. Chem. 1987, 91, 426.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (e) Weiland, B.; Hüttermann, J.; van Tol, B. Acta Chem. Scand. 1997, 51, 585.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(12) (a) Hüttermann, J.; Voit, K.; Oloff, H.; Köhnlein, W.; Gräslund, A.; Rupprecht, A. Faraday Discuss. Chem. Soc. 1984, 78, 135.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Gräslund, A.; Ehrenberg, A.; Rupprecht, A.; Ström, G. Biochim. Biophys. Acta 1971, 254, 172.[PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Cullis, P. M.; McClymont, J. D.; Malone, M. E.; Mather, A. N.; Podmore, I. D.; Sweeney, M. C.; Symons, M. C. R. J. Chem. Soc., Perkin Trans. 1992, 2, 1695.OpenURL CALIFORNIA INST OF TECHNOLOGY (d) J. Phys. Chem. 1983, 97, 3401.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(13) An EPR spectrum of a heteropolymeric DNA in a perchlorate glass at 77 K was observed upon biphotonic photoionization and was attributed primarily to the guanine radical. See:  Cullis, P. M.; Malone, M. E.; Merson-Davies, L. A. J. Am. Chem. Soc. 1996, 118, 2775.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(14) (a) Stemp, E. D. A.; Arkin, M. R.; Barton, J. K. J. Am. Chem. Soc. 1997, 119, 2921.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Arkin, M. R.; Stemp, E. D. A.; Pulver, S. C.; Barton, J. K. Chem. Biol. 1997, 4, 389.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(15) Juris, A.; Balzani, V.; Barigelletti, F.; Campagna, S.; Belser, P.; von Zelewsky, A. Coord. Chem. Rev. 1988, 84, 85.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(16) Steenken, S.; Jovanovic, S. V. J. Am. Chem. Soc. 1997, 119, 617.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(17) Steenken, S. Chem. Rev. 1989, 89, 503.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(18) Amouyal, E.; Homsi, A.; Chambron, J. C.; Sauvage, J. P. J. Chem. Soc., Dalton Trans. 1990, 6, 1841.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(19) Weil, J. A.; Bolton, J. R.; Wertz, J. E. Electron Paramagnetic Resonance. Elementary Theory and Practical Applications; Wiley-Interscience:  New York, 1994; p 322.OpenURL CALIFORNIA INST OF TECHNOLOGY\nVunakis, H. V.; Seaman, E.; Kahan, L.; Kappler, J. W.; Levine, L. Biochemistry 1966, 5, 3986.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(21) Johnson, C. S., Jr.; Gutowsky, H. S. J. Chem. Phys. 1963, 39, 58.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(22) Johnston, D. H.; Glasgow, K. C.; Thorp, H. H. J. Am. Chem. Soc. 1995, 117, 8933.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(23) Weiland, B.; Hüttermann, J. Int. J. Radiat. Biol. 1998, 74, 341.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(24) Olson, E. J. C.; Hu, D.; Hörmann, A.; Jonkman, A. M.; Arkin, M. R.; Stemp, E. D. A.; Barton, J. K.; P. F. Barbara J. Am. Chem. Soc. 1997, 119, 11458. (b) Friedman, A. E.; Chambron, J.-C.; Sauvage, J.-P.; Turro, N. J.; Barton, J. K. J. Am. Chem. Soc. 1990, 112, 4960. (c) Jenkins, Y.; Friedman, A. E.; Turro, N. J.; Barton, J. K. Biochemistry 1992, 31, 10809.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(25) Saito, I.; Takayama, M.; Sugiyama, H.; Nakatani, K.; Tsuchida, A.; Yamamoto, M. J. Am. Chem. Soc. 1995, 117, 6406. (b) Sugiyama, H.; Saito, I. J. Am. Chem. Soc. 1996, 118, 7063. (c) Faraggi, M.; Broitman, F.; Trent, J. B.; Klapper, M. H. J. Phys. Chem. 1996, 100, 14751.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(26) Catterall, H.; Davies, M. J.; Gilbert, B. C.; Polack, N. P. J. Chem. Soc., Perkin Trans. 1993, 2, 2039. (b) Kuwabara, M.; Inanami, O.; Endoh, D.; Sato, F. Biochemistry 1987, 26, 2458. (c) Davies, M. J.; Gilbert, B. C.; Hazelwood, C.; Polack, N. P. J. Chem. Soc., Perkin Trans. 1995, 2, 13. (d) Kuwabara, M.; Ohshima, H.; Sato, F.; Ono, A.; Matsuda, A. Biochemistry 1993, 32, 10599.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(27) Pou, S. J.; Anderson, D. E.; Surichamorn, W.; Keaton, L. L.; Tod, M. L. Mol. Pharmacol. 1994, 46, 709.[PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(28) Buettner, G. R. Free Radical Biol. Med. 1987, 3, 259.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(29) (a) Burrows, C. J.; Muller, J. G. Chem. Rev. 1998, 98, 1109.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Cadet, J.; Berger, M.; Buchko, G. W.; Joshi, P. C.; Raoul, S.; Ravant, J.-L. J. Am. Chem. Soc. 1994, 116, 7403.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nFranklin, S. J.; Treadway, C. R.; Barton, J. K. Inorg. Chem. 1998, 37, 5198.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(31) (a) Holmlin, R. E.; Stemp, E. D. A.; Barton, J. K. Inorg. Chem. 1998, 37, 29.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Tuite, E.; Lincoln, P.; Nordén, B. J. Am. Chem. Soc. 1997, 119, 239.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(32) Pezeshk, A.; Symons, M. C. R.; McClymont, J. D. J. Phys. Chem. 1996, 100, 18562.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(33) Arkin, M. R.; Stemp, E. D. A.; Holmlin, R. E.; Barton, J. K.; Hörmann, A.; Olson, E. J. C.; Barbara, P. F. Science 1996, 273, 475.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(34) Candeias, L. P.; Steenken, S. J. Am. Chem. Soc. 1993, 115, 2437.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(35) Steenken, S. Biol. Chem. 1997, 378, 1293.[PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(36) Meggers, E.; Michel-Beyerle, M. E.; Giese, B. J. Am. Chem. Soc. 1998, 120, 12950. (b) Giese, B.; Wessely, S.; Spormann, M.; Lindemann, U.; Meggers, E.; Michel-Beyerle, M. Angew. Chem., Int. Ed. Engl. 1999, 38, 8, 996.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(37) Henderson, P. T.; Jones, D.; Hampikian, G.; Kan, Y. Z.; Schuster, G. B. Proc. Natl. Acad. Sci., USA 1999, 96, 8353."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"EPR Detection of Guanine Radicals in a DNA Duplex under Biological Conditions:  Selective Base Oxidation by Ru(phen)2dppz3+ Using the Flash-Quench Technique\nOlav Schiemann, Nicholas J. Turro, and Jacqueline K. Barton\nThe Journal of Physical Chemistry B 2000 104 (30), 7214-7220\nDOI: 10.1021/jp000725p","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":""},{"agency":"NSF","grant_number":""},{"agency":"Deutsche Forschungsgemeinschaft (DFG)","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}