{"title":"Fast label-free multilayered histology-like imaging of human breast cancer by photoacoustic microscopy","uri":"","abstract":"The goal of breast-conserving surgery is to completely remove all of the cancer. Currently, no intraoperative tools can microscopically analyze the entire lumpectomy specimen, which results in 20 to 60% of patients undergoing second surgeries to achieve clear margins. To address this critical need, we have laid the foundation for the development of a device that could allow accurate intraoperative margin assessment. We demonstrate that by taking advantage of the intrinsic optical contrast of breast tissue, photoacoustic microscopy (PAM) can achieve multilayered histology-like imaging of the tissue surface. The high correlation of the PAM images to the conventional histologic images allows rapid computations of diagnostic features such as nuclear size and packing density, potentially identifying small clusters of cancer cells. Because PAM does not require tissue processing or staining, it can be performed promptly and intraoperatively, enabling immediate directed re-excision and reducing the number of second surgeries.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252359","docid":252359,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258765","fileid":1258765,"datasetid":"document","objectid":252359,"filename":"e1602168.full.pdf","mime_type":"application/pdf","hash":"7908bac29c250b32d56338585385f75c","hash_type":"MD5","filesize":971599,"mtime":"2017-05-17 18:15:12","url":"http://authors.library.caltech.edu/77511/1/e1602168.full.pdf"}],"eprintid":77511,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc","main":"e1602168.full.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252360","docid":252360,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258782","fileid":1258782,"datasetid":"document","objectid":252360,"filename":"1602168_SM.pdf","mime_type":"application/pdf","hash":"e8ca3aa198a47773be9e36265d029185","hash_type":"MD5","filesize":1012679,"mtime":"2017-05-17 18:22:08","url":"http://authors.library.caltech.edu/77511/2/1602168_SM.pdf"}],"eprintid":77511,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc","main":"1602168_SM.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/252361","docid":252361,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258784","fileid":1258784,"datasetid":"document","objectid":252361,"filename":"1602168_MovieS1.mp4","mime_type":"video/mp4","hash":"2803887a11f1181c9383a693e6e71595","hash_type":"MD5","filesize":14108087,"mtime":"2017-05-17 18:22:34","url":"http://authors.library.caltech.edu/77511/3/1602168_MovieS1.mp4"}],"eprintid":77511,"pos":3,"placement":3,"mime_type":"video/mp4","format":"video/mpeg","language":"en","security":"public","license":"cc_by_nc","main":"1602168_MovieS1.mp4","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/252362","docid":252362,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258786","fileid":1258786,"datasetid":"document","objectid":252362,"filename":"1602168_MovieS2.mp4","mime_type":"video/mp4","hash":"0b32e00b746f36d4ae1452c57ea98d5b","hash_type":"MD5","filesize":877734,"mtime":"2017-05-17 18:22:51","url":"http://authors.library.caltech.edu/77511/4/1602168_MovieS2.mp4"}],"eprintid":77511,"pos":4,"placement":4,"mime_type":"video/mp4","format":"video/mpeg","language":"en","security":"public","license":"cc_by_nc","main":"1602168_MovieS2.mp4","content":"supplemental"}],"note":"© 2017 The Authors. This is an open-access article distributed under the terms of the Creative Commons Attribution-NonCommercial license, which permits use, distribution, and reproduction in any medium, so long as the resultant use is not for commercial advantage and provided the original work is properly cited.\n\nSubmitted 8 September 2016; Accepted 23 March 2017; Published 17 May 2017. \n\nWe thank J. Ballard for the close reading of the manuscript and J. Yao for the meaningful discussion. \n\nThis work was supported by NIH grants DP1 EB016986 (NIH Director’s Pioneer Award) and R01 CA186567 (NIH Director’s Transformative Research Award) and by the Siteman Cancer Center (2014 Research Development Award in Breast Cancer). \n\nAuthor contributions: T.T.W.W., R.Z., C.Z., R.L.A., D.V.N., and L.V.W. conceived and designed the study. T.T.W.W., R.Z., C.Z., and M.A.P. constructed the imaging system. R.L.A. obtained informed consent and collected the breast cancer specimens. D.V.N. prepared the histology equivalent images. T.T.W.W. and C.Z. performed the experiments. T.T.W.W., R.Z., and D.V.N. analyzed the data. T.T.W.W. and P.H. processed the data. T.T.W.W., R.L.A., D.V.N., and L.V.W. wrote the manuscript. R.L.A., D.V.N., and L.V.W. supervised the whole study. \n\nCompeting interests: L.V.W. has a financial interest in MicroPhotoAcoustics Inc., which, however, did not support this work. L.V.W. serves as chair of the Scientific Advisory Board of MicroPhotoAcoustics Inc. Washington University has a patent application related to this work, filed 7 December 2012 (PCT/US2012/068403). The rest of the authors declare that they have no competing interests. \n\nData and materials availability: All data needed to evaluate the conclusions in the paper are present in the paper and/or the Supplementary Materials. Additional data related to this paper may be requested from the authors.","id":77511,"rev_number":42,"userid":6,"eprint_dir":"disk0/00/07/75/11","datestamp":"2017-05-17 18:48:56","lastmod":"2017-05-17 18:50:31","status_changed":"2017-05-17 18:48:56","type":"article","metadata_visibility":"show","creators":[{"given":"Terence T. W.","family":"Wong","id":"Wong-Terence-T-W","orcid":""},{"given":"Ruiying","family":"Zhang","id":"Zhang-Ruiying","orcid":""},{"given":"Pengfei","family":"Hai","id":"Hai-Pengfei","orcid":""},{"given":"Chi","family":"Zhang","id":"Zhang-Chi","orcid":""},{"given":"Miguel A.","family":"Pleitez","id":"Pleitez-M-A","orcid":""},{"given":"Rebecca L.","family":"Aft","id":"Aft-R-L","orcid":""},{"given":"Deborah V.","family":"Novack","id":"Novack-D-V","orcid":""},{"given":"Lihong V.","family":"Wang","id":"Wang-Lihong-V","orcid":"0000-0001-9783-4383"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Label-freemulti-layer histology; unprocessed tissue; human breast cancer; photoacoustic imaging; margin analysis","date":"2017-05-17","date_type":"published","publication":"Science Advances","volume":"3","number":"5","pagerange":"Art. No. e1602168","id_number":"CaltechAUTHORS:20170516-164857493","refereed":true,"issn":"2375-2548","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170516-164857493","related_url":[{"url":"http://dx.doi.org/10.1126/sciadv.1602168","type":"doi","description":"Article"},{"url":"http://advances.sciencemag.org/content/3/5/e1602168","type":"pub","description":"Article"},{"url":"http://advances.sciencemag.org/cgi/content/full/3/5/e1602168/DC1","type":"pub","description":"Supplementary Materials"}],"referencetext":["↵American Cancer Society, “Breast Cancer Facts \u0026 Figures 2015–2016” (American Cancer Society Inc., 2015).\n↵ M. S. Moran, S. J. Schnitt, A. E. Giuliano, J. R. Harris, S. A. Khan, J. Horton, S. Klimberg, M. Chavez-MacGregor, G. Freedman, N. Houssami, P. L. Johnson, M. Morrow, Society of Surgical Oncology–American Society for Radiation Oncology consensus guideline on margins for breast-conserving surgery with whole-breast irradiation in stages I and II invasive breast cancer. J. Clin. Oncol. 88, 553–564 (2014).Caltech ConnectGoogle Scholar\n↵ J. A. van Dongen, A. C. Voogd, I. S. Fentiman, C. Legrand, R. J. Sylvester, D. Tong, E. van der Schueren, P. A. Helle, K. van Zijl, H. Bartelink, Long-term results of a randomized trial comparing breast-conserving therapy with mastectomy: European Organization for Research and Treatment of Cancer 10801 trial. J. Natl. Cancer Inst. 92, 1143–1150 (2000).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\nC. C. Park, M. Mitsumori, A. Nixon, A. Recht, J. Connolly, R. Gelman, B. Silver, S. Hetelekidis, A. Abner, J. R. Harris, S. J. Schnitt, Outcome at 8 years after breast-conserving surgery and radiation therapy for invasive breast cancer: Influence of margin status and systemic therapy on local recurrence. J. Clin. Oncol. 18, 1668–1675 (2000).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ C. Kunos, L. Latson, B. Overmoyer, P. Silverman, R. Shenk, T. Kinsella, J. Lyons, Breast conservation surgery achieving ≥ 2 mm tumor-free margins results in decreased local-regional recurrence rates. Breast J. 12, 28–36 (2006).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ R. G. Pleijhuis, M. Graafland, J. de Vries, J. Bart, J. S. de Jong, G. M. van Dam, Obtaining adequate surgical margins in breast-conserving therapy for patients with early-stage breast cancer: Current modalities and future directions. Ann. Surg. Oncol. 16, 2717–2730 (2009).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ A. B. Chagpar, B. K. Killelea, T. N. Tsangaris, M. Butler, K. Stavris, F. Li, X. Yao, V. Bossuyt, M. Harigopal, D. R. Lannin, L. Pusztai, N. R. Horowitz, A randomized, controlled trial of cavity shave margins in breast cancer. N. Engl. J. Med. 373, 503–510 (2015).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ N. H. Peters, S. Esser, M. A. van den Bosch, R. K. Storm, P. W. Plaisier, T. van Dalen, S. C. Diepstraten, T. Weits, P. J. Westenend, G. Stapper, M. A. Fernandez-Gallardo, I. H. Borel Rinkes, R. van Hillegersberg, W. P. Mali, P. H. Peeters, Preoperative MRI and surgical management in patients with nonpalpable breast cancer: The MONET—Randomised controlled trial. Eur. J. Cancer 47, 879–886 (2011).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\nL. Turnbull, S. Brown, I. Harvey, C. Olivier, P. Drew, V. Napp, A. Hanby, J. Brown, Comparative effectiveness of MRI in breast cancer (COMICE) trial: A randomised controlled trial. Lancet 375, 563–571 (2010).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\nT. M. Allweis, Z. Kaufman, S. Lelcuk, I. Pappo, T. Karni, S. Schneebaum, R. Spector, A. Schindel, D. Hershko, M. Zilberman, J. Sayfan, Y. Berlin, A. Hadary, O. Olsha, H. Paran, M. Gutman, M. Carmon, A prospective, randomized, controlled, multicenter study of a real-time, intraoperative probe for positive margin detection in breast-conserving surgery. Am. J. Surg. 196, 483–489 (2008).Caltech ConnectCrossRefPubMedGoogle Scholar\nT. Karni, I. Pappo, J. Sandbank, O. Lavon, V. Kent, R. Spector, S. Morgenstern, S. Lelcuk, A device for real-time, intraoperative margin assessment in breast-conservation surgery. Am. J. Surg. 194, 467–473 (2007).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ S. B. Coopey, J. M. Buckley, B. L. Smith, K. S. Hughes, M. A. Gadd, M. C. Specht, Lumpectomy cavity shaved margins do not impact re-excision rates in breast cancer patients. Ann. Surg. Oncol. 18, 3036–3040 (2011).Caltech ConnectPubMedGoogle Scholar\n↵ N. M. A. Krekel, M. H. Haloua, A. M. F. Lopes Cardozo, R. H. de Wit, A. M. Bosch, L. M. de Widt-Levert, S. Muller, H. van der Veen, E. Bergers, E. S. M. de Lange de Klerk, S. Meijer, M. P. van den Tol, Intraoperative ultrasound guidance for palpable breast cancer excision (COBALT trial): A multicentre, randomised controlled trial. Lancet Oncol. 14, 48–54 (2013).Caltech ConnectPubMedGoogle Scholar\n↵ E. K. Valdes, S. K. Boolbol, J.-M. Cohen, S. M. Feldman, Intra-operative touch preparation cytology; does it have a role in re-excision lumpectomy? Ann. Surg. Oncol. 14, 1045–1050 (2007).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ S. E. Singletary, Surgical margins in patients with early-stage breast cancer treated with breast conservation therapy. Am. J. Surg. 184, 383–393 (2002).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ L. E. McCahill, R. M. Single, E. J. Aiello Bowles, H. S. Feigelson, T. A. James, T. Barney, J. M. Engel, A. A. Onitilo, Variability in reexcision following breast conservation surgery. JAMA 307, 467–475 (2012).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\nM. Clarke, R. Collins, S. Darby, C. Davies, P. Elphinstone, V. Evans, J. Godwin, R. Gray, C. Hicks, S. James, E. MacKinnon, P. McGale, T. McHugh, R. Peto, C. Taylor, Y. Wang; Early Breast Cancer Trialists’ Collaborative Group (EBCTCG), Effects of radiotherapy and of differences in the extent of surgery for early breast cancer on local recurrence and 15-year survival: An overview of the randomised trials. Lancet 366, 2087–2106 (2005).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\nR. Jeevan, D. A. Cromwell, M. Trivella, G. Lawrence, O. Kearins, J. Pereira, C. Sheppard, C. M. Caddy, J. H. P. van der Meulen, Reoperation rates after breast conserving surgery for breast cancer among women in England: Retrospective study of hospital episode statistics. BMJ 345, e4505 (2012).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\nL. Jacobs, Positive margins: The challenge continues for breast surgeons. Ann. Surg. Oncol. 15, 1271–1272 (2008).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\nM. C. Lee, K. Rogers, K. Griffith, K. A. Diehl, T. M. Breslin, V. M. Cimmino, A. E. Chang, L. A. Newman, M. S. Sabel, Determinants of breast conservation rates: Reasons for mastectomy at a comprehensive cancer center. Breast J. 15, 34–40 (2009).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\nW. Jung, E. Kang, S. M. Kim, D. Kim, Y. Hwang, Y. Sun, C. K. Yom, S.-W. Kim, Factors associated with re-excision after breast-conserving surgery for early-stage breast cancer. J. Breast Cancer 15, 412–419 (2012).Caltech ConnectCrossRefPubMedGoogle Scholar\nG. C. Balch, S. K. Mithani, J. F. Simpson, M. C. Kelley, Accuracy of intraoperative gross examination of surgical margin status in women undergoing partial mastectomy for breast malignancy. Am. Surg. 71, 22–28 (2005).Caltech ConnectPubMedGoogle Scholar\nT. L. Huston, R. Pigalarga, M. P. Osborne, E. Tousimis, The influence of additional surgical margins on the total specimen volume excised and the reoperative rate after breast-conserving surgery. Am. J. Surg. 192, 509–512 (2006).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ A. Kobbermann, A. Unzeitig, X.-J. Xie, J. Yan, D. Euhus, Y. Peng, V. Sarode, A. Moldrem, A. M. Leitch, V. Andrews, C. Stallings, R. Rao, Impact of routine cavity shave margins on breast cancer re-excision rates. Ann. Surg. Oncol. 18, 1349–1355 (2011).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ L. V. Wang, S. Hu, Photoacoustic tomography: In vivo imaging from organelles to organs. Science 335, 1458–1462 (2012).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ L. V. Wang, Multiscale photoacoustic microscopy and computed tomography. Nat. Photonics 3, 503–509 (2009).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ D.-K. Yao, K. Maslov, K. K. Shung, Q. Zhou, L. V. Wang, In vivo label-free photoacoustic microscopy of cell nuclei by excitation of DNA and RNA. Opt. Lett. 35, 4139–4141 (2010).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ C. Zhang, Y. S. Zhang, D.-K. Yao, Y. Xia, L. V. Wang, Label-free photoacoustic microscopy of cytochromes. J. Biomed. Opt. 18, 020504 (2013).Caltech ConnectGoogle Scholar\n↵ J. Yao, L. Wang, J.-M. Yang, K. I. Maslov, T. T. W. Wong, L. Li, C.-H. Huang, J. Zou, L. V. Wang, High-speed label-free functional photoacoustic microscopy of mouse brain in action. Nat. Methods 12, 407–410 (2015).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ H. F. Zhang, K. Maslov, G. Stoica, L. V. Wang, Functional photoacoustic microscopy for high-resolution and noninvasive in vivo imaging. Nat. Biotechnol. 24, 848–851 (2006).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ T. J. Allen, A. Hall, A. P. Dhillon, J. S. Owen, P. C. Beard, Spectroscopic photoacoustic imaging of lipid-rich plaques in the human aorta in the 740 to 1400 nm wavelength range. J. Biomed. Opt. 17, 061209 (2012).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ D. Zink, A. H. Fische, J. A. Nickerson, Nuclear structure in cancer cells. Nat. Rev. Cancer 4, 677–687 (2004).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ D.-K. Yao, R. Chen, K. Maslov, Q. Zhou, L. V. Wang, Optimal ultraviolet wavelength for in vivo photoacoustic imaging of cell nuclei. J. Biomed. Opt. 17, 056004 (2012).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ J. Xia, G. Li, L. Wang, M. Nasiriavanaki, K. Maslov, J. A. Engelbach, J. R. Garbow, L. V. Wang, Wide-field two-dimensional multifocal optical-resolution photoacoustic-computed microscopy. Opt. Lett. 38, 5236–5239 (2013).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ K.-H. Yu, C. Zhang, G. J. Berry, R. B. Altman, C. Ré, D. L. Rubin, M. Snyder, Predicting non-small cell lung cancer prognosis by fully automated microscopic pathology image features. Nat. Commun. 7, 12474 (2016).Caltech ConnectGoogle Scholar\n↵ T.-C. Hsiao, Y.-Y. Cheng, W.-T. Tein, S.-B. Luo, D.-Y. Chiou, R.-J. Chung, M.-L. Li, Deep-penetration photoacoustic array imaging of calcifications. J. Biomed. Opt. 18, 066002 (2013).Caltech ConnectGoogle Scholar\n↵ L. Liberman, A. F. Abramson, F. B. Squires, J. R. Glassman, E. A. Morris, D. D. Dershaw, The breast imaging reporting and data system: Positive predictive value of mammographic features and final assessment categories. Am. J. Roentgenol. 171, 35–40 (1998).Caltech ConnectCrossRefPubMedWeb of ScienceGoogle Scholar\n↵ R. Baker, K. D. Rogers, N. Shepherd, N. Stone, New relationships between breast microcalcifications and cancer. Br. J. Cancer 103, 1034–1039 (2010).Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ L. Wang, C. Zhang, L. V. Wang, Grueneisen relaxation photoacoustic microscopy. Phys. Rev. Lett. 113, 174301 (2014).Caltech ConnectGoogle Scholar\n↵ F. Abdalla, J. Boder, R. Markus, H. Hashmi, A. Buhmeida, Y. Collan, Correlation of nuclear morphometry of breast cancer in histological sections with clinicopathological features and prognosis. Anticancer Res. 29, 1771–1776 (2009)."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"T. T. W. Wong, R. Zhang, P. Hai, C. Zhang, M. A. Pleitez, R. L. Aft, D. V. Novack, L. V. Wang, Fast label-free multilayered histology-like imaging of human breast cancer by photoacoustic microscopy. Sci. Adv. 3, e1602168 (2017)","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":"DP1 EB016986"},{"agency":"NIH","grant_number":"R01 CA186567"},{"agency":"Siteman Cancer Center","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}