{"title":"Structure−Function Correlation of Chloroquine and Analogues as Transgene Expression Enhancers in Nonviral Gene Delivery","uri":"","abstract":"To understand how chloroquine (CQ) enhances transgene expression in polycation-based, nonviral gene delivery systems, a number of CQ analogues with variations in the aliphatic amino side chain or in the aromatic ring are synthesized and investigated. Our studies indicate that the aliphatic amino moiety of CQ is essential to provide increased gene expression. Further, the enhancements are more dramatically affected by changes to the aromatic ring and are positively correlated to the strength of intercalation between DNA and the CQ analogues. Quinacrine (QC), a CQ analogue with a fused acridinyl structure that can strongly intercalate DNA, enhances transfection similarly to CQ at a concentration 10 times lower, while N^4-(4-pyridinyl)-N^1,N^1-diethyl-1,4-pentanediamine (CP), a CQ analogue that has a weakly intercalating pyridinyl ring, shows no effect on gene expression. Subtle change on the 7-substituent of the chloroquine aromatic structure can also greatly affect the ability of the CQ analogues to enhance transgene expression. Transfection in the presence of N^4-(7-trifluoromethyl-4-quinolinyl)-N^1,N^1-diethyl-1,4-pentanediamin e (CQ7a) shows expression efficiency 10 times higher than in the presence of CQ at same concentration, while transfection in the presence of N^4-(4-quinolinyl)-N^1,N^1-diethyl-1,4-pentanediamine (CQ7b) does not reveal any enhancing effects on expression. Through a number of comparative studies with CQ and its analogues, we conclude that there are at least three mechanistic features of CQ that lead to the enhancement in gene expression:  (i) pH buffering in endocytic vesicles, (ii) displacement of polycations from the nucleic acids in polyplexes, and (iii) alteration of the biophysical properties of the released nucleic acid.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252346","docid":252346,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258612","fileid":1258612,"datasetid":"document","objectid":252346,"filename":"jm060736s.pdf","mime_type":"application/pdf","hash":"d259e052eaf515fdb5b7d588cdcd288c","hash_type":"MD5","filesize":504670,"mtime":"2017-05-17 14:14:55","url":"http://authors.library.caltech.edu/77521/1/jm060736s.pdf"}],"eprintid":77521,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"jm060736s.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252347","docid":252347,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258616","fileid":1258616,"datasetid":"document","objectid":252347,"filename":"jm060736ssi20060817_114213.pdf","mime_type":"application/pdf","hash":"9132e1d8162b9392c50d5c2c124cfabd","hash_type":"MD5","filesize":361182,"mtime":"2017-05-17 14:22:32","url":"http://authors.library.caltech.edu/77521/2/jm060736ssi20060817_114213.pdf"}],"eprintid":77521,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"jm060736ssi20060817_114213.pdf","content":"supplemental"}],"note":"© 2006 American Chemical Society. \n\nReceived 19 June 2006. Published online 7 October 2006. Published in print 1 November 2006. \n\nWe thank Insert Therapeutics for financial support.","id":77521,"rev_number":13,"userid":772,"eprint_dir":"disk0/00/07/75/21","datestamp":"2017-05-17 16:08:56","lastmod":"2017-05-17 16:08:56","status_changed":"2017-05-17 16:08:56","type":"article","metadata_visibility":"show","creators":[{"given":"Jianjun","family":"Cheng","id":"Cheng-Jianjun","orcid":""},{"given":"Ryan","family":"Zeidan","id":"Zeidan-R-K","orcid":""},{"given":"Swaroop","family":"Mishra","id":"Mishra-S","orcid":""},{"given":"Aijie","family":"Liu","id":"Liu-Aijie","orcid":""},{"given":"Suzie H.","family":"Pun","id":"Pun-Suzie-Hwang","orcid":""},{"given":"Rajan P.","family":"Kulkarni","id":"Kulkarni-R-P","orcid":""},{"given":"Gregory S.","family":"Jensen","id":"Jensen-G-S","orcid":""},{"given":"Nathalie C.","family":"Bellocq","id":"Bellocq-N-C","orcid":""},{"given":"Mark E.","family":"Davis","id":"Davis-M-E","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2006-11-02","date_type":"published","publication":"Journal of Medicinal Chemistry","volume":"49","number":"22","pagerange":"6522-6531","id_number":"CaltechAUTHORS:20170517-070821385","refereed":true,"issn":"0022-2623 ","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170517-070821385","related_url":[{"url":"http://dx.doi.org/10.1021/jm060736sD","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/jm060736s","type":"pub","description":"Article"},{"url":"http://pubs.acs.org/doi/suppl/10.1021/jm060736s","type":"pub","description":"Supporting Information"}],"referencetext":["(1) Hwang, S. J.; Davis, M. E. Cationic polymers for gene delivery:  Designs for overcoming barriers to systemic administration. Curr. Opin. Mol. Ther. 2001, 3, 183−191.[PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(2) Davis, M. E. Nonviral gene delivery systems. Curr. Opin. Biotechnol. 2002, 13, 128−131.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(3) Lechardeur, D.; Verkman, A. S.; Lukacs, G. L. Intracellular routing of plasmid DNA during non-viral gene transfer. Adv. Drug Delivery Rev. 2005, 57, 755−767.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(4) Wagner, E.; Zenke, M.; Cotten, M.; Beug, H.; Birnstiel, M. L. Transferrin-Polycation Conjugates as Carriers for DNA Uptake into Cells. Proc. Natl. Acad. Sci. U.S.A. 1990, 87, 3410−3414.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(5) Zenke, M.; Steinlein, P.; Wagner, E.; Cotten, M.; Beug, H.; Birnstiel, M. L. Receptor-Mediated Endocytosis of Transferrin Polycation Conjugates an Efficient Way to Introduce DNA into Hematopoietic-Cells. Proc. Natl. Acad. Sci. U.S.A. 1990, 87, 3655−3659.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(6) Midoux, P.; Mendes, C.; Legrand, A.; Raimond, J.; Mayer, R.; Monsigny, M.; Roche, A. C. Specific Gene-Transfer Mediated by Lactosylated Poly-l-Lysine into Hepatoma-Cells. Nucleic Acids Res. 1993, 21, 871−878.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(7) Monsigny, M.; Roche, A. C.; Midoux, P.; Mayer, R. Glycoconjugates as Carriers for Specific Delivery of Therapeutic Drugs and Genes. Adv. Drug Delivery Rev. 1994, 14, 1−24.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(8) Erbacher, P.; Roche, A. C.; Monsigny, M.; Midoux, P. Putative role of chloroquine in gene transfer into a human hepatoma cell line by DNA lactosylated polylysine complexes. Exp. Cell Res. 1996, 225, 186−194.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(9) Gonzalez, H.; Hwang, S. J.; Davis, M. E. New class of polymers for the delivery of macromolecular therapeutics. Bioconjugate Chem. 1999, 10, 1068−1074.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nHwang, S. J.; Bellocq, N. C.; Davis, M. E. Effects of structure of beta-cyclodextrin-containing polymers on gene delivery. Bioconjugate Chem. 2001, 12, 280−290.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(11) Pun, S. H.; Davis, M. E. Development of a nonviral gene delivery vehicle for systemic application. Bioconjugate Chem. 2002, 13, 630−639.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(12) Reineke, T. M.; Davis, M. E. Structural effects of carbohydrate-containing polycations on gene delivery. 1. Carbohydrate size and its distance from charge centers. Bioconjugate Chem. 2003, 14, 247−254.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(13) Reineke, T. M.; Davis, M. E. Structural effects of carbohydrate-containing polycations on gene delivery. 2. Charge center type. Bioconjugate Chem. 2003, 14, 255−261.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(14) Popielarski, S. R.; Mishra, S.; Davis, M. E. Structural effects of carbohydrate-containing polycations on gene delivery. 3. Cyclodextrin type and functionalization. Bioconjugate Chem. 2003, 14, 672−678.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(15) Irvin, J. L.; Irvin, E. M. Spectrophotometric and Potentiometric Evaluation of Apparent Acid Dissociation Exponents of Various 4-Aminoquinolines. J. Am. Chem. Soc. 1947, 69, 1091−1099.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(16) Maxfield, F. R. Weak Bases and Ionophores Rapidly and Reversibly Raise the Ph of Endocytic Vesicles in Cultured Mouse Fibroblasts. J. Cell Biol. 1982, 95, 676−681.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(17) Poole, B.; Ohkuma, S. Effect of Weak Bases on the Intralysosomal Ph in Mouse Peritoneal-Macrophages. J. Cell Biol. 1981, 90, 665−669.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(18) Sonawane, N. D.; Szoka, F. C.; Verkman, A. S. Chloride accumulation and swelling in endosomes enhances DNA transfer by polyamine-DNA polyplexes. J. Biol. Chem. 2003, 278, 44826−44831.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(19) Wibo, M.; Poole, B. Protein Degradation in Cultured-Cells .2. Uptake of Chloroquine by Rat Fibroblasts and Inhibition of Cellular Protein Degradation and Cathepsin-B1. J. Cell Biol. 1974, 63, 430−440.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nPoole, B.; Ohkuma, S.; Warburton, M. J. Accumulation of Weakly Basic Substances in Lysosomes and Inhibition of Intracellular Protein Degradation. Acta Biol. Med. Ger. 1977, 36, 1777−1788.[PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(21) Behr, J. P. The proton sponge:  A trick to enter cells the viruses did not exploit. Chimia 1997, 51, 34−36.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(22) Allison, J. L.; Obrien, R. L.; Hahn, F. E. DNAReaction with Chloroquine. Science 1965, 149, 1111−1113.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(23) Cohen, S. N.; Yielding, K. L. Spectrophotometric studies of the interaction of chloroquine with deoxyribonucleic acid. J. Biol. Chem. 1965, 240, 3123−3131.[PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(24) Egan, T. Structure−Function Relationships in Chloroquine and Related 4-Aminoquinoline Antimalarials. Mini-Rev. Med. Chem. 2001, 1, 113−123.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(25) Egan, T. J.; Hunter, R.; Kaschula, C. H.; Marques, H. M.; Misplon, A.; Walden, J. Structure−function relationships in aminoquinolines:  Effect of amino and chloro groups on quinoline-hematin complex formation, inhibition of beta-hematin formation, and antiplasmodial activity. J. Med. Chem. 2000, 43, 283−291.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(26) Kaschula, C. H.; Egan, T. J.; Hunter, R.; Basilico, N.; Parapini, S.; Taramelli, D.; Pasini, E.; Monti, D. Structure−activity relationships in 4-aminoquinoline antiplasmodials. The role of the group at the 7-position. J. Med. Chem. 2002, 45, 3531−3539.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(27) De, D. Y. D.; Krogstad, F. M.; Byers, L. D.; Krogstad, D. J. Structure−activity relationships for antiplasmodial activity among 7-substituted 4-aminoquinolines. J. Med. Chem. 1998, 41, 4918−4926.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(28) De, D. Y.; Byers, L. D.; Krogstad, D. J. Antimalarials:  Synthesis of 4-aminoquinolines that circumvent drug resistance in malaria parasites. J. Heterocycl. Chem. 1997, 34, 315−320.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(29) Bellocq, N. C.; Pun, S. H.; Jensen, G. S.; Davis, M. E. Transferrin-containing, cyclodextrin polymer-based particles for tumor-targeted gene delivery. Bioconjugate Chem. 2003, 14, 1122−1132.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nBellocq, N. C.; Kang, D. W.; Wang, X. H.; Jensen, G. S.; Pun, S. H.; Schluep, T.; Zepeda, M. L.; Davis, M. E. Synthetic biocompatible cyclodextrin-based constructs for local gene delivery to improve cutaneous wound healing. Bioconjugate Chem. 2004, 15, 1201−1211.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(31) Pun, S. H.; Tack, F.; Bellocq, N. C.; Cheng, J. J.; Grubbs, B. H.; Jensen, G. S.; Davis, M. E.; Brewster, M.; Janicot, M.; Janssens, B.; Floren, W.; Bakker, A. Targeted delivery of RNA-cleaving DNAenzyme (DNAzyme) to tumor tissue by transferrin-modified, cyclodextrin-based particles. Cancer Biol. Ther. 2004, 3, 641−650.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(32) Mishra, S.; Webster, P.; Davis, M. E. PEGylation significantly affects cellular uptake and intracellular trafficking of non-viral gene delivery particles. Eur. J. Cell Biol. 2004, 83, 97−111.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(33) Pun, S. H.; Bellocq, N. C.; Liu, A. J.; Jensen, G.; Machemer, T.; Quijano, E.; Schluep, T.; Wen, S. F.; Engler, H.; Heidel, J.; Davis, M. E. Cyclodextrin-modified polyethylenimine polymers for gene delivery. Bioconjugate Chem. 2004, 15, 831−840.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(34) Colombo, M. I.; Bertini, F. Properties of Binding-Sites for Chloroquine in Liver Lysosomal Membranes. J. Cell. Physiol. 1988, 137, 598−602.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(35) Kulkarni, R. P.; Mishra, S.; Fraser, S. E.; Davis, M. E. Single cell kinetics of intracellular, nonviral, nucleic acid delivery vehicle acidification and trafficking. Bioconjugate Chem. 2005, 16, 986−994.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(36) Singh, N. P.; McCoy, M. T.; Tice, R. R.; Schneider, E. L. A simple technique for quantitation of low levels of DNA damage in individual cells. Exp. Cell Res. 1988, 175, 184−191.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(37) O'Brien, R.; Allison, J.; Hahn, F. Evidence for intercalation of chloroquine into DNA. Biochim. Biophys. Acta 1966, 129, 622−624.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(38) Parker, F. S.; Irvin, J. L. The Interaction of Chloroquine with Nucleic Acids and Nucleoproteins. J. Biol. Chem. 1952, 199, 897−909.[PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(39) Doglia, S. M.; Albinsson, B.; Hiort, C.; Norden, B.; Graslund, A. QuinacrineSpectroscopic Properties and Interactions with Polynucleotides. Biopolymers 1993, 33, 1431−1442.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nSchaffer, D. V.; Fidelman, N. A.; Dan, N.; Lauffenburger, D. A. Vector unpacking as a potential barrier for receptor-mediated polyplex gene delivery. Biotechnol. Bioeng. 2000, 67, 598−606.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(41) Lloyd, J. B. Lysosome membrane permeability:  implications for drug delivery. Adv. Drug Delivery Rev. 2000, 41, 189−200.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(42) Rashid, F.; Horobin, R. W.; Williams, M. A. Predicting the behaviour and selectivity of fluorescent probes for lysosomes and related structures by means of structure−activity models. Histochem. J. 1991, 23, 450−459.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(43) Diwu, Z.; Chen, C. S.; Zhang, C.; Klaubert, D. H.; Haugland, R. P. A novel acidotropic pH indicator and its potential application in labeling acidic organelles of live cells. Chem. Biol. 1999, 6, 411−418.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(44) Hurwitz, S. J.; Terashima, M.; Mizunuma, N.; Slapak, C. A. Vesicular anthracycline accumulation in doxorubicin-selected U-937 cells:  participation of lysosomes. Blood 1997, 89, 3745−3754.[PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(45) de Duve, C.; de Barsy, T.; Poole, B.; Trouet, A.; Tulkens, P.; Van Hoof, F. Commentary. Lysosomotropic agents. Biochem. Pharmacol. 1974, 23, 2495−2531.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(46) Duvvuri, M.; Krise, J. P. A novel assay reveals that weakly basic model compounds concentrate in lysosomes to an extent greater than pH-partitioning theory would predict. Mol. Pharmacol. 2005, 2, 440−448.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(47) Lukacs, G. L.; Haggie, P.; Seksek, O.; Lechardeur, D.; Freedman, N.; Verkman, A. S. Size-dependent DNA mobility in cytoplasm and nucleus. J. Biol. Chem. 2000, 275, 1625−1629.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(48) Lechardeur, D.; Sohn, K. J.; Haardt, M.; Joshi, P. B.; Monck, M.; Graham, R. W.; Beatty, B.; Squire, J.; O'Brodovich, H.; Lukacs, G. L. Metabolic instability of plasmid DNA in the cytosol:  a potential barrier to gene transfer. Gene Ther. 1999, 6, 482−497."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Structure−Function Correlation of Chloroquine and Analogues as Transgene Expression Enhancers in Nonviral Gene Delivery\nJianjun Cheng, Ryan Zeidan, Swaroop Mishra, Aijie Liu, Suzie H. Pun, Rajan P. Kulkarni, Gregory S. Jensen, Nathalie C. Bellocq, and Mark E. Davis\nJournal of Medicinal Chemistry 2006 49 (22), 6522-6531\nDOI: 10.1021/jm060736s","other_numbering_system":null,"funders":[{"agency":"Insert Therapeutics, Inc.","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}