{"title":"Amplitude limits and nonlinear damping of shear-Alfvén waves in high-beta low-collisionality plasmas","uri":"","abstract":"This work, which extends Squire et al (Astrophys. J. Lett. 2016 830 L25), explores the effect of self-generated pressure anisotropy on linearly polarized shear-Alfvén fluctuations in low-collisionality plasmas. Such anisotropies lead to stringent limits on the amplitude of magnetic perturbations in high-β plasmas, above which a fluctuation can destabilize itself through the parallel firehose instability. This causes the wave frequency to approach zero, 'interrupting' the wave and stopping its oscillation. These effects are explored in detail in the collisionless and weakly collisional 'Braginskii' regime, for both standing and traveling waves. The focus is on simplified models in one dimension, on scales much larger than the ion gyroradius. The effect has interesting implications for the physics of magnetized turbulence in the high-β conditions that are prevalent in many astrophysical plasmas.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252353","docid":252353,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258722","fileid":1258722,"datasetid":"document","objectid":252353,"filename":"Squire_2017_New_J._Phys._19_055005.pdf","mime_type":"application/pdf","hash":"9825674e5eb328d9a9341be1bfff9c03","hash_type":"MD5","filesize":1540515,"mtime":"2017-05-17 17:41:35","url":"http://authors.library.caltech.edu/77524/1/Squire_2017_New_J._Phys._19_055005.pdf"}],"eprintid":77524,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"Squire_2017_New_J._Phys._19_055005.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252354","docid":252354,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258724","fileid":1258724,"datasetid":"document","objectid":252354,"filename":"1701.03175.pdf","mime_type":"application/pdf","hash":"9e68e707e519b94ecae15669399de87a","hash_type":"MD5","filesize":1436149,"mtime":"2017-05-17 17:41:43","url":"http://authors.library.caltech.edu/77524/2/1701.03175.pdf"}],"eprintid":77524,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1701.03175.pdf","content":"submitted"}],"note":"© 2017 IOP Publishing Ltd and Deutsche Physikalische Gesellschaft. Original content from this work may be used under the terms of the Creative Commons Attribution 3.0 licence. Any further distribution of this work must maintain attribution to the author(s) and the title of the work, journal citation and DOI. \n\nReceived 11 January 2017; Accepted 6 April 2017; Published 17 May 2017. \n\nIt is a pleasure to thank S Cowley, M Kunz, S Bale, C H K Chen, S Balbus, L Sironi, F Rincon, and M Strumik for useful and enlightening discussions. JS is endebted to Merton College for supporting a stay in Oxford where some of this work was carried out. JS and AAS would also like to thank the Wolfgang Pauli Institute in Vienna for its hospitality during the 9th Plasma Kinetics Working Group Meeting. JS was funded in part by the Gordon and Betty Moore Foundation through Grant GBMF5076 to Lars Bildsten, Eliot Quataert and E Sterl Phinney. AAS was supported in part by grants from UK STFC and EPSRC. EQ was supported by Simons Investigator awards from the Simons Foundation and NSF grant AST 13-33612.","id":77524,"rev_number":11,"userid":18,"eprint_dir":"disk0/00/07/75/24","datestamp":"2017-05-17 18:59:22","lastmod":"2017-05-17 18:59:22","status_changed":"2017-05-17 18:59:22","type":"article","metadata_visibility":"show","creators":[{"given":"J.","family":"Squire","id":"Squire-J","orcid":""},{"given":"A. A.","family":"Schekochihin","id":"Schekochihin-A-A","orcid":""},{"given":"E.","family":"Quataert","id":"Quataert-E","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Alfvén waves, pressure anisotropy, magnetized turbulence, high-beta plasma, firehose instability, collisionless plasma","date":"2017-05","date_type":"published","publication":"New Journal of Physics","volume":"19","number":"5","pagerange":"Art. No. 055005","id_number":"CaltechAUTHORS:20170517-104128598","refereed":true,"issn":"1367-2630","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170517-104128598","related_url":[{"url":"https://doi.org/10.1088/1367-2630/aa6bb1","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.1088/1367-2630/aa6bb1/meta","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1701.03175","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Achterberg A 1981 Astron. Astrophys. 98 161\n  \n\n\nBalbus S A and Hawley J F 1998 Rev. Mod. Phys. 70 1\nCrossref  \n\n\nBale S D et al 2009 Phys. Rev. Lett. 103 211101\nCrossref  \n\n\nBoldyrev S 2006 Phys. Rev. Lett. 96 115002\nCrossref  \n\n\nBraginskii S I 1965 Rev. Plasma Phys. 1 205\n  \n\n\nBruno R and Carbone V 2013 Living Rev. Solar Phys. 10 2\nCrossref  \n\n\nCatto P J and Simakov A N 2004 Phys. Plasmas 11 90\nCrossref  \n\n\nCesarsky C J and Kulsrud R M 1981 Cosmic-ray self confinement in the hot phase of the interstellar medium Origin of Cosmic Rays ed G Setti p 251\nCrossref  \n\n\nChandrasekhar S, Kaufman A N and Watson K M 1958 Proc. R. Soc. Lond. A 245 435\nCrossref  \n\n\nChew C F, Goldberger M L and Low F E 1956 Proc. R. Soc. Lond. A 236 112\nCrossref  \n\n\nCramer N F 2011 The Physics of Alfvén Waves (New York: Wiley)\n  \n\n\nDavidson R C and Völk H J 1968 Phys. Fluids 11 2259\nCrossref  \n\n\nDel Zanna L, Velli M and Londrillo P 2001 Astron. Astrophys. 367 705\nCrossref  \n\n\nDerby N F Jr 1978 Astrophys. J. 224 1013\nCrossref  \n\n\nEastwood J P et al 2005 Space Sci. Rev. 118 41\nCrossref  \n\n\nFlå T, Mjølhus E and Wyller J 1989 Phys. Scr. 40 219\nIOPscience  \n\n\nFoote E A and Kulsrud R M 1979 Astrophys. J. 233 302\nCrossref  \n\n\nForest C B et al 2015 J. Plasma Phys. 81 345810501\nCrossref  \n\n\nGaleev A A and Oraevskii V N 1963 Sov. Phys.—Dokl. 7 988\n  \n\n\nGaltier S, Nazarenko S V, Newell A C and Pouquet A 2000 J. Plasma Phys. 63 447\nCrossref  \n\n\nGekelman W et al 2016 Rev. Sci. Instrum. 87 025105\nCrossref  \n\n\nGizon L, Cally P S and Leibacher J 2008 Helioseismology, Asteroseismology, and MHD Connections (Berlin: Springer)\nCrossref  \n\n\nGoldreich P and Sridhar S 1995 Astrophys. J. 438 763\nCrossref  \n\n\nGoldstein M L 1978 Astrophys. J. 219 700\nCrossref  \n\n\nGoswami P, Passot T and Sulem P L 2005 Phys. Plasmas 12 102109\nCrossref  \n\n\nHammett G W, Dorland W and Perkins F W 1992 Phys. Fluids B 4 2052\nCrossref  \n\n\nHammett G W and Perkins F W 1990 Phys. Rev. Lett. 64 3019\nCrossref  \n\n\nHeidbrink W W 2008 Phys. Plasmas 15 055501\nCrossref  \n\n\nHellinger P and Matsumoto H 2000 J. Geophys. Res. 105 10519\nCrossref  \n\n\nHellinger P, Trávníček P, Kasper J C and Lazarus A J 2006 Geophys. Res. Lett. 33 L09101\nCrossref  \n\n\nHellinger P and Trávníček P M 2008 J. Geophys. Res.: Space 113 A10109\nCrossref  \n\n\nHellinger P and Trávníček P M 2015 J. Plasma Phys. 81 305810103\nCrossref  \n\n\nHollweg J V 1971a J. Geophys. Res. 76 5155\nCrossref  \n\n\nHollweg J V 1971b Phys. Rev. Lett. 27 1349\nCrossref  \n\n\nHunana P and Zank G P 2017 Astrophys. J. 839 13\nIOPscience  \n\n\nKlein K G and Howes G G 2015 Phys. Plasmas 22 032903\nCrossref  \n\n\nKulsrud R M 1978 Astronomical Papers Dedicated to Bengt Stromgren ed A Reiz and T Andersen pp 317–26\n  \n\n\nKulsrud R M 1983 MHD description of plasma Basic Plasma Physics: Selected Chapters, Handbook of Plasma Physics, Volume 1 ed R N Sagdeev and M N Rosenbluth (Amsterdam: North-Holland)\n  \n\n\nKunz M W, Bogdanović T, Reynolds C S and Stone J M 2012 Astrophys. J. 754 122\nIOPscience  \n\n\nKunz M W, Schekochihin A A, Chen C H K, Abel I G and Cowley S C 2015 J. Plasma Phys. 81 325810501\nCrossref  \n\n\nKunz M W, Schekochihin A A, Cowley S C, Binney J J and Sanders J S 2010 Mon. Not. R. Astron. Soc. 410 2446\nCrossref  \n\n\nKunz M W, Schekochihin A A and Stone J M 2014 Phys. Rev. Lett. 112 205003\nCrossref  \n\n\nLee M A and Völk H J 1973 Astrophys. Space Sci. 24 31\nCrossref  \n\n\nMarsch E 2006 Living Rev. Sol. Phys. 3 1\nCrossref  \n\n\nMatteini L, Landi S, Velli M, Zanna L D and Hellinger P 2010 Geophys. Res. Lett. 37 L20101\nCrossref  \n\n\nMedvedev M V and Diamond P H 1996 Phys. Plasmas 3 863\nCrossref  \n\n\nMedvedev M V, Shevchenko V I, Diamond P H and Galinsky V L 1997 Phys. Plasmas 4 1257\nCrossref  \n\n\nMelville S, Schekochihin A A and Kunz M W 2016 Mon. Not. R. Astron. Soc. 459 2701\nCrossref  \n\n\nMikhailovskii A B and Tsypin V S 1971 Plasma Phys. 13 785\nIOPscience  \n\n\nMontgomery D 1983 NASA Conf. Publication vol 228\n  \n\n\nNg C S and Bhattacharjee A 1996 Astrophys. J. 465 845\nCrossref  \n\n\nOfman L 2010 Living Rev. Sol. Phys. 7 4\nCrossref  \n\n\nO’Neil T 1965 Phys. Fluids 8 2255\nCrossref  \n\n\nParker E N 1958 Phys. Rev. 109 1874\nCrossref  \n\n\nPassot T, Sulem P L and Hunana P 2012 Phys. Plasmas 19 082113\nCrossref  \n\n\nQuataert E 2001 Probing the Physics of Active Galactic Nuclei by Multiwavelength Monitoring (Astronomical Society of the Pacific Conference Series vol 224) ed B M Peterson et al (San Francisco, CA: Astronomical Society of the Pacific) p 71\n  \n\n\nQuataert E and Gruzinov A 1999 Astrophys. J. 520 248\nIOPscience  \n\n\nRamos J J 2005 Phys. Plasmas 12 052102\nCrossref  \n\n\nRincon F, Schekochihin A A and Cowley S C 2015 Mon. Not. R. Astron. Soc. 447 L45\nCrossref  \n\n\nRiquelme M A, Quataert E and Verscharen D 2016 Astrophys. J. 824 123\nIOPscience  \n\n\nRosenbluth M N 1956 Stability of the pinch Technical Report LA-2030\n  \n\n\nRosin M S, Schekochihin A A, Rincon F and Cowley S C 2011 Mon. Not. R. Astron. Soc. 413 7\nCrossref  \n\n\nSantos-Lima R et al 2014 Astrophys. J. 781 84\nIOPscience  \n\n\nSchekochihin A A et al 2009 Astrophys. J. Suppl. 182 310\nIOPscience  \n\n\nSchekochihin A A, Cowley S C, Kulsrud R M, Rosin M S and Heinemann T 2008 Phys. Rev. Lett. 100 081301\nCrossref  \n\n\nSchekochihin A A, Cowley S C, Rincon F and Rosin M S 2010 Mon. Not. R. Astron. Soc. 405 291\nCrossref  \n\n\nSchekochihin A A, Nazarenko S V and Yousef T A 2012 Phys. Rev. E 85 036406\nCrossref  \n\n\nSchlickeiser R 2015 Phys. Plasmas 22 091502\nCrossref  \n\n\nServidio S et al 2015 J. Plasma Phys. 81 325810107\nCrossref  \n\n\nSharma P, Hammett G W, Quataert E and Stone J M 2006 Astrophys. J. 637 952\nIOPscience  \n\n\nSharma P, Quataert E, Hammett G W and Stone J M 2007 Astrophys. J. 667 714\nIOPscience  \n\n\nSnyder P B, Hammett G W and Dorland W 1997 Phys. Plasmas 4 3974\nCrossref  \n\n\nSquire J and Quataert E 2017 in preparation\n\n\nSquire J, Quataert E and Schekochihin A A 2016 Astrophys. J. Lett. 830 L25\nIOPscience  \n\n\nStoneham R J 1981 Origin of Cosmic Rays ed G Setti p 255\nCrossref  \n\n\nSulem P L and Passot T 2015 J. Plasma Phys. 81 325810103\nCrossref  \n\n\nTenerani A and Velli M 2013 J. Geophys. Res. 118 7507\nCrossref  \n\n\nVerscharen D, Chandran B D G, Klein K G and Quataert E 2016 Astrophys. J. 831 128\nIOPscience  \n\n\nVölk H J and Cesarsky C J 1982 Z. Naturforsch. 37 809\nCrossref  \n\n\nYoon P H, Wu C S and de Assis A S 1993 Phys. Fluids B 5 1971\nCrossref  \n\n\nZhuravleva I et al 2014 Nature 515 85\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"J Squire et al 2017 New J. Phys. 19 055005","other_numbering_system":null,"funders":[{"agency":"Gordon and Betty Moore Foundation","grant_number":"GBMF5076"},{"agency":"Science and Technology Facilities Council (STFC)","grant_number":""},{"agency":"Engineering and Physical Sciences Research Council (EPSRC)","grant_number":""},{"agency":"Simons Foundation","grant_number":""},{"agency":"NSF","grant_number":"AST 13-33612"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Walter Burke Institute for Theoretical Physics"]}