{"title":"Code Properties from Holographic Geometries","uri":"","abstract":"Almheiri, Dong, and Harlow [J. High Energy Phys. 04 (2015) 163.] proposed a highly illuminating connection between the AdS/CFT holographic correspondence and operator algebra quantum error correction (OAQEC). Here, we explore this connection further. We derive some general results about OAQEC, as well as results that apply specifically to quantum codes that admit a holographic interpretation. We introduce a new quantity called price, which characterizes the support of a protected logical system, and find constraints on the price and the distance for logical subalgebras of quantum codes. We show that holographic codes defined on bulk manifolds with asymptotically negative curvature exhibit uberholography, meaning that a bulk logical algebra can be supported on a boundary region with a fractal structure. We argue that, for holographic codes defined on bulk manifolds with asymptotically flat or positive curvature, the boundary physics must be highly nonlocal, an observation with potential implications for black holes and for quantum gravity in AdS space at distance scales that are small compared to the AdS curvature radius.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252366","docid":252366,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258812","fileid":1258812,"datasetid":"document","objectid":252366,"filename":"PhysRevX.7.021022.pdf","mime_type":"application/pdf","hash":"1075279e3de2762ab1ab0a7f7bb3d68d","hash_type":"MD5","filesize":586737,"mtime":"2017-05-17 18:42:26","url":"http://authors.library.caltech.edu/77528/1/PhysRevX.7.021022.pdf"}],"eprintid":77528,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"PhysRevX.7.021022.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252367","docid":252367,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258832","fileid":1258832,"datasetid":"document","objectid":252367,"filename":"1612.00017.pdf","mime_type":"application/pdf","hash":"4127ad725aa180e4f81b5b0e23294b00","hash_type":"MD5","filesize":809158,"mtime":"2017-05-17 19:08:32","url":"http://authors.library.caltech.edu/77528/2/1612.00017.pdf"}],"eprintid":77528,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1612.00017.pdf","content":"submitted"}],"note":"© 2017 The Authors. Published by the American Physical Society under the terms of the Creative Commons Attribution 4.0 International license. Further distribution of this work must maintain attribution to the author(s) and the published article’s title, journal citation, and DOI. \n\nReceived 5 January 2017; published 15 May 2017. \n\nF. P. would like to thank Nicolas Delfosse, Henrik Wilming, and Jens Eisert for helpful discussions and comments. F. P. gratefully acknowledges funding provided by the Institute for Quantum Information and Matter, a NSF Physics Frontiers Center, with support from the Gordon and Betty Moore Foundation, as well as the Simons Foundation through the It from Qubit program and the FUB through the ERC project (TAQ). This research was supported in part by the National Science Foundation under Grant No. NSF PHY-1125915.","id":77528,"rev_number":12,"userid":772,"eprint_dir":"disk0/00/07/75/28","datestamp":"2017-05-17 19:20:20","lastmod":"2017-05-17 19:20:20","status_changed":"2017-05-17 19:20:20","type":"article","metadata_visibility":"show","creators":[{"given":"Fernando","family":"Pastawski","id":"Pastawski-F","orcid":""},{"given":"John","family":"Preskill","id":"Preskill-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-15","date_type":"published","publication":"Physical Review X","volume":"7","number":"2","pagerange":"Art. No. 021022","id_number":"CaltechAUTHORS:20170517-114206968","refereed":true,"issn":"2160-3308","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170517-114206968","related_url":[{"url":"https://doi.org/10.1103/PhysRevX.7.021022","type":"doi","description":"Article"},{"url":"https://journals.aps.org/prx/abstract/10.1103/PhysRevX.7.021022","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1612.00017","type":"arxiv","description":"Discussion Paper"}],"referencetext":["A. Almheiri, X. Dong, and D. Harlow, Bulk Locality and Quantum Error Correction in AdS/CFT, J. High Energy Phys. 2015, 163.\nF. Pastawski, B. Yoshida, D. Harlow, and J. Preskill, Holographic Quantum Error-Correcting Codes: Toy Models for the Bulk/Boundary Correspondence, J. High Energy Phys. 2015, 149.\nP. Hayden, S. Nezami, X.-L. Qi, N. Thomas, M. Walter, and Z. Yang, Holographic Duality from Random Tensor Networks, J. High Energy Phys. 2016, 009.\nD. W. Kribs, R. Laflamme, and D. Poulin, Unified and Generalized Approach to Quantum Error Correction, Phys. Rev. Lett. 94, 180501 (2005).\nC. Bény, A. Kempf, and D. W. Kribs, Quantum Error Correction of Observables, Phys. Rev. A 76, 042303 (2007).\nC. Bény, A. Kempf, and D. W. Kribs, Generalization of Quantum Error Correction via the Heisenberg Picture, Phys. Rev. Lett. 98, 100502 (2007).\nM. A. Nielsen and D. Poulin, Algebraic and Information-Theoretic Conditions for Operator Quantum Error Correction, Phys. Rev. A 75, 064304 (2007).\nW. Donnelly, B. Michel, D. Marolf, and J. Wien, Living on the Edge: A Toy Model for Holographic Reconstruction of Algebras with Centers, arXiv:1611.05841.\nA. Almheiri, X. Dong, and B. Swingle, Linearity of Holographic Entanglement Entropy, J. High Energy Phys. 2017, 074.\nD. Harlow, The Ryu-Takayanagi Formula from Quantum Error Correction, arXiv:1607.03901.\nD. Poulin, Stabilizer Formalism for Operator Quantum Error Correction, Phys. Rev. Lett. 95, 230504 (2005).\nD. W. Kribs, R. Laflamme, D. Poulin, and M. Lesosky, Operator Quantum Error Correction, Quantum Inf. Comput. 6, 382 (2006).\nE. Knill and R. Laflamme, Theory of Quantum Error-Correcting Codes, Phys. Rev. A 55, 900 (1997).\nJ. M. Maldacena, The Large \nN\n Limit of Superconformal Field Theories and Supergravity, Adv. Theor. Math. Phys. 2, 231 (1998).\nS. Ryu and T. Takayanagi, Holographic Derivation of Entanglement Entropy from the Anti–de Sitter Space/Conformal Field Theory Correspondence, Phys. Rev. Lett. 96, 181602 (2006).\nM. Van Raamsdonk, Building up Spacetime with Quantum Entanglement, Gen. Relativ. Gravit. 42, 2323 (2010).\nV. E. Hubeny, M. Rangamani, and T. Takayanagi, A Covariant Holographic Entanglement Entropy Proposal, J. High Energy Phys. 2007, 062.\nB. Czech, J. L. Karczmarek, F. Nogueira, and M. Van Raamsdonk, The Gravity Dual of a Density Matrix, Classical Quantum Gravity 29, 155009 (2012).\nD. L. Jafferis and S. J. Suh, The Gravity Duals of Modular Hamiltonians, J. High Energy Phys. 2016, 068.\nA. Wall, Maximin Surfaces, and the Strong Subadditivity of the Covariant Holographic Entanglement Entropy, Classical Quantum Gravity 31, 225007 (2014).\nX. Dong, D. Harlow, and A. C. Wall, Reconstruction of Bulk Operators within the Entanglement Wedge in Gauge-Gravity Duality, Phys. Rev. Lett. 117, 021601 (2016).\nN. Bao and I. H. Kim, Precursor Problem and Holographic Mutual Information, arXiv:1601.07616.\nR. Bousso, A Covariant Entropy Conjecture, J. High Energy Phys. 1999, 004.\nJ. Maldacena, Eternal Black Holes in Anti–de Sitter, J. High Energy Phys. 2003, 021.\nT. Faulkner, A. Lewkowycz, and J. Maldacena, Quantum Corrections to Holographic Entanglement Entropy, J. High Energy Phys. 2013, 074.\nJ. Maldacena and L. Susskind, Cool Horizons for Entangled Black Holes, Fortschr. Phys. 61, 781 (2013).\nS. Bravyi, D. Poulin, and B. Terhal, Tradeoffs for Reliable Quantum Information Storage in 2D Systems, Phys. Rev. Lett. 104, 050503 (2010).\nS. T. Flammia, J. Haah, M. J. Kastoryano, and I. H. Kim, Limits on the Storage of Quantum Information in a Volume of Space, arXiv:1610.06169.\nD. Petz, Sufficiency of Channels Over Von Neumann Algebras, Q. J. Math. 39, 97 (1988).\nO. Fawzi and R. Renner, Quantum Conditional Mutual Information and Approximate Markov Chains, Commun. Math. Phys. 340, 575 (2015).\nF. Pastawski, J. Eisert, and H. Wilming, Quantum Source-Channel Codes, arXiv:1611.07528.\nI. H. Kim and M. J. Kastoryano, Entanglement Renormalization, Quantum Error Correction, and Bulk Causality, J. High Energy Phys. 2017, 040.\nM. Headrick, Entanglement Rényi Entropies in Holographic Theories, Phys. Rev. D 82, 126010 (2010).\nX. Dong, The Gravity Dual of Rényi Entropy, Nat. Commun. 7, 12472 (2016).\nX. Dong, Shape Dependence of Holographic Rényi Entropy in Conformal Field Theories, Phys. Rev. Lett. 116, 251602 (2016).\nD. Sutter, O. Fawzi, and R. Renner, Universal Recovery Map for Approximate Markov Chains, Proc. R. Soc. Lond A 472, 623 (2016).\nP. Hayden and J. Preskill, Black Holes as Mirrors: Quantum Information in Random Subsystems, J. High Energy Phys. 2007, 120.\nY. Sekino and L. Susskind, Fast Scramblers, J. High Energy Phys. 2008, 065.\nD. N. Page, Average Entropy of a Subsystem, Phys. Rev. Lett. 71, 1291 (1993).\nA. R. Brown, D. A. Roberts, L. Susskind, B. Swingle, and Y. Zhao, Holographic Complexity Equals Bulk Action?, Phys. Rev. Lett. 116, 191301 (2016).\nF. G. S. L. Brandão, A. W. Harrow, and M. Horodecki, Local Random Quantum Circuits are Approximate Polynomial-Designs, Commun. Math. Phys. 346, 397 (2016).\nC. Bény, Conditions for the Approximate Correction of Algebras, arXiv:0907.4207."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Code Properties from Holographic Geometries\nFernando Pastawski and John Preskill\nPhys. Rev. X 7, 021022 (2017) – Published 15 May 2017","other_numbering_system":null,"funders":[{"agency":"Institute for Quantum Information and Matter (IQIM)","grant_number":""},{"agency":"NSF Physics Frontiers Center","grant_number":""},{"agency":"Gordon and Betty Moore Foundation","grant_number":""},{"agency":"Simons Foundation","grant_number":"309981"},{"agency":"European Research Council (ERC)","grant_number":""},{"agency":"NSF","grant_number":"PHY-1125915"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}