{"title":"Contextuality and Wigner-function negativity in qubit quantum computation","uri":"","abstract":"We describe schemes of quantum computation with magic states on qubits for which contextuality and negativity of the Wigner function are necessary resources possessed by the magic states. These schemes satisfy a constraint. Namely, the non-negativity of Wigner functions must be preserved under all available measurement operations. Furthermore, we identify stringent consistency conditions on such computational schemes, revealing the general structure by which negativity of Wigner functions, hardness of classical simulation of the computation, and contextuality are connected.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252355","docid":252355,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258730","fileid":1258730,"datasetid":"document","objectid":252355,"filename":"PhysRevA.95.052334.pdf","mime_type":"application/pdf","hash":"d3ff2a690d425289096202e68be4f27d","hash_type":"MD5","filesize":843174,"mtime":"2017-05-17 17:46:51","url":"http://authors.library.caltech.edu/77525/1/PhysRevA.95.052334.pdf"}],"eprintid":77525,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"PhysRevA.95.052334.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252356","docid":252356,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1258740","fileid":1258740,"datasetid":"document","objectid":252356,"filename":"1511.08506.pdf","mime_type":"application/pdf","hash":"68b79f6d7a44e153a5d268510f1b002e","hash_type":"MD5","filesize":983342,"mtime":"2017-05-17 18:00:46","url":"http://authors.library.caltech.edu/77525/2/1511.08506.pdf"}],"eprintid":77525,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1511.08506.pdf","content":"submitted"}],"note":"© 2017 American Physical Society. \n\nReceived 16 November 2016; published 17 May 2017. \n\nR.R. thanks Terry Rudolph and the Horodecki family for discussion. This work has been funded by NSERC (N.D., C.O., and R.R.), SIQS (J.B.V.), AQuS (J.B.V.), Cifar (N.D. and R.R.), and IARPA (R.R.). R.R. acknowledges support from a fellowship from the Cifar (Canadian Institute for Advanced Research) Quantum Information Program.","id":77525,"rev_number":15,"userid":772,"eprint_dir":"disk0/00/07/75/25","datestamp":"2017-05-17 19:05:29","lastmod":"2017-05-17 19:05:29","status_changed":"2017-05-17 19:05:29","type":"article","metadata_visibility":"show","creators":[{"given":"Robert","family":"Raussendorf","id":"Raussendorf-R","orcid":""},{"given":"Dan E.","family":"Browne","id":"Browne-D-E","orcid":""},{"given":"Nicolas","family":"Delfosse","id":"Delfosse-N","orcid":""},{"given":"Cihan","family":"Okay","id":"Okay-Cihan","orcid":""},{"given":"Juan","family":"Bermejo-Vega","id":"Bermejo-Vega-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05","date_type":"published","publication":"Physical Review A","volume":"95","number":"5","pagerange":"Art. No. 052334","id_number":"CaltechAUTHORS:20170517-104639624","refereed":true,"issn":"0556-2791","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170517-104639624","related_url":[{"url":"https://doi.org/10.1103/PhysRevA.95.052334","type":"doi","description":"Article"},{"url":"https://journals.aps.org/pra/abstract/10.1103/PhysRevA.95.052334#fulltext","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1511.08506","type":"arxiv","description":"Discussion Paper"}],"referencetext":["J. S. Bell, On the problem of hidden variables in quantum mechanics, Rev. Mod. Phys. 38, 447 (1966).\nS. Kochen and E. P. Specker, The problem of hidden variables in quantum mechanics, Journal of Mathematics and Mechanics 17, 59 (1967).\nN. D. Mermin, Hidden variables and the two theorems of John Bell, Rev. Mod. Phys. 65, 803 (1993).\nS. Abramsky and A. Brandenburger, The sheaf-theoretic structure of non-locality and contextuality, New J. Phys. 13, 113036 (2011).\nA. Cabello, S. Severini, and A. Winter, Graph-Theoretic Approach to Quantum Correlations, Phys. Rev. Lett. 112, 040401 (2014).\nA. Acín, T. Fritz, A. Leverrier, and A. Belén Sainz, A combinatorial approach to nonlocality and contextuality, Comm. Math. Phys. 334, 533 (2015).\nN. D. Mermin, Extreme Quantum Entanglement in a Superposition of Macroscopically Distinct Sstates, Phys. Rev. Lett. 65, 1838 (1990).\nV. Scarani, A. Acin, E. Schenck, and M. Aspelmeyer, Nonlocality of cluster states of qubits, Phys. Rev. A 71, 042325 (2005).\nO. Gühne, G. Toth, P. Hyllus, and H. J. Briegel, Bell Inequalities for Graph States, Phys. Rev. Lett. 95, 120405 (2005).\nE. Wigner, On the quantum correction for thermodynamic equilibrium, Phys. Rev. 40, 749 (1932).\nK. S. Gibbons, M. J. Hoffman, and W. K. Wootters, Discrete phase space based on finite fields, Phys. Rev. A 70, 062101 (2004).\nD. Gross, Computational Power of Quantum Many-Body States and Some Results on Discrete Phase Spaces, Imperial College, 2008, (unpublished).\nA. Mari and J. Eisert, Positive Wigner Functions Render Classical Simulation of Quantum Computation Efficient, Phys. Rev. Lett. 109, 230503 (2012).\nS. Rahimi-Keshari, T. C. Ralph, and C. M. Caves, Sufficient Conditions for Efficient Classical Simulation of Quantum Optics, Phys. Rev. X 6, 021039 (2016).\nM. Howard et al., Contextuality supplies the ‘magic’ for quantum computation, Nature (London) 510, 351 (2014).\nN. Delfosse, P. Allard-Guerin, J. Bian, and R. Raussendorf, Wigner Function Negativity and Contextuality in Quantum Computation on Rebits, Phys. Rev. X 5, 021003 (2015).\nV. Veitch, C. Ferrie, D. Gross, and J. Emerson, Negative quasi-probability as a resource for quantum computation, New J. Phys. 14, 113011 (2012).\nE. F. Galvão, Discrete Wigner functions and quantum computational speedup, Phys. Rev. A 71, 042302 (2005).\nC. Cormick, E. F. Galvão, D. Gottesman, J. P. Paz, and A. O. Pittenger, Classicality in discrete Wigner functions, Phys. Rev. A 73, 012301 (2006).\nS. Bravyi and A. Kitaev, Universal quantum computation with ideal Clifford gates and noisy ancillas, Phys. Rev. A 71, 022316 (2005).\nR. L. Hudson, When is the Wigner quasi-probability density non-negative?, Rep. Math. Phys. 6, 249 (1974).\nR. W. Spekkens, Negativity and Contextuality are Equivalent Notions of Nonclassicality, Phys. Rev. Lett. 101, 020401 (2008).\nS. Bravyi, Universal quantum computation with the \nν\n=\n5\n/\n2\n fractional quantum Hall state, Phys. Rev. A 73, 042313 (2006).\nN. Delfosse, C. Okay, J. Bermejo-Vega, D. E. Browne, and R. Raussendorf, Equivalence between Contextuality and Negativity of the Wigner Function for Qudits, arXiv:1610.07093.\nD. Gottesman, Stabilizer Codes and Quantum Error Correction, California Institute of Technology, Pasadena, CA, 1997.\nH. Zhu, Permutation Symmetry Determines the Discrete Wigner Function, Phys. Rev. Lett. 116, 040501 (2016).\nH. Zhu, Multiqubit Clifford Groups Are Unitary 3-Designs, arXiv:1510.02619.\nA. Peres, Incompatible results of quantum measurements, Phys. Lett. A 151, 107 (1990).\nY. Han, L. Hemaspaandra, and T. Thierauf, Threshold computation and cryptographic security, SIAM J. Comput. 26, 59 (1997).\nS. Aaronson, Quantum computing, post-selection and probabilistic polynomial time, Proc. R. Soc. London, Ser. A 461, 3473 (2005).\nS. Aaronson and A. Arkhipov, in Proceedings of the 43rd Annual ACM Symposium on Theory of Computing, STOC '11, (ACM, 2011), pp. 333–342.\nM. J. Bremner, R. Jozsa, and D. J. Shepherd, Classical simulation of commuting quantum computations implies collapse of the polynomial hierarchy, Proc. R. Soc. London, Ser. A 467, 459 (2011).\nT. Morimae, K. Fujii, and J. F. Fitzsimons, On the Hardness of Classically Simulating the One Clean Qubit Model, Phys. Rev. Lett. 112, 130502 (2014).\nM. J. Hoban, J. J. Wallman, H. Anwar, N. Usher, R. Raussendorf, and D. E. Browne, Measurement-Based Classical Computation, Phys. Rev. Lett. 112, 140505 (2014).\nJ. Bermejo-Vega, N. Delfosse, C. Okay, D. E. Browne, and R. Raussendorf, Contextuality as a Resource for Qubit Quantum Computation, arXiv:1610.08529.\nM. Howard, E. Brennan, and J. Vala, Quantum contextuality with stabilizer states, Entropy 15, 2340 (2013).\nN. D. Mermin, Simple Unified form for No-Hidden-Variables Theorems, Phys. Rev. Lett. 65, 3373 (1990).\nA. R. Calderbank and P. W. Shor, Good quantum error-correcting codes exist, Phys. Rev. A 54, 1098 (1996).\nA. Steane, Multiple particle interference and quantum error correction, Proc. R. Soc. London, Ser. A 452, 2551 (1996).\nD. W. Kribs, R. Laflamme, D. Poulin, and M. Lesosky, Operator quantum error correction, Quantum Information \u0026 Computation 6, 382 (2006).\nD. Poulin, Stabilizer Formalism for Operator Quantum Error Correction, Phys. Rev. Lett. 95, 230504 (2005).\nD. Bacon, Operator quantum error-correcting subsystems for self-correcting quantum memories, Phys. Rev. A 73, 012340 (2006).\nP. W. Shor, Scheme for reducing decoherence in quantum computer memory, Phys. Rev. A 52, R2493 (1995).\nH. Bombin, Topological subsystem codes, Phys. Rev. A 81, 032301 (2010).\nV. Veitch, S. A. H. Mousavian, D. Gottesman, and J. Emerson, The resource theory of stabilizer computation, New J. Phys. 16, 013009 (2014).\nH. Pashayan, J. J. Wallman, and S. D. Bartlett, Estimating Outcome Probabilities of Quantum Circuits Using Quasiprobabilities, Phys. Rev. Lett. 115, 070501 (2015).\nJ. J. Wallman and S. D. Bartlett, Nonnegative subtheories and quasiprobability representations of qubits, Phys. Rev. A 85, 062121 (2012).\nR. Raussendorf and H. J. Briegel, A One-Way Quantum Computer, Phys. Rev. Lett. 86, 5188 (2001).\nM. van den Nest, A monomial matrix formalism to describe quantum many-body states, New J. Phys. 13, 123004 (2011).\nS. Bravyi, G. Smith, and J. Smolin, Trading Classical and Quantum Computational Resources, Phys. Rev. X 6, 021043 (2016).\nM. Howard and E. T. Campbell, Application of a Resource Theory for Magic States to Fault-Tolerant Quantum Computing, Phys. Rev. Lett. 118, 090501 (2017)."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Contextuality and Wigner-function negativity in qubit quantum computation\nRobert Raussendorf, Dan E. Browne, Nicolas Delfosse, Cihan Okay, and Juan Bermejo-Vega\nPhys. Rev. A 95, 052334 – Published 17 May 2017","other_numbering_system":null,"funders":[{"agency":"Natural Sciences and Engineering Research Council of Canada (NSERC)","grant_number":""},{"agency":"Simulators and Interfaces with Quantum Systems (SIQS)","grant_number":""},{"agency":"Analog Quantum Simulators for Many-Body Dynamics (AQuS)","grant_number":""},{"agency":"Canadian Institute for Advanced Research (CIFAR)","grant_number":""},{"agency":"Intelligence Advanced Research Projects Activity (IARPA)","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Institute for Quantum Information and Matter","IQIM"]}