{"title":"Network Utility Maximization With Nonconcave Utilities Using Sum-of-Squares Method","uri":"","abstract":"The Network Utility Maximization problem has recently been used extensively to analyze and design distributed rate allocation in networks such as the Internet. A major limitation in the state-of-the-art is that user utility functions are assumed to be strictly concave functions, modeling elastic flows. Many applications require inelastic flow models where nonconcave utility functions need to be maximized. It has been an open problem to find the globally optimal rate allocation that solves nonconcave network utility maximization, which is a difficult nonconvex optimization problem. We provide a centralized algorithm for off-line analysis and establishment of a performance benchmark for nonconcave utility maximization. Based on the semialgebraic approach to polynomial optimization, we employ convex sum-of-squares relaxations solved by a sequence of semidefinite programs, to obtain increasingly tighter upper bounds on total achievable utility for polynomial utilities. Surprisingly, in all our experiments, a very low order and often a minimal order relaxation yields not just a bound on attainable network utility, but the globally maximized network utility. When the bound is exact, which can be proved using a sufficient test, we can also recover a globally optimal rate allocation. In addition to polynomial utilities, sigmoidal utilities can be transformed into polynomials and are handled. Furthermore, using two alternative representation theorems for positive polynomials, we present price interpretations in economics terms for these relaxations, extending the classical interpretation of independent congestion pricing on each link to pricing for the simultaneous usage of multiple links.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252402","docid":252402,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1259271","fileid":1259271,"datasetid":"document","objectid":252402,"filename":"01582432.pdf","mime_type":"application/pdf","hash":"d5aea34bda1ee16f9220bd65fd58d473","hash_type":"MD5","filesize":186945,"mtime":"2017-05-17 23:38:16","url":"http://authors.library.caltech.edu/77537/1/01582432.pdf"}],"eprintid":77537,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"01582432.pdf","content":"published"}],"note":"© 2005 IEEE.","id":77537,"rev_number":8,"userid":207,"eprint_dir":"disk0/00/07/75/37","datestamp":"2017-05-17 23:45:24","lastmod":"2017-05-17 23:45:24","status_changed":"2017-05-17 23:45:24","type":"book_section","metadata_visibility":"show","creators":[{"given":"Maryam","family":"Fazel","id":"Fazel-M","orcid":""},{"given":"Mung","family":"Chiang","id":"Chiang-Mung","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Nonconvex optimization, network utility, rate allocation, algebraic geometry, sum of squares method","date":"2005-12","date_type":"published","publication":"","volume":"","number":"","pagerange":"1867-1874","id_number":"CaltechAUTHORS:20170517-163409288","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170517-163409288","related_url":[{"url":"https://doi.org/10.1109/CDC.2005.1582432","type":"doi","description":"Article"},{"url":"http://ieeexplore.ieee.org/document/1582432/","type":"pub","description":"Article"}],"referencetext":["[1] D. P. Bertsekas,\nNonlinear Programming\n, Athena Scientifi c, 1999.\n[2] S. Boyd and L. Vandenberghe,\nConvex  Optimization,\nCambridge Uni-\nversity Press, 2004.\n[3] M. Chiang, S. Zhang, and P. Hande, “Distributed rate allocation for\ninelastic flows: Optimization framework, optimality conditions, and\noptimal algorithms,”\nProc. IEEE Infocom\n, Miami, FL, March 2005.\n[4] D. Handelman, “Representing polynomials by positive linear functions\non compact convex polyhedra,”\nPacifi c  J.  Math.,\nvol. 132, pp. 35-62,\n1988.\n[5] D. Henrion, J.B. Lasserre, “Detecting global optimality and extracting\nsolutions in GloptiPoly,” Research report, LAAS-CNRS, 2003.\n[6] F. P. Kelly, A. Maulloo, and D. Tan, “Rate control for communication\nnetworks: shadow prices, proportional fairness and stability,”\nJournal of\nOperations Research Society,\nvol. 49, no. 3, pp.237-252, March 1998.\n[7] J.B. Lasserre, “Global optimization with polynomials and the problem\nof moments,”\nSIAM J. Optim.,\nvol. 11, no. 3, pp. 796-817, 2001.\n[8] J.B. Lasserre, “Polynomial programming: LP-relaxations also con-\nverge,”\nSIAM J. Optimization\n, vol. 15, no. 2, pp. 383-393, 2004.\n[9] J. W. Lee, R. R. Mazumdar, and N. Shroff, “Non-convex optimization\nand rate control for multi-class services in the Internet,”\nProc.  IEEE\nInfocom,\nHong Kong, China, March 2004.\n[10] S. H. Low, “A duality model of TCP and queue management algo-\nrithms,”\nIEEE/ACM Tran. Networking,\nvol. 11, no. 4, pp. 525-536, Aug.\n2003.\n[11] P. A. Parrilo, Structured semidefi nite programs and semi-algebraic\ngeometry methods in robustness and optimization,” PhD thesis, Caltech,\nMay 2002.\n[12] P. A. Parrilo, “Semidefi nite programming relaxations for semi-\nalgebraic problems,”\nMath. Program.\n, vol. 96, pp.293-320, 2003.\n[13] S.  Prajna,  A.  Papachristodoulou,  P.  A.  Parrilo,  “SOSTOOLS:\nSum of squares optimization toolbox for Matlab, available from\nhttp://www.cds.caltech.edu/sostools\n, 2002-04.\n[14] M. Putinar, “Positive polynomials on compact semi-algebraic sets,”\nIndiana  University  Mathematics  Journal,\nvol. 42, no. 3, pp. 969-984,\n1993.\n[15] R. T. Rockafellar,\nNetwork  Flows  and  Monotropic  Programming\n,\nAthena Scientifi c, 1998.\n[16] R. T. Rockafellar, “Lagrange multipliers and optimality,”\nSIAM Review,\nvol. 35, pp. 183-283, 1993.\n[17] K. Schm\n ̈\nudgen, “The k-moment problem for compact semialgebraic\nsets,”\nMath. Ann.\n, vol. 289, pp. 203-206, 1991.\n[18] S. Shenker, “Fundamental design issues for the future Internet,”\nIEEE\nJ. Sel. Area Comm.,\nvol. 13, no. 7, pp. 1176-1188, Sept. 1995.\n[19] N. Z. Shor, “Quadratic optimization problems,”\nSoviet  J.  Comput.\nSystems Sci.,\nvol 25, pp. 1-11, 1987.\n[20] G. Stengle, “A Nullstellensatz and a Positivstellensatz in semialgebraic\ngeometry,”\nMath. Ann.,\nvol. 207, pp.87-97, 1974."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"M. Fazel and Mung Chiang, \"Network Utility Maximization With Nonconcave Utilities Using Sum-of-Squares Method,\" Proceedings of the 44th IEEE Conference on Decision and Control, 2005, pp. 1867-1874.\ndoi: 10.1109/CDC.2005.1582432","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}