{"title":"Modeling microstructure evolution in magnesium: Comparison of detailed and reduced-order kinematic models","uri":"","abstract":"The inelastic behavior of hcp metals, such as magnesium (Mg) and its alloys, is dominated by the shortage of available slip systems and the resulting competition between dislocation slip and deformation twinning to accommodate large, irreversible deformation. A variety of models exist to describe the material behavior to varying degrees of accuracy and efficiency. Specifically, detailed crystal plasticity models account for the full set of slip and twin systems, thereby providing detailed microstructural insight at high computational costs. By contrast, reduced-order models aim to describe the same material response by a contracted set of phenomenological internal variables, resulting in significant efficiency gains at the cost of accuracy. Here, we contrast two such approaches for the example of pure Mg and apply those to model texture and yield surface evolution in applications including cold rolling and uniaxial compressions on textured Mg polycrystals. For the latter, we also compare simulated stress–strain predictions to experimental data. We highlight common features and key differences between the two models and compare their levels of accuracy and efficiency for the chosen applications. Our findings demonstrate that the efficient model agrees well with the full-detail calculations at lower levels of strain but shows deviations at large strains due to the missing account of lattice misorientation. We thus show that formulations employing differing kinematic assumptions can predict similar macroscopic behavior by altering material parameters (i.e., using a more detailed model to inform coarse-scale models).","documents":null,"note":"© 2017 Elsevier Ltd. \n\nReceived 7 October 2016, Revised 1 February 2017, Accepted 24 February 2017, Available online 28 February 2017.","id":77550,"rev_number":5,"userid":18,"eprint_dir":"disk0/00/07/75/50","datestamp":"2017-05-18 16:19:56","lastmod":"2017-05-18 16:19:56","status_changed":"2017-05-18 16:19:56","type":"article","metadata_visibility":"show","creators":[{"given":"Yingrui","family":"Chang","id":"Chang-Yingrui","orcid":""},{"given":"Jeffrey T.","family":"Lloyd","id":"Lloyd-J-T","orcid":""},{"given":"Richard","family":"Becker","id":"Becker-R-H","orcid":""},{"given":"Dennis M.","family":"Kochmann","id":"Kochmann-D-M","orcid":"0000-0002-9112-6615"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Plasticity; Magnesium; Texture; Finite element method","date":"2017-05","date_type":"published","publication":"Mechanics of Materials","volume":"108","number":"","pagerange":"40-57","id_number":"CaltechAUTHORS:20170518-080559393","refereed":true,"issn":"0167-6636 ","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170518-080559393","related_url":[{"url":"https://doi.org/10.1016/j.mechmat.2017.02.007","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0167663616303805","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Yingrui Chang, Jeffrey T. Lloyd, Richard Becker, Dennis M. Kochmann, Modeling microstructure evolution in magnesium: Comparison of detailed and reduced-order kinematic models, Mechanics of Materials, Volume 108, May 2017, Pages 40-57, ISSN 0167-6636, https://doi.org/10.1016/j.mechmat.2017.02.007.\n(http://www.sciencedirect.com/science/article/pii/S0167663616303805)","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}