{"title":"Vertex algebras and 4-manifold invariants","uri":"","abstract":"We propose a way of computing 4-manifold invariants, old and new, as chiral\ncorrelation functions in half-twisted 2d N = (0, 2) theories that arise from compactification of fivebranes. Such formulation gives a new interpretation of some known statements\nabout Seiberg-Witten invariants, such as the basic class condition, and gives a prediction\nfor structural properties of the multi-monopole invariants and their non-abelian generalizations.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252441","docid":252441,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1259507","fileid":1259507,"datasetid":"document","objectid":252441,"filename":"1705.01645.pdf","mime_type":"application/pdf","hash":"7bca29e6d506d934b2c3c35ecc3794c9","hash_type":"MD5","filesize":1119316,"mtime":"2017-05-18 16:36:15","url":"http://authors.library.caltech.edu/77558/1/1705.01645.pdf"}],"eprintid":77558,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1705.01645.pdf","content":"submitted"}],"note":"We would like to thank J. Bryan, A. Dabholkar, A. Gadde, A. Haydys, M. Mari˜no,\nV. Mikhaylov, J.W. Morgan, H. Nakajima, H. Ooguri, J. Rasmussen, S. Schafer-Nameki,\nA. Soldatenkov, M. Stosic, E. Verlinde, H. Verlinde, J. Wong, and K. Ye for useful discussions\nand comments. The work of M.D. and S.G. is supported in part by the U.S.\nDepartment of Energy, Office of Science, Office of High Energy Physics, under Award\nNumber DE-SC0011632. In addition, the work of S.G. is supported in part by the ERC\nStarting Grant no. 335739 “Quantum fields and knot homologies” funded by the European\nResearch Council under the European Union Seventh Framework Programme. P.P.\ngratefully acknowledges the support from Marvin L. Goldberger Fellowship and the DOE\nGrant DE-SC0009988. Opinions and conclusions expressed here are those of the authors\nand do not necessarily reflect the views of funding agencies.","id":77558,"rev_number":8,"userid":999,"eprint_dir":"disk0/00/07/75/58","datestamp":"2017-05-18 17:40:42","lastmod":"2017-05-18 17:40:42","status_changed":"2017-05-18 17:40:42","type":"monograph","metadata_visibility":"show","creators":[{"given":"Mykola","family":"Dedushenko","id":"Dedushenko-M","orcid":""},{"given":"Sergei","family":"Gukov","id":"Gukov-S","orcid":""},{"given":"Pavel","family":"Putrov","id":"Putrov-P","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-03","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170518-093106050","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170518-093106050","related_url":[{"url":"http://arxiv.org/abs/1705.01645","type":"arxiv","description":"Discussion Paper"}],"referencetext":["[1] A. Gadde, S. Gukov and P. Putrov, Fivebranes and 4-manifolds, 1306.4320.\n[2] H. Nakajima, Instantons on ale spaces, quiver varieties, and kac-moody algebras, Duke Math.\n76 (1994) 365–416.\n[3] H. Nakajima, Instantons and affine Lie algebras, Nucl. Phys. Proc. Suppl. 46 (1996)\n154–161, [alg-geom/9510003].\n[4] L. Crane and I. B. Frenkel, Four-dimensional topological quantum field theory, Hopf\ncategories, and the canonical bases, J. Math. Phys. 35 (1994) 5136–5154.\n[5] M. Khovanov, A categorification of the Jones polynomial, Duke Math. J. 101 (2000) 359–426.\n[6] M. Khovanov and L. Rozansky, Matrix factorizations and link homology, Fund. Math. 199\n(2008) 1–91, [math/0401268].\n[7] M. Khovanov and L. Rozansky, Matrix factorizations and link homology. II, Geom. Topol. 12\n(2008) 1387–1425, [math.QA/0505056].\n[8] S. Gukov, A. S. Schwarz and C. Vafa, Khovanov-Rozansky homology and topological strings,\nLett.Math.Phys. 74 (2005) 53–74, [hep-th/0412243].\n[9] M. Aganagic, T. Ekholm, L. Ng and C. Vafa, Topological Strings, D-Model, and Knot\nContact Homology, Adv. Theor. Math. Phys. 18 (2014) 827–956, [1304.5778].\n[10] S. Gukov, Gauge theory and knot homologies, Fortsch.Phys. 55 (2007) 473–490, [0706.2369].\n[11] E. Witten, Fivebranes and Knots, 1101.3216.\n[12] N. Carqueville and D. Murfet, Computing Khovanov-Rozansky homology and defect fusion,\nAlgebr. Geom. Topol. 14 (2014) 489–537, [1108.1081].\n[13] S. Chun, S. Gukov and D. Roggenkamp, Junctions of surface operators and categorification\nof quantum groups, 1507.06318.\n[14] S. Nawata and A. Oblomkov, Lectures on knot homology, 2015. 1510.01795.\n[15] M. Jacobsson, An invariant of link cobordisms from Khovanov homology, Algebr. Geom.\nTopol. 4 (2004) 1211–1251 (electronic).\n[16] D. Bar-Natan, Khovanov’s homology for tangles and cobordisms, Geom. Topol. 9 (2005)\n1443–1499.\n[17] J. S. Carter, M. Saito and S. Satoh, Ribbon-moves for 2-knots with 1-handles attached and\nKhovanov-Jacobsson numbers, Proc. Amer. Math. Soc. 134 (2006) 2779–2783 (electronic).\n[18] M. Khovanov, An invariant of tangle cobordisms, Trans. Amer. Math. Soc. 358 (2006)\n315–327.\n[19] J. Rasmussen, Khovanov’s invariant for closed surfaces, math/0502527.\n[20] P. B. Kronheimer and T. S. Mrowka, Gauge theory and Rasmussen’s invariant, J. Topol. 6\n(2013) 659–674.\n[21] S. Gukov, P. Putrov and C. Vafa, Fivebranes and 3-manifold homology, 1602.05302.\n[22] S. Gukov, M. Marino and P. Putrov, Resurgence in complex Chern-Simons theory,\n1605.07615.\n– 64 –\n[23] G. W. Moore, N. Nekrasov and S. Shatashvili, Integrating over Higgs branches, Commun.\nMath. Phys. 209 (2000) 97–121, [hep-th/9712241].\n[24] N. A. Nekrasov, Seiberg-Witten prepotential from instanton counting, Adv.Theor.Math.Phys.\n7 (2004) 831–864, [hep-th/0206161].\n[25] A. Losev, G. W. Moore and S. L. Shatashvili, M \u0026 m’s, Nucl. Phys. B522 (1998) 105–124,\n[hep-th/9707250].\n[26] E. P. Verlinde, Global aspects of electric - magnetic duality, Nucl. Phys. B455 (1995)\n211–228, [hep-th/9506011].\n[27] O. J. Ganor, Compactification of tensionless string theories, hep-th/9607092.\n[28] A. Gadde, S. Gukov and P. Putrov, Exact Solutions of 2d Supersymmetric Gauge Theories,\n1404.5314.\n[29] A. Gadde and P. Putrov, Exact solutions of (0,2) Landau-Ginzburg models, 1608.07753.\n[30] E. Witten, Five-brane effective action in M theory, J.Geom.Phys. 22 (1997) 103–133,\n[hep-th/9610234].\n[31] J. A. Harvey, R. Minasian and G. W. Moore, NonAbelian tensor multiplet anomalies, JHEP\n09 (1998) 004, [hep-th/9808060].\n[32] L. F. Alday, F. Benini and Y. Tachikawa, Liouville/Toda central charges from M5-branes,\nPhys.Rev.Lett. 105 (2010) 141601, [0909.4776].\n[33] C. M. Hull and E. Witten, Supersymmetric Sigma Models and the Heterotic String, Phys.\nLett. B160 (1985) 398–402.\n[34] S. H. Katz and E. Sharpe, Notes on certain (0,2) correlation functions, Commun. Math.\nPhys. 262 (2006) 611–644, [hep-th/0406226].\n[35] E. Witten, Two-dimensional models with (0,2) supersymmetry: Perturbative aspects,\nAdv.Theor.Math.Phys. 11 (2007) , [hep-th/0504078].\n[36] I. Melnikov, S. Sethi and E. Sharpe, Recent Developments in (0,2) Mirror Symmetry,\nSIGMA 8 (2012) 068, [1209.1134].\n[37] K. A. Intriligator, Anomaly matching and a Hopf-Wess-Zumino term in 6d, N=(2,0) field\ntheories, Nucl. Phys. B581 (2000) 257–273, [hep-th/0001205].\n[38] P. Yi, Anomaly of (2,0) theories, Phys. Rev. D64 (2001) 106006, [hep-th/0106165].\n[39] J. P. Gauntlett, N. Kim and D. Waldram, M Five-branes wrapped on supersymmetric cycles,\nPhys.Rev. D63 (2001) 126001, [hep-th/0012195].\n[40] M. Itoh, Moduli of half conformally flat structures, Math. Ann. 296 (1993) 687–708.\n[41] B. Assel, S. Schafer-Nameki and J.-M. Wong, M5-branes on S2 M4: Nahms equations and\n4d topological sigma-models, JHEP 09 (2016) 120, [1604.03606].\n[42] P. Putrov, J. Song and W. Yan, (0,4) dualities, JHEP 03 (2016) 185, [1505.07110].\n[43] E. Witten, Solutions of four-dimensional field theories via M theory, Nucl.Phys. B500 (1997)\n3–42, [hep-th/9703166].\n[44] S. Gukov, D. Pei, P. Putrov and C. Vafa, BPS spectra and 3-manifold invariants,\n1701.06567.\n– 65 –\n[45] A. Hook, S. Kachru and G. Torroba, Supersymmetric Defect Models and Mirror Symmetry,\nJHEP 11 (2013) 004, [1308.4416].\n[46] D. Tong and K. Wong, Vortices and Impurities, JHEP 01 (2014) 090, [1309.2644].\n[47] C. G. Callan and J. M. Maldacena, Brane death and dynamics from the Born-Infeld action,\nNucl. Phys. B513 (1998) 198–212, [hep-th/9708147].\n[48] G. W. Gibbons, Born-Infeld particles and Dirichlet p-branes, Nucl. Phys. B514 (1998)\n603–639, [hep-th/9709027].\n[49] K. Hori and C. Vafa, Mirror symmetry, hep-th/0002222.\n[50] N. Seiberg, Notes on quantum Liouville theory and quantum gravity, Prog. Theor. Phys.\nSuppl. 102 (1990) 319–349.\n[51] E. Gorsky, S. Gukov and M. Stosic, Quadruply-graded colored homology of knots, 1304.3481.\n[52] H. Ooguri and C. Vafa, Knot invariants and topological strings, Nucl. Phys. B577 (2000)\n419–438, [hep-th/9912123].\n[53] R. Harvey and H. B. Lawson, Jr., Calibrated geometries, Acta Math. 148 (1982) 47–157.\n[54] D. S. Berman and J. A. Harvey, The Self-dual string and anomalies in the M5-brane, JHEP\n11 (2004) 015, [hep-th/0408198].\n[55] P. Brax and J. Mourad, Open supermembranes coupled to M theory five-branes, Phys. Lett.\nB416 (1998) 295–302, [hep-th/9707246].\n[56] B. Haghighat, A. Iqbal, C. Kozaz, G. Lockhart and C. Vafa, M-Strings, Commun. Math.\nPhys. 334 (2015) 779–842, [1305.6322].\n[57] M. Mackaay, M. Stosic and P. Vaz, sl(N)-link homology (N ≥ 4) using foams and the\nKapustin-Li formula, Geom. Topol. 13 (2009) 1075–1128.\n[58] H. Queffelec and D. E. V. Rose, The sln foam 2-category: a combinatorial formulation of\nKhovanov-Rozansky homology via categorical skew Howe duality, Adv. Math. 302 (2016)\n1251–1339.\n[59] H. Shimizu and Y. Tachikawa, Anomaly of strings of 6d N = (1, 0) theories, JHEP 11\n(2016) 165, [1608.05894].\n[60] S. M. Kuzenko and S. Theisen, Correlation functions of conserved currents in N=2\nsuperconformal theory, Class. Quant. Grav. 17 (2000) 665–696, [hep-th/9907107].\n[61] A. D. Shapere and Y. Tachikawa, Central charges of N=2 superconformal field theories in\nfour dimensions, JHEP 09 (2008) 109, [0804.1957].\n[62] E. Witten, Monopoles and four manifolds, Math. Res. Lett. 1 (1994) 769–796,\n[hep-th/9411102].\n[63] J. Labastida and M. Marino, Topological quantum field theory and four manifolds. 2005.\n[64] J. A. Bryan and R. Wentworth, The multi-monopole equations for K¨ahler surfaces, Turkish\nJ. Math. 20 (1996) 119–128.\n[65] V. Mikhaylov, Analytic Torsion, 3d Mirror Symmetry And Supergroup Chern-Simons\nTheories, 1505.03130.\n[66] A. Hanany and D. Tong, Vortices, instantons and branes, JHEP 07 (2003) 037,\n[hep-th/0306150].\n– 66 –\n[67] A. Losev, N. Nekrasov and S. L. Shatashvili, Issues in topological gauge theory, Nucl. Phys.\nB534 (1998) 549–611, [hep-th/9711108].\n[68] A. Haydys, Generalized seiberg-witten equations and hyperkahler geometry, PhD dissertation,\nUniversitat Gottingen (2006) .\n[69] A. Haydys and T. Walpuski, A compactness theorem for the Seiberg-Witten equation with\nmultiple spinors in dimension three, Geom. Funct. Anal. 25 (2015) 1799–1821.\n[70] A. Haydys, Topology of the blow-up set for the Seiberg-Witten equation with multiple spinors,\nArXiv e-prints (July, 2016) , [1607.01763].\n[71] S. Donaldson and P. Kronheimer, The geometry of four-manifolds. Oxford Mathematical\nMonographs. Oxford University Press, New York, 2004.\n[72] F. Benini and A. Zaffaroni, Supersymmetric partition functions on Riemann surfaces,\n1605.06120.\n[73] C. Closset and H. Kim, Comments on twisted indices in 3d supersymmetric gauge theories,\nJHEP 08 (2016) 059, [1605.06531].\n[74] F. Benini and A. Zaffaroni, A topologically twisted index for three-dimensional\nsupersymmetric theories, 1504.03698.\n[75] C. Closset, S. Cremonesi and D. S. Park, The equivariant A-twist and gauged linear sigma\nmodels on the two-sphere, JHEP 06 (2015) 076, [1504.06308].\n[76] A. Gadde, L. Rastelli, S. S. Razamat and W. Yan, Gauge Theories and Macdonald\nPolynomials, Commun. Math. Phys. 319 (2013) 147–193, [1110.3740].\n[77] S. Gukov, D. Pei, W. Yan and K. Ye, Equivariant Verlinde algebra from superconformal\nindex and Argyres-Seiberg duality, 1605.06528.\n[78] L. Fredrickson, D. Pei, W. Yan and K. Ye, Argyres-Douglas Theories, Chiral Algebras and\nWild Hitchin Characters, 1701.08782.\n[79] S. K. Donaldson, Polynomial invariants for smooth four-manifolds, Topology 29 (1990)\n257–315.\n[80] P. C. Argyres and N. Seiberg, S-duality in N=2 supersymmetric gauge theories, JHEP 12\n(2007) 088, [0711.0054].\n[81] A. Gadde, L. Rastelli, S. S. Razamat and W. Yan, The Superconformal Index of the E6\nSCFT, JHEP 08 (2010) 107, [1003.4244].\n[82] J. M. F. Labastida and M. Marino, A Topological Lagrangian for monopoles on four\nmanifolds, Phys. Lett. B351 (1995) 146–152, [hep-th/9503105]."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":[{"name":"CALT-TH ","id":"2017-008"}],"funders":[{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0011632"},{"agency":"European Research Council (ERC)","grant_number":"335739"},{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0009988"},{"agency":"Marvin L. Goldberger Fellowship","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Walter Burke Institute for Theoretical Physics"]}