{"title":"Unifying Relations for Scattering Amplitudes","uri":"","abstract":"We derive new amplitudes relations revealing a hidden unity among\nwide-ranging theories in arbitrary spacetime dimensions. Our results rely on a\nset of Lorentz invariant differential operators which transmute physical\ntree-level scattering amplitudes into new ones. By transmuting the amplitudes\nof gravity coupled to a dilaton and two-form, we generate all the amplitudes of\nEinstein-Yang-Mills theory, Dirac-Born-Infield theory, special Galileon,\nnonlinear sigma model, and biadjoint scalar theory. Transmutation also relates\namplitudes in string theory and its variants. As a corollary, celebrated\naspects of gluon and graviton scattering like color-kinematics duality, the KLT\nrelations, and the CHY construction are inherited traits of the transmuted\namplitudes. Transmutation recasts the Adler zero as a trivial consequence of\nthe Weinberg soft theorem and implies new subleading soft theorems for certain\nscalar theories.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252442","docid":252442,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1259514","fileid":1259514,"datasetid":"document","objectid":252442,"filename":"1705.03025.pdf","mime_type":"application/pdf","hash":"ec670d1e645a6eb331f0c41fdc0de022","hash_type":"MD5","filesize":669903,"mtime":"2017-05-18 16:40:58","url":"http://authors.library.caltech.edu/77559/1/1705.03025.pdf"}],"eprintid":77559,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1705.03025.pdf","content":"submitted"}],"note":"We would like to thank Henrik Johansson and Ellis Yuan for discussions which inspired this work,\nas well as Bo Feng, Song He, Yu-tin Huang, Jan Plefka, Oliver Schlotterer, Stephen Stieberger,\nand Wadim Wormsbecher for helpful discussions. CHS and CW are grateful to the KITP, Santa\nBarbara, for hospitality during the final stages of this work. CC is supported by a Sloan Research\nFellowship and CC, CHS, and CW are supported in part by a DOE Early Career Award under\nGrant No. DE-SC0010255 and by the NSF under Grant No. NSF PHY-1125915.","id":77559,"rev_number":8,"userid":999,"eprint_dir":"disk0/00/07/75/59","datestamp":"2017-05-18 17:37:48","lastmod":"2017-05-18 17:37:48","status_changed":"2017-05-18 17:37:48","type":"monograph","metadata_visibility":"show","creators":[{"given":"Clifford","family":"Cheung","id":"Cheung-Clifford","orcid":""},{"given":"Chia-Hsien","family":"Shen","id":"Shen-Chia-Hsien","orcid":""},{"given":"Congkao","family":"Wen","id":"Wen-Congkao","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-08","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170518-093708530","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170518-093708530","related_url":[{"url":"http://arxiv.org/abs/1705.03025","type":"arxiv","description":"Discussion Paper"}],"referencetext":["H. Kawai, D. C. Lewellen and S. H. H. Tye, A Relation Between Tree Amplitudes of Closed\nand Open Strings, Nucl. Phys. B269 (1986) 1–23.\n[2] Z. Bern, J. J. M. Carrasco and H. Johansson, New Relations for Gauge-Theory Amplitudes,\nPhys. Rev. D78 (2008) 085011, [0805.3993].\n[3] F. Cachazo, S. He and E. Y. Yuan, Scattering of Massless Particles in Arbitrary Dimensions,\nPhys. Rev. Lett. 113 (2014) 171601, [1307.2199].\n[4] F. Cachazo, S. He and E. Y. Yuan, Scattering of Massless Particles: Scalars, Gluons and\nGravitons, JHEP 07 (2014) 033, [1309.0885].\n[5] F. Cachazo, S. He and E. Y. Yuan, Scattering Equations and Matrices: From Einstein To\nYang-Mills, DBI and NLSM, JHEP 07 (2015) 149, [1412.3479].\n[6] C. Cheung and C.-H. Shen, Symmetry and Action for Flavor-Kinematics Duality, Phys. Rev.\nLett. 118 (2017) 121601, [1612.00868].\n[7] F. Cachazo, P. Cha and S. Mizera, Extensions of Theories from Soft Limits, JHEP 06 (2016)\n170, [1604.03893].\n[8] J. J. M. Carrasco, C. R. Mafra and O. Schlotterer, Abelian Z-theory: NLSM amplitudes and\nalpha’-corrections from the open string, 1608.02569.\n[9] C. R. Mafra and O. Schlotterer, Non-abelian Z-theory: Berends-Giele recursion for the\nα\n0\n-expansion of disk integrals, JHEP 01 (2017) 031, [1609.07078].\n[10] J. J. M. Carrasco, C. R. Mafra and O. Schlotterer, Semi-abelian Z-theory: NLSM+phi3\nfrom\nthe open string, 1612.06446.\n[11] C. R. Mafra, O. Schlotterer and S. Stieberger, Complete N-Point Superstring Disk Amplitude\nI. Pure Spinor Computation, Nucl. Phys. B873 (2013) 419–460, [1106.2645].\n[12] C. R. Mafra, O. Schlotterer and S. Stieberger, Complete N-Point Superstring Disk Amplitude\nII. Amplitude and Hypergeometric Function Structure, Nucl. Phys. B873 (2013) 461–513,\n[1106.2646].\n[13] J. Broedel, O. Schlotterer and S. Stieberger, Polylogarithms, Multiple Zeta Values and\nSuperstring Amplitudes, Fortsch. Phys. 61 (2013) 812–870, [1304.7267].\n[14] F. Brown, Single-valued Motivic Periods and Multiple Zeta Values, SIGMA 2 (2014) e25,\n[1309.5309].\n27\n[15] S. Stieberger, Closed superstring amplitudes, single-valued multiple zeta values and the\nDeligne associator, J. Phys. A47 (2014) 155401, [1310.3259].\n[16] O. Schlotterer and S. Stieberger, Motivic Multiple Zeta Values and Superstring Amplitudes, J.\nPhys. A46 (2013) 475401, [1205.1516].\n[17] V. Del Duca, L. J. Dixon and F. Maltoni, New color decompositions for gauge amplitudes at\ntree and loop level, Nucl. Phys. B571 (2000) 51–70, [hep-ph/9910563].\n[18] N. Arkani-Hamed, L. Rodina and J. Trnka, Locality and Unitarity from Singularities and\nGauge Invariance, 1612.02797.\n[19] R. Britto, F. Cachazo and B. Feng, New recursion relations for tree amplitudes of gluons,\nNucl.Phys. B715 (2005) 499–522, [hep-th/0412308].\n[20] R. Britto, F. Cachazo, B. Feng and E. Witten, Direct proof of tree-level recursion relation in\nYang-Mills theory, Phys. Rev. Lett. 94 (2005) 181602, [hep-th/0501052].\n[21] T. Cohen, H. Elvang and M. Kiermaier, On-shell constructibility of tree amplitudes in general\nfield theories, JHEP 04 (2011) 053, [1010.0257].\n[22] C. Cheung, C.-H. Shen and J. Trnka, Simple Recursion Relations for General Field Theories,\nJHEP 06 (2015) 118, [1502.05057].\n[23] C. Cheung, K. Kampf, J. Novotny, C.-H. Shen and J. Trnka, On-Shell Recursion Relations\nfor Effective Field Theories, Phys. Rev. Lett. 116 (2016) 041601, [1509.03309].\n[24] H. Luo and C. Wen, Recursion relations from soft theorems, JHEP 03 (2016) 088,\n[1512.06801].\n[25] S. Weinberg, Infrared photons and gravitons, Phys. Rev. 140 (1965) B516–B524.\n[26] S. L. Adler, Consistency conditions on the strong interactions implied by a partially conserved\naxial vector current, Phys. Rev. 137 (1965) B1022–B1033.\n[27] E. Casali, Soft sub-leading divergences in Yang-Mills amplitudes, JHEP 1408 (2014) 077,\n[1404.5551].\n[28] B. U. W. Schwab and A. Volovich, Subleading Soft Theorem in Arbitrary Dimensions from\nScattering Equations, Phys. Rev. Lett. 113 (2014) 101601, [1404.7749].\n[29] F. Cachazo and A. Strominger, Evidence for a New Soft Graviton Theorem, 1404.4091.\n[30] N. Afkhami-Jeddi, Soft Graviton Theorem in Arbitrary Dimensions, 1405.3533.\n28\n[31] D. Kapec, P. Mitra, A.-M. Raclariu and A. Strominger, A 2D Stress Tensor for 4D Gravity,\n1609.00282.\n[32] C. Cheung, A. de la Fuente and R. Sundrum, 4D scattering amplitudes and asymptotic\nsymmetries from 2D CFT, JHEP 01 (2017) 112, [1609.00732].\n[33] P. Di Vecchia, R. Marotta and M. Mojaza, Soft theorem for the graviton, dilaton and the\nKalb-Ramond field in the bosonic string, JHEP 05 (2015) 137, [1502.05258].\n[34] P. Di Vecchia, R. Marotta and M. Mojaza, Subsubleading soft theorems of gravitons and\ndilatons in the bosonic string, JHEP 06 (2016) 054, [1604.03355].\n[35] C. Cheung, K. Kampf, J. Novotny and J. Trnka, Effective Field Theories from Soft Limits of\nScattering Amplitudes, Phys. Rev. Lett. 114 (2015) 221602, [1412.4095].\n[36] C. Cheung, K. Kampf, J. Novotny, C.-H. Shen and J. Trnka, A Periodic Table of Effective\nField Theories, JHEP 02 (2017) 020, [1611.03137].\n[37] L. Rodina, Uniqueness from gauge invariance and the Adler zero, 1612.06342.\n[38] L. Rodina, Uniqueness from locality and BCFW shifts, 1612.03885"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":[{"name":"CALT-TH","id":"2017-022"}],"funders":[{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0010255"},{"agency":"Alfred P. Sloan Foundation","grant_number":""},{"agency":"NSF","grant_number":"PHY-1125915"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Walter Burke Institute for Theoretical Physics"]}