{"title":"General Bootstrap Equations in 4D CFTs","uri":"","abstract":"We provide a framework for generic 4D conformal bootstrap computations. It is\nbased on the unification of two independent approaches, the covariant\n(embedding) formalism and the non-covariant (conformal frame) formalism. We\nconstruct their main ingredients (tensor structures and differential operators)\nand establish a precise connection between them. We supplement the discussion\nby additional details like classification of tensor structures of n-point\nfunctions, normalization of 2-point functions and seed conformal blocks,\nCasimir differential operators and treatment of conserved operators and\npermutation symmetries. Finally, we implement our framework in a Mathematica\npackage and make it freely available.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252444","docid":252444,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1259529","fileid":1259529,"datasetid":"document","objectid":252444,"filename":"1705.05401.pdf","mime_type":"application/pdf","hash":"9fad7ce13c6eec91a4517f14be916f59","hash_type":"MD5","filesize":640911,"mtime":"2017-05-18 17:09:55","url":"http://authors.library.caltech.edu/77561/1/1705.05401.pdf"}],"eprintid":77561,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1705.05401.pdf","content":"submitted"}],"note":"We thank Alejandra Castro, Tolya Dymarsky, Emtinan Elkhidir, Gabriele Ferretti, Diego\nHofman, Hugh Osborn, Jo˜ao Penedones, Riccardo Rattazzi, Fernando Rej´on-Barrera, Slava\nRychkov, Volker Schomerus, David Simmons-Duffin, Marco Serone and Alessandro Vichi for\nuseful discussions. We particularly thank Marco Serone for his valuable comments on the\ndraft and Emtinan Elkhidir for collaboration on the initial stages of this work. DK and PK\nare grateful to the organizers of Boostrap 2016 workshop and the Galileo Galilei Institute for\nTheoretical Physics where the main ideas of this project were born. PK would like to thank\nthe Institute for Advanced Study, where part of this work was completed, for hospitality.\nThis work is supported in part by the DOE grant DE-SC0011632 (PK).","id":77561,"rev_number":8,"userid":999,"eprint_dir":"disk0/00/07/75/61","datestamp":"2017-05-18 17:36:07","lastmod":"2017-05-18 17:36:07","status_changed":"2017-05-18 17:36:07","type":"monograph","metadata_visibility":"show","creators":[{"given":"Gabriel Francisco","family":"Cuomo","id":"Cuomo-G-F","orcid":""},{"given":"Denis","family":"Karateev","id":"Karateev-D","orcid":""},{"given":"Petr","family":"Kravchuk","id":"Kravchuk-P","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-15","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170518-100126278","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170518-100126278","related_url":[{"url":"http://arxiv.org/abs/1705.05401","type":"arxiv","description":"Discussion Paper"}],"referencetext":[" G. Mack and A. Salam, Finite component field representations of the conformal group,\nAnnals Phys. 53 (1969) 174–202.\n[2] A. M. Polyakov, Conformal symmetry of critical fluctuations, JETP Lett. 12 (1970) 381–383.\n[3] S. Ferrara, A. F. Grillo and R. Gatto, Tensor representations of conformal algebra and\nconformally covariant operator product expansion, Annals Phys. 76 (1973) 161–188.\n[4] A. M. Polyakov, Nonhamiltonian approach to conformal quantum field theory, Zh. Eksp. Teor.\nFiz. 66 (1974) 23–42.\n[5] G. Mack, Duality in quantum field theory, Nucl. Phys. B118 (1977) 445–457.\n45Recall that the limit z4 = ∞ is defined with an extra factor |x4|\n2∆4\nin order to obtain a non-zero result.\n46In particular, in the whole Euclidean region.\n– 53 –\n[6] D. Simmons-Duffin, TASI Lectures on the Conformal Bootstrap, in Proceedings, Theoretical\nAdvanced Study Institute in Elementary Particle Physics: New Frontiers in Fields and Strings\n(TASI 2015): Boulder, CO, USA, June 1-26, 2015, pp. 1–74, 2017. 1602.07982. DOI.\n[7] S. Rychkov, EPFL Lectures on Conformal Field Theory in D¿= 3 Dimensions, 1601.05000.\n[8] T. Banks and A. Zaks, On the Phase Structure of Vector-Like Gauge Theories with Massless\nFermions, Nucl. Phys. B196 (1982) 189–204.\n[9] F. Caracciolo, A. Castedo Echeverri, B. von Harling and M. Serone, Bounds on OPE\nCoefficients in 4D Conformal Field Theories, JHEP 10 (2014) 020, [1406.7845].\n[10] R. Rattazzi, V. S. Rychkov, E. Tonni and A. Vichi, Bounding scalar operator dimensions in 4D\nCFT, JHEP 12 (2008) 031, [0807.0004].\n[11] V. S. Rychkov and A. Vichi, Universal Constraints on Conformal Operator Dimensions,\nPhys. Rev. D80 (2009) 045006, [0905.2211].\n[12] R. Rattazzi, S. Rychkov and A. Vichi, Central Charge Bounds in 4D Conformal Field Theory,\nPhys. Rev. D83 (2011) 046011, [1009.2725].\n[13] D. Poland and D. Simmons-Duffin, Bounds on 4D Conformal and Superconformal Field\nTheories, JHEP 05 (2011) 017, [1009.2087].\n[14] R. Rattazzi, S. Rychkov and A. Vichi, Bounds in 4D Conformal Field Theories with Global\nSymmetry, J. Phys. A44 (2011) 035402, [1009.5985].\n[15] D. Poland, D. Simmons-Duffin and A. Vichi, Carving Out the Space of 4D CFTs,\nJHEP 05 (2012) 110, [1109.5176].\n[16] F. Caracciolo and V. S. Rychkov, Rigorous Limits on the Interaction Strength in Quantum\nField Theory, Phys. Rev. D81 (2010) 085037, [0912.2726].\n[17] A. Vichi, Improved bounds for CFT’s with global symmetries, JHEP 01 (2012) 162,\n[1106.4037].\n[18] M. F. Paulos, JuliBootS: a hands-on guide to the conformal bootstrap, 1412.4127.\n[19] D. Simmons-Duffin, A Semidefinite Program Solver for the Conformal Bootstrap,\nJHEP 06 (2015) 174, [1502.02033].\n[20] C. Behan, PyCFTBoot: A flexible interface for the conformal bootstrap, 1602.02810.\n[21] S. El-Showk and M. F. Paulos, Extremal bootstrapping: go with the flow, 1605.08087.\n[22] S. El-Showk and M. F. Paulos, Bootstrapping Conformal Field Theories with the Extremal\nFunctional Method, Phys. Rev. Lett. 111 (2013) 241601, [1211.2810].\n[23] F. Gliozzi, More constraining conformal bootstrap, Phys. Rev. Lett. 111 (2013) 161602,\n[1307.3111].\n[24] S. El-Showk, M. F. Paulos, D. Poland, S. Rychkov, D. Simmons-Duffin and A. Vichi, Solving\nthe 3D Ising Model with the Conformal Bootstrap, Phys. Rev. D86 (2012) 025022, [1203.6064].\n[25] S. El-Showk, M. F. Paulos, D. Poland, S. Rychkov, D. Simmons-Duffin and A. Vichi, Solving\nthe 3d Ising Model with the Conformal Bootstrap II. c-Minimization and Precise Critical\nExponents, J. Stat. Phys. 157 (2014) 869, [1403.4545].\n– 54 –\n[26] F. Kos, D. Poland and D. Simmons-Duffin, Bootstrapping Mixed Correlators in the 3D Ising\nModel, JHEP 11 (2014) 109, [1406.4858].\n[27] F. Kos, D. Poland and D. Simmons-Duffin, Bootstrapping the O(N) vector models,\nJHEP 06 (2014) 091, [1307.6856].\n[28] F. Kos, D. Poland, D. Simmons-Duffin and A. Vichi, Bootstrapping the O(N) Archipelago,\nJHEP 11 (2015) 106, [1504.07997].\n[29] F. Kos, D. Poland, D. Simmons-Duffin and A. Vichi, Precision islands in the Ising and O(N )\nmodels, JHEP 08 (2016) 036, [1603.04436].\n[30] Z. Komargodski and A. Zhiboedov, Convexity and Liberation at Large Spin,\nJHEP 11 (2013) 140, [1212.4103].\n[31] A. L. Fitzpatrick, J. Kaplan, D. Poland and D. Simmons-Duffin, The Analytic Bootstrap and\nAdS Superhorizon Locality, JHEP 12 (2013) 004, [1212.3616].\n[32] L. F. Alday, A. Bissi and T. Lukowski, Large spin systematics in CFT, JHEP 11 (2015) 101,\n[1502.07707].\n[33] L. F. Alday and A. Zhiboedov, An Algebraic Approach to the Analytic Bootstrap,\nJHEP 04 (2017) 157, [1510.08091].\n[34] L. F. Alday and A. Zhiboedov, Conformal Bootstrap With Slightly Broken Higher Spin\nSymmetry, JHEP 06 (2016) 091, [1506.04659].\n[35] L. F. Alday and A. Bissi, Crossing symmetry and Higher spin towers, 1603.05150.\n[36] L. F. Alday, Large Spin Perturbation Theory, 1611.01500.\n[37] L. F. Alday, Solving CFTs with Weakly Broken Higher Spin Symmetry, 1612.00696.\n[38] A. Kaviraj, K. Sen and A. Sinha, Analytic bootstrap at large spin, JHEP 11 (2015) 083,\n[1502.01437].\n[39] A. Kaviraj, K. Sen and A. Sinha, Universal anomalous dimensions at large spin and large twist,\nJHEP 07 (2015) 026, [1504.00772].\n[40] P. Dey, A. Kaviraj and K. Sen, More on analytic bootstrap for O(N) models,\nJHEP 06 (2016) 136, [1602.04928].\n[41] D. Simmons-Duffin, The Lightcone Bootstrap and the Spectrum of the 3d Ising CFT,\nJHEP 03 (2017) 086, [1612.08471].\n[42] F. Gliozzi and A. Rago, Critical exponents of the 3d Ising and related models from Conformal\nBootstrap, JHEP 10 (2014) 042, [1403.6003].\n[43] D. Mazac, Analytic Bounds and Emergence of AdS2 Physics from the Conformal Bootstrap,\nJHEP 04 (2017) 146, [1611.10060].\n[44] S. Rychkov and Z. M. Tan, The ǫ-expansion from conformal field theory,\nJ. Phys. A48 (2015) 29FT01, [1505.00963].\n[45] R. Gopakumar, A. Kaviraj, K. Sen and A. Sinha, A Mellin space approach to the conformal\nbootstrap, JHEP 05 (2017) 027, [1611.08407].\n[46] L. Iliesiu, F. Kos, D. Poland, S. S. Pufu, D. Simmons-Duffin and R. Yacoby, Bootstrapping 3D\nFermions, JHEP 03 (2016) 120, [1508.00012].\n– 55 –\n[47] L. Iliesiu, F. Kos, D. Poland, S. S. Pufu and D. Simmons-Duffin, Bootstrapping 3D Fermions\nwith Global Symmetries, 1705.03484.\n[48] A. Dymarsky, J. Penedones, E. Trevisani and A. Vichi, Charting the space of 3D CFTs with a\ncontinuous global symmetry, 1705.04278.\n[49] S. Ferrara and G. Parisi, Conformal covariant correlation functions,\nNucl. Phys. B42 (1972) 281–290.\n[50] G. M. Sotkov and R. P. Zaikov, Conformal Invariant Two Point and Three Point Functions for\nFields with Arbitrary Spin, Rept. Math. Phys. 12 (1977) 375.\n[51] G. Mack, Convergence of operator product expansions on the vacuum in conformal invariant\nquantum field theory, Comm. Math. Phys. 53 (1977) 155–184.\n[52] H. Osborn and A. C. Petkou, Implications of conformal invariance in field theories for general\ndimensions, Annals Phys. 231 (1994) 311–362, [hep-th/9307010].\n[53] S. Weinberg, Six-dimensional Methods for Four-dimensional Conformal Field Theories,\nPhys. Rev. D82 (2010) 045031, [1006.3480].\n[54] S. Giombi, S. Prakash and X. Yin, A Note on CFT Correlators in Three Dimensions,\nJHEP 07 (2013) 105, [1104.4317].\n[55] M. S. Costa, J. Penedones, D. Poland and S. Rychkov, Spinning Conformal Correlators,\nJHEP 11 (2011) 071, [1107.3554].\n[56] S. Weinberg, Six-dimensional Methods for Four-dimensional Conformal Field Theories II:\nIrreducible Fields, Phys. Rev. D86 (2012) 085013, [1209.4659].\n[57] M. S. Costa and T. Hansen, Conformal correlators of mixed-symmetry tensors,\nJHEP 02 (2015) 151, [1411.7351].\n[58] D. Simmons-Duffin, Projectors, Shadows, and Conformal Blocks, JHEP 04 (2014) 146,\n[1204.3894].\n[59] E. Elkhidir, D. Karateev and M. Serone, General Three-Point Functions in 4D CFT,\nJHEP 01 (2015) 133, [1412.1796].\n[60] G. Mack, Convergence of Operator Product Expansions on the Vacuum in Conformal Invariant\nQuantum Field Theory, Commun. Math. Phys. 53 (1977) 155.\n[61] P. Kravchuk and D. Simmons-Duffin, Counting Conformal Correlators, 1612.08987.\n[62] F. A. Dolan and H. Osborn, Conformal four point functions and the operator product\nexpansion, Nucl. Phys. B599 (2001) 459–496, [hep-th/0011040].\n[63] F. A. Dolan and H. Osborn, Conformal partial waves and the operator product expansion,\nNucl. Phys. B678 (2004) 491–507, [hep-th/0309180].\n[64] F. A. Dolan and H. Osborn, Conformal Partial Waves: Further Mathematical Results,\n1108.6194.\n[65] M. Hogervorst and S. Rychkov, Radial Coordinates for Conformal Blocks,\nPhys. Rev. D87 (2013) 106004, [1303.1111].\n[66] M. Hogervorst, Dimensional Reduction for Conformal Blocks, JHEP 09 (2016) 017,\n[1604.08913].\n– 56 –\n[67] M. S. Costa, J. Penedones, D. Poland and S. Rychkov, Spinning Conformal Blocks,\nJHEP 11 (2011) 154, [1109.6321].\n[68] F. Rejon-Barrera and D. Robbins, Scalar-Vector Bootstrap, JHEP 01 (2016) 139, [1508.02676].\n[69] L. Iliesiu, F. Kos, D. Poland, S. S. Pufu, D. Simmons-Duffin and R. Yacoby, Fermion-Scalar\nConformal Blocks, JHEP 04 (2016) 074, [1511.01497].\n[70] J. Penedones, E. Trevisani and M. Yamazaki, Recursion Relations for Conformal Blocks,\nJHEP 09 (2016) 070, [1509.00428].\n[71] M. S. Costa, T. Hansen, J. Penedones and E. Trevisani, Radial expansion for spinning\nconformal blocks, JHEP 07 (2016) 057, [1603.05552].\n[72] M. S. Costa, T. Hansen, J. Penedones and E. Trevisani, Projectors and seed conformal blocks\nfor traceless mixed-symmetry tensors, JHEP 07 (2016) 018, [1603.05551].\n[73] V. Schomerus, E. Sobko and M. Isachenkov, Harmony of Spinning Conformal Blocks,\n1612.02479.\n[74] A. Castedo Echeverri, E. Elkhidir, D. Karateev and M. Serone, Deconstructing Conformal\nBlocks in 4D CFT, JHEP 08 (2015) 101, [1505.03750].\n[75] A. Castedo Echeverri, E. Elkhidir, D. Karateev and M. Serone, Seed Conformal Blocks in 4D\nCFT, JHEP 02 (2016) 183, [1601.05325].\n[76] D. Pappadopulo, S. Rychkov, J. Espin and R. Rattazzi, OPE Convergence in Conformal Field\nTheory, Phys. Rev. D86 (2012) 105043, [1208.6449].\n[77] S. Rychkov and P. Yvernay, Remarks on the Convergence Properties of the Conformal Block\nExpansion, Phys. Lett. B753 (2016) 682–686, [1510.08486].\n[78] A. Dymarsky, On the four-point function of the stress-energy tensors in a CFT,\nJHEP 10 (2015) 075, [1311.4546].\n[79] P. A. M. Dirac, Wave equations in conformal space, Annals Math. 37 (1936) 429–442.\n[80] J. Wess and J. Bagger, Supersymmetry and supergravity. Princeton University Press, 1992.\n[81] H. K. Dreiner, H. E. Haber and S. P. Martin, Two-component spinor techniques and Feynman\nrules for quantum field theory and supersymmetry, Phys. Rept. 494 (2010) 1–196, [0812.1594].\n[82] G. Mack, All Unitary Ray Representations of the Conformal Group SU(2,2) with Positive\nEnergy, Commun. Math. Phys. 55 (1977) 1.\n[83] S. Minwalla, Restrictions imposed by superconformal invariance on quantum field theories, Adv.\nTheor. Math. Phys. 2 (1998) 781–846, [hep-th/9712074].\n[84] S. Weinberg, Minimal fields of canonical dimensionality are free,\nPhys. Rev. D86 (2012) 105015, [1210.3864].\n[85] J. Maldacena and A. Zhiboedov, Constraining Conformal Field Theories with A Higher Spin\nSymmetry, J. Phys. A46 (2013) 214011, [1112.1016].\n[86] V. Alba and K. Diab, Constraining conformal field theories with a higher spin symmetry in\nd \u003e 3 dimensions, JHEP 03 (2016) 044, [1510.02535].\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":[{"name":"CALT-TH","id":"2017-023"}],"funders":[{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0011632"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Walter Burke Institute for Theoretical Physics"]}