{"title":"Photopolarimetric characteristics of brown dwarfs bearing uniform cloud decks","uri":"","abstract":"It has long been known that an envelope of scattering particles like free\nelectrons, atoms and molecules, or particulate aggregates like haze or cloud\ngrains affect the intensity and polarization of radiation emitted by a rotating\nbody (Chandrasekhar 1946; Harrington and Collins 1968, Sengupta and Marley\n2010, Marley and Sengupta 2011, de Kok et al. 2011). Due to their high rotation\nrates, brown dwarfs (BDs) are expected to be considerably oblate. We present a\nconics-based radiative transfer scheme for computing the disc-resolved and\ndisc-integrated polarized emission of an oblate body. Using this capability, we\nexamine the photopolarimetric signal of BDs as a function of the scattering\nproperties of its atmosphere like cloud optical thickness and cloud grain size\nas well as properties specific to the BD such as its oblateness and the\norientation of its rotation axis relative to the observer. The polarizing\neffect of temperature inhomogeneity caused by gravity-darkening is considered\ndistinctly from the effect of oblateness, revealing that resulting temperature\ngradients cause intensity differences that can amplify the disc-integrated\npolarization by a factor of 2. Our examination of the properties of scatterers\nsuggests that the contested relative brightening in the J-band for cooler BDs\nin the L/T-transition can partly be explained by thick clouds bearing\nlarger-sized grains. Grain-size affects both the intensity and polarization of\nemitted radiation - as grain-size increases relative to wavelength, the\npolarization caused by scattering decreases sharply, especially at infrared\nwavelengths where Rayleigh scattering due to atoms and molecules becomes\nnegligible. We thus claim that the presence of scattering particles is a\nnecessary but not sufficient condition for observing polarization of emitted\nlight.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252451","docid":252451,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1259580","fileid":1259580,"datasetid":"document","objectid":252451,"filename":"1705.05041.pdf","mime_type":"application/pdf","hash":"3959be1e0402069f3a7194948f4c1ffd","hash_type":"MD5","filesize":7456894,"mtime":"2017-05-18 17:31:52","url":"http://authors.library.caltech.edu/77566/1/1705.05041.pdf"}],"eprintid":77566,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1705.05041.pdf","content":"submitted"}],"note":"We thank Prof. Heather Hnutson for valuable discussions. S.V.S thanks Prof. Yuk L. Yung and Prof. John\nGrotzinger of Caltech for their kind support. This research was carried out at the Jet Propulsion Laboratory, California\nInstitute of Technology, under contract with NASA. \n\nCopyright 2017. All rights reserved.","id":77566,"rev_number":9,"userid":999,"eprint_dir":"disk0/00/07/75/66","datestamp":"2017-05-18 17:35:26","lastmod":"2017-05-18 17:35:26","status_changed":"2017-05-18 17:35:26","type":"monograph","metadata_visibility":"show","creators":[{"given":"Suniti","family":"Sanghavi","id":"Sanghavi-S","orcid":""},{"given":"Maxwell A.","family":"Millar-Blanchaer","id":"Millar-Blanchaer-M-A","orcid":""},{"given":"Avi","family":"Shporer","id":"Shporer-A","orcid":""},{"given":"Adric","family":"Riedel","id":"Riedel-A","orcid":""},{"given":"Samaporn","family":"Tinyatont","id":"Tinyatont-S","orcid":""},{"given":"Ricky","family":"Nilsson","id":"Nilsson-R","orcid":""},{"given":"Tiffany","family":"Kataria","id":"Kataria-T","orcid":""},{"given":"Dimitri","family":"Mawet","id":"Mawet-D","orcid":"0000-0002-8895-4735"}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"brown dwarfs — L/T transition — clouds — oblateness — photopolarimetric retrievals","date":"2017-05-15","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170518-102709338","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170518-102709338","related_url":[{"url":"http://arxiv.org/abs/1705.05041","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Allard, F., Homeier, D., Freytag, B., Jun. 2012. Models of\nvery-low-mass stars, brown dwarfs and exoplanets.\nPhilosophical Transactions of the Royal Society of\nLondon Series A 370, 2765–2777.\nBailer-Jones, C. A., 2004. Spectroscopic rotation velocities\nof l dwarfs from vlt/uves and their comparison with\nperiods from photometric monitoring. Astronomy \u0026\nAstrophysics 419 (2), 703–712.\nBarnes, J. W., Fortney, J. J., 2003. Measuring the\noblateness and rotation of transiting extrasolar giant\nplanets. The Astrophysical Journal 588 (1), 545.\nBerger, E., 2002. Flaring up all overradio activity in rapidly\nrotating late m and l dwarfs. The Astrophysical Journal\n572 (1), 503.\nBerger, E., 2006. Radio observations of a large sample of\nlate m, l, and t dwarfs: The distribution of magnetic field\nstrengths. The Astrophysical Journal 648 (1), 629.\nBurrows, A., Hubbard, W., Lunine, J., Liebert, J., 2001.\nThe theory of brown dwarfs and extrasolar giant planets.\nReviews of Modern Physics 73 (3), 719.\nBurrows, A., Sudarsky, D., Hubeny, I., 2006. L and t dwarf\nmodels and the l to t transition. The Astrophysical\nJournal 640 (2), 1063.\nChandrasekhar, S., 1946. On the radiative equilibrium of a\nstellar atmosphere. x. The Astrophysical Journal 103,\n351.\nChandrasekhar, S., 1967. Ellipsoidal figures of\nequilibriuman historical account. Communications on\nPure and Applied Mathematics 20 (2), 251–265.\nCrossfield, I. J. M., Biller, B., Schlieder, J. E., Deacon,\nN. R., Bonnefoy, M., Homeier, D., Allard, F., Buenzli,\nE., Henning, T., Brandner, W., Goldman, B., Kopytova,\nT., Jan. 2014. A global cloud map of the nearest known\nbrown dwarf. Nature505, 654–656.\nCushing, M. C., Kirkpatrick, J. D., Gelino, C. R., Griffith,\nR. L., Skrutskie, M. F., Mainzer, A., Marsh, K. A.,\nBeichman, C. A., Burgasser, A. J., Prato, L. A., Simcoe,\nR. A., Marley, M. S., Saumon, D., Freedman, R. S.,\nEisenhardt, P. R., Wright, E. L., Dec. 2011. The\nDiscovery of Y Dwarfs using Data from the Wide-field\nInfrared Survey Explorer (WISE). ApJ743, 50.\nCushing, M. C., Marley, M. S., Saumon, D., Kelly, B. C.,\nVacca, W. D., Rayner, J. T., Freedman, R. S., Lodders,\nK., Roellig, T. L., 2008. Atmospheric parameters of field\nl and t dwarfs. The Astrophysical Journal 678 (2), 1372.\nCushing, M. C., Rayner, J. T., Vacca, W. D., 2005. An\ninfrared spectroscopic sequence of m, l, and t dwarfs. The\nAstrophysical Journal 623 (2), 1115.\nDe Kok, R., Stam, D., Karalidi, T., 2011. Characterizing\nexoplanetary atmospheres through infrared polarimetry.\nThe Astrophysical Journal 741 (1), 59.\nDomke, H., 1975. Fourier expansion of the phase matrix for\nMie scattering. Zeitschrift f¨ur Meteorologie 25, 357–361.\nEspinosa Lara, F., Rieutord, M., 2011. Gravity darkening\nin rotating stars. Astronomy \u0026 Astrophysics 533, A43.\nFaherty, J. K., Riedel, A. R., Cruz, K. L., Gagne, J.,\nFilippazzo, J. C., Lambrides, E., Fica, H., Weinberger,\nA., Thorstensen, J. R., Tinney, C. G., Baldassare, V.,\nLemonier, E., Rice, E. L., Jul. 2016. Population\nProperties of Brown Dwarf Analogs to Exoplanets.\nApJS225, 10.\nFeingold, G., Cotton, W. R., Kreidenweis, S. M., Davis,\nJ. T., 1999. The impact of giant cloud condensation\nnuclei on drizzle formation in stratocumulus:\nImplications for cloud radiative properties. Journal of the\natmospheric sciences 56 (24), 4100–4117.\nGoldman, B., Pitann, J., Osorio, M. Z., Bailer-Jones, C.,\nB´ejar, V., Caballero, J., Henning, T., 2009. Polarisation\nof very-low-mass stars and brown dwarfs-i. vlt/fors1\noptical observations of field ultra-cool dwarfs. Astronomy\n\u0026 Astrophysics 502 (3), 929–936.\nHarrington, J. P., Collins, G. W., 1968. Intrinsic\npolarization of rapidly rotating early-type stars. The\nAstrophysical Journal 151, 1051.\nHovenier, J., 1969. Symmetry relationships for scattering of\npolarized light in a slab of randomly oriented particles.\nJournal of Atmospheric Sciences 26, 488–499.\nKlein, S. A., Hartmann, D. L., 1993. The seasonal cycle of\nlow stratiform clouds. Journal of Climate 6 (8),\n1587–1606.\nManjavacas, E., Miles-P´aez, P., Zapatero-Osorio, M.,\nGoldman, B., Buenzli, E., Henning, T., Pall´e, E., Fang,\nM., 2017. Testing the existence of optical linear\npolarization in young brown dwarfs. arXiv preprint\narXiv:1703.07341.\nMarley, M. S., Sengupta, S., 2011. Probing the physical\nproperties of directly imaged gas giant exoplanets\nthrough polarization. Monthly Notices of the Royal\nAstronomical Society 417 (4), 2874–2881.\nMenard, F., Delfosse, X., Monin, J.-L., 2002. Optical linear\npolarimetry of ultra cool dwarfs. Astronomy \u0026\nAstrophysics 396 (3), L35–L38.\nMiles-P´aez, P. A., Osorio, M. Z., Pall´e, E., Ram´ırez, K. P.,\n2013. Linear polarization of rapidly rotating ultracool\ndwarfs. Astronomy \u0026 Astrophysics 556, A125.\nMiles-P´aez, P. A., Zapatero Osorio, M. R., Pall´e, E., Pe˜na\nRam´ırez, K., Apr. 2017. Optical and near-infrared linear\npolarization of low and intermediate-gravity ultracool\ndwarfs. MNRAS466, 3184–3198.\nRadigan, J., Lafreni`ere, D., Jayawardhana, R., Artigau, E.,\nOct. 2014. Strong Brightness Variations Signal\nCloudy-to-clear Transition of Brown Dwarfs. ApJ793, 75.\nRasmussen, R. M., Geresdi, I., Thompson, G., Manning,\nK., Karplus, E., 2002. Freezing drizzle formation in\nstably stratified layer clouds: The role of radiative\ncooling of cloud droplets, cloud condensation nuclei, and\nice initiation. Journal of the atmospheric sciences 59 (4),\n837–860.\nRobinson, T. D., Marley, M. S., 2014. Temperature\nfluctuations as a source of brown dwarf variability. The\nAstrophysical Journal 785 (2), 158.\nSanghavi, S., 2014. Revisiting the Fourier expansion of Mie\nscattering matrices in generalized spherical functions.\nJournal of Quantitative Spectroscopy and Radiative\nTransfer 136, 16–27.\nSanghavi, S., Davis, A. B., Eldering, A., 2014.\nvSmartMOM: A vector matrix operator method-based\nradiative transfer model linearized with respect to aerosol\nproperties. Journal of Quantitative Spectroscopy and\nRadiative Transfer 133, 412–433.\nSanghavi, S., Lebsock, M., Stephens, G., 2015. Sensitivity\nanalysis of polarimetric O2 A-band spectra for potential\ncloud retrievals using OCO-2/GOSAT measurements.\nAtmospheric Measurement Techniques 8 (9), 3601–3616.\nSaumon, D., Marley, M. S., 2008. The evolution of l and t\ndwarfs in color-magnitude diagrams. The Astrophysical\nJournal 689 (2), 1327.\nSeager, S., Hui, L., 2002. Constraining the rotation rate of\ntransiting extrasolar planets by oblateness measurements.\nThe Astrophysical Journal 574 (2), 1004.\nAASTEX Photopolarimetric characteristics of uniformly cloudy BDs 27\nSengupta, S., 2003. Explaining the observed polarization\nfrom brown dwarfs by single dust scattering. The\nAstrophysical Journal Letters 585 (2), L155.\nSengupta, S., Krishan, V., 2001. Probing dust in the\natmosphere of brown dwarfs through polarization. The\nAstrophysical Journal Letters 561 (1), L123.\nSengupta, S., Marley, M. S., 2009. Multiple scattering\npolarization of substellar-mass objects: T dwarfs. The\nAstrophysical Journal 707 (1), 716.\nSengupta, S., Marley, M. S., 2010. Observed polarization of\nbrown dwarfs suggests low surface gravity. The\nAstrophysical Journal Letters 722 (2), L142.\nShowman, A. P., Kaspi, Y., 2013. Atmospheric dynamics of\nbrown dwarfs and directly imaged giant planets. The\nAstrophysical Journal 776 (2), 85.\nSiewert, C., 1982. On the phase matrix basic to the\nscattering of polarized light. Astronomy and Astrophysics\n109, 195.\nTremblin, P., Amundsen, D. S., Chabrier, G., Baraffe, I.,\nDrummond, B., Hinkley, S., Mourier, P., Venot, O., 2016.\nCloudless atmospheres for l/t dwarfs and extrasolar giant\nplanets. The Astrophysical Journal Letters 817 (2), L19.\nTsuji, T., Nakajima, T., Yanagisawa, K., 2004. Dust in the\nphotospheric environment. ii. effect on the near-infrared\nspectra of l and t dwarfs. The Astrophysical Journal\n607 (1), 511.\nTsuji, T., Ohnaka, K., Aoki, W., Nakajima, T., 1996.\nEvolution of dusty photospheres through red to brown\ndwarfs: how dust forms in very low mass objects.\nAstronomy and Astrophysics 308, L29–L32.\nVon Zeipel, H., 1924. The radiative equilibrium of a slightly\noblate rotating star. Monthly Notices of the Royal\nAstronomical Society 84, 684–701.\nWauben, W., De Haan, J., Hovenier, J., 1994. A method for\ncomputing visible and infrared polarized monochromatic\nradiation in planetary atmospheres. Astronomy and\nAstrophysics 282, 277–290.\nYang, H., Apai, D., Marley, M. S., Karalidi, T., Flateau,\nD., Showman, A. P., Metchev, S., Buenzli, E., Radigan,\nJ., Artigau, E., et al., 2016. Extrasolar storms: ´\nPressure-dependent changes in light-curve phase in\nbrown dwarfs from simultaneous hst and spitzer\nobservations. The Astrophysical Journal 826 (1), 8.\nZapatero Osorio, M. R., Caballero, J., B´ejar, V., 2005.\nOptical linear polarization of late m and l type dwarfs.\nThe Astrophysical Journal 621 (1), 445.\nZhang, X., Showman, A. P., 2014. Atmospheric circulation\nof brown dwarfs: jets, vortices, and time variability. The\nAstrophysical Journal Letters 788 (1), L6."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NASA Hubble Fellowship","grant_number":""},{"agency":"NASA/JPL/Caltech","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}