{"title":"Designing core-shell 3D photonic crystal lattices for negative refraction","uri":"","abstract":"We use a plane wave expansion method to define parameters for the fabrication of 3-dimensional (3D) core-shell photonic crystals (PhCs) with lattice geometries that are capable of all-angle negative refraction (AANR) in the midinfrared centered around 8.0 μm. We discuss the dependence of the AANR frequency range on the volume fraction of solid within the lattice and on the ratio of the low index core material to the high index shell material. Following the constraints set by simulations, we fabricate two types of nanolattice PhCs: (1) polymer core-germanium shell and (2) amorphous carbon core-germanium shell to enable experimental observation of 3D negative refraction and related dispersion phenomena at infrared and eventually optical frequencies.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252453","docid":252453,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1259618","fileid":1259618,"datasetid":"document","objectid":252453,"filename":"101120G.pdf","mime_type":"application/pdf","hash":"c245d11c1366101b054c456b7b0bc460","hash_type":"MD5","filesize":722551,"mtime":"2017-05-18 17:46:56","url":"http://authors.library.caltech.edu/77569/1/101120G.pdf"}],"eprintid":77569,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"101120G.pdf","content":"published"}],"note":"© 2017 Society of Photo-Optical Instrumentation Engineers (SPIE).\n\n","id":77569,"rev_number":9,"userid":772,"eprint_dir":"disk0/00/07/75/69","datestamp":"2017-05-18 18:41:14","lastmod":"2017-05-18 18:41:14","status_changed":"2017-05-18 18:41:14","type":"book_section","metadata_visibility":"show","creators":[{"given":"Victoria F.","family":"Chernow","id":"Chernow-V-F","orcid":""},{"given":"Ryan C.","family":"Ng","id":"Ng-Ryan-C","orcid":""},{"given":"Julia R.","family":"Greer","id":"Greer-J-R","orcid":"0000-0002-9675-1508"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"3-dimensional photonic crystal, nanolattice, negative refraction, two-photon lithography, collimation","date":"2017-02-20","date_type":"published","publication":"","volume":"","number":"10112","pagerange":"Art. No. 101120G","id_number":"CaltechAUTHORS:20170518-104629829","refereed":true,"issn":"0277786X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170518-104629829","related_url":[{"url":"http://dx.doi.org/10.1117/12.2251545","type":"doi","description":"Article"},{"url":"http://proceedings.spiedigitallibrary.org/proceeding.aspx?articleid=2605943","type":"pub","description":"Article"}],"referencetext":["[1] Veselago, V. G., “The electrodynamics of substances with simultaneously negative values of ε and μ,” Sov.\nPhys. Uspekhi 10(4), 509–514 (1968).\n[2] Luo, C., Johnson, S. G., Soljačić, M., Joannopouls, J. D.., Pendry, J. B., “Novel optical phenomena with\nphotonic crystals,” Proc. SPIE - Int. Soc. Opt. Eng. 5166, 207–219 (2004).\n[3] Notomi, M., “Theory of light propagation in strongly modulated photonic crystals: Reflectionlike behavior in the\nvicinity of the photonic band gap,” Phys. Rev. B 62(16), 10696 (2000).\n[4] Baba, T., Matsumoto, T.., Asatsuma, T., “Negative Refraction in Photonic Crystals,” Adv. Sci. Technol. 55, 91–\n100 (2008).\n[5] Luo, C., Johnson, S., Joannopoulos, J.., Pendry, J., “All-angle negative refraction without negative effective\nindex,” Phys. Rev. B 65(20), 2–5 (2002).\n[6] Cubukcu, E., Aydin, K., Ozbay, E., Foteinopoulou, S.., Soukoulis, C. M., “Subwavelength resolution in a twodimensional\nphotonic-crystal-based superlens.,” Phys. Rev. Lett. 91(20), 207401 (2003).\n[7] Luo, C., Johnson, S. G.., Joannopoulos, J. D., “All-angle negative refraction in a three-dimensionally periodic\nphotonic crystal,” Appl. Phys. Lett. 81(13), 2352–2354 (2002).\n[8] Lu, Z., Shi, S., Schuetz, C., Murakowski, J.., Prather, D., “Three-dimensional photonic crystal flat lens by full\n3D negative refraction.,” Opt. Express 13(15), 5592–5599 (2005).\n[9] Lu, Z., Murakowski, J. A., Schuetz, C. A., Shi, S., Schneider, G. J.., Prather, D. W., “Three-dimensional\nsubwavelength imaging by a photonic-crystal flat lens using negative refraction at microwave frequencies,”\nPhys. Rev. Lett. 95(15), 2–5 (2005).\n[10] Icenogle, H. W., Platt, B. C.., Wolfe, W. L., “Refractive indexes and temperature coefficients of germanium and\nsilicon,” Appl. Opt. 15(10), 2348–2351 (1976).\n[11] Joannopoulos, J. D., Johnson, S. G., Winn, J. N.., Meade, R. D., Photonic crystals: molding the flow of light,\nPrinceton University Press (2008).\n[12] Chernow, V. F., Alaeian, H., Dionne, J. A.., Greer, J. R., “Polymer lattices as mechanically tunable 3-\ndimensional photonic crystals operating in the infrared,” Appl. Phys. Lett. 107(10) (2015).\n[13] Bauer, J., Schroer, A., Schwaiger, R.., Kraft, O., “Approaching theoretical strength in glassy carbon\nnanolattices.,” Nat. Mater. 15(4), 438–443 (2016).\n[14] Hagemann, H.-J., Gudat, W.., Kunz, C., “Optical constants from the far infrared to the x-ray region: Mg, Al, Cu,\nAg, Au, Bi, C, and Al2O3,” J. Opt. Soc. Am. 65(6), 742 (1975)."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Victoria F. Chernow ; Ryan C. Ng ; Julia R. Greer; \nDesigning core-shell 3D photonic crystal lattices for negative refraction. Proc. SPIE 10112, Photonic and Phononic Properties of Engineered Nanostructures VII, 101120G (February 20, 2017); doi:10.1117/12.2251545.","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}