{"title":"Carving Out the End of the World or (Superconformal Bootstrap in Six Dimensions)","uri":"","abstract":"We bootstrap N = (1, 0) superconformal field theories in six dimensions, by analyzing the four-point function of flavor current multiplets. Assuming E8 flavor group, we present universal bounds on the central charge CT and the flavor central charge CJ . Based on the numerical data, we conjecture that the rank-one E-string theory saturates the universal lower bound on CJ , and numerically determine the spectrum of long multiplets in the rank-one E-string theory. We comment on the possibility of solving the higher-rank E-string theories by bootstrap and thereby probing M-theory on AdS7 × S^4/Z_2.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252443","docid":252443,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1259522","fileid":1259522,"datasetid":"document","objectid":252443,"filename":"1705.05392.pdf","mime_type":"application/pdf","hash":"6efafb9b7fcbefa400e977b2dbeacea7","hash_type":"MD5","filesize":2195505,"mtime":"2017-05-18 17:00:15","url":"http://authors.library.caltech.edu/77560/1/1705.05392.pdf"}],"eprintid":77560,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1705.05392.pdf","content":"submitted"}],"note":"We are grateful to Matteo Beccaria, Clay C´ordova, Thomas T. Dumitrescu, Ori Ganor,\nHee-Cheol Kim, Petr Kravchuk, Luca V. Iliesiu, Kenneth Intriligator, Silviu S. Pufu, Tom\nRudelius, Arkady A. Tseytlin, Yifan Wang, Xi Yin, and Yang Zhou for insightful discussions,\nand to Yifan Wang for comments on the first draft. CC thanks the California Institute of\nTechnology and Harvard University, and YL thanks Yale University, the Center for Quantum\nMathematics and Physics at University of California, Davis, the University of Amsterdam,\nand Princeton University for hospitality during the course of this work. The numerical\ncomputations were performed on the Harvard Odyssey cluster, the UC Davis Peloton cluster,\nand the Caltech high energy theory group cluster. We thank Tony Bartolotta for technical\nsupport with the Caltech cluster. YL is supported by the Sherman Fairchild Foundation and the U.S. Department of Energy, Office of Science, Office of High Energy Physics, under\nAward Number DE-SC0011632. Lastly, the discoveries in this paper would not have been\npossible without John’s foundational work on string theory, and we wish John a very happy\nbirthday!","id":77560,"rev_number":9,"userid":999,"eprint_dir":"disk0/00/07/75/60","datestamp":"2017-05-18 17:37:13","lastmod":"2017-05-18 17:37:13","status_changed":"2017-05-18 17:37:13","type":"monograph","metadata_visibility":"show","creators":[{"given":"Chi-Ming","family":"Chang","id":"Chang-Chi-Ming","orcid":""},{"given":"Ying-Hsuan","family":"Lin","id":"Lin-Ying-Hsuan-Physics","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-15","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170518-094204448","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170518-094204448","related_url":[{"url":"http://arxiv.org/abs/1705.05392","type":"arxiv","description":"Discussion Paper"}],"referencetext":["D. Gaiotto, G. W. Moore and A. Neitzke, Wall-crossing, Hitchin Systems, and the\nWKB Approximation, 0907.3987.\n[2] D. Gaiotto, N=2 dualities, JHEP 08 (2012) 034, [0904.2715].\n[3] F. Apruzzi, G. Dibitetto and L. Tizzano, A new 6d fixed point from holography,\nJHEP 11 (2016) 126, [1603.06576].\n[4] H. Ooguri and C. Vafa, Non-supersymmetric AdS and the Swampland, 1610.01533.\n[5] S. Minwalla, Restrictions imposed by superconformal invariance on quantum field\ntheories, Adv. Theor. Math. Phys. 2 (1998) 781–846, [hep-th/9712074].\n[6] J. Bhattacharya, S. Bhattacharyya, S. Minwalla and S. Raju, Indices for\nSuperconformal Field Theories in 3,5 and 6 Dimensions, JHEP 02 (2008) 064,\n[0801.1435].\n[7] J. Louis and S. L¨ust, Supersymmetric AdS7 backgrounds in half-maximal supergravity\nand marginal operators of (1, 0) SCFTs, JHEP 10 (2015) 120, [1506.08040].\n[8] M. Buican, J. Hayling and C. Papageorgakis, Aspects of Superconformal Multiplets in\nD \u003e 4, JHEP 11 (2016) 091, [1606.00810].\n[9] C. Cordova, T. T. Dumitrescu and K. Intriligator, Multiplets of Superconformal\nSymmetry in Diverse Dimensions, 1612.00809.\n[10] C. Cordova, T. T. Dumitrescu and K. Intriligator, Deformations of Superconformal\nTheories, JHEP 11 (2016) 135, [1602.01217].\n51\n[11] A. M. Polyakov, Nonhamiltonian approach to conformal quantum field theory, Zh.\nEksp. Teor. Fiz. 66 (1974) 23–42.\n[12] S. Ferrara, A. F. Grillo and R. Gatto, Tensor representations of conformal algebra\nand conformally covariant operator product expansion, Annals Phys. 76 (1973)\n161–188.\n[13] G. Mack, Duality in quantum field theory, Nucl. Phys. B118 (1977) 445–457.\n[14] A. A. Belavin, A. M. Polyakov and A. B. Zamolodchikov, Infinite Conformal\nSymmetry in Two-Dimensional Quantum Field Theory, Nucl. Phys. B241 (1984)\n333–380.\n[15] R. Rattazzi, V. S. Rychkov, E. Tonni and A. Vichi, Bounding scalar operator\ndimensions in 4D CFT, JHEP 12 (2008) 031, [0807.0004].\n[16] V. S. Rychkov and A. Vichi, Universal Constraints on Conformal Operator\nDimensions, Phys. Rev. D80 (2009) 045006, [0905.2211].\n[17] D. Poland and D. Simmons-Duffin, Bounds on 4D Conformal and Superconformal\nField Theories, JHEP 05 (2011) 017, [1009.2087].\n[18] D. Poland, D. Simmons-Duffin and A. Vichi, Carving Out the Space of 4D CFTs,\nJHEP 05 (2012) 110, [1109.5176].\n[19] S. El-Showk, M. F. Paulos, D. Poland, S. Rychkov, D. Simmons-Duffin and A. Vichi,\nSolving the 3D Ising Model with the Conformal Bootstrap, Phys. Rev. D86 (2012)\n025022, [1203.6064].\n[20] S. El-Showk and M. F. Paulos, Bootstrapping Conformal Field Theories with the\nExtremal Functional Method, Phys. Rev. Lett. 111 (2013) 241601, [1211.2810].\n[21] C. Beem, L. Rastelli and B. C. van Rees, The N = 4 Superconformal Bootstrap,\nPhys. Rev. Lett. 111 (2013) 071601, [1304.1803].\n[22] F. Kos, D. Poland and D. Simmons-Duffin, Bootstrapping the O(N) vector models,\nJHEP 06 (2014) 091, [1307.6856].\n[23] S. El-Showk, M. F. Paulos, D. Poland, S. Rychkov, D. Simmons-Duffin and A. Vichi,\nSolving the 3d Ising Model with the Conformal Bootstrap II. c-Minimization and\nPrecise Critical Exponents, J. Stat. Phys. 157 (2014) 869, [1403.4545].\n[24] S. M. Chester, J. Lee, S. S. Pufu and R. Yacoby, The N = 8 superconformal bootstrap\nin three dimensions, JHEP 09 (2014) 143, [1406.4814].\n[25] F. Kos, D. Poland and D. Simmons-Duffin, Bootstrapping Mixed Correlators in the\n3D Ising Model, JHEP 11 (2014) 109, [1406.4858].\n[26] F. Caracciolo, A. Castedo Echeverri, B. von Harling and M. Serone, Bounds on OPE\nCoefficients in 4D Conformal Field Theories, JHEP 10 (2014) 020, [1406.7845].\n52\n[27] S. M. Chester, J. Lee, S. S. Pufu and R. Yacoby, Exact Correlators of BPS Operators\nfrom the 3d Superconformal Bootstrap, JHEP 03 (2015) 130, [1412.0334].\n[28] J.-B. Bae and S.-J. Rey, Conformal Bootstrap Approach to O(N) Fixed Points in Five\nDimensions, 1412.6549.\n[29] C. Beem, M. Lemos, P. Liendo, L. Rastelli and B. C. van Rees, The N = 2\nsuperconformal bootstrap, JHEP 03 (2016) 183, [1412.7541].\n[30] S. M. Chester, S. S. Pufu and R. Yacoby, Bootstrapping O(N) vector models in 4\n\u003c d \u003c 6, Phys. Rev. D91 (2015) 086014, [1412.7746].\n[31] D. Simmons-Duffin, A Semidefinite Program Solver for the Conformal Bootstrap,\nJHEP 06 (2015) 174, [1502.02033].\n[32] F. Kos, D. Poland, D. Simmons-Duffin and A. Vichi, Bootstrapping the O(N)\nArchipelago, JHEP 11 (2015) 106, [1504.07997].\n[33] S. M. Chester, S. Giombi, L. V. Iliesiu, I. R. Klebanov, S. S. Pufu and R. Yacoby,\nAccidental Symmetries and the Conformal Bootstrap, JHEP 01 (2016) 110,\n[1507.04424].\n[34] C. Beem, M. Lemos, L. Rastelli and B. C. van Rees, The (2, 0) superconformal\nbootstrap, Phys. Rev. D93 (2016) 025016, [1507.05637].\n[35] L. Iliesiu, F. Kos, D. Poland, S. S. Pufu, D. Simmons-Duffin and R. Yacoby,\nBootstrapping 3D Fermions, JHEP 03 (2016) 120, [1508.00012].\n[36] M. Lemos and P. Liendo, Bootstrapping N = 2 chiral correlators, JHEP 01 (2016)\n025, [1510.03866].\n[37] Y.-H. Lin, S.-H. Shao, D. Simmons-Duffin, Y. Wang and X. Yin, N=4\nSuperconformal Bootstrap of the K3 CFT, 1511.04065.\n[38] F. Kos, D. Poland, D. Simmons-Duffin and A. Vichi, Precision islands in the Ising\nand O(N ) models, JHEP 08 (2016) 036, [1603.04436].\n[39] Z. Li and N. Su, Bootstrapping Mixed Correlators in the Five Dimensional Critical\nO(N) Models, 1607.07077.\n[40] S. Collier, Y.-H. Lin and X. Yin, Modular Bootstrap Revisited, 1608.06241.\n[41] Y.-H. Lin, S.-H. Shao, Y. Wang and X. Yin, (2,2) Superconformal Bootstrap in Two\nDimensions, 1610.05371.\n[42] D. Li, D. Meltzer and A. Stergiou, Bootstrapping Mixed Correlators in 4D N = 1\nSCFTs, 1702.00404.\n[43] S. Collier, P. Kravchuk, Y.-H. Lin and X. Yin, Bootstrapping the Spectral Function:\nOn the Uniqueness of Liouville and the Universality of BTZ, 1702.00423.\n53\n[44] O. J. Ganor and A. Hanany, Small E(8) instantons and tensionless noncritical\nstrings, Nucl. Phys. B474 (1996) 122–140, [hep-th/9602120].\n[45] N. Seiberg and E. Witten, Comments on string dynamics in six-dimensions, Nucl.\nPhys. B471 (1996) 121–134, [hep-th/9603003].\n[46] N. Seiberg, Five-dimensional SUSY field theories, nontrivial fixed points and string\ndynamics, Phys. Lett. B388 (1996) 753–760, [hep-th/9608111].\n[47] D. R. Morrison and N. Seiberg, Extremal transitions and five-dimensional\nsupersymmetric field theories, Nucl. Phys. B483 (1997) 229–247, [hep-th/9609070].\n[48] O. J. Ganor, D. R. Morrison and N. Seiberg, Branes, Calabi-Yau spaces, and toroidal\ncompactification of the N=1 six-dimensional E(8) theory, Nucl. Phys. B487 (1997)\n93–127, [hep-th/9610251].\n[49] J. J. Heckman, P. Jefferson, T. Rudelius and C. Vafa, Punctures for theories of class\nSΓ , JHEP 03 (2017) 171, [1609.01281].\n[50] S. S. Razamat, C. Vafa and G. Zafrir, 4d N=1 from 6d (1,0), 1610.09178.\n[51] M. Del Zotto, J. J. Heckman, A. Tomasiello and C. Vafa, 6d Conformal Matter,\nJHEP 02 (2015) 054, [1407.6359].\n[52] J. J. Heckman, D. R. Morrison and C. Vafa, On the Classification of 6D SCFTs and\nGeneralized ADE Orbifolds, JHEP 05 (2014) 028, [1312.5746].\n[53] J. J. Heckman, More on the Matter of 6D SCFTs, Phys. Lett. B747 (2015) 73–75,\n[1408.0006].\n[54] J. J. Heckman, D. R. Morrison, T. Rudelius and C. Vafa, Atomic Classification of 6D\nSCFTs, Fortsch. Phys. 63 (2015) 468–530, [1502.05405].\n[55] J. A. Harvey, R. Minasian and G. W. Moore, NonAbelian tensor multiplet anomalies,\nJHEP 09 (1998) 004, [hep-th/9808060].\n[56] K. A. Intriligator, Anomaly matching and a Hopf-Wess-Zumino term in 6d, N=(2,0)\nfield theories, Nucl. Phys. B581 (2000) 257–273, [hep-th/0001205].\n[57] K. Ohmori, H. Shimizu and Y. Tachikawa, Anomaly polynomial of E-string theories,\nJHEP 08 (2014) 002, [1404.3887].\n[58] K. Ohmori, H. Shimizu, Y. Tachikawa and K. Yonekura, Anomaly polynomial of\ngeneral 6d SCFTs, PTEP 2014 (2014) 103B07, [1408.5572].\n[59] K. Intriligator, 6d, N = (1, 0) Coulomb branch anomaly matching, JHEP 10 (2014)\n162, [1408.6745].\n[60] N. Mekareeya, T. Rudelius and A. Tomasiello, T-branes, Anomalies and Moduli\nSpaces in 6D SCFTs, 1612.06399."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":[{"name":"CALT-TH","id":"2017-015"}],"funders":[{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0011632"},{"agency":"Sherman Fairchild Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Walter Burke Institute for Theoretical Physics"]}