{"title":"A model for the condensation of a dusty plasma","uri":"","abstract":"A model for the condensation of a dusty plasma is constructed by considering the spherical shielding layers surrounding a dust grain test particle. Since the diameter of the shielding region is smaller than a collision mean free path, the shielding region can be considered as being a collisionless spherical region which is surrounded by an outer collisional region. This collisionless inner region is shown to separate into three concentric layers, each having distinct physics. A collisionless Vlasov model must be used for ions in the inner-most layer and it is shown that the resulting ion density is much smaller than the predictions of the Boltzmann relation which is shown to be inappropriate in this layer. The method of matched asymptotic expansions is used at the interfaces between the three collisionless layers to derive a pair of nonlinear equations which determine the radii of the two interfaces between the three collisionless layers. Despite being much smaller than the Wigner-Seitz radius, the dust Debye length is found to be physically significant because it gives the local scale length of a precipitous cut-off of the shielded electrostatic potential at the interface between the second and third collisionless layers. Condensation of a dusty plasma into a Coulomb crystal is predicted to occur when the ratio of this cut-off radius to the Wigner-Seitz radius exceeds unity and this prediction is shown to be in good agreement with published results from a number of different experiments.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252463","docid":252463,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1259707","fileid":1259707,"datasetid":"document","objectid":252463,"filename":"01339618.pdf","mime_type":"application/pdf","hash":"f882e24ccbe1bfedf941da8b0b7dc39c","hash_type":"MD5","filesize":61485,"mtime":"2017-05-18 18:34:50","url":"http://authors.library.caltech.edu/77573/1/01339618.pdf"}],"eprintid":77573,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"01339618.pdf","content":"published"}],"note":"© 2004 IEEE.","id":77573,"rev_number":8,"userid":207,"eprint_dir":"disk0/00/07/75/73","datestamp":"2017-05-18 18:38:59","lastmod":"2017-05-18 18:38:59","status_changed":"2017-05-18 18:38:59","type":"book_section","metadata_visibility":"show","creators":[{"given":"P. M.","family":"Bellan","id":"Bellan-P-M","orcid":"0000-0002-0886-8782"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2004-07","date_type":"published","publication":"","volume":"","number":"","pagerange":"118","id_number":"CaltechAUTHORS:20170518-112527361","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170518-112527361","related_url":[{"url":"https://doi.org/10.1109/PLASMA.2004.1339618","type":"doi","description":"Abstract"},{"url":"http://ieeexplore.ieee.org/document/1339618/","type":"pub","description":"Abstract"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"P. M. Bellan, \"A model for the condensation of a dusty plasma,\" The 31st IEEE International Conference on Plasma Science, 2004. ICOPS 2004. IEEE Conference Record - Abstracts., Baltimore, MD, USA, 2004, pp. 118-.\ndoi: 10.1109/PLASMA.2004.1339618","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}