{"title":"197 Candidates and 104 Validated Planets in K2's First Five Fields","uri":"","abstract":"We present 197 planet candidates discovered using data from the first year of the NASA K2 mission (Campaigns 0–4), along with the results of an intensive program of photometric analyses, stellar spectroscopy, high-resolution imaging, and statistical validation. We distill these candidates into sets of 104 validated planets (57 in multi-planet systems), 30 false positives, and 63 remaining candidates. Our validated systems span a range of properties, with median values of R P  = 2.3 R_⊕, P = 8.6 days, T_(eff) = 5300 K, and Kp = 12.7 mag. Stellar spectroscopy provides precise stellar and planetary parameters for most of these systems. We show that K2 has increased by 30% the number of small planets known to orbit moderately bright stars (1–4 R_⊕, Kp = 9–13 mag). Of particular interest are 76 planets smaller than 2 R_⊕, 15 orbiting stars brighter than Kp = 11.5 mag, 5 receiving Earth-like irradiation levels, and several multi-planet systems—including 4 planets orbiting the M dwarf K2–72 near mean-motion resonances. By quantifying the likelihood that each candidate is a planet we demonstrate that our candidate sample has an overall false positive rate of 15%–30%, with rates substantially lower for small candidates (\u003c2R_⊕) and larger for candidates with radii \u003e8R_⊕ and/or with P \u003c 3 days. Extrapolation of the current planetary yield suggests that K2 will discover between 500 and 1000 planets in its planned four-year mission, assuming sufficient follow-up resources are available. Efficient observing and analysis, together with an organized and coherent follow-up strategy, are essential for maximizing the efficacy of planet-validation efforts for K2, TESS, and future large-scale surveys.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252478","docid":252478,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1259911","fileid":1259911,"datasetid":"document","objectid":252478,"filename":"Crossfield_2016_ApJS_226_7.pdf","mime_type":"application/pdf","hash":"234bf79a04814942accc620c99501e7b","hash_type":"MD5","filesize":2213774,"mtime":"2017-05-18 20:49:53","url":"http://authors.library.caltech.edu/77587/1/Crossfield_2016_ApJS_226_7.pdf"}],"eprintid":77587,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Crossfield_2016_ApJS_226_7.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252479","docid":252479,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1259915","fileid":1259915,"datasetid":"document","objectid":252479,"filename":"1607.05263.pdf","mime_type":"application/pdf","hash":"988172f1cb2a3211d03630760319f324","hash_type":"MD5","filesize":1795371,"mtime":"2017-05-18 20:52:06","url":"http://authors.library.caltech.edu/77587/2/1607.05263.pdf"}],"eprintid":77587,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1607.05263.pdf","content":"submitted"}],"note":"© 2016. The American Astronomical Society.\n\nReceived 2016 April 1 \nAccepted 2016 June 20 \nPublished 2016 September 2\n\nThis paper includes data collected by the K2 mission. Funding for the K2 mission is provided by the NASA Science Mission directorate.\n\nThis work was performed in part under contract with the Jet Propulsion Laboratory (JPL) funded by NASA through the Sagan Fellowship Program executed by the NASA Exoplanet Science Institute. E.A.P. acknowledges support by NASA through a Hubble Fellowship grant awarded by the Space Telescope Science Institute, which is operated by the Association of Universities for Research in Astronomy, Inc., for NASA, under contract NAS 5-26555. The Research of JES was supported by an appointment to the NASA Postdoctoral Program at the NASA Ames Research Center, administered by Universities Space Research Association under contract with NASA. B.J.F. was supported by the National Science Foundation Graduate Research Fellowship under grant No. 2014184874. Any opinion, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation. A.J. acknowledges support from FONDECYT project 1130857, BASAL CATA PFB-06, and from the Ministry for the Economy, Development, and Tourism's Programa Iniciativa Científica Milenio through grant IC 120009, awarded to the Millennium Institute of Astrophysics (MAS).\n\nSome of the data presented herein were obtained at the W.M. Keck Observatory (which is operated as a scientific partnership among Caltech, UC, and NASA) and at the Infrared Telescope Facility (IRTF, operated by UH under NASA contract NNH14CK55B). The authors wish to recognize and acknowledge the very significant cultural role and reverence that the summit of Maunakea has always had within the indigenous Hawaiian community. We are most fortunate to have the opportunity to conduct observations from this mountain.\n\nC.B. acknowledges support from the Alfred P. Sloan Foundation. The Robo-AO system was developed by the collaborating partner institutions, the California Institute of Technology and the Inter-University Centre for Astronomy and Astrophysics, and with the support of the National Science Foundation under grant Nos. AST-0906060, AST-0960343, and AST-1207891, the Mt. Cuba Astronomical Foundation, and by a gift from Samuel Oschin.\n\nThe Pan-STARRS1 Surveys (PS1) have been made possible through the contributions of the Institute for Astronomy, the University of Hawaii, the Pan-STARRS Project Office, the Max Planck Society and its participating institutes, the Max Planck Institute for Astronomy, Heidelberg and the Max Planck Institute for Extraterrestrial Physics, Garching, The Johns Hopkins University, Durham University, the University of Edinburgh, Queen's University Belfast, the Harvard-Smithsonian Center for Astrophysics, the Las Cumbres Observatory Global Telescope Network Incorporated, the National Central University of Taiwan, the Space Telescope Science Institute, the National Aeronautics and Space Administration under grant No. NNX08AR22G issued through the Planetary Science Division of the NASA Science Mission Directorate, the National Science Foundation under grant No. AST-1238877, the University of Maryland, and Eotvos Lorand University (ELTE).\n\nFacilities: APF (Levy) - , Kepler - , K2 - , Keck:I (HIRES) - , Keck:II (NIRC2) - , IRTF (SpeX) - , Palomar:Hale (PALM-3000/PHARO) - , Palomar:1.5 m (Robo-AO) - , Gemini:North (DSSI) - , Gemini:South (NIRI) - , LBT (LMIRCam). -\n\n\n","id":77587,"rev_number":19,"userid":772,"eprint_dir":"disk0/00/07/75/87","datestamp":"2017-05-18 21:54:59","lastmod":"2017-05-18 21:54:59","status_changed":"2017-05-18 21:54:59","type":"article","metadata_visibility":"show","creators":[{"given":"Ian J. M.","family":"Crossfield","id":"Crossfield-I-J-M","orcid":""},{"given":"David R.","family":"Ciardi","id":"Ciardi-D-R","orcid":"0000-0002-5741-3047"},{"given":"Erik A.","family":"Petigura","id":"Petigura-E-A","orcid":"0000-0003-0967-2893"},{"given":"Joshua E.","family":"Schlieder","id":"Schlieder-J-E","orcid":""},{"given":"Charles A.","family":"Beichman","id":"Beichman-C-A","orcid":""},{"given":"Courtney D.","family":"Dressing","id":"Dressing-C-D","orcid":""},{"given":"Jessie L.","family":"Christiansen","id":"Christiansen-J-L","orcid":""},{"given":"Reed","family":"Riddle","id":"Riddle-R-L","orcid":""},{"given":"Björn","family":"Benneke","id":"Benneke-B","orcid":""},{"given":"Heather","family":"Knutson","id":"Knutson-H-A","orcid":"0000-0002-0822-3095"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"catalogs; planets and satellites: fundamental parameters; planets and satellites: general; techniques: high angular resolution; techniques: photometric; techniques: spectroscopic","date":"2016-09","date_type":"published","publication":"Astrophysical Journal Supplement Series","volume":"226","number":"1","pagerange":"Art. No. 7","id_number":"CaltechAUTHORS:20170518-134907890","refereed":true,"issn":"0067-0049","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170518-134907890","related_url":[{"url":"https://doi.org/10.3847/0067-0049/226/1/7","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/0067-0049/226/1/7","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1607.05263","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Adams, E. R., Ciardi, D. R., Dupree, A. K., et al. 2012, AJ, 144, 42\nAdams, E. R., Jackson, B., \u0026 Endl, M. 2016, AJ, 152, 47\nAller, K. M., Kraus, A. L., Liu, M. C., et al. 2013, ApJ, 773, 63\nAlmenara, J. M., Astudillo-Defru, N., Bonfils, X., et al. 2015, A\u0026A, 581, L7\nAngus, R., Foreman-Mackey, D., \u0026 Johnson, J. A. 2016, ApJ, 818, 109\nArmstrong, D. J., Kirk, J., Lam, K. W. F., et al. 2016, MNRAS, 456, 2260\nArmstrong, D. J., Santerne, A., Veras, D., et al. 2015, A\u0026A, 582, A33\nBaranec, C., Riddle, R., Law, N. M., et al. 2013, Journal of Visualized\nExperiments, 72, e50021\nBaranec, C., Riddle, R., Law, N. M., et al. 2014, ApJL, 790, L8\nBaranne, A., Mayor, M., \u0026 Poncet, J. L. 1979, VA, 23, 279\nBarros, S. C. C., Almenara, J. M., Demangeon, O., et al. 2015, MNRAS,\n454, 4267\nBecker, J. C., Vanderburg, A., Adams, F. C., Rappaport, S. A., \u0026\nSchwengeler, H. M. 2015, ApJL, 812, L18\nBeichman, C., Livingston, J., Werner, M., et al. 2016, ApJ, 822, 39\nBorucki, W. J., Koch, D. G., Basri, G., et al. 2011, ApJ, 736, 19\nBoyajian, T. S., von Braun, K., van Belle, G., et al. 2012, ApJ, 757, 112\nChristiansen, J. L., Clarke, B. D., Burke, C. J., et al. 2015, ApJ, 810, 95\nCiardi, D. R., Beichman, C. A., Horch, E. P., \u0026 Howell, S. B. 2015, ApJ,\n805, 16\nCoelho, P., Barbuy, B., Meléndez, J., Schiavon, R. P., \u0026 Castilho, B. V. 2005,\nA\u0026A, 443, 735\nCollier Cameron, A., Wilson, D. M., West, R. G., et al. 2007, MNRAS,\n380, 1230\nCoughlin, J. L., Mullally, F., Thompson, S. E., et al. 2016, ApJS, 224, 12\nCrossfield, I. J. M., Petigura, E., Schlieder, J. E., et al. 2015, ApJ, 804, 10\nDai, F., Winn, J. N., Albrecht, S., et al. 2016, ApJ, 823, 115\nDavid, T. J., Hillenbrand, L. A., Cody, A. M., Carpenter, J. M., \u0026\nHoward, A. W. 2016a, ApJ, 816, 21\nDavid, T. J., Hillenbrand, L. A., Petigura, E. A., et al. 2016b, Natur, 534, 658\nDekany, R., Roberts, J., Burruss, R., et al. 2013, ApJ, 776, 130\nDíaz, R. F., Almenara, J. M., Santerne, A., et al. 2014, MNRAS, 441, 983\nDotter, A., Chaboyer, B., Jevremović, D., et al. 2008, ApJS, 178, 89\nDressing, C. D., \u0026 Charbonneau, D. 2015, ApJ, 807, 45\nEspinoza, N., et al. 2016, arXiv:1601.07635\nFeiden, G. A., \u0026 Chaboyer, B. 2012, ApJ, 757, 42\nForeman-Mackey, D., Hogg, D. W., Lang, D., \u0026 Goodman, J. 2012,\narXiv:1202.3665\nForeman-Mackey, D., Montet, B. T., Hogg, D. W., et al. 2015, ApJ,\n806, 215\nFulton, B. J., Howard, A. W., Winn, J. N., et al. 2013, ApJ, 772, 80\nGreene, T. P., Line, M. R., Montero, C., et al. 2016, ApJ, 817, 17\nGrziwa, S., Gandolfi, D., Csizmadia, S., et al. 2015, arXiv:1510.09149\nHayward, T. L., Brandl, B., Pirger, B., et al. 2001, PASP, 113, 105\nHellier, C., Anderson, D. R., Collier Cameron, A., et al. 2012, MNRAS,\n426, 739\nHirano, T., Fukui, A., Mann, A. W., et al. 2016, ApJ, 820, 41\nHodapp, K.-W., Irwin, E. M., Yamada, H., et al. 2003, Proc. SPIE, 4841, 869\nHorch, E. P., Howell, S. B., Everett, M. E., \u0026 Ciardi, D. R. 2012, AJ, 144, 165\nHorch, E. P., Veillette, D. R., Baena Gallé, R., et al. 2009, AJ, 137, 5057\nHoward, A. W., Marcy, G. W., Bryson, S. T., et al. 2012, ApJS, 201, 15\nHoward, A. W., Marcy, G. W., Johnson, J. A., et al. 2010, Sci, 330, 653\nHowell, S. B., Rowe, J. F., Bryson, S. T., et al. 2012, ApJ, 746, 123\nHowell, S. B., Sobeck, C., Haas, M., et al. 2014, PASP, 126, 398\nHuang, C. X., Hartman, J. D., Bakos, G. Á., et al. 2015, AJ, 150, 85\nHuber, D., Bryson, S. T., Haas, M. R., et al. 2016, ApJS, 224, 2\nHuber, D., Ireland, M. J., Bedding, T. R., et al. 2012, ApJ, 760, 32\nJohnson, M. C., Gandolfi, D., Fridlund, M., et al. 2016, AJ, 151, 171\nJordán, A., Brahm, R., Bakos, G. Á., et al. 2014, AJ, 148, 29\nKaiser, N., Aussel, H., Burke, B. E., et al. 2002, Proc. SPIE, 4836, 154\nKaufer, A., \u0026 Pasquini, L. 1998, Proc. SPIE, 3355, 844\nKolbl, R., Marcy, G. W., Isaacson, H., \u0026 Howard, A. W. 2015, AJ, 149, 18\nKraus, A. L., \u0026 Hillenbrand, L. A. 2007, AJ, 134, 2340\nKreidberg, L. 2015, PASP, 127, 1161\nLaCourse, D. M., Jek, K. J., Jacobs, T. L., et al. 2015, MNRAS, 452, 3561\nLaw, N. M., Morton, T., Baranec, C., et al. 2014, ApJ, 791, 35\nLeisenring, J. M., Skrutskie, M. F., Hinz, P. M., et al. 2012, Proc. SPIE, 8446,\n84464F\nLépine, S., \u0026 Shara, M. M. 2005, AJ, 129, 1483\nLillo-Box, J., Demangeon, O., Santerne, A., et al. 2016, arXiv:1601.07635\nLissauer, J. J., Marcy, G. W., Rowe, J. F., et al. 2012, ApJ, 750, 112\nMaldonado, J., Affer, L., Micela, G., et al. 2015, A\u0026A, 577, A132\nMann, A. W., Gaidos, E., Mace, G. N., et al. 2016, ApJ, 818, 46\nMarigo, P., Girardi, L., Bressan, A., et al. 2008, A\u0026A, 482, 883\nMontet, B. T., Morton, T. D., Foreman-Mackey, D., et al. 2015, ApJ, 809, 25\nMorton, T. D. 2012, ApJ, 761, 6\nMorton, T. D. 2015, VESPA: False Positive Probabilities Calculator,\nAstrophysics Source Code Library, ascl:1503.011\nMorton, T. D., Bryson, S. T., Coughlin, J. L., et al. 2016, ApJ, 822, 86\nMulders, G. D., Pascucci, I., \u0026 Apai, D. 2015, ApJ, 814, 130\nNarita, N., Hirano, T., Fukui, A., et al. 2015, ApJ, 815, 47\nNeveu-VanMalle, M., Queloz, D., Anderson, D. R., et al. 2016, A\u0026A,\n586, A93\nOsborn, H. P., Armstrong, D. J., Brown, D. J. A., et al. 2016, MNRAS,\n457, 2273\nParviainen, H., \u0026 Aigrain, S. 2015, MNRAS, 453, 3821\nPecaut, M. J., \u0026 Mamajek, E. E. 2013, ApJS, 208, 9\nPetigura, E. A. 2015, arXiv:1510.03902\nPetigura, E. A., Howard, A. W., \u0026 Marcy, G. W. 2013a, PNAS, 110, 19273\nPetigura, E. A., Howard, A. W., Lopez, E. D., et al. 2016, ApJ, 818, 36\nPetigura, E. A., Marcy, G. W., \u0026 Howard, A. W. 2013b, ApJ, 770, 69\nPetigura, E. A., Schlieder, J. E., Crossfield, I. J. M., et al. 2015, ApJ, 811, 102\nQueloz, D. 1995, in IAU Symp. 167, New Developments in Array Technology\nand Applications, ed. A. G. D. Philip, K. Janes, \u0026 A. R. Upgren, 221\nRicker, G. R., Winn, J. N., Vanderspek, R., et al. 2014, Proc. SPIE, 9143\n20\nRodriguez, D. R., Zuckerman, B., Kastner, J. H., et al. 2013, ApJ, 774, 101\nRowe, J. F., Bryson, S. T., Marcy, G. W., et al. 2014, ApJ, 784, 45\nSanchis-Ojeda, R., Rappaport, S., Pallé, E., et al. 2015, ApJ, 812, 112\nSanterne, A., Díaz, R. F., Almenara, J.-M., et al. 2015, MNRAS, 451, 2337\nSanterne, A., Hébrard, G., Lillo-Box, J., et al. 2016a, ApJ, 824, 55\nSanterne, A., Moutou, C., Tsantaki, M., et al. 2016b, A\u0026A, 587, A64\nSchlieder, J. E., Crossfield, I. J. M., Petigura, E. A., et al. 2016, ApJ, 818, 87\nSchmitt, J. R., Tokovinin, A., Wang, J., et al. 2016, AJ, 151, 159\nSinukoff, E., Howard, A. W., Petigura, E., et al. 2016, ApJ, 827, 78\nStassun, K. G., Pepper, J. A., Paegert, M., De Lee, N., \u0026 Sanchis-Ojeda, R.\n2014, arXiv:1410.6379\nTer Braak, C. J. F. 2006, Statistics and Computing, 16, 239\nTeske, J. K., Everett, M. E., Hirsch, L., et al. 2015, AJ, 150, 144\nTorres, G., Fischer, D. A., Sozzetti, A., et al. 2012, ApJ, 757, 161\nTorres, G., Fressin, F., Batalha, N. M., et al. 2011, ApJ, 727, 24\nValenti, J. A., \u0026 Fischer, D. A. 2005, ApJS, 159, 141\nVan Cleve, J. E., Howell, S. B., Smith, J. C., et al. 2016, PASP, 128, 075002\nVan Eylen, V., Albrecht, S., Gandolfi, D., et al. 2016b, arXiv:1605.09180\nVan Eylen, V., Nowak, G., Albrecht, S., et al. 2016a, ApJ, 820, 56\nVanderburg, A., \u0026 Johnson, J. A. 2014, PASP, 126, 948\nVanderburg, A., Latham, D. W., Buchhave, L. A., et al. 2016, ApJS, 222, 14\nVanderburg, A., Montet, B. T., Johnson, J. A., et al. 2015, ApJ, 800, 59\nVogt, S. S., Allen, S. L., Bigelow, B. C., et al. 1994, Proc. SPIE, 2198, 362\nZenteno, A., Forster, F., Rest, A., et al. 2015, ATel, 7664\nZiegler, C., Law, N. M., Morton, T., et al. 2016, arXiv:1605.03584"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Ian J. M. Crossfield et al 2016 ApJS 226 7","other_numbering_system":null,"funders":[{"agency":"NASA Sagan Fellowship","grant_number":""},{"agency":"NASA Hubble Fellowship","grant_number":""},{"agency":"NASA","grant_number":"NAS 5-26555"},{"agency":"NASA Postdoctoral Program","grant_number":""},{"agency":"NSF Graduate Research Fellowship","grant_number":"2014184874"},{"agency":"Fondo Nacional de Desarrollo Científico y Tecnológico (FONDECYT)","grant_number":"1130857"},{"agency":"BASAL CATA","grant_number":"PFB-06"},{"agency":"Ministry for the Economy, Development, and Tourism’s Programa Iniciativa Cientıfica Milenio","grant_number":"IC 120009"},{"agency":"NASA","grant_number":"NNH14CK55B"},{"agency":"Alfred P. Sloan Foundation","grant_number":""},{"agency":"NSF","grant_number":"AST-0906060"},{"agency":"NSF","grant_number":"AST-0960343"},{"agency":"NSF","grant_number":"AST-1207891"},{"agency":"Mt. Cuba Astronomical Foundation","grant_number":""},{"agency":"Samuel Oschin","grant_number":""},{"agency":"Institute for Astronomy","grant_number":""},{"agency":"University of Hawaii","grant_number":""},{"agency":"Pan-STARRS Project Office","grant_number":""},{"agency":"Max Planck Society ","grant_number":""},{"agency":"Max Planck Institute for Astronomy","grant_number":""},{"agency":"Max Planck Institute for Extraterrestrial Physics","grant_number":""},{"agency":"Johns Hopkins University","grant_number":""},{"agency":"Durham University","grant_number":""},{"agency":"University of Edinburgh","grant_number":""},{"agency":"Queen's University Belfast","grant_number":""},{"agency":"Harvard-Smithsonian Center for Astrophysics","grant_number":""},{"agency":"Las Cumbres Observatory Global Telescope Network Incorporated","grant_number":""},{"agency":"National Central University of Taiwan","grant_number":""},{"agency":"Space Telescope Science Institute","grant_number":""},{"agency":"NASA","grant_number":"NNX08AR22G"},{"agency":"NSF","grant_number":"AST-1238877"},{"agency":"University of Maryland ","grant_number":""},{"agency":"Eotvos Lorand University (ELTE)","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"","local_group":null}