{"title":"Molecular Methods in Geomicrobiology","uri":"","abstract":"In addition to the techniques described in Chapter 8, molecular tools have become increasingly important in the study of the presence, activity, and mechanisms of catalysis by geomicrobial organisms. Today, various molecules (deoxyribonucleic acid [DNA], ribonucleic acid [RNA], protein, and lipids) are used to detect specific geomicrobial agents in situ and make inferences about their metabolic activity. DNA sequencing has become routine, expanding our appreciation of the genetic potential of uncultivated organisms and complex natural communities from the environment. Isotope labeling approaches allow us to measure metabolic activity more directly and to specifically link organisms with geochemical fluxes. Finally, the application of molecular genetic, cell biological, and biochemical techniques to study the genes and gene products that catalyze geochemically significant reactions is unraveling the mechanisms underlying these processes. Together, these molecular approaches provide a window into the interactions between microorganisms and their geochemical environment and enable predictions about how these geomicrobial processes may be altered in response to environmental perturbations.","documents":null,"note":"© 2016 Taylor \u0026 Francis Group, LLC.","id":77592,"rev_number":6,"userid":5227,"eprint_dir":"disk0/00/07/75/92","datestamp":"2017-05-19 15:03:30","lastmod":"2017-05-19 15:03:30","status_changed":"2017-05-19 15:03:30","type":"book_section","metadata_visibility":"show","creators":[{"given":"Maureen L.","family":"Coleman","id":"Coleman-M-L","orcid":""},{"given":"Dianne K.","family":"Newman","id":"Newman-D-K","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2015-10","date_type":"published","publication":"","volume":"","number":"","pagerange":"187-207","id_number":"CaltechAUTHORS:20170518-163637436","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170518-163637436","related_url":[{"url":"http://dx.doi.org/10.1201/b19121-10","type":"pub","description":"Chapter"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}