{"title":"Autotrophic and heterotrophic acquisition of carbon and nitrogen by a mixotrophic chrysophyte established through stable isotope analysis","uri":"","abstract":"Collectively, phagotrophic algae (mixotrophs) form a functional continuum of nutritional modes between autotrophy and heterotrophy, but the specific physiological benefits of mixotrophic nutrition differ among taxa. Ochromonas spp. are ubiquitous chrysophytes that exhibit high nutritional flexibility, although most species generally fall towards the heterotrophic end of the mixotrophy spectrum. We assessed the sources of carbon and nitrogen in Ochromonas sp. strain BG-1 growing mixotrophically via short-term stable isotope probing. An axenic culture was grown in the presence of either heat-killed bacteria enriched with ^(15)N and ^(13)C, or unlabeled heat-killed bacteria and labeled inorganic substrates (^(13)C-bicarbonate and ^(15)N-ammonium). The alga exhibited high growth rates (up to 2 divisions per day) only until heat-killed bacteria were depleted. NanoSIMS and bulk IRMS isotope analyses revealed that Ochromonas obtained 84–99% of its carbon and 88–95% of its nitrogen from consumed bacteria. The chrysophyte assimilated inorganic ^(13)C-carbon and ^(15)N-nitrogen when bacterial abundances were very low, but autotrophic (photosynthetic) activity was insufficient to support net population growth of the alga. Our use of nanoSIMS represents its first application towards the study of a mixotrophic alga, enabling a better understanding and quantitative assessment of carbon and nutrient acquisition by this species.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252528","docid":252528,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1260910","fileid":1260910,"datasetid":"document","objectid":252528,"filename":"ismej201768a.pdf","mime_type":"application/pdf","hash":"eeae77bb06106337b4f5e33e073b182f","hash_type":"MD5","filesize":2210487,"mtime":"2017-05-22 15:04:51","url":"http://authors.library.caltech.edu/77616/1/ismej201768a.pdf"}],"eprintid":77616,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by_nc_sa","main":"ismej201768a.pdf","content":"inpress"}],"note":"© 2017 The Authors. This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by-nc-sa/4.0/. \n\nReceived 21 October 2016; Revised 20 March 2017; Accepted 3 April 2017; Advance online publication 19 May 2017. \n\nThis collaborative research was supported by the Gordon and Betty Moore Foundation through Grant GBMF3299 to DAC and KBH at USC, and Grant (GBMF3780) to VJO at California Institute of Technology. \n\nThe authors declare no conflict of interest.","id":77616,"rev_number":12,"userid":18,"eprint_dir":"disk0/00/07/76/16","datestamp":"2017-05-22 15:58:28","lastmod":"2017-06-05 20:15:56","status_changed":"2017-06-05 20:15:56","type":"article","metadata_visibility":"show","creators":[{"given":"Ramon","family":"Terrado","id":"Terrado-R","orcid":""},{"given":"Alexis L.","family":"Pasulka","id":"Pasulka-A-L","orcid":""},{"given":"Alle A.-Y.","family":"Lie","id":"Lie-Alle-A-Y","orcid":""},{"given":"Victoria J.","family":"Orphan","id":"Orphan-V-J","orcid":"0000-0002-5374-6178"},{"given":"Karla B.","family":"Heidelberg","id":"Heidelberg-K-B","orcid":""},{"given":"David A.","family":"Caron","id":"Caron-D-A","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-19","date_type":"inpress","publication":"ISME Journal","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170522-080446020","refereed":true,"issn":"1751-7362","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170522-080446020","related_url":[{"url":"http://dx.doi.org/10.1038/ismej.2017.68","type":"doi","description":"Article"},{"url":"http://www.nature.com/ismej/journal/vaop/ncurrent/full/ismej201768a.html","type":"pub","description":"Article"}],"referencetext":["Andersen KH, Aksnes DL, Berge T, Fiksen Ø, Visser A. (2015). Modelling emergent trophic strategies in plankton. J Plankton Res 37: 862–868. | Article |\nAndersen RA. (2007). Molecular systematics of the Chrysophyceae and Synurophyceae. In: Brodie J, Lewis J (eds). Unravelling the Algae: the Past, Present, and Future Of Algal Systematics. CRC Press: Boca Rotan, FL, USA, pp 285–313..\nAndersson A, Falk S, Samuelsson G, Hagström Å. (1989). Nutritional characteristics of a mixotrophic nanoflagellate, Ochromonas sp. Microb Ecol 17: 117–128. | Article |\nAzam F, Malfatti F. (2007). Microbial structuring of marine ecosystems. Nat Rev Microbiol 5: 782–791. | Article | PubMed | ISI | CAS |\nBoraas ME, Seale DB, Holen D. (1992). Predatory behavior of Ochromonas analyzed with video microscopy. Arch Hydrobiol Beih 123: 459–468.\nBoxer SG, Kraft ML, Weber PK. (2009). Advances in imaging secondary ion mass spectrometry for biological samples. Ann Rev Biophys 38: 53–74. | Article |\nCaron DA, Goldman JC. (1990). Protozoan nutrient regeneration. In: Capriulo GM (ed). Ecology of Marine Protozoa. Oxford University Press: New York, NY, USA, pp 283–306..\nCaron DA, Porter KG, Sanders RW. (1990). Carbon, nitrogen and phosphorus budgets for the mixotrophic phytoflagellate Poterioochromonas malhamensis (Chrysophyseae) during bacterial ingestion. Limnol Oceanogr 35: 433–443. | Article | CAS |\nCaron DA, Sanders RW, Lim EL, Marrasé C, Amaral LA, Whitney S et al. (1993). Light-dependent phagotrophy in the freshwater mixotrophic chrysophyte Dinobryon cylindricum. Microb Ecol 25: 93–111. | Article | PubMed | ISI |\nCarpenter KJ, Weber PK, Davisson ML, Pett-Ridge J, Haverty MI, Keeling PJ. (2013). Correlated SEM, FIB-SEM, TEM, and NanoSIMS imaging of microbes from the hindgut of a lower termite: methods for in situ functional and ecological studies of uncultivable microbes. Microsc Microanal 19: 1490–1501. | Article | PubMed |\nChrzanowski TH, Foster BLL. (2014). Prey element stoichiometry controls ecological fitness of the flagellate Ochromonas danica. Aq Microb Ecol 71: 257–269. | Article |\ndel Campo J, Massana R. (2011). Emerging diversity within chrysophytes, choanoflagellates and bicosoecids based on molecular surveys. Protist 162: 435–448. | Article | PubMed |\nFinzi-Hart JA, Pett-Ridge J, Weber PK, Popa R, Fallon SJ, Gunderson T et al. (2009). Fixation and fate of C and N in the cyanobacterium Trichodesmium using nanometer-scale secondary ion mass spectrometry. Proc Natl Acad Sci USA 106: 6345–6350. | Article | PubMed |\nFlynn KJ, Mitra A. (2009). Building the 'perfect beast': modelling mixotrophic plankton. J Plankton Res 31: 965–992. | Article |\nFlynn KJ, Stoecker DK, Mitra A, Raven JA, Glibert PM, Hansen PJ et al. (2013). Misuse of the phytoplankton-zooplankton dichotomy: the need to assign organisms as mixotrophs within plankton functional types. J Plank Res 35: 3–11. | Article |\nFoster BLL, Chrzanowski TH. (2012). The mixotrophic protist Ochromonas danica is an indiscriminant predator whose fitness is influenced by prey type. Aq Microb Ecol 68: 1–11. | Article |\nGao D, Huang X, Tao Y. (2016). A critical review of NanoSIMS in analysis of microbial metabolic activities at single-cell level. Crit Rev Biotechnol 36: 884–890. | PubMed | CAS |\nHansen PJ, Skovgaard A, Glud RN, Stoecker DK. (2000). Physiology of the mixotrophic dinoflagellate Fragilidium subglobosum. II. Effects of time scale and prey concentration on photosynthetic performance. Mar Ecol Prog Ser 201: 137–146. | Article |\nHartmann M, Grob C, Tarran GA, Martin AP, Burkill PH, Scanlan DJ et al. (2012). Mixotrophic basis of Atlantic oligotrophic ecosystems. Proc Nat Acad Sci USA 109: 5756–5760. | Article | PubMed |\nJones RI. (1994). Mixotrophy in planktonic protists as a spectrum of nutritional strategies. Mar Microb Food Webs 8: 87–96.\nJones RI. (2000). Mixotrophy in planktonic protists: an overview. Freshwater Biol 45: 219–226. | Article |\nKimura B, Ishida Y. (1989). Phospholipid as a growth factor of Uroglena americana, a red tide chrysophyceae in Lake Biwa. Nippon Suisan Gakk 55: 799–804. | Article |\nKopf SH, McGlynn SE, Green-Saxena A, Guan Y, Newman DK, Orphan VJ. (2015). Heavy water and 15 N labelling with NanoSIMS analysis reveals growth rate- dependent metabolic heterogeneity in chemostats. Environ Microbiol 17: 2542–2556. | Article | PubMed | CAS |\nKopp C, Pernice M, Domart-Coulon I, Djediat C, Spangenberg JE, Alexander DTL et al. (2013). Highly dynamic cellular-level response of symbiotic coral to a sudden increase in environmental nitrogen. mBio 4: e00052–13. | PubMed | CAS |\nLie AAY, Liu Z, Terrado R, Tatters AO, Heidelberg KB, Caron DA. (2017). Effect of light and prey availability on gene expression of the mixotrophic chrysophyte, Ochromonas sp. BMC Genomics 18: 163. | Article | PubMed |\nLiu Z, Jones AC, Campbell V, Hambright KD, Heidelberg KB, Caron DA. (2015). Gene expression in the mixotrophic prymnesiophyte, Prymnesium parvum, responds to prey availability. Front Microbiol 6: 319. | PubMed |\nLiu Z, Campbell V, Heidelberg KB, Caron DA. (2016). Gene expression demonstrates different nutritional strategies among three mixotrophic protists. FEMS Microbiol Ecol 92: fiw106.\nMaberly SC, Ball LA, Raven JA, Sültemeyer D. (2009). Inorganic carbon acquisition by chrysophytes. J Phycol 45: 1052–1061. | Article | PubMed |\nMarley J, Lu M, Bracken C. (2001). A method for efficient isotopic labeling of recombinant proteins. J Biomol NMR 20: 71–75. | Article | PubMed | ISI | CAS |\nMitra A, Flynn KJ, Tillmann U, Raven JA, Caron D, Stoecker DK et al. (2016). Defining planktonic protist functional groups on mechanisms for energy and nutrient acquisition: incorporation of diverse mixotrophic strategies. Protist 167: 106–120. | Article | PubMed | CAS |\nMorono Y, Terada T, Nishizawa M, Ito M, Hillion F, Takahata N et al. (2011). Carbon and nitrogen assimilation in deep subseafloor microbial cells. Proc Natl Acad Sci USA 108: 18295–18300. | Article | PubMed |\nMusat N, Stryhanyuk H, Bombach P, Adrian L, Audinot J-N, Richnow HH. (2014). The effect of FISH and CARD-FISH on the isotopic composition of 13C- and 15 N- labeled Pseudomonas putidacells measured by nanoSIMS. Syst Appl Microbiol 37: 267–276. | Article | PubMed | ISI | CAS |\nOrphan VJ. (2009). Methods for unveiling cryptic microbial partnerships in nature. Curr Opin Microbiol 12: 231–237. | Article | PubMed | ISI | CAS |\nOrphan VJ, House CH. (2009). Geobiological investigations using secondary ion mass spectrometry: microanalysis of extant and paleo-microbial processes. Geobiology 7: 360–372. | Article | PubMed |\nPolerecky L, Adam B, Milucka J, Musat N, Vagner T, Kuypers MMM. (2012). Look@NanoSIMS - a tool for the analysis of nanoSIMS data in environmental microbiology. Environ Microbiol 14: 1009–1023. | Article | PubMed | ISI | CAS |\nPopa R, Weber PK, Pett-Ridge J, Finzi JA, Fallon SJ, Hutcheon ID et al. (2007). Carbon and nitrogen fixation and metabolite exchange in and between individual cells of Anabaena oscillarioides. ISME J 1: 354–360. | PubMed | ISI | CAS |\nPorter KG, Feig YS. (1980). The use of DAPI for identifying and counting aquatic microflora. Limnol Oceanogr 25: 943–948. | Article | ISI |\nPringsheim EG. (1952). On the nutrition of Ochromonas. Q J Microsc Sci 3: 71–96.\nRaven JA. (1997). Phagotrophy in phototrophs. Limnol Oceanogr 42: 198–205. | Article | ISI | CAS |\nRaven JA, Cockell CS, De La Rocha CL. (2008). The evolution of inorganic carbon concentrating mechanisms in photosynthesis. Phil Trans R Soc B 363: 2641–2650. | Article | PubMed | CAS |\nRothhaupt KO. (1996). Utilization of substitutable carbon and phosphorus sources by the mixotrophic chrysophyte Ochromonas sp. Ecology 77: 706–715. | Article | ISI |\nRottberger J, Gruber A, Boenigk J, Kroth PG. (2013). Influence of nutrients and light on autotrophic, mixotrophic and heterotrophic freshwater chrysophytes. Aquatic Microb Ecol 71: 179–191. | Article |\nSanders RW, Porter KG. (1988). Phagotrophic phytoflagellates. Adv Microb Ecol 10: 167–192.\nSanders RW, Caron DA, Davidson JM, Dennett MR, Moran DM. (2001). Nutrient acquisition and population growth of a mixotrophic alga in axenic and bacterized cultures. Microb Ecol 42: 513–523. | Article | PubMed | CAS |\nSanders RW. (2011). Alternative nutritional strategies in protists: symposium introduction and a review of freshwater protists that combine photosynthesis and heterotrophy. J Euk Microbiol 58: 181–184. | Article | PubMed |\nSarmento H. (2012). New paradigms in tropical limnology: the importance of the microbial food web. Hydrobiologia 686: 1–14. | Article |\nSheik AR, Brussaard CPD, Lavik G, Lam P, Musat N, Krupke A et al. (2014). Responses of the coastal bacterial community to viral infection of the algae Phaeocystis globosa. ISME J 8: 212–225. | Article | PubMed |\nShnaiderman C, Miyara I, Kobiler I, Sherman A, Prusk D. (2013). Differential activation of ammonium transporters during the accumulation of ammonia by Colletotrichum gloeosporioides and Its effect on appressoria formation and pathogenicity. Mol Plant Microbe Interact 26: 345–355. | Article | PubMed | CAS |\nSleigh MA. (1989) Protozoa and Other Protists. Cambridge University Press: Victoria, Australia.\nStoecker DK. (1998). Conceptual models of mixotrophy in planktonic protists and some ecological and evolutionary implications. Eur J Protistol 34: 281–290. | Article | ISI |\nTaylor GT. (1982). The role of pelagic heterotrophic protozoa in nutrient cycling: a review. Ann Inst Oceanogr 58(S): 227–241.\nTerrado R, Monier A, Edgar R, Lovejoy C. (2015). Diversity of nitrogen assimilation pathways among microbial photosynthetic eukaryotes. J Phycol 51: 490–506. | Article | PubMed |\nUnrein F, Gasol JM, Not F, Forn I, Massana R. (2014). Mixotrophic haptophytes are key bacterial grazers in oligotrophic coastal waters. ISME J 8: 164–176. | Article | PubMed | ISI |\nVåge S, Castellani M, Giske J, Thingstad TF. (2013). Successful strategies in size structured mixotrophic food webs. Aq Ecol 47: 329–347. | Article |\nWan M, Liu P, Xia J, Rosenberg J, Oyler G, Betenbaugh M et al. (2011). The effect of mixotrophy on microalgal growth, lipid content, and expression levels of three pathway genes in Chlorella sorokiniana. Appl Microbiol Biotechnol 91: 835–844. | Article | PubMed |\nWard BA, Follows MJ. (2016). Marine mixotrophy increases trophic transfer efficiency, mean organism size, and vertical carbon flux. Proc Natl Acad Sci USA 113: 2958–2963. | Article | PubMed | CAS |\nWelschmeyer NA. (1994). Fluorometric analysis of chlorophyll a in the presence of chlorophyll b and pheopigments. Limnol Oceanogr 39: 1985–1992. | Article | ISI | CAS |\nWilken S, Schuurmans JM, Matthijs HCP. (2014). Do mixotrophs grow as photoheterotrophs? Photophysiological acclimation of the chrysophyte Ochromonas danica after feeding. New Phytol 204: 882–889. | Article | PubMed |\nWorden AZ, Follows MJ, Giovannoni SJ, Wilken S, Zimmerman AE, Keeling PJ. (2015). Rethinking the marine carbon cycle: factoring in the multifarious lifestyles of microbes. Science 347: 1257594. \n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Gordon and Betty Moore Foundation","grant_number":"GBMF3299"},{"agency":"Gordon and Betty Moore Foundation","grant_number":"GBMF3780"}],"collection":"CaltechAUTHORS","reviewer":"Gail","local_group":null}