{"title":"FtsZ-ring Architecture and Its Control by MinCD","uri":"","abstract":"In bacteria and archaea, the most widespread cell division system is based on the tubulin homologue FtsZ protein, whose filaments form the cytokinetic Z-ring. FtsZ filaments are tethered to the membrane by anchors such as FtsA and SepF and are regulated by accessory proteins. One such set of proteins is responsible for Z-ring’s spatiotemporal regulation, essential for the production of two equal-sized daughter cells. Here, we describe how our still partial understanding of the FtsZ-based cell division process has been progressed by visualising near-atomic structures of Z-rings and complexes that control Z-ring positioning in cells, most notably the MinCDE and Noc systems that act by negatively regulating FtsZ filaments. We summarise available data and how they inform mechanistic models for the cell division process.","documents":null,"note":"© 2017 Springer International Publishing AG.","id":77619,"rev_number":10,"userid":18,"eprint_dir":"disk0/00/07/76/19","datestamp":"2017-05-22 16:01:21","lastmod":"2017-05-22 16:01:21","status_changed":"2017-05-22 16:01:21","type":"book_section","metadata_visibility":"show","creators":[{"given":"Piotr","family":"Szwedziak","id":"Szwedziak-P","orcid":""},{"given":"Debnath","family":"Ghosal","id":"Ghosal-D","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"FtsZ  – FtsA  – Bacterial cell division  – Z-ring structure  – MinCD copolymers  – Cytomotive filaments  – Cell constriction  – Liposome constriction  – Sliding filaments  – CryoET  – Tomography  – Collaborative filaments","date":"2017-05-13","date_type":"published","publication":"","volume":"","number":"84","pagerange":"213-244","id_number":"CaltechAUTHORS:20170522-084912189","refereed":true,"issn":"0306-0225","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170522-084912189","related_url":[{"url":"http://dx.doi.org/10.1007/978-3-319-53047-5_7","type":"doi","description":"Article"},{"url":"http://link.springer.com/chapter/10.1007%2F978-3-319-53047-5_7","type":"pub","description":"Article"}],"referencetext":["\nAdams DW, Errington J (2009) Bacterial cell division: assembly, maintenance and disassembly of the Z ring. Nat Rev Microbiol 7:642–653» PubMed» CrossRef\n\n\nAddinall SG, Bi E, Lutkenhaus J (1996) FtsZ ring formation in fts mutants. J Bacteriol 178:3877–3884» PubMed» PubMedCentral» CrossRef\n\n\nAdler HI et al (1967) Miniature Escherichia coli cells deficient in DNA. Proc Natl Acad Sci U S A 57:321–326» PubMed» PubMedCentral» CrossRef\n\n\nAlexeeva S et al (2010) Direct interactions of early and late assembling division proteins in Escherichia coli cells resolved by FRET. Mol Microbiol 77:384–398» PubMed» CrossRef\n\n\nBeall B, Lutkenhaus J (1992) Impaired cell division and sporulation of a Bacillus subtilis strain with the ftsA gene deleted. J Bacteriol 174:2398–2403» PubMed» PubMedCentral» CrossRef\n\n\nBegg K, Donachie WD (1998) Division planes alternate in spherical cells of Escherichia coli. J Bacteriol 180:2564–2567» PubMed» PubMedCentral\n\n\nBegg K et al (1998) Roles of FtsA and FtsZ in activation of division sites. J Bacteriol 180:881–884» PubMed» PubMedCentral\n\n\nBen-Yehuda S, Losick R (2002) Asymmetric cell division in B. subtilis involves a spiral-like intermediate of the cytokinetic protein FtsZ. Cell 109:257–266» PubMed» CrossRef\n\n\nBernhardt TG, de Boer PA (2005) SlmA, a nucleoid-associated, FtsZ binding protein required for blocking septal ring assembly over Chromosomes in E. coli. Mol Cell 18:555–564» PubMed» PubMedCentral» CrossRef\n\n\nBeuria TK et al (2009) Adenine nucleotide-dependent regulation of assembly of bacterial tubulin-like FtsZ by a hypermorph of bacterial actin-like FtsA. J Biol Chem 284:14079–14086» PubMed» PubMedCentral» CrossRef\n\n\nBi EF, Lutkenhaus J (1991) FtsZ ring structure associated with division in Escherichia coli. Nature 354:161–164» PubMed» CrossRef\n\n\nBork P, Sander C, Valencia A (1992) An ATPase domain common to prokaryotic cell cycle proteins, sugar kinases, actin, and hsp70 heat shock proteins. Proc Natl Acad Sci U S A 89:7290–7294» PubMed» PubMedCentral» CrossRef\n\n\nBramhill D, Thompson CM (1994) GTP-dependent polymerization of Escherichia coli FtsZ protein to form tubules. Proc Natl Acad Sci U S A 91:5813–5817» PubMed» PubMedCentral» CrossRef\n\n\nBusiek K, Margolin W (2014) A role for FtsA in SPOR-independent localization of the essential Escherichia coli cell division protein FtsN. Mol Microbiol 92:1212–1226» PubMed» PubMedCentral» CrossRef\n\n\nBusiek KK et al (2012) The early divisome protein FtsA interacts directly through its 1c subdomain with the cytoplasmic domain of the late divisome protein FtsN. J Bacteriol 194:1989–2000» PubMed» PubMedCentral» CrossRef\n\n\nBuss J et al (2013) In vivo organization of the FtsZ-ring by ZapA and ZapB revealed by quantitative super-resolution microscopy. Mol Microbiol 89:1099–1120» PubMed» PubMedCentral» CrossRef\n\n\nCabre EJ et al (2013) Bacterial division proteins FtsZ and ZipA induce vesicle shrinkage and cell membrane invagination. J Biol Chem 288:26625–26634» PubMed» PubMedCentral» CrossRef\n\n\nCordell SC, Anderson RE, Lowe J (2001) Crystal structure of the bacterial cell division inhibitor MinC. EMBO J 20:2454–2461» PubMed» PubMedCentral» CrossRef\n\n\nDai K, Lutkenhaus J (1992) The proper ratio of FtsZ to FtsA is required for cell division to occur in Escherichia coli. J Bacteriol 174:6145–6151» PubMed» PubMedCentral» CrossRef\n\n\nDajkovic A et al (2008) MinC spatially controls bacterial cytokinesis by antagonizing the scaffolding function of FtsZ. Curr Biol 18:235–244» PubMed» CrossRef\n\n\nDavis BK et al (2002) Molecular evolution before the origin of species. Prog Biophys Mol Biol 79:77–133» PubMed» CrossRef\n\n\nde Boer PA, Crossley RE, Rothfield L (1988) Isolation and properties of minB, a complex genetic locus involved in correct placement of the division site in Escherichia coli. J Bacteriol 170:2106–2112» PubMed» PubMedCentral» CrossRef\n\n\nde Boer PA, Crossley RE, Rothfield L (1989) A division inhibitor and a topological specificity factor coded for by the minicell locus determine proper placement of the division septum in E. coli. Cell 56:641–649» PubMed» CrossRef\n\n\nde Boer PA et al (1991) The MinD protein is a membrane ATPase required for the correct placement of the Escherichia coli division site. EMBO J 10:4371–4380» PubMed» PubMedCentral\n\n\nde Boer PA, Crossley R, Rothfield L (1992) The essential bacterial cell-division protein FtsZ is a GTPase. Nature 359:254–256» PubMed» CrossRef\n\n\nDewar SJ, Begg KJ, Donachie WD (1992) Inhibition of cell division initiation by an imbalance in the ratio of FtsA to FtsZ. J Bacteriol 174:6314–6316» PubMed» PubMedCentral» CrossRef\n\n\nDuman R et al (2013) Structural and genetic analyses reveal the protein SepF as a new membrane anchor for the Z ring. Proc Natl Acad Sci U S A 110:E4601–E4610» PubMed» PubMedCentral» CrossRef\n\n\nEbersbach G et al (2008) Novel coiled-coil cell division factor ZapB stimulates Z ring assembly and cell division. Mol Microbiol 68:720–735» PubMed» CrossRef\n\n\nErickson HP et al (1996) Bacterial cell division protein FtsZ assembles into protofilament sheets and minirings, structural homologs of tubulin polymers. Proc Natl Acad Sci U S A 93:519–523» PubMed» PubMedCentral» CrossRef\n\n\nErickson HP, Anderson DE, Osawa M (2010) FtsZ in bacterial cytokinesis: cytoskeleton and force generator all in one. Microbiol Mol Biol Rev 74:504–528» PubMed» PubMedCentral» CrossRef\n\n\nEspéli O et al (2012) A MatP-divisome interaction coordinates chromosome segregation with cell division in : chromosome-divisome interplay. EMBO J 31:3198–3211» PubMed» PubMedCentral» CrossRef\n\n\nFaguy DM, Doolittle WF (1998) Cytoskeletal proteins: the evolution of cell division. Curr Biol 8:R338–R341» PubMed» CrossRef\n\n\nFaruqi AR, Henderson R, McMullan G (2015) Progress and Development of Direct Detectors for Electron Cryomicroscopy. Adv Ima Ele Physics 190:103–141» CrossRef\n\n\nFeucht A et al (2001) Cytological and biochemical characterization of the FtsA cell division protein of Bacillus subtilis. Mol Microbiol 40:115–125» PubMed» CrossRef\n\n\nFleurie A et al (2014) MapZ marks the division sites and positions FtsZ rings in Streptococcus pneumoniae. Nature 516:259–262» PubMed» PubMedCentral» CrossRef\n\n\nFu G et al (2010) In vivo structure of the E. coli FtsZ-ring revealed by photoactivated localization microscopy (PALM). PLoS One 5:e12682» PubMed» CrossRef\n\n\nGeissler B, Elraheb D, Margolin W (2003) A gain-of-function mutation in ftsA bypasses the requirement for the essential cell division gene zipA in Escherichia coli. Proc Natl Acad Sci U S A 100:4197–4202» PubMed» PubMedCentral» CrossRef\n\n\nGhasriani H et al (2010) Appropriation of the MinD protein-interaction motif by the dimeric interface of the bacterial cell division regulator MinE. Proc Natl Acad Sci U S A 107:18416–18421» PubMed» PubMedCentral» CrossRef\n\n\nGhosal D, Löwe J (2015) Collaborative protein filaments. EMBO J 34:2312–2320» PubMed» PubMedCentral» CrossRef\n\n\nGhosal D et al (2014) MinCD cell division proteins form alternating copolymeric cytomotive filaments. Nat Commun 5:5341» PubMed» PubMedCentral» CrossRef\n\n\nGierer A, Meinhardt H (1972) A theory of biological pattern formation. Kybernetik 12:30–39» PubMed» CrossRef\n\n\nGoehring NW, Beckwith J (2005) Diverse paths to midcell: assembly of the bacterial cell division machinery. Curr Biol 15:R514–R526» PubMed» CrossRef\n\n\nGuizetti J et al (2011) Cortical constriction during abscission involves helices of ESCRT-III-dependent filaments. Science 331:1616–1620» PubMed» CrossRef\n\n\nHale CA, de Boer PA (1999) Recruitment of ZipA to the septal ring of Escherichia coli is dependent on FtsZ and independent of FtsA. J Bacteriol 181:167–176» PubMed» PubMedCentral\n\n\nHale CA et al (2011) Identification of Escherichia coli ZapC (YcbW) as a component of the division apparatus that binds and bundles FtsZ polymers. J Bacteriol 193:1393–1404» PubMed» PubMedCentral» CrossRef\n\n\nHaney SA et al (2001) Genetic analysis of the Escherichia coli FtsZ.ZipA interaction in the yeast two-hybrid system. Characterization of FtsZ residues essential for the interactions with ZipA and with FtsA. J Biol Chem 276:11980–11987» PubMed» CrossRef\n\n\nHarry EJ, Monahan L, Thompson L (2006) Bacterial cell division: the mechanism and its precison. Int Rev Cytol 253:27–94» PubMed» CrossRef\n\n\nHirota V, Ryter A, Jacob F (1968) Thermosensitive mutants of E. coli affected in the process of DNA synthesis and cellular division. Cold Spring Harb Symp Quant Biol 33:677–693» PubMed» CrossRef\n\n\nHolden SJ et al (2014) High throughput 3D super-resolution microscopy reveals Caulobacter crescentus in vivo Z-ring organization. Proc Natl Acad Sci U S A 111(12):4566–4571» PubMed» PubMedCentral» CrossRef\n\n\nHolečková N et al (2015) LocZ is a new cell division protein involved in proper septum placement in Streptococcus pneumoniae. MBio 6:e01700–e01714\n\n\nHorger I et al (2008) FtsZ bacterial cytoskeletal polymers on curved surfaces: the importance of lateral interactions. Biophys J 94:L81–L83» PubMed» PubMedCentral» CrossRef\n\n\nHu Z, Lutkenhaus J (1999) Topological regulation of cell division in Escherichia coli involves rapid pole to pole oscillation of the division inhibitor MinC under the control of MinD and MinE. Mol Microbiol 34:82–90» PubMed» CrossRef\n\n\nHu Z, Lutkenhaus J (2000) Analysis of MinC reveals two independent domains involved in interaction with MinD and FtsZ. J Bacteriol 182:3965–3971» PubMed» PubMedCentral» CrossRef\n\n\nHu Z, Saez C, Lutkenhaus J (2003) Recruitment of MinC, an inhibitor of Z-ring formation, to the membrane in Escherichia coli: role of MinD and MinE. J Bacteriol 185:196–203» PubMed» PubMedCentral» CrossRef\n\n\nHuecas S et al (2008) Energetics and geometry of FtsZ polymers: nucleated self-assembly of single protofilaments. Biophys J 94:1796–1806» PubMed» PubMedCentral» CrossRef\n\n\nIvanov V, Mizuuchi K (2010) Multiple modes of interconverting dynamic pattern formation by bacterial cell division proteins. Proc Natl Acad Sci U S A 107:8071–8078» PubMed» PubMedCentral» CrossRef\n\n\nJennings PC et al (2010) Super-resolution imaging of the bacterial cytokinetic protein FtsZ. Micron 42:336–341» PubMed» CrossRef\n\n\nJensen SO, Thompson LS, Harry EJ (2005) Cell division in Bacillus subtilis: FtsZ and FtsA association is Z-ring independent, and FtsA is required for efficient midcell Z-Ring assembly. J Bacteriol 187:6536–6544» PubMed» PubMedCentral» CrossRef\n\n\nJimenez M et al (2011) Reconstitution and organization of Escherichia coli proto-ring elements (FtsZ and FtsA) inside giant unilamellar vesicles obtained from bacterial inner membranes. J Biol Chem 286:11236–11241» PubMed» PubMedCentral» CrossRef\n\n\nKang GB et al (2010) Crystal structure of Helicobacter pylori MinE, a cell division topological specificity factor. Mol Microbiol 76:1222–1231» PubMed» PubMedCentral» CrossRef\n\n\nKarimova G, Dautin N, Ladant D (2005) Interaction network among Escherichia coli membrane proteins involved in cell division as revealed by bacterial two-hybrid analysis. J Bacteriol 187:2233–2243» PubMed» PubMedCentral» CrossRef\n\n\nKatzmann DJ, Babst M, Emr SD (2001) Ubiquitin-dependent sorting into the multivesicular body pathway requires the function of a conserved endosomal protein sorting complex, ESCRT-I. Cell 106:145–155» PubMed» CrossRef\n\n\nKiekebusch D et al (2012) Localized dimerization and nucleoid binding drive gradient formation by the bacterial cell division inhibitor MipZ. Mol Cell 46:245–259» PubMed» PubMedCentral» CrossRef\n\n\nKoonin EV (1993) A superfamily of ATPases with diverse functions containing either classical or deviant ATP-binding motif. J Mol Biol 229:1165–1174» PubMed» CrossRef\n\n\nKruse K, Howard M, Margolin W (2007) An experimentalist’s guide to computational modelling of the Min system. Mol Microbiol 63:1279–1284» PubMed» PubMedCentral» CrossRef\n\n\nLan G et al (2009) Condensation of FtsZ filaments can drive bacterial cell division. Proc Natl Acad Sci U S A 106:121–126» PubMed» CrossRef\n\n\nLara B et al (2005) Cell division in cocci: localization and properties of the Streptococcus pneumoniae FtsA protein. Mol Microbiol 55:699–711» PubMed» CrossRef\n\n\nLeger MM et al (2015) An ancestral bacterial division system is widespread in eukaryotic mitochondria. Proc Natl Acad Sci U S A 112:10239–10246» PubMed» PubMedCentral» CrossRef\n\n\nLevin PA, Losick R (1996) Transcription factor Spo0A switches the localization of the cell division protein FtsZ from a medial to a bipolar pattern in Bacillus subtilis. Genes Dev 10:478–488» PubMed» CrossRef\n\n\nLi Z et al (2007) The structure of FtsZ filaments in vivo suggests a force-generating role in cell division. EMBO J 26:4694–4708» PubMed» PubMedCentral» CrossRef\n\n\nLindas AC et al (2008) A unique cell division machinery in the Archaea. Proc Natl Acad Sci U S A 105:18942–18946» PubMed» PubMedCentral» CrossRef\n\n\nLoose M, Schwille P (2009) Biomimetic membrane systems to study cellular organization. J Struct Biol 168. doi:» 10.​1016/​j.​jsb.​2009.​03.​016 \n\n\nLoose M, Mitchison TJ (2014) The bacterial cell division proteins FtsA and FtsZ self-organize into dynamic cytoskeletal patterns. Nat Cell Biol 16:38–46» PubMed» CrossRef\n\n\nLoose M et al (2008) Spatial regulators for bacterial cell division self-organize into surface waves in vitro. Science 320:789–792» PubMed» CrossRef\n\n\nLoose M et al (2011) Min protein patterns emerge from rapid rebinding and membrane interaction of MinE. Nat Struct Mol Biol 18:577–583» PubMed» CrossRef\n\n\nLöwe J, Amos LA (1998) Crystal structure of the bacterial cell-division protein FtsZ. Nature 391:203–206» PubMed» CrossRef\n\n\nLöwe J, Amos LA (2000) Helical tubes of FtsZ from Methanococcus jannaschii. Biol Chem 381:993–999» PubMed» CrossRef\n\n\nLu C, Reedy M, Erickson HP (2000) Straight and curved conformations of FtsZ are regulated by GTP hydrolysis. J Bacteriol 182:164–170» PubMed» PubMedCentral» CrossRef\n\n\nLutkenhaus J (2007) Assembly dynamics of the bacterial MinCDE system and spatial regulation of the Z ring. Annu Rev Biochem 76:539–562» PubMed» CrossRef\n\n\nLutkenhaus J (2012) The ParA/MinD family puts things in their place. Trends Microbiol 20:411–418» PubMed» PubMedCentral» CrossRef\n\n\nMa X, Margolin W (1999) Genetic and functional analyses of the conserved C-terminal core domain of Escherichia coli FtsZ. J Bacteriol 181:7531–7544» PubMed» PubMedCentral\n\n\nMa X, Ehrhardt DW, Margolin W (1996) Colocalization of cell division proteins FtsZ and FtsA to cytoskeletal structures in living Escherichia coli cells by using green fluorescent protein. Proc Natl Acad Sci U S A 93:12998–13003» PubMed» PubMedCentral» CrossRef\n\n\nMa X et al (1997) Interactions between heterologous FtsA and FtsZ proteins at the FtsZ ring. J Bacteriol 179:6788–6797» PubMed» PubMedCentral» CrossRef\n\n\nMargolin W (2005) FtsZ and the division of prokaryotic cells and organelles. Nat Rev Mol Cell Biol 6:862–871» PubMed» PubMedCentral» CrossRef\n\n\nMargolin W (2012) The price of tags in protein localization studies. J Bacteriol 194:6369–6371» PubMed» PubMedCentral» CrossRef\n\n\nMarston AL et al (1998) Polar localization of the MinD protein of Bacillus subtilis and its role in selection of the mid-cell division site. Genes Dev 12:3419–3430» PubMed» PubMedCentral» CrossRef\n\n\nMartos A et al (2012) Towards a bottom-up reconstitution of bacterial cell division. Trends Cell Biol 22:634–643» PubMed» CrossRef\n\n\nMercier R, Kawai Y, Errington J (2013) Excess membrane synthesis drives a primitive mode of cell proliferation. Cell 152:997–1007» PubMed» CrossRef\n\n\nMichie KA, Löwe J (2006) Dynamic filaments of the bacterial cytoskeleton. Annu Rev Biochem 75:467–492» PubMed» CrossRef\n\n\nMilam SL, Osawa M, Erickson HP (2012) Negative-stain electron microscopy of inside-out FtsZ rings reconstituted on artificial membrane tubules show ribbons of protofilaments. Biophys J 103:59–68» PubMed» PubMedCentral» CrossRef\n\n\nMingorance J et al (2005) Visualization of single Escherichia coli FtsZ filament dynamics with atomic force microscopy. J Biol Chem 280:20909–20914» PubMed» CrossRef\n\n\nMonahan LG, Harry EJ (2013) Identifying how bacterial cells find their middle: a new perspective. Mol Microbiol 87:231–234» PubMed» CrossRef\n\n\nMosyak L et al (2000) The bacterial cell-division protein ZipA and its interaction with an FtsZ fragment revealed by X-ray crystallography. EMBO J 19:3179–3191» PubMed» PubMedCentral» CrossRef\n\n\nMukherjee A, Lutkenhaus J (1994) Guanine nucleotide-dependent assembly of FtsZ into filaments. J Bacteriol 176:2754–2758» PubMed» PubMedCentral» CrossRef\n\n\nMukherjee A, Saez C, Lutkenhaus J (2001) Assembly of an FtsZ mutant deficient in GTPase activity has implications for FtsZ assembly and the role of the Z ring in cell division. J Bacteriol 183:7190–7197» PubMed» PubMedCentral» CrossRef\n\n\nOliva MA, Cordell SC, Löwe J (2004) Structural insights into FtsZ protofilament formation. Nat Struct Mol Biol 11:1243–1250» PubMed» CrossRef\n\n\nOsawa M, Erickson HP (2011) Inside-out Z rings–constriction with and without GTP hydrolysis. Mol Microbiol 81:571–579» PubMed» PubMedCentral» CrossRef\n\n\nOsawa M, Erickson HP (2013) Liposome division by a simple bacterial division machinery. Proc Natl Acad Sci U S A 110:11000–11004» PubMed» PubMedCentral» CrossRef\n\n\nOsawa M, Anderson DE, Erickson HP (2008) Reconstitution of contractile FtsZ rings in liposomes. Science 320:792–794» PubMed» PubMedCentral» CrossRef\n\n\nOsawa M, Anderson DE, Erickson HP (2009) Curved FtsZ protofilaments generate bending forces on liposome membranes. EMBO J 28:3476–3484» PubMed» PubMedCentral» CrossRef\n\n\nPalmer CM, Löwe J (2013) A cylindrical specimen holder for electron cryo-tomography. Ultramicroscopy 137:20–29» PubMed» CrossRef\n\n\nPark KT et al (2011) The Min oscillator uses MinD-dependent conformational changes in MinE to spatially regulate cytokinesis. Cell 146:396–407» PubMed» PubMedCentral» CrossRef\n\n\nPark KT, Du S, Lutkenhaus J (2015) MinC/MinD copolymers are not required for Min function. Mol Microbiol 98(5):895–909» PubMed» PubMedCentral» CrossRef\n\n\nPichoff S, Lutkenhaus J (2005) Tethering the Z ring to the membrane through a conserved membrane targeting sequence in FtsA. Mol Microbiol 55:1722–1734» PubMed» CrossRef\n\n\nPichoff S, Lutkenhaus J (2007) Identification of a region of FtsA required for interaction with FtsZ. Mol Microbiol 64:1129–1138» PubMed» CrossRef\n\n\nPopp D et al (2009) FtsZ condensates: an in vitro electron microscopy study. Biopolymers 91:340–350» PubMed» PubMedCentral» CrossRef\n\n\nRamirez-Arcos S et al (2001) Expression of Neisseria gonorrhoeae cell division genes ftsZ, ftsE and minD is influenced by environmental conditions. Res Microbiol 152:781–791» PubMed» CrossRef\n\n\nRamos D et al (2006) Conformation of the cell division regulator MinE: evidence for interactions between the topological specificity and anti-MinCD domains. Biochemistry 45:4593–4601» PubMed» CrossRef\n\n\nRaskin DM, de Boer PA (1999) MinDE-dependent pole-to-pole oscillation of division inhibitor MinC in Escherichia coli. J Bacteriol 181:6419–6424» PubMed» PubMedCentral\n\n\nReeve JN et al (1973) Minicells of Bacillus subtilis. J Bacteriol 114:860–873» PubMed» PubMedCentral\n\n\nRivas G, Vogel SK, Schwille P (2014) Reconstitution of cytoskeletal protein assemblies for large-scale membrane transformation. Curr Opin Chem Biol 22. doi:» 10.​1016/​j.​cbpa.​2014.​07.​018. Epub 2014 Aug 12\n\n\nRothfield L, Taghbalout A, Shih YL (2005) Spatial control of bacterial division-site placement. Nat Rev Microbiol 3:959–968» PubMed» CrossRef\n\n\nRowlett VW, Margolin W (2014) 3D-SIM super-resolution of FtsZ and its membrane tethers in Escherichia coli cells. Biophys J 107:L17–L20» PubMed» PubMedCentral» CrossRef\n\n\nSamson RY et al (2008) A Role for the ESCRT System in Cell Division in Archaea. Science 322:1710–1713» PubMed» PubMedCentral» CrossRef\n\n\nShen B, Lutkenhaus J (2009) The conserved C-terminal tail of FtsZ is required for the septal localization and division inhibitory activity of MinC(C)/MinD. Mol Microbiol 72:410–424» PubMed» PubMedCentral» CrossRef\n\n\nShiomi D, Margolin W (2008) Compensation for the loss of the conserved membrane targeting sequence of FtsA provides new insights into its function. Mol Microbiol 67:558–569» PubMed» PubMedCentral» CrossRef\n\n\nSingh JK et al (2007) A membrane protein, EzrA, regulates assembly dynamics of FtsZ by interacting with the C-terminal tail of FtsZ. Biochemistry 46:11013–11022» PubMed» CrossRef\n\n\nSmall E et al (2007) FtsZ polymer-bundling by the Escherichia coli ZapA orthologue, YgfE, involves a conformational change in bound GTP. J Mol Biol 369:210–221» PubMed» CrossRef\n\n\nStrauss MP et al (2012) 3D-SIM super resolution microscopy reveals a bead-like arrangement for FtsZ and the division machinery: implications for triggering cytokinesis. PLoS Biol 10:e1001389» PubMed» PubMedCentral» CrossRef\n\n\nStricker J et al (2002) Rapid assembly dynamics of the Escherichia coli FtsZ-ring demonstrated by fluorescence recovery after photobleaching. Proc Natl Acad Sci U S A 99:3171–3175» PubMed» PubMedCentral» CrossRef\n\n\nSun Q, Margolin W (1998) FtsZ dynamics during the division cycle of live Escherichia coli cells. J Bacteriol 180:2050–2056» PubMed» PubMedCentral\n\n\nSwulius MT, Jensen GJ (2012) The helical MreB cytoskeleton in Escherichia coli MC1000/pLE7 is an artifact of the N-Terminal yellow fluorescent protein tag. J Bacteriol 194:6382–6386» PubMed» PubMedCentral» CrossRef\n\n\nSzeto TH et al (2003) The MinD membrane targeting sequence is a transplantable lipid-binding helix. J Biol Chem 278:40050–40056» PubMed» CrossRef\n\n\nSzwedziak P et al (2012) FtsA forms actin-like protofilaments. EMBO J 31:2249–2260» PubMed» PubMedCentral» CrossRef\n\n\nSzwedziak P et al (2014) Architecture of the ring formed by the tubulin homologue FtsZ in bacterial cell division. eLife 3. doi:» 10.​7554/​eLife.​04601 \n\n\nThanbichler M, Shapiro L (2006) MipZ, a spatial regulator coordinating chromosome segregation with cell division in Caulobacter. Cell 126:147–162» PubMed» CrossRef\n\n\nTreuner-Lange A et al (2013) PomZ, a ParA-like protein, regulates Z-ring formation and cell division in Myxococcus xanthus. Mol Microbiol 87:235–253» PubMed» CrossRef\n\n\nTuring AM (1952) The chemical basis of morphogenesis. Philos Trans R Soc Lond Ser B Biol Sci 237:37–72» CrossRef\n\n\nvan den Ent F, Löwe J (2000) Crystal structure of the cell division protein FtsA from Thermotoga maritima. EMBO J 19:5300–5307» PubMed» PubMedCentral» CrossRef\n\n\nVeiga H, Jorge AM, Pinho MG (2011) Absence of nucleoid occlusion effector Noc impairs formation of orthogonal FtsZ rings during Staphylococcus aureus cell division. Mol Microbiol 80:1366–1380» PubMed» CrossRef\n\n\nVicente M, Rico AI (2006) The order of the ring: assembly of Escherichia coli cell division components. Mol Microbiol 61:5–8» PubMed» CrossRef\n\n\nWang X et al (1997) Analysis of the interaction of FtsZ with itself, GTP, and FtsA. J Bacteriol 179:5551–5559» PubMed» PubMedCentral» CrossRef\n\n\nWard JEJ, Lutkenhaus J (1985) Overproduction of FtsZ induces minicell formation in E. coli. Cell 42:941–949» PubMed» CrossRef\n\n\nWillemse J et al (2011) Positive control of cell division: FtsZ is recruited by SsgB during sporulation of Streptomyces. Genes Dev 25:89–99» PubMed» PubMedCentral» CrossRef\n\n\nWoldringh C et al (1991) Toporegulation of bacterial division according to the nucleoid occlusion model. Res Microbiol 142:309–320» PubMed» CrossRef\n\n\nWu LJ et al (2009) Noc protein binds to specific DNA sequences to coordinate cell division with chromosome segregation. EMBO J 28:1940–1952» PubMed» PubMedCentral» CrossRef\n\n\nWu W et al (2011) Determination of the structure of the MinD-ATP complex reveals the orientation of MinD on the membrane and the relative location of the binding sites. Mol Microbiol 79:1515–1528» PubMed» PubMedCentral» CrossRef\n\n\nWu LJ, Errington J (2012) Nucleoid occlusion and bacterial cell division. Nat Rev Mircobiol, 10:8–12\n\n\nYim L et al (2000) Role of the carboxy terminus of Escherichia coli FtsA in self-interaction and cell division. J Bacteriol 182:6366–6373» \n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}