{"title":"The Structure, Function and Roles of the Archaeal ESCRT Apparatus","uri":"","abstract":"Although morphologically resembling bacteria, archaea constitute a distinct domain of life with a closer affiliation to eukaryotes than to bacteria. This similarity is seen in the machineries for a number of essential cellular processes, including DNA replication and gene transcription. Perhaps surprisingly, given their prokaryotic morphology, some archaea also possess a core cell division apparatus that is related to that involved in the final stages of membrane abscission in vertebrate cells, the ESCRT machinery.","documents":null,"note":"© 2017 Springer International Publishing AG.","id":77618,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/76/18","datestamp":"2017-05-22 15:55:56","lastmod":"2017-05-22 15:55:56","status_changed":"2017-05-22 15:55:56","type":"book_section","metadata_visibility":"show","creators":[{"given":"Rachel Y.","family":"Samson","id":"Samson-R-Y","orcid":""},{"given":"Megan J.","family":"Dobro","id":"Dobro-M-J","orcid":""},{"given":"Grant J.","family":"Jensen","id":"Jensen-G-J","orcid":"0000-0003-1556-4864"},{"given":"Stephen D.","family":"Bell","id":"Bell-S-D","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"ESCRT-III  – Vps4  – cdvA  – cdvB  – Cytokinetic ring  – Archaeal cell constriction  – Sulfolobus acidocaldarius   – AAA+ protein  – MIT domain  – Electron cryotomography  – Cryo-ET  – STIV","date":"2017-05-13","date_type":"published","publication":"","volume":"","number":"84","pagerange":"357-377","id_number":"CaltechAUTHORS:20170522-084200520","refereed":true,"issn":"0306-0225","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170522-084200520","related_url":[{"url":"http://dx.doi.org/10.1007/978-3-319-53047-5_12","type":"doi","description":"Article"},{"url":"http://link.springer.com/chapter/10.1007%2F978-3-319-53047-5_12","type":"pub","description":"Article"},{"url":"https://www.edge-cdn.net/video_1169522?playerskin=37016","type":"other","description":"ESCRT Chapter Supplementary Video"}],"referencetext":["\nAgromayor M, Martin-Serrano J (2013) Knowing when to but and run: mechanisms that control cytokinetic abscission. Trends Cell Biol 23:433–441» CrossRef» PubMed\n\n\nAnantharaman V, Aravind L (2002) The PRC-barrel: a widespread, conserved domain shared by photosynthetic reaction center subunits and proteins of RNA metabolism. Genome Biol 3, RESEARCH0061\n\n\nBajorek M, Schubert HL, Mccullough J, Langelier C, Eckert DM, Stubblefield WM, Uter NT, Myszka DG, Hill CP, Sundquist WI (2009) Structural basis for ESCRT-III protein autoinhibition. Nat Struct Mol Biol 16:754–762» CrossRef» PubMed» PubMedCentral\n\n\nBang C, Schmitz RA (2015) Archaea associated with human surfaces: not to be underestimated. FEMS Microbiol Rev 39:631–648» CrossRef» PubMed\n\n\nBaumann P, Jackson SP (1996) An archaebacterial homologue of the essential eubacterial cell division protein FtsZ. Proc Natl Acad Sci U S A 93:6726–6730» CrossRef» PubMed» PubMedCentral\n\n\nBernander R (1998) Archaea and the cell cycle. Mol Microbiol 29:955–961» CrossRef» PubMed\n\n\nBize A, Karlsson EA, Ekefjard K, Quax TE, Pina M, Prevost MC, Forterre P, Tenaillon O, Bernander R, Prangishvili D (2009) A unique virus release mechanism in the Archaea. Proc Natl Acad Sci U S A 106:11306–11311» CrossRef» PubMed» PubMedCentral\n\n\nBoura E, Rozycki B, Chung HS, Herrick DZ, Canagarajah B, Cafiso DS, Eaton WA, Hummer G, Hurley JH (2012) Solution structure of the ESCRT-I and -II supercomplex: implications for membrane budding and scission. Structure 20:874–886» CrossRef» PubMed» PubMedCentral\n\n\nBreuert S, Allers T, Spohn G, Soppa J (2006) Regulated polyploidy in halophilic archaea. PLoS One:1\n\n\nBrumfield SK, Ortmann AC, Ruigrok V, Suci P, Douglas T, Young MJ (2009) Particle assembly and ultrastructural features associated with replication of the lytic archaeal virus sulfolobus turreted icosahedral virus. J Virol 83:5964–5970» CrossRef» PubMed» PubMedCentral\n\n\nCarlton JG, Martin-Serrano J (2007) Parallels between cytokinesis and retroviral budding: A role for the ESCRT machinery. Science 316:1908–1912» CrossRef» PubMed\n\n\nChen L, Brugger K, Skovgaard M, Redder P, She Q, Torarinsson E, Greve B, Awayez M, Zibat A, Klenk HP, Garrett RA (2005) The genome of Sulfolobus acidocaldarius, a model organism of the Crenarchaeota. J Bacteriol 187:4992–4999» CrossRef» PubMed» PubMedCentral\n\n\nDaum B, Quax TEF, Sachse M, Mills DJ, Reimann J, Yildiz O, Hader S, Saveanu C, Forterre P, Albers SV, kuhlbrandt W, Prangishvili D (2014) Self-assembly of the general membrane-remodeling protein PVAP into sevenfold virus-associated pyramids. Proc Natl Acad Sci U S A 111:3829–3834» CrossRef» PubMed» PubMedCentral\n\n\nDobro MJ, Samson RY, Yu Z, Mccullough J, Ding HJ, Chong PL, Bell SD, Jensen GJ (2013) Electron cryotomography of ESCRT assemblies and dividing Sulfolobus cells suggests that spiraling filaments are involved in membrane scission. Mol Biol Cell 24:2319–2327» CrossRef» PubMed» PubMedCentral\n\n\nDominguez-Escobar J, Chastanet A, Crevenna AH, Fromion V, Wedlich-Soldner R, Carballido-Lopez R (2011) Processive movement of MreB-associated cell wall biosynthetic complexes in bacteria. Science 333:225–228» CrossRef» PubMed\n\n\nEffantin G, Dordor A, Sandrin V, Martinelli N, Sundquist WI, Schoehn G, Weissenhorn W (2013) ESCRT-III CHMP2A and CHMP3 form variable helical polymers in vitro and act synergistically during HIV-1 budding. Cell Microbiol 15:213–226» CrossRef» PubMed\n\n\nElia N, Sougrat R, Spurlin TA, Hurley JH, Lippincott-Schwartz J (2011) Dynamics of endosomal sorting complex required for transport (ESCRT) machinery during cytokinesis and its role in abscission. Proc Natl Acad Sci U S A 108:4846–4851» CrossRef» PubMed» PubMedCentral\n\n\nEllen AF, Albers SV, Huibers W, Pitcher A, Hobel CFV, Schwarz H, Folea M, Schouten S, Boekema EJ, Poolman B, Driessen AJM (2009) Proteomic analysis of secreted membrane vesicles of archaeal Sulfolobus species reveals the presence of endosome sorting complex components. Extremophiles 13:67–79» CrossRef» PubMed\n\n\nErrington J (2015) Bacterial morphogenesis and the enigmatic MreB helix. Nat Rev Microbiol 13:241–248» CrossRef» PubMed\n\n\nErzberger JP, Berger JM (2006) Evolutionary relationships and structural mechanisms of AAA plus proteins. Annu Rev Biophys Biomol Struct 35:93–114» CrossRef» PubMed\n\n\nEttema TJ, Lindas AC, Bernander R (2011) An actin-based cytoskeleton in archaea. Mol Microbiol 80:1052–1061» CrossRef» PubMed\n\n\nFaguy DM, Doolittle WF (1999) Lessons from the Aeropyrum pernix genome. Curr Biol 9:R883–R886» CrossRef» PubMed\n\n\nFitz-Gibbon ST, Ladner H, Kim UJ, Stetter KO, Simon MI, Miller JH (2002) Genome sequence of the hyperthermophilic crenarchaeon Pyrobaculum aerophilum. Proc Natl Acad Sci U S A 99:984–989» CrossRef» PubMed» PubMedCentral\n\n\nFrols S, Gordon PM, Panlilio MA, Duggin IG, Bell SD, Sensen CW, Schleper C (2007) Response of the hyperthermophilic archaeon Sulfolobus solfataricus to UV damage. J Bacteriol 189:8708–8718» CrossRef» PubMed» PubMedCentral\n\n\nFu CY, Wang K, Gan L, Lanman J, Khayat R, Young MJ, Jensen GJ, Doerschuk PC, Johnson JE (2010) In vivo assembly of an archaeal virus studied with whole-cell electron cryotomography. Structure 18:1579–1586» CrossRef» PubMed» PubMedCentral\n\n\nGarner EC, Bernard R, Wang W, Zhuang X, Rudner DZ, Mitchison T (2011) Coupled, circumferential motions of the cell wall synthesis machinery and MreB filaments in B. subtilis. Science 333:222–225» CrossRef» PubMed» PubMedCentral\n\n\nGotz D, Paytubi S, Munro S, Lundgren M, Bernander R, White MF (2007) Responses of hyperthermophilic crenarchaea to UV irradiation. Genome Biol 8:R220» CrossRef» PubMed» PubMedCentral\n\n\nGuy L, Ettema TJ (2011) The archaeal ‘TACK’ superphylum and the origin of eukaryotes. Trends Microbiol 19:580–587» CrossRef» PubMed\n\n\nHenne WM, Stenmark H, Emr SD (2013) Molecular mechanisms of the membrane sculpting ESCRT pathway. Cold Spring Harb Perspect Biol 5\n\n\nHurley JH (2015) ESCRTs are everywhere. EMBO J 34:2398–2407» CrossRef» PubMed» PubMedCentral\n\n\nJones LJ, Carballido-Lopez R, Errington J (2001) Control of cell shape in bacteria: helical, actin-like filaments in Bacillus subtilis. Cell 104:913–922» CrossRef» PubMed\n\n\nKawarabayasi Y, Hino Y, Horikawa H, Yamazaki S, Haikawa Y, Jin-No K, Takahashi M, Sekine M, Baba S, Ankai A, Kosugi H, Hosoyama A, Fukui S, Nagai Y, Nishijima K, Nakazawa H, Takamiya M, Masuda S, Funahashi T, Tanaka T, Kudoh Y, Yamazaki J, Kushida N, Oguchi A, Kikuchi H et al (1999) Complete genome sequence of an aerobic hyper-thermophilic crenarchaeon, Aeropyrum pernix K1. DNA Res 6(83–101):145–152» CrossRef\n\n\nKawarabayasi Y, Hino Y, Horikawa H, Jin-No K, Takahashi M, Sekine M, Baba S, Ankai A, Kosugi H, Hosoyama A, Fukui S, Nagai Y, Nishijima K, Otsuka R, Nakazawa H, Takamiya M, Kato Y, Yoshizawa T, Tanaka T, Kudoh Y, Yamazaki J, Kushida N, Oguchi A, Aoki K, Masuda S, Yanagii M, Nishimura M, Yamagishi A, Oshima T, Kikuchi H (2001) Complete genome sequence of an aerobic thermoacidophilic crenarchaeon, Sulfolobus tokodaii strain7. DNA Res 8:123–140» CrossRef» PubMed\n\n\nKieffer C, Skalicky JJ, Morita E, De Domenico I, Ward DM, Kaplan J, Sundquist WI (2008) Two distinct modes of ESCRT-III recognition are required for VPS4 functions in lysosomal protein targeting and HIV-1 budding. Dev Cell 15:62–73» CrossRef» PubMed» PubMedCentral\n\n\nLata S, Schoehn G, Jain A, Pires R, Piehler J, Gottlinger HG, Weissenhorn W (2008) Helical structures of ESCRT-III are disassembled by VPS4. Science 321:1354–1357» CrossRef» PubMed» PubMedCentral\n\n\nLindas AC, Karlsson EA, Lindgren MT, Ettema TJG, Bernander R (2008) A unique cell division machinery in the Archaea. Proc Natl Acad Sci U S A 105:18942–18946» CrossRef» PubMed» PubMedCentral\n\n\nLowe J, Amos LA (1998) Crystal structure of the bacterial cell-division protein FtsZ. Nature 391:203–206» CrossRef» PubMed\n\n\nLundgren M, Malandrin L, Eriksson S, Huber H, Bernander R (2008) Cell cycle characteristics of Crenarchaeota: Unity among diversity. J Bacteriol 190:5362–5367» CrossRef» PubMed» PubMedCentral\n\n\nMaaty WS, Wiedenheft B, Tarlykov P, Schaff N, heinemann J, Robison-Cox J, Valenzuela J, Dougherty A, Blum P, Lawrence CM, Douglas T, Young MJ, Bothner B (2009) Something old, something new, something borrowed; how the thermoacidophilic archaeon Sulfolobus solfataricus responds to oxidative stress. PLoS One 4:e6964» CrossRef» PubMed» PubMedCentral\n\n\nMakarova KS, Yutin N, Bell SD, Koonin EV (2010) Evolution of diverse cell division and vesicle formation systems in Archaea. Nat Rev Microbiol 8:731–741» CrossRef» PubMed» PubMedCentral\n\n\nMargolin W, Wang R, Kumar M (1996) Isolation of an ftsZ homolog from the archaebacterium Halobacterium salinarium: implications for the evolution of FtsZ and tubulin. J Bacteriol 178:1320–1327» CrossRef» PubMed» PubMedCentral\n\n\nMccullough J, Colf LA, Sundquist WI (2013) Membrane fission reactions of the mammalian ESCRT pathway. Annu Rev Biochem 82:663–692» CrossRef» PubMed» PubMedCentral\n\n\nMonroe N, Han H, Gonciarz MD, Eckert DM, Karren MA, Whitby FG, Sundquist WI, Hill CP (2014) The oligomeric state of the active Vps4 AAA ATPase. J Mol Biol 426:510–525» CrossRef» PubMed\n\n\nMorita E, Sandrin V, Chung HY, Morham SG, Gygi SP, Rodesch CK, Sundquist WI (2007) Human ESCRT and ALIX proteins interact with proteins of the midbody and function in cytokinesis. EMBO J 26:4215–4227» CrossRef» PubMed» PubMedCentral\n\n\nMuziol T, Pineda-Molina E, Ravelli RB, Zamborlini A, Usami Y, Gottlinger H, Weissenhorn W (2006) Structural basis for budding by the ESCRT-III factor CHMP3. Dev Cell 10:821–830» CrossRef» PubMed\n\n\nObita T, Saksena S, Ghazi-Tabatabai S, Gill DJ, Perisic O, Emr SD, Williams RL (2007) Structural basis for selective recognition of ESCRT-III by the AAA ATPase Vps4. Nature 449:735–U11» CrossRef» PubMed\n\n\nOkutan E, Deng L, Mirlashari S, Uldahl K, Halim M, Liu C, Garrett RA, She QX, Peng X (2013) Novel insights into gene regulation of the rudivirus SIRV2 infecting Sulfolobus cells. RNA Biol 10:875–885» CrossRef» PubMed» PubMedCentral\n\n\nOrtmann AC, Brumfield SK, Walther J, Mcinnerney K, Brouns SJJ, Van De Werken HJG, Bothner B, Douglas T, Van De Oost J, Young MJ (2008) Transcriptome analysis of infection of the Archaeon Sulfolobus solfataricus with Sulfolobus turreted icosahedral virus. J Virol 82:4874–4883» CrossRef» PubMed» PubMedCentral\n\n\nPrangishvili D (2013) The wonderful world of archaeal viruses. Annu Rev Microbiol 67:565–585» CrossRef» PubMed\n\n\nPrangishvili D, Holz I, Stieger E, Nickell S, Kristjansson JK, Zillig W (2000) Sulfolobicins, specific proteinaceous toxins produced by strains of the extremely thermophilic archaeal genus Sulfolobus. J Bacteriol 182:2985–2988» CrossRef» PubMed» PubMedCentral\n\n\nPreston CM, Wu KY, Molinski TF, Delong EF (1996) A psychrophilic crenarchaeon inhabits a marine sponge: Cenarchaeum symbiosum gen. nov., sp. nov. Proc Natl Acad Sci U S A 93:6241–6246» CrossRef» PubMed» PubMedCentral\n\n\nRivera MC, Lake JA (2004) The ring of life provides evidence for a genome fusion origin of eukaryotes. Nature 431:152–155» CrossRef» PubMed\n\n\nRobinson NP, Blood KA, Mccallum SA, Edwards PAW, Bell SD (2007) Sister chromatid junctions in the hyperthermophilic archaeon Sulfolobus solfataricus. EMBO J 26:816–824» CrossRef» PubMed» PubMedCentral\n\n\nSaksena S, Wahlman J, Teis D, Johnson AE, Emr SD (2009) Functional reconstitution of ESCRT-III assembly and disassembly. Cell 136:97–109» CrossRef» PubMed» PubMedCentral\n\n\nSamson RY, Bell SD (2011) Cell cycles and cell division in the archaea. Curr Opin Microbiol 14:350–356» CrossRef» PubMed\n\n\nSamson RY, Bell SD (2014) Archaeal chromosome biology. J Mol Microbiol Biotechnol 24:420–427» CrossRef» PubMed\n\n\nSamson RY, Obita T, Freund SM, Williams RL, Bell SD (2008) A Role for the ESCRT System in Cell Division in Archaea. Science 322:1710–1713» CrossRef» PubMed» PubMedCentral\n\n\nSamson RY, Obita T, Hodgson B, Shaw MK, Chong PL, Williams RL, Bell SD (2011) Molecular and structural basis of ESCRT-III recruitment to membranes during archaeal cell division. Mol Cell 41:186–196» CrossRef» PubMed» PubMedCentral\n\n\nSamson RY, Abeyrathne PD, Bell SD (2016) Mechanism of archaeal MCM helicase recruitment to DNA replication origins. Mol Cell 61:287–296» CrossRef» PubMed\n\n\nSchink B (1997) Energetics of syntrophic cooperation in methanogenic degradation. Microbiol Mol Biol Rev 61:262–280» PubMed» PubMedCentral\n\n\nScott A, Chung HY, Gonciarz-Swiatek M, Hill GC, Whitby FG, Gaspar J, Holton JM, Viswanathan R, Ghaffarian S, Hill CP, Sundquist WI (2005) Structural and mechanistic studies of VPS4 proteins. EMBO J 24:3658–3669» CrossRef» PubMed» PubMedCentral\n\n\nShe Q, Singh RK, Confalonieri F, Zivanovic Y, Allard G, Awayez MJ, Chan-Weiher CCY, Clausen IG, Curtis BA, De Moors A, Erauso G, Fletcher C, Gordon PMK, Heikamp-De Jong I, Jeffries AC, Kozera CJ, Medina N, Peng X, Thi-Ngoc HP, Redder P, Schenk ME, Theriault C, Tolstrup N, Charlebois RL, Doolittle WF, Duguet M, Gaasterland T, Garrett RA, Ragan MA, Sensen CW, Van Der Oost J (2001) The complete genome of the crenarchaeon Sulfolobus solfataricus P2. Proc Natl Acad Sci U S A 98:7835–7840» CrossRef» PubMed» PubMedCentral\n\n\nSnyder JC, Samson RY, Brumfield SK, Bell SD, Young MJ (2013) Functional interplay between a virus and the ESCRT machinery in archaea. Proc Natl Acad Sci U S A 110:10783–10787» CrossRef» PubMed» PubMedCentral\n\n\nSoler N, Marguet E, Verbavatz JM, Forterre P (2008) Virus-like vesicles and extracellular DNA produced by hyperthermophilic archaea of the order Thermococcales. Res Microbiol 159:390–399» CrossRef» PubMed\n\n\nSolomons J, Sabin C, Poudevigne E, Usami Y, Hulsik DL, Macheboeuf P, Hartlieb B, Gottlinger H, Weissenhorn W (2011) Structural basis for ESCRT-III CHMP3 recruitment of AMSH. Structure 19:1149–1159» CrossRef» PubMed» PubMedCentral\n\n\nSpang A, Saw JH, Jorgensen SL, Zaremba-Niedzwiedzka K, Martijn J, Lind AE, Van Eijk R, Schleper C, Guy L, Ettema TJG (2015) Complex archaea that bridge the gap between prokaryotes and eukaryotes. Nature 521:173–179» CrossRef» PubMed» PubMedCentral\n\n\nStahl DA, De La Torre JR (2012) Physiology and diversity of ammonia-oxidizing archaea. Annu Rev Microbiol 66:83–101» CrossRef» PubMed\n\n\nStuchell-Brereton MD, Skalicky JJ, Kieffer C, Karren MA, Ghaffarian S, Sundquist WI (2007) ESCRT-III recognition by VPS4 ATPases. Nature 449:740–744» CrossRef» PubMed\n\n\nSwulius MT, Jensen GJ (2012) The helical MreB cytoskeleton in Escherichia coli MC1000/pLE7 is an artifact of the N-Terminal yellow fluorescent protein tag. J Bacteriol 194:6382–6386» CrossRef» PubMed» PubMedCentral\n\n\nVotteler J, Sundquist WI (2013) Virus budding and the ESCRT pathway. Cell Host Microbe 14:232–241» CrossRef» PubMed\n\n\nWang X, Lutkenhaus J (1996) FtsZ ring: the eubacterial division apparatus conserved in archaebacteria. Mol Microbiol 21:313–319» CrossRef» PubMed\n\n\nWiedemann C, Szambowska A, Hafner S, Ohlenschlager O, Guhrs KH, Gorlach M (2015) Structure and regulatory role of the C-terminal winged helix domain of the archaeal minichromosome maintenance complex. Nucleic Acids Res 43:2958–2967» CrossRef» PubMed» PubMedCentral\n\n\nWilliams TA, Foster PG, Cox CJ, Embley TM (2013) An archaeal origin of eukaryotes supports only two primary domains of life. Nature 504:231–236» CrossRef» PubMed\n\n\nWoese CR, Fox GE (1977) Phylogenetic structure of the prokaryotic domain: the primary kingdoms. Proc Natl Acad Sci U S A 74:5088–5090» CrossRef» PubMed» PubMedCentral\n\n\nWollert T, Hurley JH (2010) Molecular mechanism of multivesicular body biogenesis by ESCRT complexes. Nature 464:864–U73» CrossRef» PubMed» PubMedCentral\n\n\nWurtzel O, Sapra R, Chen F, Zhu YW, Simmons BA, Sorek R (2010) A single-base resolution map of an archaeal transcriptome. Genome Res 20:133–141» CrossRef» PubMed» PubMedCentral\n\n\nYang N, Driessen AJ (2014) Deletion of cdvB paralogous genes of Sulfolobus acidocaldarius impairs cell division. Extremophiles 18:331–339» CrossRef» PubMed\n\n\nYang D, Rismanchi N, Renvoise B, Lippincott-Schwartz J, Blackstone C, Hurley JH (2008) Structural basis for midbody targeting of spastin by the ESCRT-III protein CHMP1B. Nat Struct Mol Biol 15:1278–1286» CrossRef» PubMed» PubMedCentral\n\n\nYang Z, Vild C, Ju J, Zhang X, Liu J, Shen J, Zhao B, Lan W, Gong F, Liu M, Cao C, Xu Z (2012) Structural basis of molecular recognition between ESCRT-III-like protein Vps60 and AAA-ATPase regulator Vta1 in the multivesicular body pathway. J Biol Chem 287:43899–43908» CrossRef» PubMed» PubMedCentral\n\n\nYang B, Stjepanovic G, Shen Q, Martin A, Hurley JH (2015) Vps4 disassembles an ESCRT-III filament by global unfolding and processive translocation. Nat Struct Mol Biol 22:492–498» CrossRef» PubMed» PubMedCentral\n\n\nYutin N, Wolf MY, Wolf YI, Koonin EV (2009) The origins of phagocytosis and eukaryogenesis. Biol Direct 4:9» CrossRef» PubMed» PubMedCentral\n\n\nZerulla K, Soppa J (2014) Polyploidy in haloarchaea: advantages for growth and survival. Front Microbiol 5:274» \n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}