{"title":"An XMM-Newton and NuSTAR Study of IGR J18214-1318: A Non-pulsating High-mass X-Ray Binary with a Neutron Star","uri":"","abstract":"IGR J18214-1318, a Galactic source discovered by the International Gamma-Ray Astrophysics Laboratory, is a high-mass X-ray binary (HMXB) with a supergiant O-type stellar donor. We report on the XMM-Newton and NuSTAR observations that were undertaken to determine the nature of the compact object in this system. This source exhibits high levels of aperiodic variability, but no periodic pulsations are detected with a 90% confidence upper limit of 2% fractional rms between 0.00003–88 Hz, a frequency range that includes the typical pulse periods of neutron stars (NSs) in HMXBs (0.1–10^3 s). Although the lack of pulsations prevents us from definitively identifying the compact object in IGR J18214-1318, the presence of an exponential cutoff with e-folding energy ≾30 keV in its 0.3–79 keV spectrum strongly suggests that the compact object is an NS. The X-ray spectrum also shows a Fe Kα emission line and a soft excess, which can be accounted for by either a partial-covering absorber with N_H ≈ 10^(23) cm^(−2), which could be due to the inhomogeneous supergiant wind, or a blackbody component with kT = 1.74_(-0.05)^(+0.04) keV and R_(BB) ≈ 0.3 km, which may originate from NS hot spots. Although neither explanation for the soft excess can be excluded, the former is more consistent with the properties observed in other supergiant HMXBs. We compare IGR J18214-1318 to other HMXBs that lack pulsations or have long pulsation periods beyond the range covered by our observations.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252537","docid":252537,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1260997","fileid":1260997,"datasetid":"document","objectid":252537,"filename":"Fornasini_2017_ApJ_841_35.pdf","mime_type":"application/pdf","hash":"d44d1089e12513b6967840358f1162db","hash_type":"MD5","filesize":1555407,"mtime":"2017-05-22 16:10:17","url":"http://authors.library.caltech.edu/77622/1/Fornasini_2017_ApJ_841_35.pdf"}],"eprintid":77622,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Fornasini_2017_ApJ_841_35.pdf","content":"published"}],"note":"© 2017 American Astronomical Society. \n\nReceived 2016 August 23. Accepted 2017 April 25. Published 2017 May 22. \n\nWe thank the anonymous referee for suggestions that improved the clarity and thoroughness of this paper. This work made use of data from the NuSTAR mission, a project led by the California Institute of Technology, managed by the Jet Propulsion Laboratory, and funded by the National Aeronautics and Space Administration. We thank the NuSTAR Operations, Software and Calibration teams for support with the execution and analysis of these observations. This research has made use of the NuSTAR Data Analysis Software (NuSTARDAS) jointly developed by the ASI Science Data Center (ASDC, Italy) and the California Institute of Technology (USA). In addition, F.M.F. acknowledges support from the National Science Foundation Graduate Research Fellowship. F.M.F. and J.A.T. acknowledge partial support from NASA under XMM Guest Observer grant NNX15AG31G. R.K. acknowledges support from the Russian Science Foundation (grant 14-12-01315). L.N. wishes to acknowledge financial support by ASI/INAF grant I/037/12/0.","id":77622,"rev_number":8,"userid":772,"eprint_dir":"disk0/00/07/76/22","datestamp":"2017-05-22 16:45:35","lastmod":"2017-05-22 16:45:35","status_changed":"2017-05-22 16:45:35","type":"article","metadata_visibility":"show","creators":[{"given":"Francesca M.","family":"Fornasini","id":"Fornasini-F-M","orcid":""},{"given":"John A.","family":"Tomsick","id":"Tomsick-J-A","orcid":""},{"given":"Matteo","family":"Bachetti","id":"Bachetti-M","orcid":"0000-0002-4576-9337"},{"given":"Roman A.","family":"Krivonos","id":"Krivonos-R-A","orcid":"0000-0003-2737-5673"},{"given":"Felix","family":"Fürst","id":"Fürst-F","orcid":""},{"given":"Lorenzo","family":"Natalucci","id":"Natalucci-L","orcid":""},{"given":"Katja","family":"Pottschmidt","id":"Pottschmidt-K","orcid":""},{"given":"Jörn","family":"Wilms","id":"Wilms-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"stars: black holes; stars: individual (IGR J18214-1318) ; stars: neutron; X-rays: binaries","date":"2017-05-20","date_type":"published","publication":"Astrophysical Journal","volume":"841","number":"1","pagerange":"Art. No. 35","id_number":"CaltechAUTHORS:20170522-091006693","refereed":true,"issn":"1538-4357","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170522-091006693","related_url":[{"url":"https://doi.org/10.3847/1538-4357/aa6ff4","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-4357/aa6ff4","type":"pub","description":"Article"}],"referencetext":["Ankay A., Kaper L., de Bruijne J. H. J. et al 2001 A\u0026A 370 170\nCrossrefADS \nBachetti M., Harrison F. A., Cook R. et al 2015 ApJ 800 109\nIOPscienceADS \nBarragán L., Wilms J., Pottschmidt K. et al 2009 A\u0026A 508 1275\nCrossrefADS \nBartlett E. S., Coe M. J. and Ho W. C. G. 2013 MNRAS 436 2054\nCrossrefADS \nBecker P. A. and Wolff M. T. 2007 ApJ 654 435\nIOPscienceADS \nBelczynski K. and Ziolkowski J. 2009 ApJ 707 870\nIOPscienceADS \nBellm E. C., Fürst F., Pottschmidt K. et al 2014 ApJ 792 108\nIOPscienceADS \nBelloni T. and Hasinger G. 1990 A\u0026A 230 103\nADS \nBhalerao V., Romano P., Tomsick J. et al 2015 MNRAS 447 2274\nCrossrefADS \nBird A. J., Barlow E. J., Bassani L. et al 2006 ApJ 636 765\nIOPscienceADS \nBird A. J., Bazzano A., Malizia A. et al 2016 ApJS 223 15\nIOPscienceADS \nBlay P., Ribó M., Negueruela I. et al 2005 A\u0026A 438 963\nCrossrefADS \nBodaghee A., Tomsick J. A., Fornasini F. M. et al 2016 ApJ 823 146\nIOPscienceADS \nBodaghee A., Tomsick J. A., Rodriguez J. et al 2010 ApJ 719 451\nIOPscienceADS \nBonning E. W. and Falanga M. 2005 A\u0026A 436 L31\nCrossrefADS \nBoroson B., Vrtilek S. D., Kallman T. and Corcoran M. 2003 ApJ 592 516\nIOPscienceADS \nBozzo E., Falanga M. and Stella L. 2008 ApJ 683 1031\nIOPscienceADS \nBozzo E., Pavan L., Ferrigno C. et al 2012 A\u0026A 544 A118\nCrossrefADS \nBronfman L., Alvarez H., Cohen R. S. and Thaddeus P. 1989 ApJS 71 481\nCrossrefADS \nButler S. C., Tomsick J. A., Chaty S. et al 2009 ApJ 698 502\nIOPscienceADS \nCaballero I., Kretschmar P., Santangelo A. et al 2007 A\u0026A 465 L21\nCrossrefADS \nCaballero I. and Wilms J. 2012 MmSAI 83 230\nADS \nCasares J., Negueruela I., Ribó M. et al 2014 Natur 505 378\nCrossrefADS \nChaty S. 2013 AdSpR 52 2132\nCrossrefADS \nChaty S., Rahoui F., Foellmi C. et al 2008 A\u0026A 484 783\nCrossrefADS \nClark J. S., Goodwin S. P., Crowther P. A. et al 2002 A\u0026A 392 909\nCrossrefADS \nCoburn W., Heindl W. A., Rothschild R. E. et al 2002 ApJ 580 394\nIOPscienceADS \nCorbet R., Barbier L., Barthelmy S. et al 2006 ATel 797\nADS \nCorbet R. H. D. 1986 MNRAS 220 1047\nCrossrefADS \nCorbet R. H. D., Finley J. P. and Peele A. G. 1999 ApJ 511 876\nIOPscienceADS \nCorbet R. H. D. and Krimm H. A. 2013 ApJ 778 45\nIOPscienceADS \nDi Salvo T., Done C., Życki P. T., Burderi L. and Robba N. R. 2001 ApJ 547 1024\nIOPscienceADS \nDoroshenko V., Suchy S., Santangelo A. et al 2010 A\u0026A 515 L1\nCrossrefADS \nDray L. M. 2006 MNRAS 370 2079\nCrossrefADS \nEnoto T., Sasano M., Yamada S. et al 2014 ApJ 786 127\nIOPscienceADS \nFarinelli R., Ferrigno C., Bozzo E. and Becker P. A. 2016 A\u0026A 591 A29\nCrossrefADS \nFarrell S. A., Sood R. K., O’Neill P. M. and Dieters S. 2008 MNRAS 389 608\nCrossrefADS \nFilliatre P. and Chaty S. 2004 ApJ 616 469\nIOPscienceADS \nFragos T., Lehmer B., Tremmel M. et al 2013 ApJ 764 41\nIOPscienceADS \nFürst F., Pottschmidt K., Wilms J. et al 2014 ApJ 780 133\nIOPscienceADS \nGottwald M., White N. E. and Stella L. 1986 MNRAS 222 21P\nCrossrefADS \nGrebenev S. A. and Sunyaev R. A. 2007 AstL 33 149\nCrossrefADS \nGrove J. E., Johnson W. N., Kroeger R. A. et al 1998 ApJ 500 899\nIOPscienceADS \nGrudzinska M., Belczynski K., Casares J. et al 2015 MNRAS 452 2773\nCrossrefADS \nHannikainen D. C., Rawlings M. G., Muhli P. et al 2007 MNRAS 380 665\nCrossrefADS \nHarrison F. A., Craig W. W., Christensen F. E. et al 2013 ApJ 770 103\nIOPscienceADS \nHeap S. R. and Corcoran M. F. 1992 ApJ 387 340\nCrossrefADS \nHickox R. C., Narayan R. and Kallman T. R. 2004 ApJ 614 881\nIOPscienceADS \nHoshino M. and Takeshima T. 1993 ApJL 411 L79\nCrossrefADS \nIbarra A., Matt G., Guainazzi M. et al 2007 A\u0026A 465 501\nCrossrefADS \nIkhsanov N. R. and Beskrovnaya N. G. 2010 Ap 53 237\nCrossrefADS \nKalberla P. M. W., Burton W. B., Hartmann D. et al 2005 A\u0026A 440 775\nCrossrefADS \nKouveliotou C., Patel S., Tennant A. et al 2003 IAUC 8109 2\nADS \nKrivonos R., Tsygankov S., Lutovinov A. et al 2012 A\u0026A 545 A27\nCrossrefADS \nLa Palombara N. and Mereghetti S. 2006 A\u0026A 455 283\nCrossrefADS \nLa Palombara N. and Mereghetti S. 2007 A\u0026A 474 137\nCrossrefADS \nLa Palombara N., Sidoli L., Esposito P., Tiengo A. and Mereghetti S. 2009 A\u0026A 505 947\nCrossrefADS \nLattimer J. M. 2012 ARNPS 62 485\nCrossrefADS \nLeahy D. A., Darbro W., Elsner R. F. et al 1983 ApJ 266 160\nCrossrefADS \nLi X.-D. and van den Heuvel E. P. J. 1999 ApJL 513 L45\nIOPscienceADS \nLinden T., Kalogera V., Sepinsky J. F. et al 2010 ApJ 725 1984\nIOPscienceADS \nLü G.-L., Zhu C.-H., Postnov K. A. et al 2012 MNRAS 424 2265\nCrossrefADS \nMadsen K. K., Harrison F. A., Markwardt C. B. et al 2015 ApJS 220 8\nIOPscienceADS \nMakishima K., Takahashi H., Yamada S. et al 2008 PASJ 60 585\nCrossrefADS \nMarcu D. M., Fürst F., Pottschmidt K. et al 2011 ApJL 742 L11\nIOPscienceADS \nMasetti N., Parisi P., Palazzi E. et al 2010 A\u0026A 519 A96\nCrossrefADS \nMcClintock J. E. and Remillard R. A. 2006 Black Hole Binaries ed W. H. G. Lewin and M. van der Klis (Cambridge: Cambridge Univ. Press) 157\nADS \nMori K., Gotthelf E. V., Dufour F. et al 2014 ApJ 793 88\nIOPscienceADS \nMukherjee U. and Paul B. 2005 A\u0026A 431 667\nCrossrefADS \nMuno M. P. 2007 AIP Conf. Ser. 924, The Multicolored Landscape of Compact Objects and Their Explosive Origins ed T. di Salvo et al (Melville, NY: AIP) 166\nADS \nNegueruela I., Smith D. M., Reig P., Chaty S. and Torrejón J. M. 2006 ESA Special Publication, Vol. 604, The X-ray Universe 2005 ed A. Wilson (Noordwijk: ESA) 165\nADS \nNegueruela I., Torrejón J. M., Reig P., Ribó M. and Smith D. M. 2008 AIP Conf. Ser. 1010, A Population Explosion: The Nature \u0026 Evolution of X-ray Binaries in Diverse Environments ed R. M. Bandyopadhyay et al (Melville, NY: AIP) 252\nADS \nNespoli E., Fabregat J. and Mennickent R. E. 2008 A\u0026A 486 911\nCrossrefADS \nOlausen S. A. and Kaspi V. M. 2014 ApJS 212 6\nIOPscienceADS \nOzel F. and Freire P. 2016 ARA\u0026A 54 401\nCrossrefADS \nPatel S. K., Kouveliotou C., Tennant A. et al 2004 ApJL 602 L45\nIOPscienceADS \nPatel S. K., Zurita J., Del Santo M. et al 2007 ApJ 657 994\nIOPscienceADS \nPopov S. B. and Prokhorov M. E. 2006 MNRAS 367 732\nCrossrefADS \nPostnov K. A. and Yungelson L. R. 2014 LRR 17 arXiv:1403.4754\nPreprint \nPottschmidt K., Kreykenbohm I., Wilms J. et al 2005 ApJL 634 L97\nIOPscienceADS \nPrat L., Rodriguez J., Hannikainen D. C. and Shaw S. E. 2008 MNRAS 389 301\nCrossrefADS \nReig P., Chakrabarty D., Coe M. J. et al 1996 A\u0026A 311 879\nADS \nReig P., Torrejón J. M. and Blay P. 2012 MNRAS 425 595\nCrossrefADS \nReig P., Torrejón J. M., Negueruela I. et al 2009 A\u0026A 494 1073\nCrossrefADS \nRevnivtsev M., Churazov E., Postnov K. and Tsygankov S. 2009 A\u0026A 507 1211\nCrossrefADS \nReynolds A. P., Owens A., Kaper L., Parmar A. N. and Segreto A. 1999 A\u0026A 349 873\nADS \nRibó M., Negueruela I., Blay P., Torrejón J. M. and Reig P. 2006 A\u0026A 449 687\nCrossrefADS \nRodriguez J., Tomsick J. A. and Chaty S. 2009 A\u0026A 494 417\nCrossrefADS \nRomano P., Krimm H. A., Palmer D. M. et al 2014 A\u0026A 562 A2\nCrossrefADS \nSeifina E., Titarchuk L. and Shaposhnikov N. 2016 ApJ 821 23\nIOPscienceADS \nSguera V., Bazzano A., Bird A. J. et al 2006 ApJ 646 452\nIOPscienceADS \nShakura N., Postnov K., Sidoli L. and Paizis A. 2014 MNRAS 442 2325\nCrossrefADS \nShakura N. I. and Sunyaev R. A. 1976 MNRAS 175 613\nCrossrefADS \nSkinner G. K., Bedford D. K., Elsner R. F. et al 1982 Natur 297 568\nCrossrefADS \nSmith N. 2014 ARA\u0026A 52 487\nCrossrefADS \nStrüder L., Briel U., Dennerl K. et al 2001 A\u0026A 365 L18\nCrossrefADS \nSzostek A. and Zdziarski A. A. 2008 MNRAS 386 593\nCrossrefADS \nTendulkar S. P., Fürst F., Pottschmidt K. et al 2014 ApJ 795 154\nIOPscienceADS \nTomsick J. A., Chaty S., Rodriguez J. et al 2009 ApJ 694 344\nIOPscienceADS \nTomsick J. A., Chaty S., Rodriguez J., Walter R. and Kaaret P. 2008 ApJ 685 1143\nIOPscienceADS \nTorrejón J. M., Kreykenbohm I., Orr A., Titarchuk L. and Negueruela I. 2004 A\u0026A 423 301\nCrossrefADS \nTorrejón J. M., Schulz N. S., Nowak M. A. and Kallman T. R. 2010 ApJ 715 947\nIOPscienceADS \nTsygankov S. S., Krivonos R. A. and Lutovinov A. A. 2012 MNRAS 421 2407\nCrossrefADS \nTurner M. J. L., Abbey A., Arnaud M. et al 2001 A\u0026A 365 L27\nCrossrefADS \nvan der Klis M. 1989 Timing Neutron Stars ed H. Ögelman and E. P. J. van den Heuvel (New York: Kluwer Academic/Plenum Publishers) 27\nCrossrefADS \nvan der Meer A., Kaper L., di Salvo T. et al 2005 A\u0026A 432 999\nCrossrefADS \nVaughan S. 2010 MNRAS 402 307\nCrossrefADS \nVerner D. A., Ferland G. J., Korista K. T. and Yakovlev D. G. 1996 ApJ 465 487\nCrossrefADS \nWalter R., Lutovinov A. A., Bozzo E. and Tsygankov S. S. 2015 A\u0026ARv 23 2\nCrossrefADS \nWalter R., Rodriguez J., Foschini L. et al 2003 A\u0026A 411 L427\nCrossrefADS \nWalter R., Zurita Heras J., Bassani L. et al 2006 A\u0026A 453 133\nCrossrefADS \nWang W. 2013 MNRAS 432 954\nCrossrefADS \nWhittle P. 1953 ArM 2 423\nCrossrefADS \nWhittle P. 1957 J. R. Stat. Soc. B 19 38\n \nWilms J., Allen A. and McCray R. 2000 ApJ 542 914\nIOPscienceADS \nYamamoto T., Mihara T., Sugizaki M. et al 2014 PASJ 66 59\nCrossrefADS \nZdziarski A. A. 2000 IAU Symp. 195, Highly Energetic Physical Processes and Mechanisms for Emission from Astrophysical Plasmas ed P. C. H. Martens, S. Tsuruta and M. A. Weber (San Francisco, CA: ASP) 153"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Francesca M. Fornasini et al 2017 ApJ 841 35","other_numbering_system":null,"funders":[{"agency":"NASA/JPL/Caltech","grant_number":""},{"agency":"NSF Graduate Research Fellowship","grant_number":""},{"agency":"NASA","grant_number":"NNX15AG31G"},{"agency":"Russian Science Foundation","grant_number":"14-12-01315"},{"agency":"Agenzia Spaziale Italiana (ASI)","grant_number":"I/037/12/0-011/13"},{"agency":"Istituto Nazionale di Astrofisica (INAF)","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["NuSTAR"]}