{"title":"The Detection of an Extremely Bright Fast Radio Burst in a Phased Array Feed Survey","uri":"","abstract":"We report the detection of an ultra-bright fast radio burst (FRB) from a modest, 3.4-day pilot survey with the Australian Square Kilometre Array Pathfinder. The survey was conducted in a wide-field fly's-eye configuration using the phased-array-feed technology deployed on the array to instantaneously observe an effective area of 160 deg^2, and achieve an exposure totaling 13200 deg^2 hr. We constrain the position of FRB 170107 to a region 8^'x 8^' in size (90% containment) and its fluence to be 58 ± 6 Jy ms. The spectrum of the burst shows a sharp cutoff above 1400 MHz, which could be due to either scintillation or an intrinsic feature of the burst. This confirms the existence of an ultra-bright (\u003e 20 Jy ms) population of FRBs.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252538","docid":252538,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261014","fileid":1261014,"datasetid":"document","objectid":252538,"filename":"Bannister_2017_ApJL_841_L12.pdf","mime_type":"application/pdf","hash":"4d00ff6340f2472c3e4f48b9d8090bf6","hash_type":"MD5","filesize":773531,"mtime":"2017-05-22 16:34:11","url":"http://authors.library.caltech.edu/77624/1/Bannister_2017_ApJL_841_L12.pdf"}],"eprintid":77624,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Bannister_2017_ApJL_841_L12.pdf","content":"published"}],"note":"© 2017 The American Astronomical Society. \n\nReceived 2017 March 30. Accepted 2017 May 3. Published 2017 May 22. \n\nThe Australian SKA Pathfinder is part of the Australia Telescope National Facility which is managed by CSIRO. Operation of ASKAP is funded by the Australian Government with support from the National Collaborative Research Infrastructure Strategy. ASKAP uses the resources of the Pawsey Supercomputing Centre. Establishment of ASKAP, the Murchison Radio-astronomy Observatory and the Pawsey Supercomputing Centre are initiatives of the Australian Government, with support from the Government of Western Australia and the Science and Industry Endowment Fund. We acknowledge the Wajarri Yamatji people as the traditional owners of the Observatory site. S.O. acknowledges Australian Research Council grant Laureate Fellowship FL150100148. This research is supported by the Australian Research Council through grants CE110001020 and FT150100415. We would like to thank the MWA director, Randall Wayth, for giving us access to the Galaxy GPU cluster.","id":77624,"rev_number":6,"userid":772,"eprint_dir":"disk0/00/07/76/24","datestamp":"2017-05-22 17:00:41","lastmod":"2017-05-22 17:00:41","status_changed":"2017-05-22 17:00:41","type":"article","metadata_visibility":"show","creators":[{"given":"K. W.","family":"Bannister","id":"Bannister-K-W","orcid":""},{"given":"L. R.","family":"D'Addario","id":"D'Addario-L-R","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"instrumentation: interferometers; methods: data analysis; radiation mechanisms: non-thermal; surveys","date":"2017-05-20","date_type":"published","publication":"Astrophysical Journal Letters","volume":"841","number":"1","pagerange":"Art. No. L12","id_number":"CaltechAUTHORS:20170522-093359174","refereed":true,"issn":"2041-8205","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170522-093359174","related_url":[{"url":"https://doi.org/10.3847/2041-8213/aa71ff","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/2041-8213/aa71ff/meta","type":"pub","description":"Article"}],"referencetext":["Bunton, J. D., \u0026 Hay, S. G. 2010, in Int. Conf. on Electromagnetics in Advanced\nApplications (ICEAA), ed. R. S. Zich et al. (Piscataway, NJ: IEEE), 728\nCalabretta, M. R., Staveley-Smith, L., \u0026 Barnes, D. G. 2014, PASA, 31,\ne007\nCaleb, M., Flynn, C., Bailes, M., et al. 2016, MNRAS, 458, 718\nCaleb, M., Flynn, C., Barr, E. D., et al. 2017, MNRAS, 458, 718\nChampion, D. J., Petroff, E., Kramer, M., et al. 2016, MNRAS, 460, L30\nChatterjee, S., Law, C. J., Wharton, R. S., et al. 2017, Natur, 541, 58\nClarke, N., D’Addario, L., Navarro, R., \u0026 Trinh, J. 2014, JAI, 3, 1450004\nCondon, J. J., Cotton, W. D., Greisen, E. W., et al. 1998, AJ, 115, 1693\nCordes, J. M., \u0026 Lazio, T. J. W. 2002, arXiv:astro-ph/0207156\nFeroz, F., Hobson, M. P., \u0026 Bridges, M. 2009, MNRAS, 398, 1601\nHay, S. G., \u0026 O’Sullivan, J. D. 2008, RaSc, 43, RS6S04\nHotan, A. W., Bunton, J. D., Harvey-Smith, L., et al. 2014, PASA, 31, 41\nHuchra, J. P., \u0026 Geller, M. J. 1982, ApJ, 257, 423\nJohnston, S., Taylor, R., Bailes, M., et al. 2008, ExA, 22, 151\nKeane, E. F., \u0026 Petroff, E. 2015, MNRAS, 447, 2852\nKeith, M. J., Jameson, A., van Straten, W., et al. 2010, MNRAS, 409, 619\nLorimer, D. R., Bailes, M., McLaughlin, M. A., Narkevic, D. J., \u0026\nCrawford, F. 2007, Sci, 318, 777\nMacquart, J.-P., Bailes, M., Bhat, N. D. R., et al. 2010, PASA, 27, 272\nMacquart, J.-P., \u0026 Johnston, S. 2015, MNRAS, 451, 3278\nMasui, K., Lin, H.-H., Sievers, J., et al. 2015, Natur, 528, 523\nMcConnell, D., Allison, J. R., Bannister, K., et al. 2016, PASA, 33, e042\nMcQuinn, M. 2014, ApJL, 780, L33\nPetroff, E., Barr, E. D., Jameson, A., et al. 2016, PASA, 33, e045\nPetroff, E., van Straten, W., Johnston, S., et al. 2014, ApJL, 789, L26\nRavi, V., Shannon, R. M., Bailes, M., et al. 2016, Sci, 354, 1249\nSchinckel, A. E., Bunton, J. D., Cornwell, T. J., Feain, I., \u0026 Hay, S. G. 2012,\nProc. SPIE, 8444, 84442A\nScholz, P., Spitler, L. G., Hessels, J. W. T., et al. 2016, ApJ, 833, 177\nSerra, P., Koribalski, B., Kilborn, V., et al. 2015, MNRAS, 452, 2680\nSpitler, L. G., Scholz, P., Hessels, J. W. T., et al. 2016, Natur, 531, 202\nTendulkar, S. P., Bassa, C. G., Cordes, J. M., et al. 2017, ApJL, 834, L7\nThornton, D., Stappers, B., Bailes, M., et al. 2013, Sci, 341, 53\nWayth, R. B., Brisken, W. F., Deller, A. T., et al. 2011, ApJ, 735, 97\nYao, J. M., Manchester, R. N., \u0026 Wang, N. 2017, ApJ, 835, 29\nZackay, B., \u0026 Ofek, E. O. 2017, ApJ, 835, 11"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"K. W. Bannister et al 2017 ApJL 841 L12","other_numbering_system":null,"funders":[{"agency":"Australian Government National Collaborative Research Infrastructure Strategy","grant_number":""},{"agency":"Australian Research Counci","grant_number":"FL150100148"},{"agency":"Australian Research Council","grant_number":"CE110001020"},{"agency":"Australian Research Council","grant_number":"FT150100415"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}