{"title":"Measurement of Phenazines in Bacterial Cultures","uri":"","abstract":"Certain pseudomonads are capable of producing phenazines—pigmented, reversibly redox-active metabolites that induce a variety of physiological effects on the producing organism as well as others in their vicinity. Environmental conditions and the specific physiological state of cells can dramatically affect the absolute amounts and relative proportions of the various phenazines produced. The method detailed here—high-performance liquid chromatography coupled to detection by UV–Vis absorption—can be used to separate and quantify the amount of phenazines in a Pseudomonas culture. Simple spectrophotometric measurements of filtered culture supernatants can be used to quantify certain oxidized phenazines, such as pyocyanin, in cultures. For cases where the conditions under study are not planktonic cultures (e.g., soil or biofilms) extracting the phenazines may be a necessary first step.","documents":null,"note":"Ⓒ 2014 Springer Science+Business Media New York.","id":77621,"rev_number":6,"userid":5227,"eprint_dir":"disk0/00/07/76/21","datestamp":"2017-05-22 16:42:29","lastmod":"2017-05-22 16:42:29","status_changed":"2017-05-22 16:42:29","type":"book_section","metadata_visibility":"show","creators":[{"given":"Suzanne E.","family":"Kern","id":"Kern-S-E","orcid":""},{"given":"Dianne K.","family":"Newman","id":"Newman-D-K","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Phenazine; Pyocyanin; Phenazine-1-carboxylic acid; 1-Hydroxyphenazine; PCA; PYO; HPLC; UV–Vis spectroscopy","date":"2014","date_type":"published","publication":"","volume":"1149","number":"1149","pagerange":"303-310","id_number":"CaltechAUTHORS:20170522-090349682","refereed":true,"issn":"1064-3745","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170522-090349682","related_url":[{"url":"http://dx.doi.org/10.1007/978-1-4939-0473-0_25","type":"doi","description":"Book Chapter"},{"url":"https://link.springer.com/protocol/10.1007%2F978-1-4939-0473-0_25","type":"pub","description":"Book Chapter"}],"referencetext":["\n1.\nMavrodi DV, Blankenfeldt W, Thomashow LS (2006) Phenazine compounds in fluorescent Pseudomonas spp. biosynthesis and regulation. Ann Rev Phytopath 44:417–445CrossRef\n2.\nMavrodi DV, Bonsall RF, Delaney SM, Soule MJ, Phillips G, Thomashow LS (2001) Functional analysis of genes for biosynthesis of pyocyanin and phenazine-1-carboxamide from Pseudomonas aeruginosa PAO1. J Bacteriol 183:6454–6465PubMedCentralPubMedCrossRef\n3.\nDavis G, Thornalley PJ (1983) Free radical production from the aerobic oxidation of reduced pyridine nucleotides catalysed by phenazine derivatives. Biochim Biophys Acta 724:456–464PubMedCrossRef\n4.\nHassan HM, Fridovich I (1980) Mechanism of the antibiotic action of pyocyanine. J Bacteriol 141:156–163PubMedCentralPubMed\n5.\nRabaey K, Boon N, Hofte M, Verstraete W (2005) Microbial phenazine production enhances electron transfer in biofuel cells. Environ Sci Technol 39:3401–3408PubMedCrossRef\n6.\nYong Y-C, Yu Y-Y, Li C-M, Zhong J-J, Song H (2011) Bioelectricity enhancement via overexpression of quorum sensing system in Pseudomonas aeruginosa-inoculated microbial fuel cells. Biosens Bioelectron 30:87–92PubMedCrossRef\n7.\nLau GW, Hassett DJ, Ran H, Kong F (2004) The role of pyocyanin in Pseudomonas aeruginosa infection. Trends Mol Med 10:599–606PubMedCrossRef\n8.\nChin-A-Woeng T, Bloemberg G, Lugtenberg B (2003) Phenazines and their role in biocontrol by Pseudomonas bacteria. New Phytologist 157:503–523CrossRef\n9.\nWang Y, Newman DK (2008) Redox reactions of phenazine antibiotics with ferric (hydr)oxides and molecular oxygen. Environ Sci Technol 42:2380–2386PubMedCentralPubMedCrossRef\n10.\nHernandez ME, Kappler A, Newman DK (2004) Phenazines and other redox-active antibiotics promote microbial mineral reduction. Appl Environ Microb 70:921–928CrossRef\n11.\nRamos I, Dietrich LEP, Price-Whelan A, Newman DK (2010) Phenazines affect biofilm formation by Pseudomonas aeruginosa in similar ways at various scales. Res Microbiol 161:187–191PubMedCentralPubMedCrossRef\n12.\nWang Y, Wilks JC, Danhorn T, Ramos I, Croal L, Newman DK (2011) Phenazine-1-carboxylic acid promotes bacterial biofilm development via ferrous iron acquisition. J Bacteriol 193: 3606–3617PubMedCentralPubMedCrossRef\n13.\nDietrich LEP, Okegbe C, Price-Whelan A, Sakhtah H, Hunter RC, Newman DK (2013) Bacterial community morphogenesis is intimately linked to the intracellular redox state. J Bacteriol 195(7):1371–1380\n14.\nPrice-Whelan A, Dietrich LEP, Newman D (2007) Pyocyanin alters redox homeostasis and carbon flux through central metabolic pathways in Pseudomonas aeruginosa PA14. J Bacteriol 189:6372–6381PubMedCentralPubMedCrossRef\n15.\nWang Y, Kern SE, Newman DK (2010) Endogenous phenazine antibiotics promote anaerobic survival of Pseudomonas aeruginosa via extracellular electron transfer. J Bacteriol 192:365–369PubMedCentralPubMedCrossRef\n16.\nDietrich LEP, Price-Whelan A, Petersen A, Whiteley M, Newman DK (2006) The phenazine pyocyanin is a terminal signalling factor in the quorum sensing network of Pseudomonas aeruginosa. Mol Microbiol 61:1308–1321PubMedCrossRef\n17.\nKoley D, Ramsey MM, Bard AJ, Whiteley M (2011) Discovery of a biofilm electrocline using real-time 3D metabolite analysis. Proc Natl Acad Sci U S A 108:19996–20001PubMedCentralPubMedCrossRef\n18.\nSullivan NL, Tzeranis DS, Wang Y, So PTC, Newman D (2011) Quantifying the dynamics of bacterial secondary metabolites by spectral multiphoton microscopy. ACS Chem Biol 6:893–899PubMedCentralPubMedCrossRef\n19.\nReszka KJ, O'Malley Y, McCormick ML, Denning GM, Britigan BE (2004) Oxidation of pyocyanin, a cytotoxic product from Pseudomonas aeruginosa, by microperoxidase 11 and hydrogen peroxide. Free Radic Biol Med 36:1448–1459PubMedCrossRef\n20.\nMorales DK, Jacobs NJ, Rajamani S, Krishnamurthy M, Cubillos-Ruiz JR, Hogan DA (2010) Antifungal mechanisms by which a novel Pseudomonas aeruginosa phenazine toxin kills Candida albicans in biofilms. Mol Microbiol 78:1379–1392PubMedCrossRef\n21.\nHunter RC, Klepac-Ceraj V, Lorenzi MM, Grotzinger H, Martin TR, Newman DK (2012) Phenazine content in the cystic fibrosis respiratory tract negatively correlates with lung function and microbial complexity. Am J Respir Cell Mol Biol 47:738–745PubMedCrossRef\n22.\nFernandez RO, Pizarro RA (1997) High-performance liquid chromatographic analysis of Pseudomonas aeruginosa phenazines. J Chromat A 771:99–104"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}