{"title":"Complex Spiral Structure in the HD 100546 Transitional Disk\nas Revealed by GPI and MagAO","uri":"","abstract":"We present optical and near-infrared high-contrast images of the transitional disk HD 100546 taken with the Magellan Adaptive Optics system (MagAO) and the Gemini Planet Imager (GPI). GPI data include both polarized intensity and total intensity imagery, and MagAO data are taken in Simultaneous Differential Imaging mode at Hα. The new GPI H-band total intensity data represent a significant enhancement in sensitivity and field rotation compared to previous data sets and enable a detailed exploration of substructure in the disk. The data are processed with a variety of differential imaging techniques (polarized, angular, reference, and simultaneous differential imaging) in an attempt to identify the disk structures that are most consistent across wavelengths, processing techniques, and algorithmic parameters. The inner disk cavity at 15 au is clearly resolved in multiple data sets, as are a variety of spiral features. While the cavity and spiral structures are identified at levels significantly distinct from the neighboring regions of the disk under several algorithms and with a range of algorithmic parameters, emission at the location of HD 100546 \"c\" varies from point-like under aggressive algorithmic parameters to a smooth continuous structure with conservative parameters, and is consistent with disk emission. Features identified in the HD 100546 disk bear qualitative similarity to computational models of a moderately inclined two-armed spiral disk, where projection effects and wrapping of the spiral arms around the star result in a number of truncated spiral features in forward-modeled images.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252539","docid":252539,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261031","fileid":1261031,"datasetid":"document","objectid":252539,"filename":"Follette_2017_AJ_153_264.pdf","mime_type":"application/pdf","hash":"417a5f3241e0d2dd81da12e62800cb3d","hash_type":"MD5","filesize":2658940,"mtime":"2017-05-22 16:52:24","url":"http://authors.library.caltech.edu/77625/1/Follette_2017_AJ_153_264.pdf"}],"eprintid":77625,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Follette_2017_AJ_153_264.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252540","docid":252540,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261037","fileid":1261037,"datasetid":"document","objectid":252540,"filename":"1704.06260.pdf","mime_type":"application/pdf","hash":"4389092d5a5ffc5d8fe3796da6c682d5","hash_type":"MD5","filesize":7714306,"mtime":"2017-05-22 16:55:51","url":"http://authors.library.caltech.edu/77625/2/1704.06260.pdf"}],"eprintid":77625,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1704.06260.pdf","content":"submitted"}],"note":"© 2017 The American Astronomical Society. \n\nReceived 2016 December 28. Accepted 2017 April 13. Published 2017 May 22. \n\nBased on observations obtained at the Gemini Observatory, which is operated by the Association of Universities for Research in Astronomy, Inc., under a cooperative agreement with the NSF on behalf of the Gemini partnership: the National Science Foundation (United States), the National Research Council (Canada), CONICYT (Chile), Ministerio de Ciencia, Tecnología e Innovación Productiva (Argentina), and Ministério da Ciência, Tecnologia e Inovação (Brazil). K.B.F. and J.F.'s work was performed in part under contract with the California Institute of Technology (Caltech)/Jet Propulsion Laboratory (JPL) funded by NASA through the Sagan Fellowship Program executed by the NASA Exoplanet Science Institute. K.B.F. and B.M.'s work was supported by NSF AST-1411868. Portions of this work were performed under the auspices of the US Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344. K.M.M., T.B., and L.M.C.'s work is supported by the NASA Exoplanets Research Program (XRP) by cooperative agreement NNX16AD44G. J.R.G., R.D.R., P.K., J.W., V.B., and other members of the GPIES team are supported by NASA grant number NNX15AD95G. Support for M.M.B.'s work was provided by NASA through Hubble Fellowship grant 51378.01-A awarded by the Space Telescope Science Institute, which is operated by the Association of Universities for Research in Astronomy, Inc., for NASA, under contract NAS5-26555. \n\nFacilities: Gemini:South (GPI) and Magellan:Clay (MagAO) -","id":77625,"rev_number":12,"userid":772,"eprint_dir":"disk0/00/07/76/25","datestamp":"2017-05-22 18:32:44","lastmod":"2017-05-22 18:32:44","status_changed":"2017-05-22 18:32:44","type":"article","metadata_visibility":"show","creators":[{"given":"Katherine B.","family":"Follette","id":"Follette-K-B","orcid":""},{"given":"Maxwell A.","family":"Millar-Blanchaer","id":"Millar-Blanchaer-M-A","orcid":""},{"given":"J. Kent","family":"Wallace","id":"Wallace-J-K","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"instrumentation: adaptive optics – planet–disk interaction – protoplanetary disk – stars: individual\n(HD 100546)","date":"2017-06-06","date_type":"published","publication":"Astronomical Journal","volume":"153","number":"6","pagerange":"Art. No. 264","id_number":"CaltechAUTHORS:20170522-095217310","refereed":true,"issn":"0004-6256","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170522-095217310","related_url":[{"url":"https://doi.org/10.3847/1538-3881/aa6d85","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-3881/aa6d85#artAbst","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1704.06260","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Allard, F., Homeier, D., \u0026 Freytag, B. 2012, RSPTA, 370, 2765\nAmara, A., \u0026 Quanz, S. P. 2012, MNRAS, 427, 948\nArdila, D. R., Golimowski, D. A., Krist, J. E., et al. 2007, ApJ, 665, 512\nAugereau, J. C., Lagrange, A. M., Mouillet, D., \u0026 Ménard, F. 2001, A\u0026A,\n365, 78\nAvenhaus, H., Quanz, S. P., Meyer, M. R., et al. 2014, ApJ, 790, 56\nBenisty, M., Tatulli, E., Ménard, F., \u0026 Swain, M. R. 2010, A\u0026A, 511, A75\nBoccaletti, A., Pantin, E., Lagrange, A.-M., et al. 2013, A\u0026A, 560, A20\nBrittain, S. D., Carr, J. S., Najita, J. R., Quanz, S. P., \u0026 Meyer, M. R. 2014,\nApJ, 791, 136\nCanovas, H., Ménard, F., de Boer, J., et al. 2015, A\u0026A, 582, L7\nClose, L. M., Follette, K. B., Males, J. R., et al. 2014, ApJL, 781, L30\nClose, L. M., Follette, K. B., Males, J. R., et al. 2014, ApJL, 781, L30\nCox, A. N. 2000, Allenʼs Astrophysical Quantities (New York: Springer-\nVerlag)\nCurrie, T., Cloutier, R., Brittain, S., et al. 2015, ApJL, 814, L27\nCurrie, T., Muto, T., Kudo, T., et al. 2014, ApJL, 796, L30\nde Boer, J., Salter, G., Benisty, M., et al. 2016, A\u0026A, 595, A114\nDong, R., Fung, J., \u0026 Chiang, E. 2016a, ApJ, 826, 75\nDong, R., Rafikov, R., Zhu, Z., et al. 2012, ApJ, 750, 161\nDong, R., Zhu, Z., Fung, J., et al. 2016b, ApJL, 816, L12\nDong, R., Zhu, Z., Rafikov, R. R., \u0026 Stone, J. M. 2015, ApJL, 809, L5\nFedele, D., Bruderer, S., van den Ancker, M. E., \u0026 Pascucci, I. 2015, ApJ,\n800, 23\nFollette, K. B., Grady, C. A., Swearingen, J. R., et al. 2015, ApJ, 798, 132\nFollette, K. B., Tamura, M., Hashimoto, J., et al. 2013, ApJ, 767, 10\nFung, J. 2015, PhD thesis, Univ. Toronto\nFung, J., \u0026 Dong, R. 2015, ApJL, 815, L21\nGarufi, A., Quanz, S. P., Schmid, H. M., et al. 2016, A\u0026A, 588, A8\nGrady, C. A., Polomski, E. F., Henning, T., et al. 2001, AJ, 122, 3396\nGrady, C. A., Woodgate, B., Heap, S. R., et al. 2005, ApJ, 620, 470\nGuimarães, M. M., Alencar, S. H. P., Corradi, W. J. B., \u0026 Vieira, S. L. A.\n2006, A\u0026A, 457, 581\nGullbring, E., Hartmann, L., Briceño, C., \u0026 Calvet, N. 1998, ApJ, 492, 323\nHashimoto, J., Tamura, M., Muto, T., et al. 2011, ApJL, 729, L17\nHinkley, S., Oppenheimer, B. R., Soummer, R., et al. 2009, ApJ, 701, 804\nHu, J. Y., The, P. S., \u0026 de Winter, D. 1989, A\u0026A, 208, 213\nIngraham, P., Perrin, M. D., Sadakuni, N., et al. 2014, Proc. SPIE, 9147,\n91477O\nJensen-Clem, R., Millar-Blanchaer, M., Mawet, D., et al. 2016, ApJ, 820, 111\nKim, S.-H., Martin, P. G., \u0026 Hendry, P. D. 1994, ApJ, 422, 164\nKonopacky, Q. M., Thomas, S. J., Macintosh, B. A., et al. 2014, Proc. SPIE,\n9147, 914784\nKuhn, J. R., Potter, D., \u0026 Parise, B. 2001, ApJL, 553, L189\nLafrenière, D., Marois, C., Doyon, R., Nadeau, D., \u0026 Artigau, É 2007, ApJ,\n660, 770\nLevenhagen, R. S., \u0026 Leister, N. V. 2006, MNRAS, 371, 252\nLindegren, L., Lammers, U., Bastian, U., et al. 2016, A\u0026A, 595, A4\nMacintosh, B., Graham, J. R., Ingraham, P., et al. 2014, PNAS, 111, 12661\nMaire, J., Ingraham, P. J., De Rosa, R. J., et al. 2014, Proc. SPIE, 9147, 85\nMales, J. R., Close, L. M., Morzinski, K. M., et al. 2014, ApJ, 786, 32\nMarois, C., Lafrenière, D., Doyon, R., Macintosh, B., \u0026 Nadeau, D. 2006, ApJ,\n641, 556\nMarois, C., Macintosh, B., \u0026 Véran, J.-P. 2010, Proc. SPIE, 7736, 77361J\nMawet, D., Milli, J., Wahhaj, Z., et al. 2014, ApJ, 792, 97\nMazoyer, J., Boccaletti, A., Augereau, J.-C., et al. 2014, A\u0026A, 569, A29\nMendigutía, I., de Wit, W. J., Oudmaijer, R. D., et al. 2015, MNRAS,\n453, 2126\nMillar-Blanchaer, M. A., Graham, J. R., Pueyo, L., et al. 2015, ApJ, 811, 18\nMillar-Blanchaer, M. A., Perrin, M. D., Hung, L.-W., et al. 2016, Proc. SPIE,\n9908, 990836\nMilli, J., Mouillet, D., Lagrange, A.-M., et al. 2012, A\u0026A, 545, A111\nMorzinski, K. M., Close, L. M., Males, J. R., et al. 2014, Proc. SPIE, 9148,\n914804\nMorzinski, K. M., Close, L. M., Males, J. R., et al. 2016, Proc. SPIE, 9909,\n990901\nOwen, J. E. 2016, PASA, 33, e005\nPanic, O., Ratzka, T., Mulders, G. D., et al. 2014, A\u0026A, 562, A101\nPantin, E., Waelkens, C., \u0026 Lagage, P. O. 2000, A\u0026A, 361, L9\nPerrin, M. D., Duchene, G., Millar-Blanchaer, M., et al. 2015, ApJ, 799, 182\nPerrin, M. D., Graham, J. R., Kalas, P., et al. 2004, Sci, 303, 1345\nPerrin, M. D., Ingraham, P., Follette, K. B., et al. 2016, Proc. SPIE, 9908,\n990837\nPerrin, M. D., Maire, J., Ingraham, P., et al. 2014, Proc. SPIE, 9147, 91473J\nPineda, J. E., Quanz, S. P., Meru, F., et al. 2014, ApJL, 788, L34\nPinilla, P., Benisty, M., \u0026 Birnstiel, T. 2012, A\u0026A, 545, A81\nPinilla, P., de Boer, J., Benisty, M., et al. 2015, A\u0026A, 584, 4\nQuanz, S. P., Amara, A., Meyer, M. R., et al. 2013, ApJL, 766, L1\nQuanz, S. P., Amara, A., Meyer, M. R., et al. 2015, ApJ, 807, 64\nQuanz, S. P., Schmid, H. M., Geissler, K., et al. 2011, ApJ, 738, 23\nRameau, J., Follette, K. B., Pueyo, L., et al. 2017, AJ, 153, 244\nRigliaco, E., Natta, A., Testi, L., et al. 2012, A\u0026A, 548, A56\nRodigas, T. J., Hinz, P. M., Leisenring, J., et al. 2012, ApJ, 752, 57\nSallum, S., Follette, K. B., Eisner, J. A., et al. 2015a, Natur, 527, 342\nSallum, S., Follette, K. B., Eisner, J. A., et al. 2015b, Natur, 527, 342\nSartori, M. J., Lépine, J. R. D., \u0026 Dias, W. S. 2003, A\u0026A, 404, 913\nSchmid, H. M., Joos, F., \u0026 Tschan, D. 2006, A\u0026A, 452, 657\nShakura, N. I., \u0026 Sunyaev, R. A. 1973, A\u0026A, 24, 337\nSoummer, R., Pueyo, L., \u0026 Larkin, J. 2012, ApJL, 755, L28\nStrom, K. M., Strom, S. E., Edwards, S., Cabrit, S., \u0026 Skrutskie, M. F. 1989,\nAJ, 97, 1451\nTatulli, E., Benisty, M., Ménard, F., et al. 2011, A\u0026A, 531, A1\nvan den Ancker, M. E., The, P. S., Tjin A Djie, H. R. E., et al. 1997, A\u0026A,\n324, L33\nvan der Marel, N., van Dishoeck, E. F., Bruderer, S., et al. 2013, Sci, 340, 1199\nvan Leeuwen, F. 2007, A\u0026A, 474, 653\nWaelkens, C., Waters, L. B. F. M., de Graauw, M. S., et al. 1996, A\u0026A,\n315, L245\nWalsh, C., Juhász, A., Pinilla, P., et al. 2014, ApJL, 791, L6\nWang, J. J., Rajan, A., Graham, J. R., et al. 2014, Proc. SPIE, 9147, 914755\nWang, J. J., Ruffio, J.-B., De Rosa, R. J., et al. 2015, pyKLIP: PSF Subtraction\nfor Exoplanets and Disks, Astrophysics Source Code Library, ascl:1506.001\nWhitney, B. A., Robitaille, T. P., Bjorkman, J. E., et al. 2013, ApJS, 207, 30\nWolff, S. G., Perrin, M. D., Maire, J., et al. 2014, Proc. SPIE, 9147, 91477H\nWright, C. M., Maddison, S. T., Wilner, D. J., et al. 2015, MNRAS, 453, 414\nZhu, Z., Dong, R., Stone, J. M., \u0026 Rafikov, R. R. 2015, ApJ, 813, 88\nZhu, Z., Nelson, R. P., Dong, R., Espaillat, C., \u0026 Hartmann, L. 2012, ApJ,\n755, 6"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Katherine B. Follette et al 2017 AJ 153 264","other_numbering_system":null,"funders":[{"agency":"NASA/JPL/Caltech","grant_number":""},{"agency":"NASA Sagan Fellowship","grant_number":""},{"agency":"NASA Exoplanet Science Institute","grant_number":""},{"agency":"NSF","grant_number":"AST-1411868"},{"agency":"Department of Energy (DOE)","grant_number":"DE-AC52-07NA27344"},{"agency":"NASA","grant_number":"NNX16AD44G"},{"agency":"NASA","grant_number":"NNX15AD95G"},{"agency":"NASA Hubble Fellowship","grant_number":"51378.01-A"},{"agency":"NASA","grant_number":"NAS5-26555"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Infrared Processing and Analysis Center (IPAC)"]}