{"title":"Three eras of planetary exploration","uri":"","abstract":"The number of known exoplanets rose from zero to one in the mid-1990s, and has been doubling approximately every two years ever since. Although this can justifiably be called the beginning of an era, an earlier era began in the 1960s when humankind began exploring the Solar System with spacecraft. Even earlier than that, the era of modern scientific study of the Solar System began with Copernicus, Galileo, Brahe, Kepler and Newton. These eras overlap in time, and many individuals have worked across all three. This Review explores what the past can tell us about the future and what the exploration of the Solar System can teach us about exoplanets, and vice versa. We consider two primary examples: the history of water on Venus and Mars; and the study of Jupiter, including its water, with the Juno spacecraft.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252569","docid":252569,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261491","fileid":1261491,"datasetid":"document","objectid":252569,"filename":"s41550-016-0010.pdf","mime_type":"application/pdf","hash":"ef2c1099ced4b40e2757af49de3159af","hash_type":"MD5","filesize":429879,"mtime":"2017-05-22 22:56:19","url":"http://authors.library.caltech.edu/77636/1/s41550-016-0010.pdf"}],"eprintid":77636,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"s41550-016-0010.pdf","content":"published"}],"note":"© 2017 Macmillan Publishers Limited, part of Springer\nNature. \n\nReceived: 30 September 2016; Accepted: 15 November 2016; Published online: 04 January 2017. \n\nThis research was supported by NASA through the Juno and Cassini Projects. \n\nThe author declares no competing financial interest.","id":77636,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/76/36","datestamp":"2017-05-22 23:07:05","lastmod":"2017-05-22 23:07:05","status_changed":"2017-05-22 23:07:05","type":"article","metadata_visibility":"show","creators":[{"given":"Andrew P.","family":"Ingersoll","id":"Ingersoll-A-P","orcid":"0000-0002-2035-9198"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2017-01","date_type":"published","publication":"Nature Astronomy","volume":"1","number":"1","pagerange":"Art. No. 0010","id_number":"CaltechAUTHORS:20170522-155613502","refereed":true,"issn":"2397-3366","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170522-155613502","related_url":[{"url":"http://dx.doi.org/10.1038/s41550-016-0010","type":"doi","description":"Article"},{"url":"http://www.nature.com/articles/s41550-016-0010","type":"pub","description":"Article"},{"url":"http://rdcu.be/sNh9","type":"pub","description":"Free ReadCube access"}],"referencetext":["1.\nGalilei, G. Siderius Nuncius (1610).\n+ Show context\n\n2.\nCopernicus, N. De Revolutionibus Orbium Coelestium (1543).\n+ Show context\n\n3.\nKepler, J. Astronomia Nova (1609).\n+ Show context\n\n4.\nNewton, I. Principia Mathematica (1687).\n+ Show context\n\n5.\nCavendish, H. Experiments to determine the density of the Earth. Phil. Trans. Roy. Soc. 88, 469–526 (1798).\n+ Show context\nArticle\n\n\n6.\nMarcy, G. W. et al. The planet around 51 Pegasi. Astrophys. J. 481, 926–935 (1997).\n+ Show context\nISI\nArticle\n\n\n7.\nButler, R. P. et al. Attaining Doppler precision of 3 m s−1. Pub. Astron. Soc. Pacific 108, 500–509 (1996).\n+ Show context\nArticle\n\n\n8.\nBorucki, W. J. et al. Kepler planet-detection mission: Introduction and first results. Science 327, 977–980 (2010).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n9.\nMenzel, D. H., Coblentz, W. W. \u0026 Lampland, C. O. Planetary temperature derived from water-cell transmissions. Astrophys. J. 63, 177–187 (1926).\n+ Show context\nArticle\n\n\n10.\nAdel, A. \u0026 Slipher, V. M. The constitution of the atmospheres of the giant planets. Phys. Rev. 46, 902–906 (1934).\n+ Show context\nCAS\nArticle\n\n\n11.\nKiess, C. C., Corliss, C. H. \u0026 Kiess, H. K. High-dispersion spectra of Jupiter. Astrophys. J. 132, 221–231 (1960).\n+ Show context\nCAS\nArticle\n\n\n12.\nCharbonneau, D., Brown, T. M., Noyes, R. W. \u0026 Gilliland, R. L. Detection of an extrasolar planet atmosphere. Astrophys. J. 568, 377–384 (2002).\n+ Show context\nISI\nCAS\nArticle\n\n\n13.\nDeming, D. et al. Infrared transmission spectroscopy of the exoplanets HD 209458b and XO-1b using the wide field camera-3 on the Hubble Space Telescope. Astrophys. J. 774, 95 (2013).\n+ Show context\nCAS\nArticle\n\n\n14.\nKreidberg, L. et al. A precise water abundance measurement for the hot Jupiter WASP-43b. Astrophys. J. Lett. 793, L27 (2014).\n+ Show context\nCAS\nArticle\n\n\n15.\nKreidberg, L. et al. Clouds in the atmosphere of the super-Earth exoplanet GJ 1214b. Nature 505, 69–72 (2014).\n+ Show context\nCAS\nPubMed\nArticle\n\n\n16.\nKnutson, H. A. et al. 3.6 and 4.5 μm phase curves and evidence for non-equilibrium chemistry in the atmosphere of extrasolar planet HD 189733b. Astrophys. J. 754, 22 (2012).\n+ Show context\nCAS\nArticle\n\n\n17.\nShowman, A. P. \u0026 Guillot, T. Atmospheric circulation and tides of ‘51 Pegasus b-like' planets. Astron. Astrophys. 385, 166–180 (2002).\n+ Show context\nArticle\n\n\n18.\nMallama, A., Wang, D. \u0026 Howard, R. A. Venus phase function and forward scattering from H2SO4. Icarus 182, 10–22 (2006).\n+ Show context\nArticle\n\n\n19.\nOwen, T., Barnun, A. \u0026 Kleinfeld, I. Possible cometary origin of heavy noble-gases in the atmospheres of Venus, Earth and Mars. Nature 358, 43–46 (1992).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n20.\nOwen, T. \u0026 Barnun, A. Comets, impacts, and atmospheres. Icarus 116, 215–226 (1995).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n21.\nMarty, B. The origins and concentrations of water, carbon, nitrogen and noble gases on Earth. Earth Planet. Sci. Lett. 313, 56–66 (2012).\n+ Show context\nCAS\nArticle\n\n\n22.\nAltwegg, K. et al. 67P/Churyumov–Gerasimenko, a Jupiter family comet with a high D/H ratio. Science 347, 1261952 (2015).\n+ Show context\nCAS\nPubMed\nArticle\n\n\n23.\nBarnes, J. J. et al. An asteroidal origin for water in the Moon. Nat. Commun. 7, 11684 (2016).\n+ Show context\nCAS\nArticle\n\n\n24.\nKomabayashi, M. Discrete equilibrium temperatures of a hypothetical planet with the atmosphere and hydrosphere of one component-two phase system under constant solar radiation. J. Meteor. Soc. Jpn 45, 137–139 (1967).\n+ Show context\n\n25.\nIngersoll, A. P. The runaway greenhouse: A history of water on Venus. J. Atmos. Sci. 26, 1191–1198 (1969).\n+ Show context\nCAS\nArticle\n\n\n26.\nNakajima, S., Hayashi, Y. Y. \u0026 Abe, Y. A study on the runaway greenhouse-effect with a one-dimensional radiative convective equilibrium-model. J. Atmos. Sci. 49, 2256–2266 (1992).\n+ Show context\nArticle\n\n\n27.\nKasting, J. F. Runaway and moist greenhouse atmospheres and the evolution of Earth and Venus. Icarus 74, 472–494 (1988).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n28.\nPujol, T. \u0026 North, G. R. Runaway greenhouse effect in a semigray radiative-convective model. J. Atmos. Sci. 59, 2801–2810 (2002).\n+ Show context\nArticle\n\n\n29.\nKasting, J. F., Chen, H. \u0026 Kopparapu, R. K. Stratospheric temperatures and water loss from moist greenhouse atmospheres of Earth-like planets. Astrophys. J. Lett. 813 L3 (2015).\n+ Show context\nCAS\nArticle\n\n\n30.\nHoward, A. D., Moore, J. M. \u0026 Irwin, R. P. An intense terminal epoch of widespread fluvial activity on early Mars: 1. Valley network incision and associated deposits. J. Geophys. Res. Planets 110 E12S14 (2005).\n+ Show context\nArticle\n\n\n31.\nMalin, M. C. \u0026 Edgett, K. S. Evidence for persistent flow and aqueous sedimentation on early Mars. Science 302, 1931–1934 (2003).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n32.\nWordsworth, R. D. in Annu. Rev. Earth Planet. Sci. Vol. 44 (eds Jeanloz, R. \u0026 Freeman, K. H.) 381–408 (2016).\n+ Show context\n\n33.\nBibring, J. P. et al. Global mineralogical and aqueous Mars history derived from OMEGA/Mars express data. Science 312, 400–404 (2006).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n34.\nEhlmann, B. L. et al. Orbital identification of carbonate-bearing rocks on Mars. Science 322, 1828–1832 (2008).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n35.\nEhlmann, B. L. et al. Subsurface water and clay mineral formation during the early history of Mars. Nature 479, 53–60 (2011).\n+ Show context\nCAS\nPubMed\nArticle\n\n\n36.\nSmith, M. D. The annual cycle of water vapor on Mars as observed by the thermal emission spectrometer. J. Geophys. Res. Planets 107, E11 (2002).\n+ Show context\n\n37.\nMalin, M. C. \u0026 Edgett, K. S. Evidence for recent groundwater seepage and surface runoff on Mars. Science 288, 2330–2335 (2000).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n38.\nMcEwen, A. S. et al. Seasonal flows on warm Martian slopes. Science 333, 740–743 (2011).\n+ Show context\nCAS\nPubMed\nArticle\n\n\n39.\nIngersoll, A. P. Mars: Occurrence of liquid water. Science 168, 972–973 (1970).\n+ Show context\nCAS\nArticle\n\n\n40.\nChevrier, V. F. \u0026 Rivera-Valentin, E. G. Formation of recurring slope lineae by liquid brines on present-day Mars. Geophys. Res. Lett. 39, L21202 (2012).\n+ Show context\nCAS\nArticle\n\n\n41.\nOjha, L. et al. Spectral evidence for hydrated salts in recurring slope lineae on Mars. Nat. Geosci. 8, 829–832 (2015).\n+ Show context\nCAS\nArticle\n\n\n42.\nBahcall, J. N., Huebner, W. F., Lubow, S. H., Parker, P. D. \u0026 Ulrich, R. K. Standard solar models and the uncertainties in predicted capture rates of solar neutrinos. Revs. Mod. Phys. 54, 767–800 (1982).\n+ Show context\nCAS\nArticle\n\n\n43.\nMinton, D. A. \u0026 Malhotra, R. Assessing the massive young sun hypothesis to solve the warm young Earth puzzle. Astrophys. J. 660, 1700–1706 (2007).\n+ Show context\nArticle\n\n\n44.\nKasting, J. F. CO2 condensation and the climate of early Mars. Icarus 94, 1–13 (1991).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n45.\nForget, F. et al. 3D modelling of the early martian climate under a denser CO2 atmosphere: Temperatures and CO2 ice clouds. Icarus 222, 81–99 (2013).\n+ Show context\nISI\nCAS\nArticle\n\n\n46.\nWordsworth, R. D., Kerber, L., Pierrehumbert, R. T., Forget, F. \u0026 Head, J. W. Comparison of ‘warm and wet' and ‘cold and icy' scenarios for early Mars in a 3-D climate model. J. Geophys. Res. Planets 120, 1201–1219 (2015).\n+ Show context\nArticle\n\n\n47.\nBoynton, W. V. et al. Distribution of hydrogen in the near surface of Mars: Evidence for subsurface ice deposits. Science 297, 81–85 (2002).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n48.\nJakosky, B. M. et al. The Mars Atmosphere and Volatile Evolution (MAVEN) mission. Space Sci. Rev. 195, 3–48 (2015).\n+ Show context\nCAS\nArticle\n\n\n49.\nJakosky, B. M., Grebowsky, J. M., Luhmann, J. G. \u0026 Brain, D. A. Initial results from the MAVEN mission to Mars. Geophys. Res. Lett. 42, 8791–8802 (2015).\n+ Show context\nArticle\n\n\n50.\nJontof-Hutter, D., Rowe, J. F., Lissauer, J. J., Fabrycky, D. C. \u0026 Ford, E. B. The mass of the Mars-sized exoplanet Kepler-138 b from transit timing. Nature 522, 321–323 (2015).\n+ Show context\nCAS\nArticle\n\n\n51.\nNiemann, H. B. et al. The composition of the Jovian atmosphere as determined by the Galileo probe mass spectrometer. J. Geophys. Res. Planets 103, 22831–22845 (1998).\n+ Show context\nCAS\nArticle\n\n\n52.\nFolkner, W. M., Woo, R. \u0026 Nandi, S. Ammonia abundance in Jupiter's atmosphere derived from the attenuation of the Galileo probe's radio signal. J. Geophys. Res. Planets 103, 22847–22855 (1998).\n+ Show context\nCAS\nArticle\n\n\n53.\nMahaffy, P. R. et al. Noble gas abundance and isotope ratios in the atmosphere of Jupiter from the Galileo probe mass spectrometer. J. Geophys. Res. Planets 105, 15061–15071 (2000).\n+ Show context\nCAS\nArticle\n\n\n54.\nStevenson, D. J. \u0026 Salpeter, E. E. Dynamics and helium distribution in hydrogen–helium fluid planets. Astrophys. J. Supp. Ser. 35, 239–261 (1977).\n+ Show context\nCAS\nArticle\n\n\n55.\nAtreya, S. K., Mahaffy, P. R., Niemann, H. B. \u0026 Owen, T. C. Composition and cloud structure of Jupiter's deep atmosphere. Highlights Astron. 12, 597–601 (2002).\n+ Show context\nArticle\n\n\n56.\nHersant, F., Gautier, D. \u0026 Lunine, J. I. Enrichment in volatiles in the giant planets of the Solar System. Planet. Space Sci. 52, 623–641 (2004).\n+ Show context\nISI\nCAS\nArticle\n\n\n57.\nJanssen, M. A. et al. Microwave remote sensing of Jupiter's atmosphere from an orbiting spacecraft. Icarus 173, 447–453 (2005).\n+ Show context\nCAS\nArticle\n\n\n58.\nGrassi, D. et al. Jupiter's hot spots: Quantitative assessment of the retrieval capabilities of future IR spectro-imagers. Planet. Space Sci. 58, 1265–1278 (2010).\n+ Show context\nArticle\n\n\n59.\nPoincare, H. Sur la precession des corps deformables. Bull. Astron. 27, 321–356 (1910).\n+ Show context\n\n60.\nKaspi, Y., Flierl, G. R. \u0026 Showman, A. P. The deep wind structure of the giant planets: Results from an anelastic general circulation model. Icarus 202, 525–542 (2009).\n+ Show context\nArticle\n\n\n61.\nFletcher, L. N., Orton, G. S., Teanby, N. A., Irwin, P. G. J. \u0026 Bjoraker, G. L. Methane and its isotopologues on Saturn from Cassini/CIRS observations. Icarus 199, 351–367 (2009).\n+ Show context\nCAS\nArticle\n\n\n62.\nFletcher, L. N., Orton, G. S., Teanby, N. A. \u0026 Irwin, P. G. J. Phosphine on Jupiter and Saturn from Cassini/CIRS. Icarus 202, 543–564 (2009).\n+ Show context\nCAS\nArticle\n\n\n63.\nFletcher, L. N. et al. Sub-millimetre spectroscopy of Saturn's trace gases from Herschel/SPIRE. Astron. Astrophys. 539, A44 (2012).\n+ Show context\nCAS\nArticle\n\n\n64.\nMilitzer, B., Hubbard, W. B., Vorberger, J., Tamblyn, I. \u0026 Bonev, S. A. A massive core in Jupiter predicted from first-principles simulations. Astrophys. J. Lett. 688, L45 (2008).\n+ Show context\nCAS\nArticle\n\n\n65.\nHelled, R. \u0026 Guillot, T. Interior models of Saturn: Including the uncertainties in shape and rotation. Astrophys. J. 767, 113 (2013).\n+ Show context\nArticle\n\n\n66.\nHubbard, W. B. Gravitational signature of Jupiter's deep zonal flows. Icarus 137, 357–359 (1999).\n+ Show context\nISI\nArticle\n\n\n67.\nConnerney, J. E. P., Acuna, M. H., Ness, N. F. \u0026 Satoh, T. New models of Jupiter's magnetic field constrained by the Io flux tube footprint. J. Geophys. Res. Space Phys. 103, 11929–11939 (1998).\n+ Show context\nArticle\n\n\n68.\nConnerney, J. E. P., Ness, N. F. \u0026 Acuna, M. H. Zonal harmonic model of Saturn's magnetic field from Voyager 1 and 2 observations. Nature 298, 44–46 (1982).\n+ Show context\nISI\nArticle\n\n\n69.\nBurton, M. E., Dougherty, M. K. \u0026 Russell, C. T. Saturn's internal planetary magnetic field. Geophys. Res. Lett. 37, 5 (2010).\n+ Show context\nCAS\nArticle\n\n\n70.\nKhurana, K. K. et al. in Jupiter: The Planet, Satellites, and Magnetosphere (ed. Bagenal, F.) Ch. 24 (Cambridge Univ. Press, 2004).\n+ Show context\n\n71.\nAndre, N. et al. Identification of Saturn's magnetospheric regions and associated plasma processes: synopsis of Cassini observations during orbit insertion. Rev. Geophys. 46, RG4008 (2008).\n+ Show context\nCAS\nArticle\n\n\n72.\nHill, T. W. Inertial limit on corotation. J. Geophys. Res. Space Phys. 84, 6554–6558 (1979).\n+ Show context\nArticle\n\n\n73.\nde Pater, I. \u0026 Lissauer, J. J. Planetary Sciences 2nd edn (Cambridge Univ. Press, 2015).\n+ Show context\n\n74.\nDonahue, T. M. \u0026 Pollack, J. B. in Venus (eds Hunten, D. M., Collin, L., Donahue, T. M. \u0026 Moroz, V. I.) 1003–1036 (Univ. Arizona Press, 1983).\n+ Show context\n\n75.\nSmith, D. E. et al. Mars orbiter laser altimeter: Experiment summary after the first year of global mapping of Mars. J. Geophys. Res. Planets 106, 23689–23722 (2001).\n+ Show context\nArticle\n\n\n76.\nPhillips, R. J. et al. Massive CO2 ice deposits sequestered in the south polar layered deposits of Mars. Science 332, 838–841 (2011).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n77.\nIngersoll, A. P. Planetary Climates (Princeton Univ. Press, 2013).\n+ Show context\n\n78.\nAsplund, M., Grevesse, N., Sauval, A. J. \u0026 Scott, P. The chemical composition of the Sun. Ann. Rev. Astron. Astrophys. 47, 481–522 (2009).\n+ Show context\nCAS\nArticle\n\n\n79.\nAtreya, S. K. in Medicean Moons: Their Impact on 400 Years of Discovery (eds Barbieri, C., Chakrabarti, S., Coradini, M. \u0026 Lazzarin, M.) 130–140 (Cambridge Univ. Press, 2010).\n+ Show context\n\n80.\nBockelee-Morvan, D. et al. Deuterated water in comet C 1996 B2 (Hyakutake) and its implications for the origin of comets. Icarus 133, 147–162 (1998).\n+ Show context\nISI\nCAS\nArticle\n\n\n81.\nDonahue, T. M., Grinspoon, D. H., Hartle, R. E. \u0026 Hodges, R. R. in Venus II (eds Bougher, S. W., Hunten, D. M. \u0026 Phillips, R. J.) Ch. 13 (Univ. Arizona Press, 1997).\n+ Show context\n\n82.\nDyudina, U. A. et al. Saturn's south polar vortex compared to other large vortices in the Solar System. Icarus 202, 240–248 (2009).\n\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NASA","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}