{"title":"Reactive Molecular Dynamics Simulations to Understand Mechanical Response of Thaumasite under Temperature and Strain Rate Effects","uri":"","abstract":"Understanding the structural, thermal, and mechanical properties of thaumasite is of great interest to the cement industry, mainly because it is the phase responsible for the aging and deterioration of civil infrastructures made of cementitious materials attacked by external sources of sulfate. Despite its importance, the effects of temperature and strain rate on the mechanical response of thaumasite have remained unexplored to date. In this study, the mechanical properties of thaumasite are fully characterized using the reactive molecular dynamics (RMD) method. With employing a first-principles based reactive force field, the RMD simulations enable the description of bond dissociation and formation under realistic conditions. From the stress-strain curves of thaumasite generated in the x, y, and z directions, the tensile strength, Young’s modulus, and fracture strain are determined for the three orthogonal directions. During the course of each simulation, the chemical bonds undergoing tensile deformations are monitored to reveal the bonds responsible for the mechanical strength of thaumasite. The effect of temperature increase is found to accelerate the rate of bond breaking and consequently degradation of mechanical properties of thaumasite, while an increase in the strain rate leads to their slight enhancement. ","documents":[{"id":"http://authors.library.caltech.edu/id/document/252589","docid":252589,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261693","fileid":1261693,"datasetid":"document","objectid":252589,"filename":"acs%2Ejpca%2E7b02824.pdf","mime_type":"application/pdf","hash":"291762e548fffa2b223f61975bceb5d4","hash_type":"MD5","filesize":8744302,"mtime":"2017-05-23 16:09:42","url":"http://authors.library.caltech.edu/77649/1/acs%252Ejpca%252E7b02824.pdf"}],"eprintid":77649,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"acs%2Ejpca%2E7b02824.pdf","content":"accepted"}],"note":"© 2017 American Chemical Society.\n\nPublication Date (Web): May 22, 2017.\n\nThe Extreme Science and Engineering Discovery Environment (XSEDE), which is supported by National Science Foundation grant number ACI-1548562, was used for part of the atomistic simulations conducted\nin this study.","id":77649,"rev_number":6,"userid":18,"eprint_dir":"disk0/00/07/76/49","datestamp":"2017-05-23 18:17:14","lastmod":"2017-05-23 18:17:14","status_changed":"2017-05-23 18:17:14","type":"article","metadata_visibility":"show","creators":[{"given":"Shahin","family":"Hajilar","id":"Hajilar-S","orcid":""},{"given":"Behrouz","family":"Shafei","id":"Shafei-B","orcid":""},{"given":"Tao","family":"Cheng","id":"Cheng-Tao","orcid":"0000-0003-4830-177X"},{"given":"Andres","family":"Jaramillo-Botero","id":"Jaramillo-Botero-A","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-22","date_type":"inpress","publication":"Journal of Physical Chemistry A","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170523-090937724","refereed":true,"issn":"1089-5639","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170523-090937724","related_url":[{"url":"http://dx.doi.org/10.1021/acs.jpca.7b02824","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/acs.jpca.7b02824","type":"pub","description":"Article"}],"referencetext":["1. Crammond, N.J. Thaumasite in Failed Cement Mortars and Renders from Exposed Brickwork. Cem.\nConcr. Res. 1985, 15, 1039-1050.\n2. Santhanam, M.; Cohen, M.D.; Olek, J. Mechanism of Sulfate Attack: a Fresh Look Part 1: Summary\nof Experimental Results. Cem. Concr. Res. 2002, 32, 915-921.\n3. Santhanam, M.; Cohen, M.D.; Olek, J. Mechanism of Sulfate Attack: a Fresh Look Part 2. Proposed\nMechanisms. Cem. Concr. Res. 2003, 33, 341-346.\n4. Neville, A. The Confused World of Sulfate Attack on Concrete. Cem. Concr. Res. 2004, 34, 1275-1296.\n5. Crammond, N.J. The Occurrence of Thaumasite in Modern Construction- a Review. Cem. Concr. Res.\n2002, 24, 393-402.\n6. Glasser, F.P.; Marchand, J.; Samson, E. Durability of Concrete-Degradation Phenomena Involving\nDetrimental Chemical Reactions. Cem. Concr. Res. 2008, 38, 226-246.\n7. Bensted, J. Thaumasite-Background and Nature in Deterioration of Cements, Mortars and Concretes.\nCem. Concr. Compos. 1999, 21, 117-121.\n8. Bickley, J.A. The Repair of Arctic Structures Damaged by Thaumasite. Cem. Concr. Compos. 1999,\n21, 155-158.\n9. Jacobsen, S.D.; Smyth, J.R.; Swope, R.J. Thermal Expansion of Hydrated Six-Coordinate Silicon in\nThaumasite, Ca3Si(OH)6(CO3)(SO4).12H2O. Phys. Chem. Miner. 2003, 30, 321-329.\n10. Martucci, A.; Cruciani, G. In Situ Time Resolved Synchrotron Powder Diffraction Study of\nThaumasite. Phys. Chem. Miner. 2006, 33, 723-731.\n11. Gatta, G.D.; McIntyre, G.J.; Swanson, J.G.; Jacobson, S.D. Minerals in Cement Chemistry: A Single-\nCrystal Neutron Diffraction and Raman Spectroscopic Study of Thaumasite,\nCa3Si(OH)6(CO3)(SO4)·12H2O. Am. Mineral. 2012, 97, 1060-1069.\n12. Scholtzová, E.; Tunega, D.; Speziale, S. Mechanical Properties of Ettringite and Thaumasite-DFT and\nExperimental Study. Cem. Concr. Res. 2015, 77, 9-15.\n13. Liu, L.; Jaramillo-Botero, A.; Goddard III, W.A.; Sun, H. Development of a ReaxFF Reactive Force\nField for Ettringite and Study of its Mechanical Failure Modes from Reactive Molecular Dynamics. J.\nPhys. Chem. A 2012, 116, 3918-3925.\n14. Hajilar, S.; Shafei, B. Mechanical Failure Mechanisms of Hydrated Products of Tricalcium Aluminate:\nA Reactive Molecular Dynamics Study. Mater. Des. 2016, 90, 165-176.\n15. Van Duin, A.C.T.; Dasgupta, S.; Lorant, F.; Goddard III, W.A. ReaxFF: A Reactive Force Field for\nHydrocarbons. J. Phys. Chem. A 2001, 105, 9396-9409.\n16. Jaramillo-Botero, A.; Cheng, T.; Liu, L.; Goddard III, W.A. First-Principles Based Modeling of Cement\nHydration Kinetics and Dynamics, Nanomechanics for Structural Materials Meeting (DOT award No.\nDTFH61-10-C-00019), DOT Turner-Fairbank Highway Research Center, Virginia, March 6, 2014.\n17. Jaramillo-Botero, A.; Naserifar, S.; Goddard III, W.A. A General Multi-Objective Force Field\nOptimization Framework, with Application to Reactive Force Fields for Silicon Carbide. J. Chem.\nTheory Comput. 2014, 10, 1426-1439.\n18. Edge, R.A.; Taylor, H.F.W. Crystal Structure of Thaumasite, [Ca3Si(OH)6.12H2O](SO4)(CO3). Acta\nCrystallogr., Sect. B: Struct. Sci., Cryst. Eng. Mater. 1971, 27, 594-601.\n19. Effenberger, H.; Kirfel, A.; Will, G.; Zobetz, E. A Further Refinement of the Crystal Structure of\nThaumasite, Ca3Si(OH)6CO3SO412H2O. Neus Jahrbuch fur Mineralogie Monatshefte 1983, 2, 60–68.\n20. Moenke, H. Ein Weiteres Mineral mit Silizium in 6er-Koordination: Thaumasit. Naturwissenschaften\n1964, 51, 239.\n21. Grimmer, A.R.; Wieker, W.; Lampe, F.; Fechner, E.; Peter, R.; Molgedey, G. Hochauflosende 29Si-\nNMR an Festen Silicaten: Anisotropie der Chemischen Verschiebung im Thaumasite. Z. Chem. 1980,\n20, 453.\n22. Stebbins, J.F.; Kanzaki, M. Local Structure and Chemical Shifts for Six-Coordinated Silicon in High-\nPressure Mantle Phases. Sci. 1991, 251, 294–298.\n23. Yang, H.; Prewitt, C.T.; Frost, D.J. Crystal Structure of Dense Hydrous Magnesium Silicate, Phase D.\nAm. Mineral. 1997, 82, 651-654.\n24. Frost, D.J.; Fei, Y. Stability of Phase D at High Pressure and High Temperature. J. Geophys. Res. 1998,\n103, 7463-7474.\n25. Wunder, B.; Jahn, S.; Koch-Muller, M.; Speziale, S. The 3.65 Å Phase, MgSi(OH)6: Structural Insights\nfrom DFT-Calculations and T-Dependent IR Spectroscopy. Am. Mineral. 2012, 97, 1043-1048.\n26. Plimpton, S. Fast Parallel Algorithms for Short-Range Molecular Dynamics. J. Comput. Phys. 1995,\n117, 1-19.\n27. Rappe, A.K.; Goddard III, W.A. Charge Equilibration for Molecular Dynamics Simulations. J. Phys.\nChem. 1991, 95, 3358–3363.\n28. Hajilar, S.; Shafei, B. Nano-Scale Characterization of Elastic Properties of AFt and AFm Phases of\nHydrated Cement Paste, Proceedings of the European Conference on Computational Modeling of\nConcrete Structures (EURO-C), St. Anton am Arlberg, Austria, 2014, 1, 299-306.\n29. Hajilar, S.; Shafei, B. Nano-Scale Investigation of Elastic Properties of Hydrated Cement Paste\nConstituents using Molecular Dynamics Simulations. Comput. Mater. Sci. 2015, 101, 216-226.\n30. Brough, A.R.; Atkinson, A. Micro-Raman Spectroscopy of Thaumasite. Cem. Concr. Res. 2001, 31,\n421-424.\n31. Koh, S.J.A.; Lee, H.P.; Lu, C.; Cheng, Q.H. Molecular Dynamics Simulation of a Solid Platinum\nNanowire under Uniaxial Tensile Strain: Temperature and Strain-Rate Effects. Phys. Rev. B 2005, 72,\n085414.\n32. Pedone, A.; Malavasi, G.; Menziani, M.C.; Segre, U.; Cormack, A.N. Molecular Dynamics Studies of\nStress-Strain Behavior of Silica Glass under a Tensile Load. Chem. Mater. 2008, 20, 4356-4366.\n33. Li, C.; Strachan, A. Molecular Dynamics Predictions of Thermal and Mechanical Properties of\nThermoset Polymer EPON862/DETDA. Polymer 2011, 52, 2920-2928.\n34. Pei, Q.X.; Sha, Z.D.; Zhang, Y.Y.; Zhang, Y.W. Effects of Temperature and Strain Rate on the\nMechanical Properties of Silicene. J. Appl. Phys. 2014, 115, 023519.\n35. Hajilar, S.; Shafei, B. Assessment of Structural, Thermal, and Mechanical Properties of Portlandite\nthrough Molecular Dynamics Simulations. J. Solid State Chem. 2016, 24, 164-174.\n36. Xiao, T.; Ren, Y.; Liao, K. A Kinetic Model for Time-Dependent Fracture of Carbon Nanotubes. Nano\nLett. 2004, 4, 1139-1142.\n37. Wu, X.; Moon, R.J.; Martini, A. Tensile Strength of Iβ Crystalline Cellulose Predicted by Molecular\nDynamics Simulation. Cellulose 2014, 21, 2233-2245.\n38. Zhuang, S.; Lu, J.; Ravichandran, G. Shock Wave Response of a Zirconium-Based Bulk Metallic Glass\nand its Composite. J. Appl. Phys. Lett. 2002, 80, 4522.\n39. Rossi, P. Strain Rate Effects in Concrete Structures: the LCPC Experience. Mater. Struct. 1997, 30, 54-\n62."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Reactive Molecular Dynamics Simulations to Understand Mechanical Response of Thaumasite under Temperature and Strain Rate Effects\n\nShahin Hajilar, Behrouz Shafei, Tao Cheng, and Andres Jaramillo-Botero\n\nThe Journal of Physical Chemistry A Just Accepted Manuscript \nDOI: 10.1021/acs.jpca.7b02824 ","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"ACI-1548562"}],"collection":"CaltechAUTHORS","reviewer":"","local_group":null}