{"title":"Chemical structure-guided design of dynapyrazoles, potent cell-permeable dynein inhibitors with a unique mode of action","uri":"","abstract":"Cytoplasmic dyneins are motor proteins in the AAA+ superfamily that power transport of cellular cargos towards microtubule minus-ends. Recently, ciliobrevins were reported as selective cell-permeable inhibitors of cytoplasmic dyneins. As is often true for first-in-class inhibitors, the use of ciliobrevins has been limited by low potency. Moreover, suboptimal chemical properties, such as the potential to isomerize, have hindered efforts to improve ciliobrevins. Here, we characterized the structure of ciliobrevins and designed conformationally-constrained isosteres. We identified dynapyrazoles, inhibitors more potent than ciliobrevins in vitro, and find that while ciliobrevins inhibit both dynein's microtubule-stimulated and basal ATPase activity, dynapyrazoles block only microtubule-stimulated activity. Single-digit micromolar concentrations of dynapyrazoles block intraflagellar transport in the cilium and lysosome motility in the cytoplasm, processes that depend on cytoplasmic dyneins. Together, our studies suggest that chemical structure-based analyses can lead to inhibitors with distinct modes of inhibition and improved properties.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252579","docid":252579,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261635","fileid":1261635,"datasetid":"document","objectid":252579,"filename":"e25174-download.pdf","mime_type":"application/pdf","hash":"c809b1b1216a878eeb68e9209aefe29d","hash_type":"MD5","filesize":99311240,"mtime":"2017-05-23 14:56:16","url":"http://authors.library.caltech.edu/77646/1/e25174-download.pdf"}],"eprintid":77646,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"e25174-download.pdf","content":"accepted"}],"note":"© 2017 Steinman et al. This article is distributed under the terms of the Creative Commons Attribution License permitting unrestricted use and redistribution provided that the original author and source are credited. \n\nReceived January 20, 2017. Accepted May 17, 2017. Published May 19, 2017. \n\nWe acknowledge Mr. M. Iida (Takeda Pharmaceuticals Company, Limited, Kanagawa, Japan) for valuable assistance with structural analysis of compounds. We thank Dr. Milica Tesic Mark and Dr. Henrik Molina for assistance with mass\nspectrometry. This work was supported by the NIH (R01 GM098579 to T. M. K., R01 GM52111 to V. I. G., R01 GM113100 to J. K. C., and R01 GM089933 to M.V.N.). T. M. K. acknowledges the Robertson Therapeutic Development Fund for support. J. B. S. was supported by NIH grant T32GM007739 to the Weill Cornell/Rockefeller/Sloan-Kettering Tri-Institutional MD-PhD Program. R. M. M. was supported by a Damon Runyon Cancer Research Foundation Postdoctoral Fellowship (DRG-2222-15). A. P. C. was supported by the Medical Research Council, UK (MC_UP_A025_1011) and a Wellcome Trust New Investigator Award (WT100387). The WCMC NMR facility was supported by NIH instrumentation grant S10 OD016320. The Proteomics Resource Center at The Rockefeller University was supported by Leona M. and Harry B. Helmsley Charitable Trust for mass spectrometer instrumentation. \n\nThe funders had no role in study design, data collection and interpretation, or the decision to submit the work for publication.","id":77646,"rev_number":10,"userid":18,"eprint_dir":"disk0/00/07/76/46","datestamp":"2017-05-23 18:26:06","lastmod":"2017-05-23 18:26:06","status_changed":"2017-05-23 18:26:06","type":"article","metadata_visibility":"show","creators":[{"given":"Jonathan Baruch","family":"Steinman","id":"Steinman-J-B","orcid":""},{"given":"Cristina C.","family":"Santarossa","id":"Santarossa-C-C","orcid":""},{"given":"Rand M.","family":"Miller","id":"Miller-R-M","orcid":""},{"given":"Lola S.","family":"Yu","id":"Yu-Lola-S","orcid":""},{"given":"Anna S.","family":"Serpinskaya","id":"Serpinskaya-A-S","orcid":""},{"given":"Hideki","family":"Furukawa","id":"Furukawa-Hideki","orcid":""},{"given":"Sachie","family":"Morimoto","id":"Morimoto-Sachie","orcid":""},{"given":"Yuta","family":"Tanaka","id":"Tanaka-Yuta","orcid":""},{"given":"Mitsuyoshi","family":"Nishitani","id":"Nishitani-Mitsuyoshi","orcid":""},{"given":"Moriteru","family":"Asano","id":"Asano-Moriteru","orcid":""},{"given":"Ruta","family":"Zalyte","id":"Zalyte-R","orcid":""},{"given":"Alison E.","family":"Ondrus","id":"Ondrus-A-E","orcid":""},{"given":"Alex G.","family":"Johnson","id":"Johnson-A-G","orcid":""},{"given":"Fan","family":"Ye","id":"Ye-Fan","orcid":""},{"given":"Maxence V.","family":"Nachury","id":"Nachury-M-V","orcid":""},{"given":"Yoshiyuki","family":"Fukase","id":"Fukase-Yoshiyuki","orcid":""},{"given":"Kazuyoshi","family":"Aso","id":"Aso-Kazuyoshi","orcid":""},{"given":"Michael A.","family":"Foley","id":"Foley-M-A","orcid":""},{"given":"Vladimir I.","family":"Gelfand","id":"Gelfand-V-I","orcid":""},{"given":"James K.","family":"Chen","id":"Chen-James-K","orcid":""},{"given":"Andrew P.","family":"Carter","id":"Carter-A-P","orcid":""},{"given":"Tarun M.","family":"Kapoor","id":"Kapoor-T-M","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-19","date_type":"inpress","publication":"eLife","volume":"6","number":"","pagerange":"Art. No. e25174","id_number":"CaltechAUTHORS:20170523-075555486","refereed":true,"issn":"2050-084X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170523-075555486","related_url":[{"url":"http://dx.doi.org/10.7554/eLife.25174","type":"doi","description":"Article"},{"url":"https://elifesciences.org/content/6/e25174","type":"pub","description":"Article"}],"referencetext":["1. Erzberger JP, Berger JM. Evolutionary relationships and structural mechanisms of\n1473 AAA+ proteins. Annual review of biophysics and biomolecular structure. 2006;35:93-\n1474 114.\n1475 2. Human AAA+ protein count was obtained as follows: in supfam.org (reference 3),\n1476 search was performed for \"Extended AAA-ATPase domain\" and refined for proteins\n1477 within the human genome.\n1478 3. Hanson PI, Whiteheart SW. AAA+ proteins: have engine, will work. Nature\n1479 reviews Molecular cell biology. 2005;6(7):519-29.\n1480 4. Baker TA, Sauer RT. ClpXP, an ATP-powered unfolding and protein-degradation\n1481 machine. Biochimica et biophysica acta. 2012;1823(1):15-28.\n1482 5. Lampson MA, Kapoor TM. Unraveling cell division mechanisms with small1483\nmolecule inhibitors. Nature chemical biology. 2006;2(1):19-27.\n1484 6. Deshaies RJ. Proteotoxic crisis, the ubiquitin-proteasome system, and cancer\n1485 therapy. BMC biology. 2014;12:94.\n1486 7. Firestone AJ, Weinger JS, Maldonado M, Barlan K, Langston LD, O'Donnell M,\n1487 Gelfand VI, Kapoor TM, Chen JK. Small-molecule inhibitors of the AAA+ ATPase\n1488 motor cytoplasmic dynein. Nature. 2012;484(7392):125-9.\n1489 8. Vale RD. The molecular motor toolbox for intracellular transport. Cell.\n1490 2003;112(4):467-80.\n1491 9. Allan VJ. Cytoplasmic dynein. Biochemical Society transactions.\n1492 2011;39(5):1169-78.\n1493 10. Vallee RB, Williams JC, Varma D, Barnhart LE. Dynein: An ancient motor\n1494 protein involved in multiple modes of transport. Journal of neurobiology.\n1495 2004;58(2):189-200.\n1496 11. Hou Y, Witman GB. Dynein and intraflagellar transport. Experimental cell\n1497 research. 2015;334(1):26-34.\n1498 12. Ishikawa H, Marshall WF. Ciliogenesis: building the cell's antenna. Nature\n1499 reviews Molecular cell biology. 2011;12(4):222-34.\n13. Goetz SC, Anderson KV. The primary cilium: a signalling centre during\n1501 vertebrate development. Nature reviews Genetics. 2010;11(5):331-44.\n1502 14. Kobayashi T, Martensen T, Nath J, Flavin M. Inhibition of dynein ATPase by\n1503 vanadate, and its possible use as a probe for the role of dynein in cytoplasmic motility.\n1504 Biochemical and biophysical research communications. 1978;81(4):1313-8.\n1505 15. Gibbons IR, Cosson MP, Evans JA, Gibbons BH, Houck B, Martinson KH, Sale\n1506 WS, Tang WJ. Potent inhibition of dynein adenosinetriphosphatase and of the motility of\n1507 cilia and sperm flagella by vanadate. Proceedings of the National Academy of Sciences\n1508 of the United States of America. 1978;75(5):2220-4.\n1509 16. Bouchard P, Penningroth SM, Cheung A, Gagnon C, Bardin CW. erythro-9-[3-(2-\n1510 Hydroxynonyl)]adenine is an inhibitor of sperm motility that blocks dynein ATPase and\n1511 protein carboxylmethylase activities. Proceedings of the National Academy of Sciences\n1512 of the United States of America. 1981;78(2):1033-6.\n1513 17. Hyman JM, Firestone AJ, Heine VM, Zhao Y, Ocasio CA, Han K, Sun M, Rack\n1514 PG, Sinha S, Wu JJ, Solow-Cordero DE, Jiang J, Rowitch DH, Chen JK. Small-molecule\n1515 inhibitors reveal multiple strategies for Hedgehog pathway blockade. Proceedings of the\n1516 National Academy of Sciences of the United States of America. 2009;106(33):14132-7.\n1517 18. Sainath R, Gallo G. The dynein inhibitor Ciliobrevin D inhibits the bidirectional\n1518 transport of organelles along sensory axons and impairs NGF-mediated regulation of\n1519 growth cones and axon branches. Developmental neurobiology. 2015;75(7):757-77.\n1520 19. Liu X, Kapoor TM, Chen JK, Huse M. Diacylglycerol promotes centrosome\n1521 polarization in T cells via reciprocal localization of dynein and myosin II. Proceedings of\n1522 the National Academy of Sciences of the United States of America. 2013;110(29):11976-\n1523 81.\n1524 20. Yi J, Wu X, Chung AH, Chen JK, Kapoor TM, Hammer JA. Centrosome\n1525 repositioning in T cells is biphasic and driven by microtubule end-on capture-shrinkage.\n1526 The Journal of cell biology. 2013;202(5):779-92.\n1527 21. Ye F, Breslow DK, Koslover EF, Spakowitz AJ, Nelson WJ, Nachury MV. Single\n1528 molecule imaging reveals a major role for diffusion in the exploration of ciliary space by\n1529 signaling receptors. eLife. 2013;2:e00654.\n1530 22. Roossien DH, Miller KE, Gallo G. Ciliobrevins as tools for studying dynein\n1531 motor function. Frontiers in cellular neuroscience. 2015;9:252.\n1532 23. Schmidt H. Dynein motors: How AAA+ ring opening and closing coordinates\n1533 microtubule binding and linker movement. BioEssays : news and reviews in molecular,\n1534 cellular and developmental biology. 2015;37(5):532-43.\n1535 24. Iyer LM, Leipe DD, Koonin EV, Aravind L. Evolutionary history and higher\n1536 order classification of AAA+ ATPases. Journal of structural biology. 2004;146(1-2):11-\n1537 31.\n1538 25. Carter AP. Crystal clear insights into how the dynein motor moves. Journal of cell\n1539 science. 2013;126(Pt 3):705-13.\n1540 26. Bhabha G, Cheng HC, Zhang N, Moeller A, Liao M, Speir JA, Cheng Y, Vale RD.\n1541 Allosteric communication in the dynein motor domain. Cell. 2014;159(4):857-68.\n1542 27. DeWitt MA, Cypranowska CA, Cleary FB, Belyy V, Yildiz A. The AAA3\n1543 domain of cytoplasmic dynein acts as a switch to facilitate microtubule release. Nature\n1544 structural \u0026 molecular biology. 2015;22(1):73-80.\n28. Nicholas MP, Berger F, Rao L, Brenner S, Cho C, Gennerich A. Cytoplasmic\n1546 dynein regulates its attachment to microtubules via nucleotide state-switched\n1547 mechanosensing at multiple AAA domains. Proceedings of the National Academy of\n1548 Sciences of the United States of America. 2015;112(20):6371-6.\n1549 29. See SK, Hoogendoorn S, Chung AH, Ye F, Steinman JB, Sakata-Kato T, Miller\n1550 RM, Cupido T, Zalyte R, Carter AP, Nachury MV, Kapoor TM, Chen JK. Cytoplasmic\n1551 Dynein Antagonists with Improved Potency and Isoform Selectivity. ACS chemical\n1552 biology. 2016;11(1):53-60.\n1553 30. Milokhov DS, Khilya OV, Turov AV, Zubatyuk RI, Palamarchuk GV, Shishkin\n1554 OV, Chekotilo AA, Volovenko YM. Reactions of 2-(2-hetaryl)-2-(tetrahydrofuran-2-\n1555 ylidene)acetonitriles with tertiary amines. Chemistry of Heterocyclic Compounds.\n1556 2013;48(12):1761-9.\n1557 31. Süsse M, Johne S. Synthese von Pyrrolo[1,2-a]chinazolinonen, Indolo[1,2-\n1558 a]chinazolinonen, Pyrrolo[1,2-a]thieno[3,2-e]pyrimidinonen, Benzothieno[3,2-e]-\n1559 pyrrolo[1,2-a]pyrimidinonen und 6H-Cyclohepta[4,5]thieno-[3,2-e]pyrrolo[1,2-\n1560 a]pyrimidinonen. Journal fuer Praktische Chemie. 1981;323(4):647-53.\n1561 32. Orvieto F, Branca D, Giomini C, Jones P, Koch U, Ontoria JM, Palumbi MC,\n1562 Rowley M, Toniatti C, Muraglia E. Identification of substituted pyrazolo[1,5-\n1563 a]quinazolin-5(4H)-one as potent poly(ADP-ribose)polymerase-1 (PARP-1) inhibitors.\n1564 Bioorganic \u0026 medicinal chemistry letters. 2009;19(15):4196-200.\n1565 33. Schmidt H, Zalyte R, Urnavicius L, Carter AP. Structure of human cytoplasmic\n1566 dynein-2 primed for its power stroke. Nature. 2015;518(7539):435-8.\n1567 34. Taipale J, Chen JK, Cooper MK, Wang B, Mann RK, Milenkovic L, Scott MP,\n1568 Beachy PA. Effects of oncogenic mutations in Smoothened and Patched can be reversed\n1569 by cyclopamine. Nature. 2000;406(6799):1005-9.\n1570 35. Chen JK, Taipale J, Young KE, Maiti T, Beachy PA. Small molecule modulation\n1571 of Smoothened activity. Proceedings of the National Academy of Sciences of the United\n1572 States of America. 2002;99(22):14071-6.\n1573 36. Sharpe HJ, Wang W, Hannoush RN, de Sauvage FJ. Regulation of the\n1574 oncoprotein Smoothened by small molecules. Nature chemical biology. 2015;11(4):246-\n1575 55.\n1576 37. He M, Agbu S, Anderson KV. Microtubule Motors Drive Hedgehog Signaling in\n1577 Primary Cilia. Trends in cell biology. 2017;27(2):110-25.\n1578 38. Yang TT, Su J, Wang WJ, Craige B, Witman GB, Tsou MF, Liao JC.\n1579 Superresolution Pattern Recognition Reveals the Architectural Map of the Ciliary\n1580 Transition Zone. Scientific reports. 2015;5:14096.\n1581 39. Mangeol P, Prevo B, Peterman EJ. KymographClear and KymographDirect: two\n1582 tools for the automated quantitative analysis of molecular and cellular dynamics using\n1583 kymographs. Molecular biology of the cell. 2016;27(12):1948-57.\n1584 40. Engel BD, Ishikawa H, Wemmer KA, Geimer S, Wakabayashi K, Hirono M,\n1585 Craige B, Pazour GJ, Witman GB, Kamiya R, Marshall WF. The role of retrograde\n1586 intraflagellar transport in flagellar assembly, maintenance, and function. The Journal of\n1587 cell biology. 2012;199(1):151-67.\n1588 41. Yamada M, Toba S, Yoshida Y, Haratani K, Mori D, Yano Y, Mimori-Kiyosue Y,\n1589 Nakamura T, Itoh K, Fushiki S, Setou M, Wynshaw-Boris A, Torisawa T, Toyoshima YY, Hirotsune S. LIS1 and NDEL1 coordinate the plus-end-directed transport of\n1591 cytoplasmic dynein. The EMBO journal. 2008;27(19):2471-83.\n1592 42. Qi Y, Wang JK, McMillian M, Chikaraishi DM. Characterization of a CNS cell\n1593 line, CAD, in which morphological differentiation is initiated by serum deprivation. The\n1594 Journal of neuroscience : the official journal of the Society for Neuroscience.\n1595 1997;17(4):1217-25.\n1596 43. Pu J, Guardia CM, Keren-Kaplan T, Bonifacino JS. Mechanisms and functions of\n1597 lysosome positioning. 2016;129(23):4329-39.\n1598 44. Barlan K, Rossow MJ, Gelfand VI. The journey of the organelle: teamwork and\n1599 regulation in intracellular transport. Current opinion in cell biology. 2013;25(4):483-8.\n1600 45. Shpetner HS, Paschal BM, Vallee RB. Characterization of the microtubule1601\nactivated ATPase of brain cytoplasmic dynein (MAP 1C). The Journal of cell biology.\n1602 1988;107(3):1001-9.\n1603 46. Ori-McKenney KM, Xu J, Gross SP, Vallee RB. A cytoplasmic dynein tail\n1604 mutation impairs motor processivity. Nature cell biology. 2010;12(12):1228-34.\n1605 47. Nicholas MP, Hook P, Brenner S, Wynne CL, Vallee RB, Gennerich A. Control\n1606 of cytoplasmic dynein force production and processivity by its C-terminal domain.\n1607 Nature communications. 2015;6:6206.\n1608 48. Lee-Eiford A, Ow RA, Gibbons IR. Specific cleavage of dynein heavy chains by\n1609 ultraviolet irradiation in the presence of ATP and vanadate. The Journal of biological\n1610 chemistry. 1986;261(5):2337-42.\n1611 49. Kon T, Nishiura M, Ohkura R, Toyoshima YY, Sutoh K. Distinct functions of\n1612 nucleotide-binding/hydrolysis sites in the four AAA modules of cytoplasmic dynein.\n1613 Biochemistry. 2004;43(35):11266-74.\n1614 50. Gibbons BH, Gibbons IR. Vanadate-sensitized cleavage of dynein heavy chains\n1615 by 365-nm irradiation of demembranated sperm flagella and its effect on the flagellar\n1616 motility. The Journal of biological chemistry. 1987;262(17):8354-9.\n1617 51. Silvanovich A, Li MG, Serr M, Mische S, Hays TS. The third P-loop domain in\n1618 cytoplasmic dynein heavy chain is essential for dynein motor function and ATP-sensitive\n1619 microtubule binding. Molecular biology of the cell. 2003;14(4):1355-65.\n1620 52. Serafimova IM, Pufall MA, Krishnan S, Duda K, Cohen MS, Maglathlin RL,\n1621 McFarland JM, Miller RM, Frodin M, Taunton J. Reversible targeting of noncatalytic\n1622 cysteines with chemically tuned electrophiles. Nature chemical biology. 2012;8(5):471-6.\n1623 53. Pillai AD, Pain M, Solomon T, Bokhari AA, Desai SA. A cell-based high1624\nthroughput screen validates the plasmodial surface anion channel as an antimalarial target.\n1625 Molecular pharmacology. 2010;77(5):724-33.\n1626 54. Waterman-Storer CM, Karki SB, Kuznetsov SA, Tabb JS, Weiss DG, Langford\n1627 GM, Holzbaur EL. The interaction between cytoplasmic dynein and dynactin is required\n1628 for fast axonal transport. Proceedings of the National Academy of Sciences of the United\n1629 States of America. 1997;94(22):12180-5.\n1630 55. Gross SP, Welte MA, Block SM, Wieschaus EF. Coordination of opposite1631\npolarity microtubule motors. The Journal of cell biology. 2002;156(4):715-24.\n1632 56. Martin M, Iyadurai SJ, Gassman A, Gindhart JG, Jr., Hays TS, Saxton WM.\n1633 Cytoplasmic dynein, the dynactin complex, and kinesin are interdependent and essential\n1634 for fast axonal transport. Molecular biology of the cell. 1999;10(11):3717-28.\n57. Ally S, Larson AG, Barlan K, Rice SE, Gelfand VI. Opposite-polarity motors\n1636 activate one another to trigger cargo transport in live cells. The Journal of cell biology.\n1637 2009;187(7):1071-82.\n1638 58. Prevo B, Scholey JM, Peterman EJ. Intraflagellar Transport: Mechanisms of\n1639 Motor Action, Cooperation and Cargo Delivery. The FEBS journal. 2017.\n1640 59. Ross JL, Wallace K, Shuman H, Goldman YE, Holzbaur EL. Processive\n1641 bidirectional motion of dynein-dynactin complexes in vitro. Nature cell biology.\n1642 2006;8(6):562-70.\n1643 60. Imamula K, Kon T, Ohkura R, Sutoh K. The coordination of cyclic microtubule\n1644 association/dissociation and tail swing of cytoplasmic dynein. Proceedings of the\n1645 National Academy of Sciences of the United States of America. 2007;104(41):16134-9.\n1646 61. Babine RE, Bender SL. Molecular Recognition of Protein-Ligand Complexes:\n1647 Applications to Drug Design. Chemical reviews. 1997;97(5):1359-472.\n1648 62. Bussenius J, Anand NK, Blazey CM, Bowles OJ, Bannen LC, Chan DS, Chen B,\n1649 Co EW, Costanzo S, DeFina SC, Dubenko L, Engst S, Franzini M, Huang P,\n1650 Jammalamadaka V, Khoury RG, Kim MH, Klein RR, Laird D, Le DT, Mac MB,\n1651 Matthews DJ, Markby D, Miller N, Nuss JM, Parks JJ, Tsang TH, Tsuhako AL, Wang Y,\n1652 Xu W, Rice KD. Design and evaluation of a series of pyrazolopyrimidines as p70S6K\n1653 inhibitors. Bioorganic \u0026 medicinal chemistry letters. 2012;22(6):2283-6.\n1654 63. Burla MC, Caliandro R, Camalli M, Carrozzini B, Cascarano GL, De Caro L,\n1655 Giacovazzo C, Polidori G, Siliqi D, Spagna R. IL MILIONE: a suite of computer\n1656 programs for crystal structure solution of proteins. Journal of Applied Crystallography.\n1657 2007;40(3):609-13.\n1658 64. Sheldrick GM. A short history of SHELX. Acta crystallographica Section A,\n1659 Foundations of crystallography. 2008;64(Pt 1):112-22.\n1660 65. Spek AL. Structure validation in chemical crystallography. Acta crystallographica\n1661 Section D, Biological crystallography. 2009;65(Pt 2):148-55.\n1662 66. Schindelin J, Arganda-Carreras I, Frise E, Kaynig V, Longair M, Pietzsch T,\n1663 Preibisch S, Rueden C, Saalfeld S, Schmid B, Tinevez JY, White DJ, Hartenstein V,\n1664 Eliceiri K, Tomancak P, Cardona A. Fiji: an open-source platform for biological-image\n1665 analysis. Nature methods. 2012;9(7):676-82.\n1666 67. Peterson AC, Russell JD, Bailey DJ, Westphall MS, Coon JJ. Parallel reaction\n1667 monitoring for high resolution and high mass accuracy quantitative, targeted proteomics.\n1668 Molecular \u0026 cellular proteomics : MCP. 2012;11(11):1475-88.\n1669 68. MacLean B, Tomazela DM, Shulman N, Chambers M, Finney GL, Frewen B,\n1670 Kern R, Tabb DL, Liebler DC, MacCoss MJ. Skyline: an open source document editor\n1671 for creating and analyzing targeted proteomics experiments. Bioinformatics (Oxford,\n1672 England). 2010;26(7):966-8.\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":"R01 GM098579"},{"agency":"NIH","grant_number":"R01 GM52111"},{"agency":"NIH","grant_number":"R01 GM113100"},{"agency":"NIH","grant_number":"R01 GM089933"},{"agency":"Robertson Therapeutic Development Fund","grant_number":""},{"agency":"NIH Predoctoral Fellowship","grant_number":"T32GM007739"},{"agency":"Damon Runyon Cancer Research Foundation","grant_number":"DRG-2222-15"},{"agency":"Medical Research Council (UK)","grant_number":"MC_UP_A025_1011"},{"agency":"Wellcome Trust","grant_number":"WT100387"},{"agency":"NIH","grant_number":"S10 OD016320"},{"agency":"Leona M. and Harry B. Helmsley Charitable Trust","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}