{"title":"Atomic-scale Structural and Chemical Characterization of Hexagonal Boron Nitride Layers Synthesized at the Wafer-Scale with Monolayer Thickness Control","uri":"","abstract":"Hexagonal boron nitride (h-BN) is a promising two-dimensional insulator with a large band gap and low density of charged impurities that is isostructural and isoelectronic with graphene. Here we report the chemical and atomic-scale structure of CVD-grown wafer-scale (~25 cm2) h-BN sheets ranging in thickness from 1-20 monolayers. Atomic-scale images of h-BN on Au and graphene/Au substrates obtained by scanning tunneling microscopy (STM) reveal high h-BN crystalline quality in monolayer samples. Further characterization of 1-20 monolayer samples indicates uniform thickness for wafer-scale areas; this thickness control is a result of precise control of the precursor flow rate, deposition temperature and pressure. Raman and infrared spectroscopy indicate the presence of B-N bonds and reveal a linear dependence of thickness with growth time. X-ray photoelectron spectroscopy (XPS) shows the film stoichiometry, and the B/N atom ratio in our films is 1 ± 0.6% across the range of thicknesses. Electrical current transport in metal/insulator/metal (Au/h-BN/Au) heterostructures indicates that our CVD-grown h-BN films can act as excellent tunnel barriers with a high hard-breakdown field strength. Our results suggest that large-area h-BN films are structurally, chemically and electronically uniform over the wafer scale, opening the door to pervasive application as a dielectric in layered nanoelectronic and nanophotonic heterostructures.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252588","docid":252588,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261686","fileid":1261686,"datasetid":"document","objectid":252588,"filename":"acs%2Echemmater%2E7b00183.pdf","mime_type":"application/pdf","hash":"ed1b95d247bd13a504ca1befe94f2156","hash_type":"MD5","filesize":1495362,"mtime":"2017-05-23 16:03:25","url":"http://authors.library.caltech.edu/77648/1/acs%252Echemmater%252E7b00183.pdf"}],"eprintid":77648,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"acs%2Echemmater%2E7b00183.pdf","content":"accepted"}],"note":"© 2017 American Chemical Society. \n\nPublication Date (Web): May 22, 2017. \n\nThe authors gratefully acknowledge support from the Department of Energy, Office of Science under Grant DE-FG02-07ER46405 (W.H.L. and H.A.A.) and for use of facilities of the DOE “Light-Material Interactions in Energy Conversion ” Energy Frontier Research Center (DE-SC0001293). D.J. and M.C.S. acknowledge additional support from Resnick Sustainability Institute Graduate and Postdoctoral Fellowships whereas V.W.B. acknowledge additional support from the Kavli Nanoscience Postdoctoral Fellowship. The authors thank Prof. George Rossman for access to the Raman and FTIR tools. The authors thank I-Te Lu for the discussion about the moiré pattern calculation. The authors acknowledge support from the Beckman Institute of the California Institute of Technology to the Molecular Materials Research Center. \n\nThe authors declare no competing financial interests.","id":77648,"rev_number":7,"userid":18,"eprint_dir":"disk0/00/07/76/48","datestamp":"2017-05-23 18:22:20","lastmod":"2017-06-02 23:07:03","status_changed":"2017-05-23 18:22:20","type":"article","metadata_visibility":"show","creators":[{"given":"Wei-Hsiang","family":"Lin","id":"Lin-Wei-Hsiang","orcid":""},{"given":"Victor W.","family":"Brar","id":"Brar-V-W","orcid":""},{"given":"Deep","family":"Jariwala","id":"Jariwala-D","orcid":""},{"given":"Michelle C.","family":"Sherrott","id":"Sherrott-M-C","orcid":"0000-0002-7503-9714"},{"given":"Wei-Shiuan","family":"Tseng","id":"Tseng-Wei-Shiuan","orcid":""},{"given":"Chih-I","family":"Wu","id":"Wu-Chih-I","orcid":""},{"given":"Nai-Chang","family":"Yeh","id":"Yeh-N-C","orcid":""},{"given":"Harry A.","family":"Atwater","id":"Atwater-H-A","orcid":"0000-0001-9435-0201"}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-22","date_type":"inpress","publication":"Chemistry of Materials","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170523-090321139","refereed":true,"issn":"0897-4756","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170523-090321139","related_url":[{"url":"http://dx.doi.org/10.1021/acs.chemmater.7b00183","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/acs.chemmater.7b00183","type":"pub","description":"Article"}],"referencetext":["1. Dean, C. R.; Young, A. F.; Meric, I.; Lee, C.; Wang, L.; Sorgenfrei, S.; Watanabe,\nK.; Taniguchi, T.; Kim, P.; Shepard, K. L.; Hone, J., Boron nitride substrates for\nhigh-quality graphene electronics. Nat Nanotechnol 2010, 5, 722-726.\n2. Kim, K. K.; Hsu, A.; Jia, X. T.; Kim, S. M.; Shi, Y. M.; Dresselhaus, M.; Palacios,\nT.; Kong, J., Synthesis and Characterization of Hexagonal Boron Nitride Film as a\nDielectric Layer for Graphene Devices. Acs Nano 2012, 6, 8583-8590.\n3. Zhang, K.; Yap, F. L.; Li, K.; Ng, C. T.; Li, L. J.; Loh, K. P., Large Scale\nGraphene/Hexagonal Boron Nitride Heterostructure for Tunable Plasmonics. Adv\nFunct Mater 2014, 24, 731-738.\n4. Novoselov, K. S.; Geim, A. K.; Morozov, S. V.; Jiang, D.; Katsnelson, M. I.;\nGrigorieva, I. V.; Dubonos, S. V.; Firsov, A. A., Two-dimensional gas of massless\nDirac fermions in graphene. Nature 2005, 438, 197-200.\n5. Levendorf, M. P.; Kim, C. J.; Brown, L.; Huang, P. Y.; Havener, R. W.; Muller, D.\nA.; Park, J., Graphene and boron nitride lateral heterostructures for atomically thin\ncircuitry. Nature 2012, 488, 627-632.\n6. Kim, S. M.; Hsu, A.; Park, M. H.; Chae, S. H.; Yun, S. J.; Lee, J. S.; Cho, D. H.;\nFang, W. J.; Lee, C.; Palacios, T.; Dresselhaus, M.; Kim, K. K.; Lee, Y. H.; Kong, J.,\nSynthesis of large-area multilayer hexagonal boron nitride for high material\nperformance. Nat Commun 2015, 6, 8662\n7. Geim, A. K.; Novoselov, K. S., The rise of graphene. Nat Mater 2007, 6 ,\n183-191.\n8. Radisavljevic, B.; Radenovic, A.; Brivio, J.; Giacometti, V.; Kis, A., Single-layer\nMoS2 transistors. Nat Nanotechnol 2011, 6, 147-150.\n9. Fu, L.; Sun, Y. Y.; Wu, N.; Mendes, R. G.; Chen, L. F.; Xu, Z.; Zhang, T.;\nRummeli, M. H.; Rellinghaus, B.; Pohl, D.; Zhuang, L.; Fu, L., Direct Growth of\nMoS2/h-BN Heterostructures via a Sulfide-Resistant Alloy. Acs Nano 2016, 10,\n2063-2070.\n10. Doganov, R. A.; Koenig, S. P.; Yeo, Y. T.; Watanabe, K.; Taniguchi, T.; Ozyilmaz,\nB., Transport properties of ultrathin black phosphorus on hexagonal boron nitride.\nAppl Phys Lett 2015, 106, 083505.\n11. Kim, C. J.; Brown, L.; Graham, M. W.; Hovden, R.; Havener, R. W.; McEuen, P.\nL.; Muller, D. A.; Park, J., Stacking Order Dependent Second Harmonic Generation\nand Topological Defects in h-BN Bilayers. Nano Lett 2013, 13, 5660-5665.\n12. Ci, L.; Song, L.; Jin, C. H.; Jariwala, D.; Wu, D. X.; Li, Y. J.; Srivastava, A.; Wang, Z. F.; Storr, K.; Balicas, L.; Liu, F.; Ajayan, P. M., Atomic layers of hybridized\nboron nitride and graphene domains. Nat Mater 2010, 9, 430-435.\n13. Zhu, J.; Kang, J.; Kang, J. M.; Jariwala, D.; Wood, J. D.; Seo, J. W. T.; Chen, K.\nS.; Marks, T. J.; Hersam, M. C., Solution-Processed Dielectrics Based on\nThickness-Sorted Two-Dimensional Hexagonal Boron Nitride Nanosheets. Nano Lett\n2015, 15, 7029-7036.\n14. Song, L.; Ci, L. J.; Lu, H.; Sorokin, P. B.; Jin, C. H.; Ni, J.; Kvashnin, A. G.;\nKvashnin, D. G.; Lou, J.; Yakobson, B. I.; Ajayan, P. M., Large Scale Growth and\nCharacterization of Atomic Hexagonal Boron Nitride Layers. Nano Lett 2010, 10,\n3209-3215.\n15. Shi, Y. M.; Hamsen, C.; Jia, X. T.; Kim, K. K.; Reina, A.; Hofmann, M.; Hsu, A.\nL.; Zhang, K.; Li, H. N.; Juang, Z. Y.; Dresselhaus, M. S.; Li, L. J.; Kong, J.,\nSynthesis of Few-Layer Hexagonal Boron Nitride Thin Film by Chemical Vapor\nDeposition. Nano Lett 2010, 10, 4134-4139.\n16. Liu, Z.; Song, L.; Zhao, S. Z.; Huang, J. Q.; Ma, L. L.; Zhang, J. N.; Lou, J.;\nAjayan, P. M., Direct Growth of Graphene/Hexagonal Boron Nitride Stacked Layers.\nNano Lett 2011, 11, 2032-2037.\n17. Gorbachev, R. V.; Riaz, I.; Nair, R. R.; Jalil, R.; Britnell, L.; Belle, B. D.; Hill, E.\nW.; Novoselov, K. S.; Watanabe, K.; Taniguchi, T.; Geim, A. K.; Blake, P., Hunting\nfor Monolayer Boron Nitride: Optical and Raman Signatures. Small 2011, 7, 465-468.\n18. Britnell, L.; Gorbachev, R. V.; Jalil, R.; Belle, B. D.; Schedin, F.; Katsnelson, M.\nI.; Eaves, L.; Morozov, S. V.; Mayorov, A. S.; Peres, N. M. R.; Neto, A. H. C.; Leist,\nJ.; Geim, A. K.; Ponomarenko, L. A.; Novoselov, K. S., Electron Tunneling through\nUltrathin Boron Nitride Crystalline Barriers. Nano Lett 2012, 12, 1707-1710.\n19. Lee, K. H.; Shin, H. J.; Lee, J.; Lee, I. Y.; Kim, G. H.; Choi, J. Y.; Kim, S. W.,\nLarge-Scale Synthesis of High-Quality Hexagonal Boron Nitride Nanosheets for\nLarge-Area Graphene Electronics. Nano Lett 2012, 12, 714-718.\n20. Guo, N.; Wei, J. Q.; Fan, L. L.; Jia, Y.; Liang, D. Y.; Zhu, H. W.; Wang, K. L.;\nWu, D. H., Controllable growth of triangular hexagonal boron nitride domains on\ncopper foils by an improved low-pressure chemical vapor deposition method.\nNanotechnology 2012, 23, 415605.\n21. Ismach, A.; Chou, H.; Ferrer, D. A.; Wu, Y. P.; McDonnell, S.; Floresca, H. C.;\nCovacevich, A.; Pope, C.; Piner, R.; Kim, M. J.; Wallace, R. M.; Colombo, L.; Ruoff,\nR. S., Toward the Controlled Synthesis of Hexagonal Boron Nitride Films. Acs Nano\n2012, 6, 6378-6385. \n22. Wang, M.; Jang, S. K.; Jang, W. J.; Kim, M.; Park, S. Y.; Kim, S. W.; Kahng, S.\nJ.; Choi, J. Y.; Ruoff, R. S.; Song, Y. J.; Lee, S., A Platform for Large-Scale Graphene\nElectronics - CVD Growth of Single-Layer Graphene on CVD-Grown Hexagonal\nBoron Nitride. Adv Mater 2013, 25, 2746-2752.\n23. Gibb, A. L.; Alem, N.; Chen, J. H.; Erickson, K. J.; Ciston, J.; Gautam, A.; Linck,\nM.; Zettl, A., Atomic Resolution Imaging of Grain Boundary Defects in Monolayer\nChemical Vapor Deposition-Grown Hexagonal Boron Nitride. J Am Chem Soc 2013,\n135, 6758-6761.\n24. Kim, G.; Jang, A. R.; Jeong, H. Y.; Lee, Z.; Kang, D. J.; Shin, H. S., Growth of\nHigh-Crystalline, Single-Layer Hexagonal Boron Nitride on Recyclable Platinum Foil.\nNano Lett 2013, 13, 1834-1839.\n25. Liu, Z.; Gong, Y. J.; Zhou, W.; Ma, L. L.; Yu, J. J.; Idrobo, J. C.; Jung, J.;\nMacDonald, A. H.; Vajtai, R.; Lou, J.; Ajayan, P. M., Ultrathin high-temperature\noxidation-resistant coatings of hexagonal boron nitride. Nat Commun 2013, 4, 2541.\n26. Tay, R. Y.; Griep, M. H.; Mallick, G.; Tsang, S. H.; Singh, R. S.; Tumlin, T.; Teo,\nE. H. T.; Karna, S. P., Growth of Large Single-Crystalline Two-Dimensional Boron\nNitride Hexagons on Electropolished Copper. Nano Lett 2014, 14, 839-846.\n27. Park, J. H.; Park, J. C.; Yun, S. J.; Kim, H.; Luong, D. H.; Kim, S. M.; Choi, S.\nH.; Yang, W.; Kong, J.; Kim, K. K.; Lee, Y. H., Large-Area Monolayer Hexagonal\nBoron Nitride on Pt Foil. Acs Nano 2014, 8, 8520-8528.\n28. Feigelson, B. N.; Bermudez, V. M.; Hite, J. K.; Robinson, Z. R.; Wheeler, V. D.;\nSridhara, K.; Hernandez, S. C., Growth and spectroscopic characterization of\nmonolayer and few-layer hexagonal boron nitride on metal substrates. Nanoscale\n2015, 7 , 3694-3702.\n29. Wu, Q.; Jang, S. K.; Park, S.; Jung, S. J.; Suh, H.; Lee, Y. H.; Lee, S.; Song, Y. J.,\nIn situ synthesis of a large area boron nitride/graphene monolayer/boron nitride film\nby chemical vapor deposition. Nanoscale 2015, 7, 7574-7579.\n30. Stehle, Y.; Meyer, H. M.; Unocic, R. R.; Kidder, M.; Polizos, G.; Datskos, P. G.;\nJackson, R.; Smirnov, S. N.; Vlassiouk, I. V., Synthesis of Hexagonal Boron Nitride\nMono layer: Control of Nucleation and Crystal Morphology. Chem Mater 2015, 27,\n8041-8047.\n31. Khan, M. H.; Huang, Z. G.; Xiao, F.; Casillas, G.; Chen, Z. X.; Molino, P. J.; Liu,\nH. K., Synthesis of Large and Few Atomic Layers of Hexagonal Boron Nitride on\nMelted Copper. Scientific Reports 2015, 5, 7743\n32. Wen, Y.; Shang, X. Z.; Dong, J.; Xu, K.; He, J.; Jiang, C., Ultraclean and large-area monolayer hexagonal boron nitride on Cu foil using chemical vapor\ndeposition. Nanotechnology 2015, 26, 275601.\n33. Nai, C. T.; Lu, J.; Zhang, K.; Loh, K. P., Studying Edge Defects of Hexagonal\nBoron Nitride Using High-Resolution Electron Energy Loss Spectroscopy. J Phys\nChem Lett 2015, 6, 4189-4193.\n34. Kiraly, B.; Iski, E. V.; Mannix, A. J.; Fisher, B. L.; Hersam, M. C.; Guisinger, N.\nP., Solid-source growth and atomic-scale characterization of graphene on Ag(111).\nNat Commun 2013, 4, 2804.\n35. Warner, J. H.; Rummeli, M. H.; Bachmatiuk, A.; Buchner, B., Atomic Resolution\nImaging and Topography of Boron Nitride Sheets Produced by Chemical Exfoliation.\nAcs Nano 2010, 4, 1299-1304.\n36. Bianchini, F.; Patera, L. L.; Peressi, M.; Africh, C.; Comelli, G., Atomic Scale\nIdentification of Coexisting Graphene Structures on Ni(111). J Phys Chem Lett 2014,\n5, 467-473.\n37. Tang, S. J.; Wang, H. M.; Zhang, Y.; Li, A.; Xie, H.; Liu, X. Y.; Liu, L. Q.; Li, T.\nX.; Huang, F. Q.; Xie, X. M.; Jiang, M. H., Precisely aligned graphene grown on\nhexagonal boron nitride by catalyst free chemical vapor deposition. Scientific Reports\n2013, 3, 2666\n38. Lin, W. H.; Chen, T. H.; Chang, J. K.; Taur, J. I.; Lo, Y. Y.; Lee, W. L.; Chang, C.\nS.; Su, W. B.; Wu, C. I., A Direct and Polymer-Free Method for Transferring\nGraphene Grown by Chemical Vapor Deposition to Any Substrate. Acs Nano 2014, 8,\n1784-1791.\n39. Kidambi, P. R.; Blume, R.; Kling, J.; Wagner, J. B.; Baehtz, C.; Weatherup, R. S.;\nSchloegl, R.; Bayer, B. C.; Hofmann, S., In Situ Observations during Chemical Vapor\nDeposition of Hexagonal Boron Nitride on Polycrystalline Copper. Chem Mater 2014,\n26, 6380-6392.\n40. Jang, S. K.; Youn, J.; Song, Y. J.; Lee, S., Synthesis and Characterization of\nHexagonal Boron Nitride as a Gate Dielectric. Scientific Reports 2016, 6, 30449.\n41. Lee, G. H.; Yu, Y. J.; Lee, C.; Dean, C.; Shepard, K. L.; Kim, P.; Hone, J.,\nElectron tunneling through atomically flat and ultrathin hexagonal boron nitride. Appl\nPhys Lett 2011, 99, 243114."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Atomic-scale Structural and Chemical Characterization of Hexagonal Boron Nitride Layers Synthesized at the Wafer-Scale with Monolayer Thickness Control\nWei-Hsiang Lin, Victor W. Brar, Deep Jariwala, Michelle C. Sherrott, Wei-Shiuan Tseng, Chih-I Wu, Nai-Chang Yeh, and Harry A Atwater\nChemistry of Materials Just Accepted Manuscript \nDOI: 10.1021/acs.chemmater.7b00183","other_numbering_system":null,"funders":[{"agency":"Department of Energy (DOE)","grant_number":"DE-FG02-07ER46405"},{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0001293"},{"agency":"Resnick Sustainability Institute","grant_number":""},{"agency":"Kavli Nanoscience Institute","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Resnick Sustainability Institute","Kavli Nanoscience Institute"]}