{"title":"A Comparison of Computerized Chemical Models for Equilibrium Calculations in Aqueous Systems","uri":"","abstract":"A survey of computer programs which are currently being used to calculate the distribution of species in aqueous solutions, especially natural waters, has been made in order to 1) provide an inventory of available programs with a short description of their uses, 2) compare the consistency of their output for two given test solutions and 3) identify major weaknesses or problems encountered from their use. More than a dozen active programs which can be used for distribution of species and activity calculations for homogeneos equilibria among the major anions and cations of natural waters have been inventoried. Half of these programs can also accept several trace elements including Fe, Al, Mn, Cu, Ni, Zn, Cd, Pb, Ag, Hg, As, Ba, Sr, and B. Consistency between programs was evaluated by comparing the log of the molal concentrations of free ions and complexes for two test solutions: a hypothetical seawater analysis and a hypothetical river water analysis. Comparison of the free major ion concentrations in the river water test case shows excellent agreement for the major species. In the seawater test case there is less agreement and for both test cases the minor species commonly show orders of magnitude differences in concentrations. These differences primarily reflect differences in the thermodynamic data base of each chemical model although other factors such as activity coefficient calculations, redox assumptions, temperature corrections, alkalinity corrections and the number of complexes used all have an affect on the output.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252599","docid":252599,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261746","fileid":1261746,"datasetid":"document","objectid":252599,"filename":"bk-1979-0093%2Ech038.pdf","mime_type":"application/pdf","hash":"920fc12670ad6ecb8bbb4eb3e5ab093f","hash_type":"MD5","filesize":2235214,"mtime":"2017-05-23 16:59:58","url":"http://authors.library.caltech.edu/77654/1/bk-1979-0093%252Ech038.pdf"}],"eprintid":77654,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"bk-1979-0093%2Ech038.pdf","content":"published"}],"note":"This chapter not subject to U.S. copyright. Published 1979 American Chemical Society. \n\nReceived November 16, 1978. Publication Date (Print): March 19, 1979.","id":77654,"rev_number":10,"userid":18,"eprint_dir":"disk0/00/07/76/54","datestamp":"2017-05-23 18:32:33","lastmod":"2017-05-23 18:32:33","status_changed":"2017-05-23 18:32:33","type":"book_section","metadata_visibility":"show","creators":[{"given":"D. K.","family":"Nordstrom","id":"Nordstrom-D-K","orcid":""},{"given":"L. N.","family":"Plummer","id":"Plummer-L-N","orcid":""},{"given":"T. M. L.","family":"Wigley","id":"Wigley-T-M-L","orcid":""},{"given":"T. J.","family":"Wolery","id":"Wolery-T-J","orcid":""},{"given":"J. W.","family":"Ball","id":"Ball-J-W","orcid":""},{"given":"E. A.","family":"Jenne","id":"Jenne-E-A","orcid":""},{"given":"R. L.","family":"Bassett","id":"Bassett-R-L","orcid":""},{"given":"D. A.","family":"Crerar","id":"Crerar-D-A","orcid":""},{"given":"T. M.","family":"Florence","id":"Florence-T-M","orcid":""},{"given":"B.","family":"Fritz","id":"Fritz-B","orcid":""},{"given":"M.","family":"Hoffmann","id":"Hoffmann-M-R","orcid":"0000-0002-0432-6564"},{"given":"G. R.","family":"Holdren","id":"Holdren-G-R","orcid":""},{"given":"G. M.","family":"Lafon","id":"Lafon-G-M","orcid":""},{"given":"S. V.","family":"Mattigod","id":"Mattigod-S-V","orcid":""},{"given":"R. E.","family":"McDuff","id":"McDuff-R-E","orcid":""},{"given":"F.","family":"Morel","id":"Morel-F-M","orcid":""},{"given":"M. M.","family":"Reddy","id":"Reddy-M-M","orcid":""},{"given":"G.","family":"Sposito","id":"Sposito-G","orcid":""},{"given":"J.","family":"Thrailkill","id":"Thrailkill-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"1979-03-19","date_type":"published","publication":"","volume":"","number":"93","pagerange":"857-892","id_number":"CaltechAUTHORS:20170523-095954454","refereed":true,"issn":"1947-5918","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170523-095954454","related_url":[{"url":"http://dx.doi.org/10.1021/bk-1979-0093.ch038","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/bk-1979-0093.ch038","type":"pub","description":"Article"}],"referencetext":["1.\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n1 o.\n11.\n12.\nLeggett, D. J. Machine computation of equilibrium concentrations\n- some practical considerations, Talanta 24,\n535-542 (1977).\nPerrin, D.D. Recent applications of digital computers in\nanalytical chemistry, Talanta 24, 339-345 (1977).\nBjerrum, N. Ionic association I. Influence of ionic\nassociation on the activity of ions at moderate degrees of\nassociation, Kgl. Danske Videnskab. Selskab. Math-fys. Medd.\n7, 1-48 (192 .\nFuoss, R. M. Properties of electrolyte solutions, Chem. Rev.\n17, 27-42 (1935).\nBockris, J. O'M. and Reddy, A. K. N. \"Modern Electrochemistry,\"\n622 p. Plenum Press, New York, 1970.\nReilly, P. J., Wood, R. H. and Robinson, R. A. Prediction\nof osmotic and activity coefficients in mixed-electrolyte\nsolutions, J. Phys. Chem. ?.2_, 1305-1315 (1971)~\nOthmer, H. G. Nonuniqueness of equilibria in closed reacting\nsystems, Chem. Eng. Sci. 31, 993-1003 (1976).\nCaram, H. S. and Scriven, L. E. -,;Jonunique reaction equilibria\nin non-ideal systems, Chem. Eng. Sci. 31, 163-168\n(1976). -\nZeleznik, F. J. and Gordon, S. Calculation of complex\nchemical equilibria, Ind. Eng. Chem. 60, 27-57 (1968).\nVan Zeggeren, F. and Storey, S. H. \"The Computation of\nChemical Equilibria,\" 176 p. Cambridge University Press,\nLondon, England, 1970.\nBrinkley, S. R. Notes on the condition of equilibrium for\nsystems of many constituents, J. Chem. Phys. 14, 563-564\n(1946). -\nBrinkley,, S. R., Calculation of the equilibrium composition\nof systems of many constituents, J. Chem. Phys •\n.:!2· 107-110 (1947).\n13.\n14.\n15.\n16.\n17.\n18.\n19.\n20.\n21.\n22.\n23.\n24.\n25.\n26.\n27.\nKandiner, H. J. and Brinkley, S. R. Calculation of\ncomplex equilibrium relations, Ind. Eng. Chem. 42, 850-855\n(1950).\nFeldman, H. F., Simons, w. H. and Bienstock, D.\nCalculating equilibrium compositions of multicomponent,\nmultiphase, chemical reacting systems, U.S. Bur. Mines Rep.\nInvest. 7257, 22 p. (1969).\nCrear, D-:----1\\method for computing multicomponent chemical\nequilibria based on equilibrium constants, Geochim.\nCosmochim. Acta 39, 1375-1384 (1975).\nActon, F. S. \"Numerical Methods that Work,\" 541 p.\nHarper and Row, New York, 1970.\nWhite, W. B., Johnson, S. M. and Dantzig, G. B. Chemical\neguilibrium in complex mixtures, J. Chem. Phys. 28, 751-755\n(1958). -\nDayhoff, M.O., Lippincott, E. R., Eck, R. V. and\nNagarajan, G. Thermodynamic equilibrium in prebiological\natmospheres of C, H, O, N, P, Sand Cl, NASA SP-3040,\nWashington, D.C., 260 p. 1967.\nHolloway, J. R. and Reese, F. 0. The generation of\nN2-co2-H2o fluids for use in hydrothermal experimentation\nI. Experimental method and equilibrium calculations in\nthe C-0-H-N system, Amer. Mineral.~. 587-597 (1974).\nKarpov, I. K. and Kaz'min, L. A. Calculation of geochemical\nequilibria in heterogeneous multicomponent systems,\nGeochem. Int. 9, 252-265 (1972).\nIngri, N., Kakolowicz, w., Sillen, L. G. and Warnquist,\nB. High-speed computers as a supplement of graphical\nmethods - V. HALTAFALL, a general program for calculating\nthe composition of equilibrium mixtues, Talanta 14, 1261-\n1286 ( 1967) . -\nDyrssen, D., Jagner, D. and Wengelin, F. \"Computer\nCalculation of Ionic Equilibria and Titration Procedures,\"\n250 p. John Wiley, New York, 1968.\nIngri, N. and Sillen, L. G. High-speed computers as a\nsupplement of graphical methods IV. An ALGOL version of\nLETAGROP VRID, Arkiv. Kemi 23, 97-121 (1965).\nPerrin, D. D. Multiple equlTibria in assemblages of metal\nions and commplexing species: a model for biological\nsystems, Nature 206, 170-171 (1965).\nPerrin, D. D. and Sayce, I. G. Computer calculation of\nequilibrium concentrations in mixtures of metal ions and\ncomplexing species, Talanta 14, 833-842 (1967).\nFardy, J. J. and Sylva, R. N:- SIAS, a computer program\nfor the generalized calculation of speciation in ~ixed\nmetal-ligand aqueous systems, AAEC/E445, Lucas Heights,\nAustralia, 20 p. (1978).\nDetar, D. F. \"Computer Programs for Chemistry,\" Vol. II,\n260 p. W. A. Benjamin, New York, 1969.\n28.\n29.\n30.\n31.\n32.\n33.\n34.\n35.\n36.\n37.\n38.\n39.\n40.\nCHEMICAL MODELING IN AQUEOUS SYSTEMS\nBos, M. and Meershoek, H. Q. J. A computer program for the\ncalculation of equilibrium concentrations in complex\nsystems, Anal. Chim. Acta 61, 185-194 (1972).\nGarrels, R. M. and Thompson--;-14. E., A chemical model for\nseawater at 25°C and one atmosphere total pressure, Amer.\nJ. Sci. 260, 57-66 (1962). -Barnes,\n-r=--and Clarke, F. E., Chemical properties of\nground water and their encrustation effects on wells, U.S.\nGeol. Survey Prof. Paper 498-D, 58 p. (1969). ~\nHelgeson, H. C., Brown, T. H., Nigrini, A. and Jones, T.\nA., Calculation of mass transfer in geochemical processes\ninvolving aqueous solutions, Geochim. Cosmochim. Acta.\n34, 569-592 (1970).\nFritz, B. \"Etude thermodynamique et simulation des reactions\nentre mineraux et solutions application a la geochemie\ndes alterations et des eaux continentales.\" PhD.\nThesis, Univ. Louis Pasteur, Strasbourg, France, 152 p.,\n1975.\nDroubi, A. Geochimie des sels et des solutions concentrees\npars evaporation. Modele thermodynamique de\nsimulation. Application aux sols sales du Tchad •. Ph.D.\nThesis, Univ. Louis Pasteur, Strasbourg, France, 177 p.,\n1976.\nTruesdell, A.H. and Jones, B. F. WATEQ, a computer\nprogram for calculating chemical equilibria of natural\nwaters, NTIS Tech. Rept. PB2-20464 Springfield,VA 77 p. (1973).\nTruesdell, A. H. and Jones, B. F. WATEQ, a computer program\nfor calculating chemical equili~ria of natural waters,\nJ. Res. U. S. Geol. Survey 2, 233-274 (1974).\nKharaka, Y. K. and Barnes, T., SOLMNEQ: Solution-mineral\nequilibrium computations, NTIS Tech. Rept. PB214-899,\nSpringfield, VA 82 p. (1973).\nWolery, T. J., Some chemical aspects of hydrothermal processes\nat mid-oceanic ridges - a theoretical study. I.\nBasalt - sea water reaction and chemical cycling between\nthe coeanic crust and the oceans. II. Calculation of\nchemical equilibrium between aqueous solutions and\nminerals, Ph.D. Thesis, Northwestern Univ., [vanston,\nIL, 1978.\nPlummer, L. N., Jones, B. F. and Truesdell, A.H., WATEQF\n- a FORTRAN IV version of WATEQ, a computer program for\ncalculatina chemical equilibrium of natural waters, U.S.\nGeol. Survey Water Resour. Invest. 76-13, 61 p. (197~\nLueck, S. L., Runnells, D. D. and Markos, G., Computer\nmodelling of urnaium species in natural waters: applications\nto exploration, Geol. Soc. Amer. Ann. Mtg. Abstracts,\n1978.\nBall, J. W., Jenne, E. A. and Nordstrom, D. K., WATEQ2 - a\ncomputerized chemical model for trace and major element\nspeciation and mineral equilibria of natural waters, in Jenne, E. A., ed., \"Chemical Modeling in Aqueous Systems.\nSpeciation, Sorption, Solubility, and Kinetics,\" Amer.\nChem. Soc., 1978 (This volume).\nWigTey, T.M.L. WATSPEC: a computer program for determining\nthe equilibrium speciation of aqueous solutions,\nBrit. Geomorph. Res. Group Tech. Bull. 20, 48 p. (1977).\nWigley, T. M. L., Ion pairing and water quality measurements,\nCan. J. Earth Sci. 8, 468-476 (1971).\nWolery, T. J. and Walters,-L. J., Jr., Calculation of\nequilibrium distributions of chemical species in aqueous\nsolutions by means of monotone sequences, Math Geol.\n7, 99-115 (1975).\nWalters, L. J., Jr. and Wolery, T. J., A monotonesequences\nalgorithm and FORTRAN IV program for calculation\nof equilibrium distributions of chemical species, Comp.\nGeosci. l, 57-63 (1975).\nLafon, G:- M., Some quantitative aspects of the chemical\nevolution of the oceans, Ph.D. Thesis, Northwestern Univ.,\nEvanston, IL., 136 p., 1969.\nHoldren, G. R., Jr., Distribution and behavior of manganese\nin the interstitial waters of Chesapeake Bay sediments\nduring early diagenesis, Ph.D. Thesis, The Johns\nHopkins Univ., Baltimore, MD, 191 p., 1977.\nThrailkill, J., Solution geochemistry of the water of\nlimestone terrains, Univ. Kentucky Water Resour. Inst. Res.\nRept. 19, 125 p ( 1970 .\nvan--Beef, C. G. E. M., personal communication.\nVan Breeman, N. Calculation of ionic activities in\nnatural waters, Geochim. Cosmochim. Acta 37, 101-107 (1973).\n(1973). -\nMorel, F. and Morgan, J. J. A numerical method for computing\nequilibria in aqueous chemical systems, Env. Sci.\nTech. 6, 58-67 (1972).\nMorel,-F., McDuff, R. E. and Morgan, J. J. Interactions\nand chemostasis in aquatic chemical systems: Role of pH,\npE, solubility and complexation, p. 157-200, ~Singer, P.C.,\ned., \"Trace Metals and Metal-Organic Interactions in\nNatural Waters,\" Ann Arbor Science Publishers, Ann Arbor,\nMichigan, 1973.\nMorel, F., McDuff, R. E. and Morgan, J. J. Theory of\ninteraction intensities, buffer capacities, and pH stabi-\n1 ity in aqueous systems, with application to the pH of\nseawater and a heterogeneous model ocean system, Mar.\nChem. 4, 1001-1028 (1976). -\nJames,-R. 0. and Healy, T. W. Adsorption of hydrolyzable\nmetal ions at the oxide-water interface. I. Cobalt (II)\nadsorption on silicon dioxide and titanium dioxide as\nmodel systems II. Charge reversal of silicon dioxide and\ntitanium dioxide colloids by adsorbed cobalt (II), lanthanum\n(III) and thorium (IV) as model systems III.\nThermodynamic model of adsorption, J. Colloid Interface\nSci. 40, 42-81 (1972).\nSchindler, P. W. and Gamsjaeger, H. Acid-base reactions\nof the titanium dioxide (anatase) - water interface and\nthe point of zero charge of titanium dioxide suspension,\nKolloid - z. z. Polym. 250, 759-763 (1972).\nSchindler, P. W., Fuersr:-B., Dick, R., Wolfe, P. U.\nLigand properties of surface silanol groups. I. Surface\ncomplex formation with iron (3+), copper (2+), cadmium\n(2+) and lead (2+), J. Colloid Interface Sci. 55, 469-475\n(1976). -\nSchindler, P. W., Waelti, E. and Fuerst, B. The role of\nsurface hydroxyl roups in the surface chemistry of metal\noxides, Chimia 30, 107-109 (1976).\nHohl, H. and Stumm, W. Interaction of lead (2+) with\nhydrous-alumina, J. Colloid Interface Sci. 55, 281-288\n(1976). -\nWestall, J. and Hohl, H. A general method for the computation\nof equilibria and determination of equilibrium\nconstants for adsorption at hydrous oxide surfaces, ·;n\n\"Abstracts of Papers,\" Amer. Chem. Soc. Meeting, Miami\nBeach, FL., 1978.\nDavis, J. A., III and Leckie, J.O. Surface ionization\nand complexation at the oxide/water interface, in Jenne,\nE. A., ed. \"Chemical Modeling in Aqueous System$.\"' Speciation,\nSorption, Solubility, and Kinetics.\" Amer. Chem. Soc., 1978\n(This volume).\nWestall, J.C., Zachary, J. L. and Morel F. M. M. MINEQL,\na computer program for the calculation of chemical equilibrium\ncomposition of aqueous system, Tech. Note 18, Dept.Civil Eng.\nMass. Inst. Tech., Cambridge, MA., 91 p., (1976).\nMattigod, S. V. and Sposito, G. Chemical modeling of trace\nmetal equilibria in contaminated soil solutions using the\ncomputer program GEOCHEM, in Jenne, E.A., ed., \"Chemical\nModeling in Aqueous System$.\"' Speciation, Sorption, Solubilit;y,\nand Kinetics.\" Amer. Chem. Soc., 1978 (This volume).\nI, T.-P. and Nancollas, G.H. EQUIL - a computational\nmethod for the calculation of solution equilibria, Anal.\nChem. 44, 1940-1950 (1972). -Helgeson,\nH. C. Evaluation of irreversible reactions in\ngeochemical processes involving minerals and aqueous solutions\n- I. Thermodynamic relations, Geochim. Cosmochim.\nActa 32, 853-877 ( 1968).\nHelgeson, H. C., Garrels, R. M. and Mackenzie, F. T.\nEvaluation of irreversible reactions in geochemical processes\ninvolving minerals and aqueous solutions - II. Applications,\nGeochim. Cosmochim. Acta 33, 455-481 (1969).\nDeDonder, Th. and Van Rysselberghe, P. \"The Thermodynamic\nTheory of Affinity,\" Stanford University Press, Stanford,\nCalifornia, 1936.\n66.\n67.\n68.\n69.\n70.\n71 •\n72.\n73.\n74.\n75.\n76.\n77.\n78.\n79.\n80.\nHelgeson, H. C. A chemical and thermodynamic model of ore\ndeposition in hydrothermal systems, Mineral Soc. Amer.\nSpec. Paper l_, 155-186 (1970).\nMiller, D. G., Piwinskii, A. J. and Yamauchi, R. The use\nof geochemical~equilibrium computer calculations to estimate\nprecipitation from geothermal brines, UCRL-52197\nLivermore, Calif., 34 p., (1977).\nDroubi, A., Cheverry, c., Fritz, B. and Tardy, Y.\nGeochimie des eaux et des sels dans les sols des polders\ndu Lac Tchad: Application d1 un modele thermodynamique de\nsimulation de 11evaporation, Chem. Geol. lL, 165-177\n(1976).\nDroubi, A., Fritz, B. and Tardy, Y. Equilibres entre\nmineraux et solutions; Programmes de calcul appliques a la\nprediction de la sahire des sols et des doses optimales\nd1 irrigation, Cah. ORSTOM, ser. Pedol XIV, 13-38 (1976).\nGear, C. W. The automatic integration of ordinary differential\nequations, Communications of the ACM 14, 176-179\n(1971).\nGear, C. W. Algorithm 407-DIFSUB for solution of ordinary\ndifferential equations, Communications of the ACM .!.!• 185-\n190 (1971).\nPlummer, L. N., Parkhurst, D. L. and Kosiur, D. R. MIX2:\nA computer program for modeling chemical reactions in\nnatural waters, U.S. Geol. Survey Water Resour. Inv. Rept.\n75-61, 73 p. (1975).\nPlummer, L. N. Mixing of sea water and calcium carbonate\nground water, Geol. Soc. Amer. Mem. 142, 219-236 (1975).\nWigley, T. M. L. and Plummer, L. N. Mixing of carbonate\nwaters, Geochim. Cosmochim. Acta 40, 989-995 (1976).\nPlummer, L. N. Defining reactionS-and mass transfer in\npart of the Floridan aquifer, Water Resour. Res. J.l, 801-812\n( 1977) .\nParkhurst, D. L. Plummer, L. N. and Thorstenson, D. C.\nChemical models in ground-water systems, Geol. Soc. Amer.\nAnn. Mtg. Abstracts 1978.\nHaas, J. L., Jr. and Fisher, J. R. Simultaneous evaluation\nand correlation of thermodynamic data, Amer. J.\nSci. 276, 525-545 (1976).\nHelgeson, H. C. Thermodynamics of hydrothermal systems at\nelevated temperatures and pressures, Amer. J. Sci. 267, 729-\n804 (1969).\nHelgeson, H. C. and Kirkham, D. H. Theoretical prediction\nof the thermodynamic behavior of aqueous electrolytes at\nhigh pressures and temperatures II. Debye-Huckel parameters\nfor activity coefficients and relative partial molal\nproperties, Amer. J. Sci. 274, 1199-1261 (1974).\nDavies, C. W. 11 Ion Association,\" 190 p. Butterworths,\nWashington, D.C., 1962.\n81.\n82.\n83.\n84.\n85.\n86.\n87.\n88.\n89.\n90.\nCHEMICAL MODELING IN AQUEOUS SYSTEMS\nMorris, J. C. and Stumm, w. Redox equilibria and measurements\nof potentials in the aquatic environment, p.270-285. in\nGould, R. F., ed., \"Equilibrium Concepts in Natural Water\nSystems,\" Adv. Chem. Ser. 67, 1967.\nMehrbach, C., Culberson, C. H., Hawley, J. E. and\nPytkowicz, R. M. Measurement of the aparent dissociation\nconstants of carbonic acid in seawater at atmospheric\npressure, Limnol. Oceanogr. ~. 897-907 (1973).\nLyman, J. Buffer mechanism of seawater, Ph.D. Thesis,\nUniv. Calif.y Los Angeles, CA., 196 p .• 1956.\nLi, Y. H., Takahashi, T. and Broecker, w. S., Degree of\nsaturation of Caco3 in the oceans, J. Geophys. Res. 74,\n5507-5525 ( 1969). -\nMcDuff, R. E. and Morel, F. M., Description and use of the\nchemical equilibrium program REDEQL2, Keck Lab. Tech. Rept.\nEQ-73-02, Calif, Inst. Tech., Pasadena, CA, 75., (1973).\nHoldren, G. R., Jr. and Bricker, O.P., Distribution and\ncontrol of dissolved iron and manganese in the interstitial\nwaters of the Chesapeake Bay, p. 178-196, in Drucker, H.\nand Wildung, R. E., ed., ''Biological Implications of Metals\nin the Environment.\" ERDA Symposium Series 42. 1977.\nThrailkill, J., Carbonate chemistry of aquifer and stream\nwater in Kentucky, J. Hydrol. ~. 93-104 (1972).\nThrailkill, J., Carbonate equilibria in karst waters. P• 745-\n771, in Yevjevich, V., ed., \"Karst Hydrology and Water\nResources,\" Vol. 2, Water Resources Pub., Ft. Collins, CO.,\n1976.\nWigley, T. M. L., Plummer, L. N., and Pearson, F. J., Jr.,\nMass transfer and carbon isotope evolution in natural\nwater system, Geochim. Cosmochim. Acta 42, 1117-1139 (1978).\nBerner, R. A., The solubility of calcite and aragonite in\nseawater at atmospheric pressure and 34.50/oo salinity,\nAmer. J. Sci. 276, 713-730 (1976)."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"A Comparison of Computerized Chemical Models for Equilibrium Calculations in Aqueous Systems\nD. K. NORDSTROM, L. N. PLUMMER, T. M. L. WIGLEY, T. J. WOLERY, J. W. BALL, E. A. JENNE, R. L. BASSETT, D. A. CRERAR, T. M. FLORENCE, B. FRITZ, M. HOFFMAN, G. R. HOLDREN, JR., G. M. LAFON, S. V. MATTIGOD, R. E. McDUFF, F. MOREL, M. M. REDDY, G. SPOSITO, and J. THRAILKILL\nChemical Modeling in Aqueous Systems. March 19, 1979 , 857-892 \nDOI:10.1021/bk-1979-0093.ch038","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}