{"title":"Torque-coupled thermodynamic model for F_oF_1-ATPase","uri":"","abstract":"F_oF_1-ATPase is a motor protein complex that utilizes transmembrane ion flow to drive the synthesis of adenosine triphosphate (ATP) from adenosine diphosphate (ADP) and phosphate (Pi). While many theoretical models have been proposed to account for its rotary activity, most of them focus on the F_o or F_1 portions separately rather than the complex as a whole. Here, we propose a simple but new torque-coupled thermodynamic model of F_oF_1-ATPase. Solving this model at steady state, we find that the monotonic variation of each portion's efficiency becomes much more robust over a wide range of parameters when the F_o and F_1 portions are coupled together, as compared to cases when they are considered separately. Furthermore, the coupled model predicts the dependence of each portion's kinetic behavior on the parameters of the other. Specifically, the power and efficiency of the F_1 portion are quite sensitive to the proton gradient across the membrane, while those of the F_o portion as well as the related Michaelis constants for proton concentrations respond insensitively to concentration changes in the reactants of ATP synthesis. The physiological proton gradient across the membrane in the F_o portion is also shown to be optimal for the Michaelis constants of ADP and phosphate in the F_1 portion during ATP synthesis. Together, our coupled model is able to predict key dynamic and thermodynamic features of the F_oF_1-ATPase in vivo semiquantitatively, and suggests that such coupling approach could be further applied to other biophysical systems.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252592","docid":252592,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261709","fileid":1261709,"datasetid":"document","objectid":252592,"filename":"PhysRevE.95.052413.pdf","mime_type":"application/pdf","hash":"784c5a170bbfb617d047758ebb9fb412","hash_type":"MD5","filesize":948105,"mtime":"2017-05-23 16:21:13","url":"http://authors.library.caltech.edu/77651/1/PhysRevE.95.052413.pdf"}],"eprintid":77651,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"PhysRevE.95.052413.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252594","docid":252594,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261717","fileid":1261717,"datasetid":"document","objectid":252594,"filename":"SI_coupledATPase.pdf","mime_type":"application/pdf","hash":"6175834249e5b53a080ccf35ce92f80d","hash_type":"MD5","filesize":872222,"mtime":"2017-05-23 16:24:41","url":"http://authors.library.caltech.edu/77651/2/SI_coupledATPase.pdf"}],"eprintid":77651,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"SI_coupledATPase.pdf","content":"supplemental"}],"note":"© 2017 American Physical Society. \n\nReceived 31 May 2016; revised manuscript received 2 March 2017; published 23 May 2017. \n\nThe authors would like to thank Biswajit Das, Xiao Jin, and Ziqing Zhao for comments and helpful discussions. H.G. is supported by National Natural Science Foundation of China (Grants No. 21373021 and No. 11622101) and the 863 program in China (Grant No. 2015AA020406).","id":77651,"rev_number":11,"userid":18,"eprint_dir":"disk0/00/07/76/51","datestamp":"2017-05-23 16:30:40","lastmod":"2017-05-23 16:30:40","status_changed":"2017-05-23 16:30:40","type":"article","metadata_visibility":"show","creators":[{"given":"Guangkuo","family":"Ai","id":"Ai-Guangkuo","orcid":""},{"given":"Pengfei","family":"Liu","id":"Liu-Pengfei","orcid":""},{"given":"Hao","family":"Ge","id":"Ge-Hao","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05","date_type":"published","publication":"Physical Review E","volume":"95","number":"5","pagerange":"Art. No. 052413","id_number":"CaltechAUTHORS:20170523-092109554","refereed":true,"issn":"2470-0045","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170523-092109554","related_url":[{"url":"https://doi.org/10.1103/PhysRevE.95.052413","type":"doi","description":"Article"},{"url":"https://journals.aps.org/pre/abstract/10.1103/PhysRevE.95.052413","type":"pub","description":"Article"},{"url":"https://journals.aps.org/pre/supplemental/10.1103/PhysRevE.95.052413","type":"pub","description":"Supplemental Material"}],"referencetext":["P. Boyer, Annu. Rev. Biochem. 66, 717 (1997).\nM. Yoshida, E. Muneyuki, and T. Hisabori, Nat. Rev. Mol. Cell Bio. 2, 669 (2001).\nP. Mitchell, Nature 191, 144 (1961).\nP. Boyer, Angew. Chem. Int. Ed. 37, 2296 (1998).\nW. Junge, H. Sielaff, and S. Engelbrecht, Nature (London) 459, 364 (2009).\nJ. Weber and A. E. Senior, Biochim. Biophys. Acta 1458, 300 (2000).\nK. Kinosita, R. Yasuda, and H. Noji, Essays Biochem. 35, 3 (2000).\nK. Kinosita, K. Adachi, and H. Itoh, Annu. Rev. Biophys. Biomol. Struct. 33, 245 (2004).\nR. Yasuda, H. Noji, K. Kinosita, and M. Yoshida, Cell 93, 1117 (1998).\nY. Rondelez, G. Tresset, T. Nakashima, Y. Kato-Yamada, H. Fujita, S. Takeuchi, and H. Noji, Nature (London) 433, 773 (2005).\nR. Yasuda, H. Noji, M. Yoshida, K. Kinosita, and H. Itoh, Nature (London) 410, 898 (2001).\nT. Ariga, E. Muneyuki, and M. Yoshida, Nat. Struct. Mol. Biol. 14, 841 (2007).\nH. Itoh, A. Takahashi, K. Adachi, H. Noji, R. Yasuda, M. Yoshida, and K. Kinosita, Jr., Nature (London) 427, 465 (2004).\nS. Toyabe, T. Watanabe-Nakayama, T. Okamoto, S. Kudo, and E. Muneyuki, Proc. Natl. Acad. Sci. USA 108, 17951 (2011).\nK. Adachi, R. Yasuda, H. Noji, H. Itoh, Y. Harada, M. Yoshida, and K. Kinosita, Proc. Natl. Acad. Sci. USA 97, 7243 (2000).\nH. Noji, M. Yoshida, and K. Kinosita, Nature (London) 386, 299 (1997).\nH. Omote, N. Sambonmatsu, K. Saito, Y. Sambongi, A. Iwamoto-Kihara, T. Yanagida, Y. Wada, and M. Futai, Proc. Natl. Acad. Sci. USA 96, 7780 (1999).\nH. Wang and G. Oster, Nature (London) 396, 279 (1998).\nY. Q. Gao, W. Yang, and M. Karplus, Cell 123, 195 (2005).\nL. Xu, Biochim. Biophys. Acta 1777, 1422 (2008).\nO. Pänke and B. Rumberg, Biochim. Biophys. Acta 1412, 118 (1999).\nP. Gaspard and E. Gerritsma, J. Theor. Biol. 247, 672 (2007).\nT. Schmiedl and U. Seifert, Europhys. Lett. 83, 30005 (2008).\nK. Adachi, K. Oiwa, T. Nishizaka, S. Furuike, H. Noji, H. Itoh, M. Yoshida, and K. Kinosita, Cell 130, 309 (2007).\nR. Watanabe, D. Okuno, S. Sakakihara, K. Shimabukuro, R. Iino, M. Yoshida, and H. Noji, Nat. Chem. Biol. 8, 86 (2012).\nR. Watanabe, K. Hayashi, H. Ueno, and H. Noji, Biophys. J. 105, 2385 (2013).\nT. Elston, H. Wang, and G. Oster, Nature (London) 391, 510 (1998).\nSee Supplemental Material at http://link.aps.org/supplemental/10.1103/PhysRevE.95.052413 for the details of the model including the equations for each portion of the FoF1 -ATPase, the estimated parameter values and the consistency of the coupled model based on experimental literatures, the results via another F1 model, and the results in the case of mismatch between Fo and F1 .\nX.-J. Zhang, H. Qian, and M. Qian, Phys. Rep. 510, 1 (2012).\nH. Ge and H. Qian, Phys. Rev. E 87, 062125 (2013).\nT. Hill, Free Energy Transduction and Biochemical Cycle Kinetics (Springer-Verlag, 1995).\nM. E. Fisher and A. B. Kolomeisky, Proc. Natl. Acad. Sci. USA 96, 6597 (1999).\nH. Qian, Biophys. Chem. 83, 35 (2000).\nP. Hänggi, P. Talkner, and M. Borkovec, Rev. Mod. Phys. 62, 251 (1990).\nH.-X. Zhou, Q. Rev. Biophys. 43, 219 (2010).\nE. Saita, T. Suzuki, K. Kinosita, and M. Yoshida, Proc. Natl. Acad. Sci. USA 112, 9626 (2015).\nD. Chowdhury, Phys. Rep. 529, 1 (2013).\nA. E. Senior, S. Nadanaciva, and J. Weber, Biochim. Biophys. Acta 1553, 188 (2002).\nN. Sakaki, R. Shimo-Kon, K. Adachi, H. Itoh, S. Furuike, E. Muneyuki, M. Yoshida, and K. Kinosita, Biophys. J. 88, 2047 (2005).\nS. Toyabe and E. Muneyuki, New J. Phys. 17, 015008 (2015).\nD. Stock, C. Gibbons, I. Arechaga, A. G. Leslie, and J. E. Walker, Curr. Opin. Struct. Biol. 10, 672 (2000).\nW. Jiang, J. Hermolin, and R. H. Fillingame, Proc. Natl. Acad. Sci. USA 98, 4966 (2001).\nE. R. Kashet, Biochemistry 21, 5534 (1982).\nM. K. Al-Shawi, C. J. Ketchum, and R. K. Nakamoto, Biochemistry 36, 12961 (1997).\nJ. C. Wilks and J. L. Slonczewski, J. Bacteriol. 189, 5601 (2007).\nG. Oster and H. Wang, J. Bioenerg. Biomem. 32, 459 (2000).\nS. C. Kou, B. J. Cherayil, M. Wei, B. P. English, and X. S. Xie, J. Phys. Chem. B 109, 19068 (2005).\nI. B. Dodd, M. A. Micheelsen, K. Sneppen, and G. Thon, Cell 129, 813 (2007).\nW. Ma, A. Trusina, H. El-Samad, W. A. Lim, and C. Tang, Cell 138, 760 (2009).\nL. Zhang, K. Radtke, L. Zheng, A. Q. Cai, T. F. Schilling, and Q. Nie, Mol. Syst. Biol. 8, 613 (2012).\nS. Chong, C. Chen, H. Ge, and X. S. Xie, Cell 158, 314 (2014)."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"National Natural Science Foundation of China","grant_number":"21373021"},{"agency":"National Natural Science Foundation of China","grant_number":"11622101"},{"agency":"863 Program","grant_number":"2015AA020406"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}