{"title":"From Rousettus aegyptiacus (bat) Landing to Robotic Landing: Regulation of CG-CP Distance Using a Nonlinear Closed-Loop Feedback","uri":"","abstract":"Bats are unique in that they can achieve unrivaled agile maneuvers due to their functionally versatile wing conformations. Among these maneuvers, roosting (landing) has captured attentions because bats perform this acrobatic maneuver with a great composure. This work attempts to reconstruct bat landing maneuvers with a Micro Aerial Vehicle (MAV) called Allice. Allice is capable of adjusting the position of its Center of Gravity (CG) with respect to the Center of Pressure (CP) using a nonlinear closed-loop feedback. This nonlinear control law, which is based on the method of input-output feedback linearization, enables attitude regulations through variations in CG-CP distance. To design the model-based nonlinear controller, the Newton-Euler dynamic model of the robot is considered, in which the aerodynamic coefficients of lift and drag are obtained experimentally. The performance of the proposed control architecture is validated by conducting several experiments.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252611","docid":252611,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261872","fileid":1261872,"datasetid":"document","objectid":252611,"filename":"ICRA17_2003_FI.pdf","mime_type":"application/pdf","hash":"6959261a67f6d81b54f0db49f2fb5579","hash_type":"MD5","filesize":4681322,"mtime":"2017-05-23 18:54:42","url":"http://authors.library.caltech.edu/77662/1/ICRA17_2003_FI.pdf"}],"eprintid":77662,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"ICRA17_2003_FI.pdf","content":"accepted"}],"note":"","id":77662,"rev_number":8,"userid":6,"eprint_dir":"disk0/00/07/76/62","datestamp":"2017-05-23 19:40:58","lastmod":"2017-05-23 19:40:58","status_changed":"2017-05-23 19:40:58","type":"conference_item","metadata_visibility":"show","creators":[{"given":"Usman A.","family":"Syed","id":"Syed-U-A","orcid":""},{"given":"Alireza","family":"Ramezani","id":"Ramezani-Alireza","orcid":"0000-0002-3391-5288"},{"given":"Soon-Jo","family":"Chung","id":"Chung-Soon-Jo","orcid":"0000-0002-6657-3907"},{"given":"Seth","family":"Hutchinson","id":"Hutchinson-Seth","orcid":"0000-0002-3949-6061"}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-06","date_type":"completed","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170523-114956940","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170523-114956940","related_url":null,"referencetext":["[1] J. Yan, S. Avadhanula, J. Birch, M. Dickinson, M. Sitti, T. Su, and\nR. Fearing, “Wing transmission for a micromechanical flying insect,”\nJournal of Micromechatronics, vol. 1, no. 3, pp. 221–237, 2001.\n[2] J. E. Clark, J. G. Cham, S. A. Bailey, E. M. Froehlich, P. K. Nahata,\nR. J. Full, and M. R. Cutkosky, “Biomimetic design and fabrication\nof a hexapedal running robot,” in Robotics and Automation, 2001.\nProceedings 2001 ICRA. IEEE International Conference on, vol. 4.\nIEEE, 2001, pp. 3643–3649.\n[3] S.-J. Chung and M. Dorothy, “Neurobiologically inspired control\nof engineered flapping flight,” Journal of Guidance, Control, and\nDynamics, vol. 33, no. 2, pp. 440–453, 2010.\n[4] O. Unver, A. Uneri, A. Aydemir, and M. Sitti, “Geckobot: a gecko\ninspired climbing robot using elastomer adhesives,” in Proceedings\n2006 IEEE International Conference on Robotics and Automation,\n2006. ICRA 2006., May 2006, pp. 2329–2335.\n[5] A. Jusufi, D. T. Kawano, T. Libby, and R. J. Full, “Righting and turning\nin mid-air using appendage inertia: reptile tails, analytical models and\nbio-inspired robots,” Bioinspiration and Biomimetics, vol. 5, no. 4, p.\n045001, 2010.\n[6] D. K. Riskin, D. J. Willis, J. Iriarte-D´ıaz, T. L. Hedrick, M. Kostandov,\nJ. Chen, D. H. Laidlaw, K. S. Breuer, and S. M. Swartz, “Quantifying\nthe complexity of bat wing kinematics,” Journal of Theoretical\nBiology, vol. 254, no. 3, pp. 604–615, 2008.\n[7] A. Ramezani, H. Vejdani, D. Boerma, S.-J. Chung, S. M. Swartz,\nK. S. Breuer, and S. Hutchinson, “From rousettus aegyptiacus landing\nto robotic landing: Synthesis and control of a reduced-order landing\nmodel,” submitteded to IEEE International Conference on Robotics\nand Automation, 2017.\n[8] A. Ramezani, X. Shi, S.-J. Chung, and S. Hutchinson, “Bat bot (b2),\na biologically inspired flying machine,” in Proceedings of the IEEE\nInternational Conference on Robotics and Automation (ICRA), 2016.\n[9] ——, “Lagrangian modeling and flight control of articulated-winged\nbat robot,” Proc. 2015 IEEE/RSJ International Conference on Intelligent\nRobots and Systems (IROS), Hamburg, Germany, September 28\nOctober 02, 2015.\n[10] J. M. CAMHI, “Sensory control of abdomen posture in flying locusts,”\nJournal of Experimental Biology, vol. 52, no. 3, pp. 533–537, 1970.\n[11] ——, “Yaw-correcting postural changes in locusts,” Journal of Experimental\nBiology, vol. 52, no. 3, pp. 519–531, 1970.\n[12] T. Libby, T. Y. Moore, E. Chang-Siu, D. Li, D. J. Cohen, A. Jusufi, and\nR. J. Full, “Tail-assisted pitch control in lizards, robots and dinosaurs,”\nNature, 2012.\n[13] E. Chang-Siu, T. Libby, M. Tomizuka, and R. J. Full, “A lizardinspired\nactive tail enables rapid maneuvers and dynamic stabilization\nin a terrestrial robot,” in 2011 IEEE/RSJ International Conference on\nIntelligent Robots and Systems, Sept 2011, pp. 1887–1894.\n[14] E. Chang-Siu, T. Libby, M. Brown, R. J. Full, and M. Tomizuka,\n“A nonlinear feedback controller for aerial self-righting by a tailed\nrobot,” in Robotics and Automation (ICRA), 2013 IEEE International\nConference on, May 2013, pp. 32–39.\n[15] A. Jusufi, D. I. Goldman, S. Revzen, and R. J. Full, “Active tails\nenhance arboreal acrobatics in geckos,” Proceedings of the National\nAcademy of Sciences, vol. 105, no. 11, pp. 4215–4219, 2008.\n[16] Y. Laouris, J. Kalli-Laouri, and P. Schwartze, “The postnatal development\nof the air-righting reaction in albino rats. quantitative analysis\nof normal development and the effect of preventing neck-torso and\ntorso-pelvis rotations,” Behavioural Brain Research, vol. 37, no. 1,\npp. 37 – 44, 1990.\n[17] T. Kane and M. Scher, “A dynamical explanation of the falling cat\nphenomenon,” International Journal of Solids and Structures, vol. 5,\nno. 7, pp. 663 – 670, 1969.\n[18] J. P. Dyhr, K. A. Morgansen, T. L. Daniel, and N. J. Cowan, “Flexible\nstrategies for flight control: an active role for the abdomen,” Journal\nof Experimental Biology, vol. 216, no. 9, pp. 1523–1536, 2013.\n[19] J. M. ZANKER, “On the mechanism of speed and altitude control in\ndrosophila melanogaster,” Physiological Entomology, vol. 13, no. 3,\npp. 351–361, 1988.\n[20] W. Wang, G. Song, K. Nonami, M. Hirata, and O. Miyazawa, “Autonomous\ncontrol for micro-flying robot and small wireless helicopter\nx.r.b,” in 2006 IEEE/RSJ International Conference on Intelligent\nRobots and Systems, Oct 2006, pp. 2906–2911.\n[21] C. Bermes, S. Leutenegger, S. Bouabdallah, D. Schafroth, and R. Siegwart,\n“New design of the steering mechanism for a mini coaxial\nhelicopter,” in 2008 IEEE/RSJ International Conference on Intelligent\nRobots and Systems, Sept 2008, pp. 1236–1241.\n[22] I. C. Rust and H. H. Asada, “The eyeball rov: Design and control of a\nspherical underwater vehicle steered by an internal eccentric mass,” in\nRobotics and Automation (ICRA), 2011 IEEE International Conference\non. IEEE, 2011, pp. 5855–5862.\n[23] L. Jia-Wang, S. Bao-Wei, and S. Cheng, “Tracking control of autonomous\nunderwater vehicles with internal moving mass,” Acta\nAutomatica Sinica, vol. 34, no. 10, pp. 1319–1323, 2008.\n[24] N. E. Leonard and J. G. Graver, “Model-based feedback control of\nautonomous underwater gliders,” Oceanic Engineering, IEEE Journal\nof, vol. 26, no. 4, pp. 633–645, 2001.\n[25] C. A. Woolsey and N. E. Leonard, “Stabilizing underwater vehicle\nmotion using internal rotors,” Automatica, vol. 38, no. 12, pp. 2053–\n2062, 2002.\n[26] J. D. Anderson Jr, Fundamentals of aerodynamics. Tata McGraw-Hill\nEducation, 2010.\n[27] M. W. Spong, S. Hutchinson, and M. Vidyasagar, Robot modeling and\ncontrol. Wiley New York, 2006, vol. 3.\n[28] J. D. DeLaurier, “An aerodynamic model for flapping-wing flight,”\nThe Aeronautical Journal (1968), vol. 97, no. 964, pp. 125–130, 07\n2016.\n[29] R. F. Stengel, Flight dynamics. Princeton University Press, 2015.\n[30] M. P. Miller, “An accurate method of measuring the moments of inertia\nof airplanes,” 1930.\n[31] N. Hovakimyan, E. Lavretsky, and C. Cao, “Dynamic inversion for\nmultivariable non-affine-in-control systems via time-scale separation,”\nInternational Journal of Control, vol. 81, no. 12, pp. 1960–1967, 2008.\n[32] H. K. Khalil and J. Grizzle, Nonlinear systems. Prentice hall New\nJersey, 1996, vol. 3."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"TD","local_group":["GALCIT"]}