{"title":"Reducing Versatile Bat Wing Conformations to a 1-DoF Machine","uri":"","abstract":"Recent works have shown success in mimicking the flapping flight of bats on the robotic platform Bat Bot (B2). This robot has only five actuators but retains the ability to flap and fold-unfold its wings in flight. However, this bat-like robot has been unable to perform folding-unfolding of its wings within the period of a wingbeat cycle, about 100 ms. The DC motors operating the spindle mechanisms cannot attain this folding speed. Biological bats rely on this periodic folding of their wings during the upstroke of the wingbeat cycle. It reduces the moment of inertia of the wings and limits the negative lift generated during the upstroke. Thus, we consider it important to achieve wing folding during the upstroke. A mechanism was designed to couple the flapping cycle to the folding cycle of the robot. We then use biological data to further optimize the mechanism such that the kinematic synergies of the robot best match those of a biological bat. This ensures that folding is performed at the correct point in the wingbeat cycle.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252612","docid":252612,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261884","fileid":1261884,"datasetid":"document","objectid":252612,"filename":"LM2017_010_final_v2[1].pdf","mime_type":"application/pdf","hash":"0153af45d6e02c4c29363f0c76a41c1a","hash_type":"MD5","filesize":481233,"mtime":"2017-05-23 19:23:55","url":"http://authors.library.caltech.edu/77663/1/LM2017_010_final_v2%5B1%5D.pdf"}],"eprintid":77663,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"LM2017_010_final_v2[1].pdf","content":"accepted"}],"note":"We would like to thank the team of graduate and undergraduate students from aerospace, electrical, computer, and mechanical engineering departments at the University of Illinois at Urbana-Champaign for their contribution to construct the initial prototype of B2. \n\nThe biological motion capture data set was provided by Dr. Kenneth Breuer and Dr. Sharon Swartz from Brown University. We would like to thank them in their assistance with this, as well as José Iriarte-Díaz for compiling the data. \n\nThis work was supported by NSF Grant 1427111.","id":77663,"rev_number":11,"userid":6,"eprint_dir":"disk0/00/07/76/63","datestamp":"2017-05-23 19:44:53","lastmod":"2017-05-23 19:44:53","status_changed":"2017-05-23 19:44:53","type":"conference_item","metadata_visibility":"show","creators":[{"given":"Jonathan","family":"Hoff","id":"Hoff-Jonathan","orcid":""},{"given":"Alireza","family":"Ramezani","id":"Ramezani-Alireza","orcid":"0000-0002-3391-5288"},{"given":"Soon-Jo","family":"Chung","id":"Chung-Soon-Jo","orcid":"0000-0002-6657-3907"},{"given":"Seth","family":"Hutchinson","id":"Hutchinson-Seth","orcid":"0000-0002-3949-6061"}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"Aerial robotics, bats, biologically-inspired robots, kinematics","date":"2017-07","date_type":"completed","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170523-120929316","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170523-120929316","related_url":null,"referencetext":["1. J. W. Bahlman, S. M. Swartz, and K. S. Breuer. Design and characterization of\na multi-articulated robotic bat wing. Bioinspiration \u0026 Biomimetics, 8(1):016009,\n2013.\n2. N. A. Bernstein. The coordination and regulation of movements. Pergamon Press,\nOxford, 1967.\n3. C. Y. Brown and H. H. Asada. Inter-finger coordination and postural synergies\nin robot hands via mechanical implementation of principal components analysis.\nIEEE/RSJ International Conference on Intelligent Robots and Systems (IROS),\npages 2877–2882, 2007.\n4. M. G. Catalano, G. Grioli, E. Farnioli, A. Serio, C. Piazza, and A. Bicchi. Adaptive\nsynergies for the design and control of the Pisa/IIT SoftHand. The International\nJournal of Robotics Research, 33(5):768–782, 2014.\n5. A. Conn, S. Burgess, and C. Ling. Design of a parallel crank-rocker flapping\nmechanism for insect-inspired micro air vehicles. Proceedings of the Institution\nof Mechanical Engineers, Part C: Journal of Mechanical Engineering Science,\n221(10):1211–1222, 2007.\n6. M. A. Fenelon and T. Furukawa. Design of an active flapping wing mechanism and\na micro aerial vehicle using a rotary actuator. Mechanism and Machine Theory,\n45(2):137–146, 2010.\n7. J. Hoff, A. Ramezani, S.-J. Chung, and S. Hutchinson. Synergistic design of a bioinspired\nmicro aerial vehicle with articulated wings. Robotics: Science and Systems\n(RSS), 2016.\n8. J. Lin, Y. Wu, and T. S. Huang. Modeling the constraints of human hand motion.\nIEEE Workshop on Human Motion, pages 121–126, 2000.\n9. D. Mueller, J.W. Gerdes, and S. K. Gupta. Incorporation of passive wing folding in\nflapping wing miniature air vehicles. ASME Mechanism and Robotics Conference,\npages 797–805, 2009.\n10. U. M. Norberg and J. M. Rayner. Ecological morphology and flight in bats (Mammalia;\nChiroptera): wing adaptations, flight performance, foraging strategy and\necholocation. Philosophical Transactions of the Royal Society B: Biological Sciences,\n316(1179):335–427, 1987.\n11. A. Ramezani, S.-J. Chung, and S. Hutchinson. A biomimetic robotic platform to\nstudy flight specializations of bats. Science Robotics, 2(3), 2017.\n12. A. Ramezani, X. Shi, S.-J. Chung, and S. Hutchinson. Lagrangian modeling and\nflight control of articulated-winged bat robot. IEEE/RSJ International Conference\non Intelligent Robots and Systems (IROS), pages 2867–2874, 2015.\n13. A. Ramezani, X. Shi, S.-J. Chung, and S. Hutchinson. Bat Bot (B2), a biologically\ninspired flying machine. IEEE International Conference on Robotics and\nAutomation (ICRA), pages 3219–3226, 2016.\n14. A. Ramezani, X. Shi, S.-J. Chung, and S. Hutchinson. Modeling and nonlinear\nflight controller synthesis of a bat-inspired micro aerial vehicle. AIAA Guidance,\nNavigation, and Control Conference, page 1376, 2016.\n15. D. K. Riskin, A. Bergou, K. S. Breuer, and S. M. Swartz. Upstroke wing flexion\nand the inertial cost of bat flight. Proceedings of the Royal Society of London B:\nBiological Sciences, 279(1740):2945–2950, 2012.\n16. D. K. Riskin, D. J. Willis, J. Iriarte-D´ıaz, T. L. Hedrick, M. Kostandov, J. Chen,\nD. H. Laidlaw, K. S. Breuer, and S. M. Swartz. Quantifying the complexity of bat\nwing kinematics. Journal of Theoretical Biology, 254(3):604–615, 2008.\n17. M. Santello, M. Flanders, and J. F. Soechting. Postural hand synergies for tool\nuse. The Journal of Neuroscience, 18(23):10105–10115, 1998.\n18. A. K. Stowers and D. Lentink. Folding in and out: passive morphing in flapping\nwings. Bioinspiration \u0026 Biomimetics, 10(2):025001, 2015.\n19. A. Wissa, Y. Tummala, J. Hubbard Jr, and M. Frecker. Passively morphing ornithopter\nwings constructed using a novel compliant spine: design and testing.\nSmart Materials and Structures, 21(9):094028, 2012.\n20. R. Zbikowski, C. Galinski, and C. B. Pedersen. Four-bar linkage mechanism for\ninsectlike flapping wings in hover: Concept and an outline of its realization. Transactions\nof the ASME: Journal of Mechanical Design, 127(4):817–824, 2005."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"CMMI-1427111"}],"collection":"CaltechAUTHORS","reviewer":"TD","local_group":["GALCIT"]}