{"title":"Co-Design of Strain-Actuated Solar Arrays for Spacecraft Precision Pointing and Jitter Reduction","uri":"","abstract":"This work presents a novel spacecraft attitude control architecture using strain-actuated solar arrays (SASA) that does not require the use of conventional attitude control hardware. SASA enables attitude slewing maneuvers and precision-pointing (image acquisition) stares, while simultaneously suppressing structural vibrations. Distributed piezoelectric actuators help achieve higher precision, higher bandwidth, and quieter operation than reaction wheels. To understand the design tradeoffs for this architecture, a framework for the integrated design of distributed structural geometry and distributed control is presented. The physical properties of the array are modeled and designed with respect to a piecewise linear distributed thickness profile. The distributed control is a voltage profile across the array modeled as a spatially continuous function. The dynamics of the system are modeled using a coupled ODE-PDE system using extended generalizations for hybrid coordinate systems. The combined physical- and control-system design, or co-design problem is investigated to understand the optimal performance of the system. Single-axis slew maneuvers of 7.2 milli-radians or 1485 arc seconds are achieved for a representative spacecraft model without increasing array mass or reducing array planform area. From additional tradeoff studies, a design criteria is revealed for the array structure and control strategy based on the optimal design tradeoff between large array inertia and fast structural dynamics. Moreover, the fundamental limits on SASA slew angle magnitude are demonstrated using an intuitive pseudorigid body dynamic model.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252609","docid":252609,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1261854","fileid":1261854,"datasetid":"document","objectid":252609,"filename":"journal-manuscript-design.pdf","mime_type":"application/pdf","hash":"8b38b7a84e92910e832ebddeaa59afd5","hash_type":"MD5","filesize":2043529,"mtime":"2017-05-23 18:43:11","url":"http://authors.library.caltech.edu/77660/1/journal-manuscript-design.pdf"}],"eprintid":77660,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"journal-manuscript-design.pdf","content":"accepted"}],"note":"An earlier version of the material in this article was presented as paper 2016-0162 at the AIAA/ASCE/AHS/ASC Structures, Structural Dynamics, and Materials Conference, San Diego, CA, USA, 4-8 January 2016. \n\nGovernment sponsorship is acknowledged. The research was in part carried out at the Jet Propulsion Laboratory, California Institute of Technology under a contract with the National Aeronautics and Space Administration. The authors acknowledge help from Giri Subramanian and Kevin Lohan during the initial phases of the project.","id":77660,"rev_number":15,"userid":6,"eprint_dir":"disk0/00/07/76/60","datestamp":"2017-05-23 19:31:14","lastmod":"2017-05-23 19:38:38","status_changed":"2017-05-23 19:38:38","type":"article","metadata_visibility":"show","creators":[{"given":"Christian M.","family":"Chilan","id":"Chilan-Christian-M","orcid":""},{"given":"Daniel R.","family":"Herber","id":"Herber-Daniel-R","orcid":""},{"given":"Yashwanth Kumar","family":"Nakka","id":"Nakka-Yashwanth-K","orcid":""},{"given":"Soon-Jo","family":"Chung","id":"Chung-Soon-Jo","orcid":"0000-0002-6657-3907"},{"given":"James T.","family":"Allison","id":"Allison-J-T","orcid":""},{"given":"Jack B.","family":"Aldrich","id":"Aldrich-J-B","orcid":""},{"given":"Oscar S.","family":"Alvarez-Salazar","id":"Alvarez-Salazar-O-S","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-23","date_type":"inpress","publication":"AIAA Journal","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170523-113653804","refereed":true,"issn":"0001-1452","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170523-113653804","related_url":[{"url":"http://dx.doi.org/10.2514/MSDM16","type":"related","description":"Conference Paper"}],"referencetext":["1Arnon, 530 S., Rotman, S., and Kopeika, N. S., “Optimum Transmitter Optics Aperture for Satellite\nOptical Communication,” IEEE Transactions on Aerospace and Electronic Systems, Vol. 34, No. 2, Aug.\n1998, pp. 590–596, doi: 10.1109/7.670339\n2Ruiter, A. F. D., Damaren, C., and Forbes, J. R., Spacecraft Dynamics and Control: An Introduction,\nJohn Wiley \u0026 Sons, 2013.\n535 3Sirlin, S. W., “Vibration Isolation for Spacecraft Using the Piezoelectric Polymer PVF2,” Journal of\nthe Acoustical Society of America, Vol. 82, No. S13, Nov. 1987, doi: 10.1121/1.2024666\n4Rao, S. S. and Sunar, M., “Piezoelectricity and Its Use in Disturbance Sensing and Control of\nFlexible Structures: A Survey,” Applied Mechanics Reviews, Vol. 47, No. 4, April 1994, pp. 113–123,\ndoi: 10.1115/1.3111074\n540 5Cowen, R., “The Wheels Come Off Kepler,” Nature, Vol. 497, No. 7450, 2013, pp. 417–418,\ndoi: 10.1038/497417a\n6Coverstone-Carroll, V. L. and Wilkey, N. M., “Optimal Control of a Satellite-Robot System Using\nDirect Collocation with Non-linear Programming,” Acta Astronautica, Vol. 36, No. 3, Aug. 1995, pp. 149–\n162, doi: 10.1016/0094-5765(95)00096-I\n545 7Meckl, P. H. and Kinceler, R., “Robust Motion Control of Flexible Systems Using Feedfoward Forcing\nFunctions.” IEEE Transactions on Control Systems Technology, Vol. 2, No. 3, Sept. 1994, pp. 245–254,\ndoi: 10.1109/87.317981\n8Manning, R. A., “Optimum Design of Intelligent Truss Structures,” 32nd Structures, Structural\nDynamics, and Materials Conference, Baltimore, MA, USA, April 1991, pp. 528–533,\n550 doi: 10.2514/6.1991-1158\n9Smith, M. J., Grigoriadis, K. M., and Skelton, R. E., “Optimal Mix of Passive and Active Control\nin Structures,” Journal of Guidance, Control, and Dynamics, Vol. 15, No. 4, July–Aug. 1992, pp. 912–919,\ndoi: 10.2514/3.20924\n10Meirovitch, L., Dynamics and Control of Structures, John Wiley \u0026 Sons, 1990.\n11Crawley, E. F. and 555 Luis, J. D., “Use of Piezoelectric Actuators as Elements of Intelligent Structures,”\nAIAA Journal, Vol. 25, No. 10, Oct. 1987, pp. 1373–1385, doi: 10.2514/3.9792\n12Pan, J., Hansen, C. H., and Snyder, S. D., “A Study of the Response of a Simply Supported Beam\nto Excitation by a Piezoelectric Actuator,” Journal of Intelligent Material Systems and Structures, Vol. 3,\nNo. 1, Jan. 1992, pp. 3–16, doi: 10.1177/1045389X9200300101\n560 13Hubbard Jr., J. E. and Burke, S. E., “Distributed Transducer Design for Intelligent Structural Components,”\nIntelligent Structural Systems, edited by H. S. Tzou and G. L. Anderson, Vol. 13, Springer, 1992,\npp. 305–324, doi: 10.1007/978-94-017-1903-2_8\n14Hwang, W. and Park, H. C., “Finite Element Modeling of Piezoelectric Sensors and Actuators,” AIAA\nJournal, Vol. 31, No. 5, May 1993, pp. 930–937, doi: 10.2514/3.11707\n565 15Alvarez-Salazar, O. S. and Iliff, K., “Destabilizing Effects of Rate Feedback on Strain Actuated Beams,”\nJournal of Sound and Vibration, Vol. 221, No. 2, March 1999, pp. 289–307, doi: 10.1006/jsvi.1998.2010\n16Bailey, T. and Hubbard Jr., J. E., “Distributed Piezoelectric-Polymer Active Vibration Control of a\nCantilever Beam,” Journal of Guidance, Control, and Dynamics, Vol. 8, No. 5, Sept. 1985, pp. 605–611,\ndoi: 10.2514/3.20029\n570 17Dimitriadis, E. K., Fuller, C. R., and Rogers, C. A., “Piezoelectric Actuators for Distributed Vibration\nExcitation of Thin Plates,” Journal of Vibration and Acoustics, Vol. 113, No. 1, Jan. 1991, pp. 100–107,\ndoi: 10.1115/1.2930143\n18Pinkerton, J. L., McGowan, A.-A. R., Moses, R. W., Scott, R. C., , and Heeg, J., “Controlled Aeroelastic\nResponse and Airfoil Shaping Using Adaptive Materials and Integrated Systems,” Symposium on Smart\n575 Structures and Materials, San Diego, CA, USA, Feb. 1996, pp. 166–177.\n19Fowler, R. M., Investigation of Compliant Space Mechanisms with Application to the Design of a\nLarge-Displacement Monolithic Compliant Rotational Hinge, M.S. Thesis, Brigham Young University, Aug.\n2012.\n20Balas, M. J., “Active Control of Flexible Systems,” Journal of Optimization Theory and Applications,\n580 Vol. 25, No. 3, July 1978, pp. 415–436, doi: 10.1007/BF00932903\n21Junkins, J. L. and Rew, D. W., “Unified Optimization of Structures and Controllers,” Large Space\nStructures: Dynamics and Control, edited by S. N. Atluri and A. K. Amos, Springer Series in Computational\nMechanics, Springer, 1988, pp. 323–353, doi: 10.1007/978-3-642-83376-2_14\n22Allison, J. T., Guo, T., and Han, Z., “Co-Design of an Active Suspension Using Simultane585\nous Dynamic Optimization,” Journal of Mechanical Design, Vol. 136, No. 8, Aug. 2014, pp. 081003,\ndoi: 10.1115/1.4027335\n23Allison, J. T. and Herber, D. R., “Multidisciplinary Design Optimization of Dynamic Engineering\nSystems,” AIAA Journal, Vol. 52, No. 4, April 2014, pp. 691–710, doi: 10.2514/1.J052182\n24Allison, J. T., “Plant-Limited Co-Design of an Energy-Efficient Counterbalanced Robotic Manipulator,”\n590 ASME Journal of Mechanical Design, Vol. 135, No. 10, 2013, pp. 101003, doi: 10.1115/1.4024978\n25Salama, M., Garba, J., and Demsetz, L., “Simultaneous Optimization of Controlled Structures,” Computational\nMechanics, Vol. 3, No. 4, July 1988, pp. 275–282, doi: 10.1007/BF00368961\n26Wu, Z., Harne, R. L., and Wang, K.-W., “Energy Harvester Synthesis Via Coupled Linear-Bistable\nSystem with Multistable Dynamics,” Journal of Applied Mechanics, Vol. 81, No. 6, Feb. 2014, pp. 061005,\n595 doi: 10.1115/1.4026555\n27Grigoriadis, K. M., Zhu, G., and Skelton, R. E., “Optimal Redesign of Linear Systems,” Journal\nof Dynamic Systems, Measurement, and Control, Vol. 118, No. 3, Sept. 1993, pp. 598–605,\ndoi: 10.1115/1.2801186\n28Allison, J. T., Kokkolaras, M., and Papalambros, P. Y., “On Selecting Single-Level Formulations for\n600 Complex System Design Optimization,” Journal of Mechanical Design, Vol. 129, No. 9, Sept. 2006, pp. 898–\n906, doi: 10.1115/1.2747632\n29Herber, D. R., Dynamic System Design Optimization of Wave Energy Converters Utilizing Direct\nTranscription, M.S. Thesis, University of Illinois at Urbana-Champaign, Urbana, IL, USA, May 2014.\n30Fanson, J. L. and Caughey, T. K., “Positive Position Feedback Control for Large Space Structures,”\n605 AIAA Journal, Vol. 28, No. 4, April 1990, pp. 717–724, doi: 10.2514/3.10451\n31Li, W. P. and Huang, H., “Integrated Optimization of Actuator Placement and Vibration Control for\nPiezoelectric Adaptive Trusses,” Journal of Sound and Vibration, Vol. 332, No. 1, Jan. 2013, pp. 17–32,\ndoi: 10.1016/j.jsv.2012.08.005\n32Grandhi, R. V., “Structural and Control Optimization of Space Structures,” Computers \u0026 Structures,\n610 Vol. 31, No. 2, 1989, pp. 139–150, doi: 10.1016/0045-7949(89)90222-8\n33Belvin, W. K. and Park, K. C., “Structural Tailoring and Feedback Control Synthesis: An Interdisciplinary\nApproach,” Journal of Guidance, Control, and Dynamics, Vol. 13, No. 3, May 1990, pp. 424–429,\ndoi: 10.2514/3.25354\n34Herber, D. R., McDonald, J. W., Alvarez-Salazar, O. S., Krishnan, G., and Allison, J. T., “Reducing\n615 Spacecraft Jitter During Satellite Reorientation Maneuvers via Solar Array Dynamics,” AIAA/ISSMO Multidisciplinary\nAnalysis and Optimization Conference, No. AIAA 2014-3278, Atlanta, GA, USA, June 2014,\ndoi: 10.2514/6.2014-3278\n35Alvarez-Salazar, O. S., Aldrich, J. B., Filipe, N., Allison, J. T., and Chung, S.-J., “Strain Actuated Solar Arrays for Precision Pointing of Spacecraft,” AAS Guidance, Navigation, and Control Conference, No.\n620 AAS 16-137, Breckenridge, CO, USA, Feb. 2016.\n36Yu, Y.-Q., Howell, L. L., Lusk, C., Yue, Y., and He, M.-G., “Dynamic Modeling of Compliant Mechanisms\nBased on the Pseudo-Rigid-Body Model,” Journal of Mechanical Design, Vol. 127, No. 4, Aug. 2005,\npp. 760–765, doi: 10.1115/1.1900750\n37Ben-Tal, A. and Bar-Yoseph, P. Z., “Space-Time Spectral Element Method for Optimal Slewing of a\n625 Flexible Beam,” International Journal for Numerical Methods in Engineering, Vol. 39, No. 18, Sept. 1996,\npp. 3101–3121, doi: 10.1002/(SICI)1097-0207(19960930)39:18\u003c3101::AID-NME987\u003e3.0.CO;2-O\n38Chilan, C. M., Herber, D. R., Nakka, Y. K., Chung, S.-J., Allison, J. T., Aldrich, J. B., and Alvarez-\nSalazar, O. S., “Co-Design of Strain-Actuated Solar Arrays for Precision Pointing and Jitter Reduction,”\nAIAA/ASCE/AHS/ASC Structures, Structural Dynamics, and Materials Conference, No. AIAA 2016-0162,\n630 San Diego, CA, USA, Jan. 2016, doi: 10.2514/6.2016-0162\n39Bisplinghoff, R. L., Ashley, H., and Halfman, R. L., Aeroelasticity, Addison-Wesley, 1995.\n40Junkins, J. L. and Kim, Y., Introduction to Dynamics and Control of Flexible Structures, AIAA, 1st\ned., 1993, doi: 10.2514/4.862076\n41Paranjape, A. A., Guan, J., Chung, S.-J., and Krstic, M., “PDE Boundary Control for Flexible\n635 Articulated Wings on a Robotic Aircraft,” IEEE Transactions on Robotics, Vol. 29, No. 3, June 2013,\npp. 625–640, doi: 10.1109/TRO.2013.2240711\n42Deshmukh, A. P., Herber, D. R., and Allison, J. T., “Bridging the Gap between Open-\nLoop and Closed-Loop Control in Co-Design: A Framework for Complete Optimal Plant and Control\nArchitecture Design,” American Control Conference, Chicago, IL, USA, July 2015, pp. 4916–4922,\n640 doi: 10.1109/ACC.2015.7172104\n43Paranjape, A. A., Chung, S.-J., Hilton, H. H., and Chakravarthy, A., “Dynamics and Performance of\nTailless Micro Aerial Vehicle with Flexible Articulated Wings,” AIAA Journal, Vol. 50, No. 5, May 2012,\npp. 1177–1188, doi: 10.2514/1.J051447\n44Nakka, Y. K., Nonlinear Attitude Control of Spacecraft With Strain-Actuated Solar Arrays, M.S. The645\nsis, University of Illinois at Urbana-Champaign, Urbana, IL, USA, Aug. 2016.\n45Moheimani, S. O. M. and Fleming, A. J., Piezoelectric Transducers for Vibration Control and Damping,\nSpringer, 1st ed., 2006, doi: 10.1007/1-84628-332-9\n46Lindmayer, J. and C.Y., W., “Development of a High Efficiency Thin Silicon Solar Cell,” Tech. Rep.\nSX/105/F, Solarex Corporation, Rockville, MD, USA, Sept. 1977.\n650 47Lee, J., Wu, J., Shi, M., Yoon, J., Park, S.-I., Li, M., Liu, Z., Huang, Y., and Rogers, J. A., “Stretchable GaAS Photovoltaics With Designs That Enable High Areal Coverage,” Advanced Materials, Vol. 23, No. 8,\nFeb. 2011, pp. 986–991, doi: 10.1002/adma.201003961\n48Qiu, L., He, S., Yang, J., Deng, J., and Peng, H., “Fiber-Shaped Perovskite Solar Cells\nWith High Power Conversion Efficiency,” Small, Vol. 12, No. 18, May 2016, pp. 2419–2424,\n655 doi: 10.1002/smll.201600326\n49Fathy, H. K., Reyer, J. A., and Papalambros, P. Y., “On the Coupling Between the Plant and Controller\nOptimization Problems,” American Control Conference, Arlington, VA, USA, June 2001, pp. 1864–1869,\ndoi: 10.1109/ACC.2001.946008\n50Enright, P. J. and Conway, B. A., “Discrete Approximations to Optimal Trajectories Using Direct\n660 Transcription and Nonlinear Programming,” Journal of Guidance, Control, and Dynamics, Vol. 15, No. 4,\nJuly–Aug. 1992, pp. 994–1002, doi: 10.2514/3.20934\n51Betts, J. T., Practical Methods for Optimal Control and Estimation Using Nonlinear Programming,\nSIAM, 2nd ed., 2010, doi: 10.1137/1.9780898718577\n52Biegler, L. T., Nonlinear Programming: Concepts, Algorithms, and Applications to Chemical Processes,\n665 SIAM, 2010, doi: 10.1137/1.9780898719383\n53Chilan, C. M. and Conway, B. A., “Automated Design of Multiphase Space Missions Using Hybrid\nOptimal Control,” Journal of Guidance, Control, and Dynamics, Vol. 36, No. 5, Sept. 2013, pp. 1410–1424,\ndoi: 10.2514/1.58766\n54Morgan, D., Chung, S.-J., and Hadaegh, F. Y., “Model Predictive Control of Swarms of Spacecraft\n670 Using Sequential Convex Programming,” Journal of Guidance, Control, and Dynamics, Vol. 37, No. 6, 2014,\npp. 1725–1740, doi: 10.2514/1.G000218"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NASA/JPL/Caltech","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"TD","local_group":["GALCIT"]}