{"title":"Application of Bottlebrush Block Copolymers as Photonic Crystals","uri":"","abstract":"Brush block copolymers are a class of comb polymers that feature polymeric side chains densely grafted to a linear backbone. These polymers display interesting properties due to their dense functionality, low entanglement, and ability to rapidly self-assemble to highly ordered nanostructures. The ability to prepare brush polymers with precise structures has been enabled by advancements in controlled polymerization techniques. This Feature Article highlights the development of brush block copolymers as photonic crystals that can reflect visible to near-infrared wavelengths of light. Fabrication of these materials relies on polymer self-assembly processes to achieve nanoscale ordering, which allows for the rapid preparation of photonic crystals from common organic chemical feedstocks. The characteristic physical properties of brush block copolymers are discussed, along with methods for their preparation. Strategies to induce self-assembly at ambient temperatures and the use of blending techniques to tune photonic properties are emphasized.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252641","docid":252641,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1262223","fileid":1262223,"datasetid":"document","objectid":252641,"filename":"7c72be7e5c609747837405b0c1a2ba0f38d31d16be148e62e69f04e0f9396d79.pdf","mime_type":"application/pdf","hash":"665f1a4c99102fcefc223baf732d01e3","hash_type":"MD5","filesize":4007786,"mtime":"2017-05-24 14:56:42","url":"http://authors.library.caltech.edu/77691/1/7c72be7e5c609747837405b0c1a2ba0f38d31d16be148e62e69f04e0f9396d79.pdf"}],"eprintid":77691,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"7c72be7e5c609747837405b0c1a2ba0f38d31d16be148e62e69f04e0f9396d79.pdf","content":"inpress"}],"note":"© 2017 Wiley-VCH Verlag GmbH \u0026 Co. KGaA, Weinheim. \n\nReceived: January 25, 2017; Revised: April 8, 2017; Published online 22 May 2017. \n\nWe would like to acknowledge the many co-workers over the years who have contributed to the research described above. The U.S. National Science Foundation (CHE-1048404), U.S. Department of Energy (DE-SC0001293), and a Dow Resnick Bridge Award funded aspects of our research in this area. A.L.L.-M. thanks the Resnick Sustainability Institute at Caltech for fellowship support. We thank Alice B. Chang for insightful discussions during the preparation of this manuscript.","id":77691,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/76/91","datestamp":"2017-05-24 16:16:17","lastmod":"2017-05-24 16:16:17","status_changed":"2017-05-24 16:16:17","type":"article","metadata_visibility":"show","creators":[{"given":"Allegra L.","family":"Liberman-Martin","id":"Liberman-Martin-A-L","orcid":"0000-0002-8447-905X"},{"given":"Crystal K.","family":"Chu","id":"Chu-Crystal-K","orcid":""},{"given":"Robert H.","family":"Grubbs","id":"Grubbs-R-H","orcid":"0000-0002-0057-7817"}],"ispublished":"inpress","subjects":null,"full_text_status":"none","keywords":"photonic crystals; bottlebrush; block copolymers; self-assembly; structural color","date":"2017-05-22","date_type":"inpress","publication":"Macromolecular Rapid Communications","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170524-075636935","refereed":true,"issn":"1022-1336","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170524-075636935","related_url":[{"url":"http://dx.doi.org/10.1002/marc.201700058","type":"doi","description":"Article"},{"url":"http://onlinelibrary.wiley.com/doi/10.1002/marc.201700058/abstract","type":"pub","description":"Article"}],"referencetext":["1\na) M. Qiu, M. Mulot, M. Swillo, S. Anand, B. Jaskorzynska, A. Karlsson, M. Kamp, A. Forchel, Appl. Phys. Lett. 2003, 83, 5121;\n\nb) Y. Mahmoud, G. Bassou, A. Taalbi, Z. M. Chekroun, Optics Communications 2012, 285, 368.\n\n2\nM. Malekmohammad, M. Soltanolkotabi, A. Erfanian, R. Asadi, S. Bagheri, M. Zahedinejad, M. Khaje, M. H. Naderi, J. Euro. Opt. Soc. Rapid Public. 2012, 7, 12008.\n\n3\na) H. Ding, C. Liu, H. Gu, Y. Zhao, B. Wang, Z. Gu, ACS Photonics 2014, 1, 121;\n\nb) H. Ding, C. Liu, B. Ye, F. Fu, H. Wang, Y. Zhao, Z. Gu, ACS Appl. Mater. Interfaces 2016, 8, 6796.\n\n4\nJ. Rosenberg, R. V. Shenoi, S. Krishna, O. Painter, Optics Express 2010, 18, 3672.\n\n5\nJ. D. Joannopoulos, S. G. Johnson, J. N. Winn, R. D. Meade, Photonic Crystals: Molding the Flow of Light, 2nd ed., Princeton University Press, Princeton, NJ, 2008.\n\n6\nY. Wang, D. Chen, G. Zhang, J. Wang, S. Tao, Optics Commun. 2016, 363, 13.\n\n7\nB. R. Sveinbjörnsson, R. A. Weitekamp, G. M. Miyake, Y. Xia, H. A. Atwater, R. H. Grubbs, Proc. Natl. Acad. Sci. USA 2012, 109, 14332.\n\n8\nM. Maldovan, E. L. Thomas, Periodic Materials and Interference Lithography, Wiley-VCH Publishers, Weinheim, 2009.\n\n9\nE. Yablonovitch, J. Phys. Condens. Matter 1993, 5, 2443.\n\n10\nC. Paquet, E. Kumacheva, Materials Today 2008, 11, 48.\n\n11\nJ. H. Moon, S. Yang, Chem. Rev. 2010, 110, 547.\n\n12\nJ.-H. Lee, C. Y. Koh, J. P. Singer, S.-J. Jeon, M. Maldovan, O. Stein, E. L. Thomas, Adv. Mater. 2014, 26, 532.\n\n13\nS. Y. Lin, J. G. Fleming, D. L. Hetherington, B. K. Smith, R. Biswas, K. M. Ho, M. M. Sigalas, W. Zubrzycki, S. R. Kurtz, J. Bur, Nature 1998, 394, 251.\n\n14\nM. Campbell, D. N. Sharp, M. T. Harrison, R. G. Denning, A. J. Turberfield, Nature 2000, 404, 53.\n\n15\nS. Jeon, J.-U. Park, R. Cirelli, S. Yang, C. E. Heitzman, P. V. Braun, P. J. A. Kenis, J. A. Rogers, Proc. Natl. Acad. Sci. USA 2004, 101, 12428.\n\n16\nH. Masuda, M. Ohya, H. Asoh, M. Nakao, M. Nohtomi, T. Tamamura, Jpn. J. Appl. Phys. 1999, 38, 1403.\n\n17\nJ. A. Liddle, G. M. Gallatin, ACS Nano 2016, 10, 2995.\n\n18\nJ. F. Galisteo-López, M. Ibisate, R. Sapienza, L. S. Froufe-Pérez, Á. Blanco, C. López, Adv. Mater. 2011, 23, 30.\n\n19\na) J. Ge, Y. Yin, Angew. Chem. Int. Ed. 2011, 50, 1492;\n\nb) P. V. Braun, P. Wiltzius, Nature 1999, 402, 603;\n\nc) C. I. Aguirre, E. Reguera, A. Stein, Adv. Funct. Mater. 2010, 20, 2565.\n\n20\nG. M. Miyake, R. A. Weitekamp, R. H. Grubbs, in Handbook of Metathesis Vol. 3: Polymer Synthesis, 2 ed. (Eds: R. H. Grubbs, E. Knosravi), Wiley-VCH Verlag GmbH \u0026 Co, 2015, p. 93.\n\n21\nM. B. Runge, C. E. Lipscomb, L. R. Ditzler, M. K. Mahanthappa, A. V. Tivanski, N. B. Bowden, Macromolecules 2008, 41, 7687.\n\n22\nY. Fink, A. M. Urbas, M. G. Bawendi, J. D. Joannopoulos, E. L. Thomas, J. Lightwave Tech. 1999, 17, 1963.\n\n23\nF. S. Bates, G. H. Fredrickson, Annu. Rev. Phys. Chem. 1990, 41, 525.\n\n24\na) A. Walther, A. H. Müller, Chem. Rev. 2013, 113, 5194;\n\nb) Y. Mai, A. Eisenberg, Chem. Soc. Rev. 2012, 41, 5969.\n\n25\nJ. Rzayev, Macromolecules 2009, 42, 2135.\n\n26\na) C. M. Bates, F. S. Bates, Macromolecules 2017, 50, 3;\n\nb) A. Noro, Y. Tomita, Y. Matsushita, E. L. Thomas, Macromolecules 2016, 49, 8971.\n\n27\nJ. K. D. Mapas, T. Thomay, A. N. Cartwright, J. Ilavsky, J. Rzayev, Macromolecules 2016, 49, 3733.\n\n28\nS. W. Hong, W. Gu, J. Huh, B. R. Sveinbjörnsson, G. Jeong, R. H. Grubbs, T. P. Russel, ACS Nano 2013, 7, 9684.\n\n29\nA. M. Urbas, M. Maldovan, P. DeRege, E. L. Thomas, Adv. Mater. 2002, 14, 1850.\n\n30\nJ. Rzayev, ACS Macro Lett. 2012, 1, 1146.\n\n31\na) M. Zhang, A. H. E. Müller, J. Polym. Sci., Part A: Polym. Chem. 2005, 43, 3461;\n\nb) S. S. Sheiko, M. Möller, Chem. Rev. 2001, 101, 4099.\n\n32\na) M. Hu, Y. Xia, G. B. McKenna, J. A. Kornfield, R. H. Grubbs, Macromolecules 2011, 44, 6935;\n\nb) B. M. Yavitt, Y. Gai, D.-P. Song, H. H. Winter, J. J. Watkins, Macromolecules 2016;\n\nc) S. J. Dalsin, M. A. Hillmyer, F. S. Bates, Macromolecules 2015, 48, 4680.\n\n33\nW. Gu, J. Huh, S. W. Hong, B. R. Sveinbjörnsson, C. Park, R. H. Grubbs, T. P. Russell, ACS Nano 2013, 7, 2551.\n\n34\nS. J. Dalsin, T. G. Rions-Maehren, M. D. Beam, F. S. Bates, M. A. Hillmyer, M. W. Matsen, ACS Nano 2015, 9, 12233.\n\n35\nJ. Bolton, T. S. Bailey, J. Rzayev, Nano Lett. 2011, 11, 998.\n\n36\nB. R. Sveinbjörnsson, Ph.D. Dissertation, California Institute of Technology, (Pasadena, CA), April, 2014.\n\n37\na) R. Verduzco, X. Li, S. L. Pesek, G. E. Stein, Chem. Soc. Rev. 2015, 44, 2405;\n\nb) C. Feng, Y. Li, D. Yang, J. Hu, X. Zhang, X. Huang, Chem. Soc. Rev. 2001, 40, 1282.\n\n38\nS. S. Sheiko, B. S. Sumerlin, K. Matyjaszewski, Prog. Polym. Sci. 2008, 33, 759.\n\n39\na) H. Shinoda, K. Matyjaszewski, Macromolecules 2001, 34, 6243;\n\nb) Y. Xia, B. D. Olsen, J. A. Kornfield, R. H. Grubbs, J. Am. Chem. Soc. 2009, 131, 18525;\n\nc) Z. Li, K. Zhang, J. Ma, C. Cheng, K. L. Wooley, J. Polym. Sci. A, Polym. Chem. 2009, 47, 5557.\n\n40\na) M. B. Runge, N. B. Bowden, J. Am. Chem. Soc. 2007, 129, 10551;\n\nb) M. B. Runge, S. Dutta, N. B. Bowden, Macromolecules 2006, 39, 498.\n\n41\nM. W. Matsen, F. S. Bates, J. Polym. Sci., Part B: Polym. Phys. 1997, 35, 945.\n\n42\na) Y. Xia, J. A. Kornfield, R. H. Grubbs, Macromolecules 2009, 42, 3761;\n\nb) C. Cheng, E. Khoshdel, K. L. Wooley, Macromolecules 2005, 38, 9455.\n\n43\nM. Vayer, M. A. Hillmyer, M. Dirany, G. Thevenin, R. Erre, C. Sinturel, Thin Solid Films 2010, 518, 3710.\n\n44\nG. M. Miyake, R. A. Weitekamp, V. A. Piunova, R. H. Grubbs, J. Am. Chem. Soc. 2012, 134, 14249.\n\n45\na) E. Yashima, K. Maeda, H. Iida, Y. Furusho, K. Nagai, Chem. Rev. 2009, 109, 6102;\n\nb) S. Mayer, R. Zentel, Prog. Polym. Sci. 2001, 26, 1973.\n\n46\nJ. T. Chen, E. L. Thomas, C. K. Ober, G.-p. Mao, Science 1996, 273, 343.\n\n47\nM. Kikuchi, L. T. N. Lien, A. Narumi, Y. Jinbo, Y. Izumi, K. Nagai, S. Kawaguchi, Macromolecules 2008, 41, 6564.\n\n48\na) N. A. Lynd, M. A. Hillmyer, Macromolecules 2005, 38, 8803;\n\nb) N. A. Lynd, A. J. Meuler, M. A. Hillmyer, Prog. Polym. Sci. 2008, 33, 875;\n\nc) J. M. Widin, M. Kim, A. K. Schmitt, E. Han, P. Gopalan, M. K. Mahanthappa, Macromolecules 2013, 46, 4472.\n\n49\nV. A. Piunova, G. M. Miyake, C. S. Daeffler, R. A. Weitekamp, R. H. Grubbs, J. Am. Chem. Soc. 2013, 135, 15609.\n\n50\na) K. Koo, H. Ahn, S.-W. Kim, D. Y. Ryu, T. P. Russell, Soft Matter 2013, 9, 9059;\n\nb) F. H. Schacher, P. A. Rupar, I. Manners, Angew. Chem. Int. Ed. 2012, 51, 7898;\n\nc) J. Yoon, W. Lee, E. L. Thomas, MRS Bulletin 2011, 30, 721;\n\nd) A. C. Edrington, A. M. Urbas, P. DeRege, C. X. Chen, T. M. Swager, N. Hadjichristidis, M. Xenidou, L. J. Fetters, J. D. Joannopoulos, Y. Fink, E. L. Thomas, Adv. Mater. 2001, 13, 421.\n\n51\nR. J. Macfarlane, B. Kim, B. Lee, R. A. Weitekamp, C. M. Bates, S. F. Lee, A. B. Chang, K. T. Delaney, G. H. Fredrickson, H. A. Atwater, R. H. Grubbs, J. Am. Chem. Soc. 2014, 136, 17374.\n\n52\nR. J. Spontak, N. P. Patel, in Developments in Block Copolymer Science and Technology, (Ed: I. W. Hamley), John Wiley \u0026 Sons, Ltd, Chichester, UK, 2004.\n\n53\nG. M. Miyake, V. A. Piunova, R. A. Weitekamp, R. H. Grubbs, Angew. Chem. Int. Ed. 2012, 51, 11246.\n\n54\na) K. H. Ku, H. Yang, S. G. Jang, J. Bang, B. J. Kim, J. Polym. Sci. Part A: Polym. Chem. 2016, 54, 228;\n\nb) B. Sarkar, P. Alexandridis, Prog. Polym. Sci. 2015, 40, 33;\n\nc) I. W. Hamley, Nanotech. 2003, 14, R39;\n\nd) M. R. Bockstaller, R. A. Mickiewicz, E. L. Thomas, Adv. Mater. 2005, 17, 1331.\n\n55\na) D.-P. Song, S. Shahin, W. Xie, S. Mehravar, X. Liu, C. Li, R. A. Norwood, J.-H. Lee, J. J. Watkins, Macromolecules 2016, 49, 5068;\n\nb) D. P. Song, C. Li, W. Li, J. J. Watkins, ACS Nano 2016, 10, 1216;\n\nc) D. P. Song, C. Li, N. S. Colella, X. Lu, J. H. Lee, J. J. Watkins, Adv. Optical Mater. 2015, 3, 1169;\n\nd) D. P. Song, Y. Lin, Y. Gai, N. S. Colella, C. Li, X. H. Liu, S. Gido, J. J. Watkins, J. Am. Chem. Soc. 2015, 137, 3771.\n\n56\nJ. Polte, CrystEngComm 2015, 17, 6809.\n\n57\nD. P. Song, C. Li, N. S. Colella, W. Xie, S. Li, X. Lu, S. Gido, J. H. Lee, J. J. Watkins, J Am Chem Soc 2015, 137, 12510.\n\n58\nK. Kawamoto, M. Zhong, K. R. Gadelrab, L. C. Cheng, C. A. Ross, A. Alexander-Katz, J. A. Johnson, J Am Chem Soc 2016, 138, 11501.\n\n59\na) D. R. Snoswell, A. Kontogeorgos, J. J. Baumberg, T. D. Lord, M. R. Mackley, P. Spahn, G. P. Hellmann, Phys. Rev. E 2010, 81, 020401;\n\nb) A. J. Parnell, N. Tzokova, A. Pryke, J. R. Howse, O. O. Mykhaylyk, A. J. Ryan, P. Panine, J. P. Fairclough, Phys. Chem. Chem. Phys. 2011, 13, 3179.\n\n60\na) Y. Yue, J. P. Gong, J. Photochem. and Photobio. C: Photochem. Rev. 2015, 23, 45;\n\nb) J. E. Stumpel, D. J. Broer, A. P. Schenning, Chem. Commun. 2014, 50, 15839;\n\nc) H. Wang, K. Q. Zhang, Sensors 2013, 13, 4192.\n\n61\nI. B. Burgess, M. Loncˇar, J. Aizenberg, J. Mater. Chem. C 2013, 1, 6075.\n\n62\nC. Osuji, C.-Y. Chao, I. Bita, C. K. Ober, E. L. Thomas, Adv. Funct. Mater. 2002, 12, 753.\n\n63\na) H. Fudouzi, T. Sawada, Langmuir 2006, 22, 1365;\n\nb) E. P. Chan, J. J. Walish, E. L. Thomas, C. M. Stafford, Adv. Mater. 2011, 23, 4702;\n\nc) E. P. Chan, J. J. Walish, A. M. Urbas, E. L. Thomas, Adv. Mater. 2013, 25, 3934.\n\n64\na) J. H. Holtz, S. A. Asher, Nature 1997, 389, 829;\n\nb) K. Lee, S. A. Asher, J. Am. Chem. Soc. 2000, 122, 9534;\n\nc) Y.-J. Lee, P. V. Braun, Adv. Mater. 2003, 15, 563.\n\n65\na) X. Xu, G. Friedman, K. D. Humfeld, S. A. Majetich, S. A. Asher, Chem. Mater. 2002, 14, 1249;\n\nb) K. Ueno, K. Matsubara, M. Wantanabe, Y. Takeoka, Adv. Mater. 2007, 19, 28087.\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"A. L. Liberman-Martin, C. K. Chu, R. H. Grubbs, Macromol. Rapid Commun. 2017, 1700058","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"CHE-1048404"},{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0001293"},{"agency":"Dow Chemical Company","grant_number":""},{"agency":"Resnick Sustainability Institute","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Resnick Sustainability Institute"]}