{"title":"An Application of Multi-band Forced Photometry to One Square Degree of SERVS: Accurate Photometric Redshifts and Implications for Future Science","uri":"","abstract":"We apply The Tractor image modeling code to improve upon existing multi-band photometry for the Spitzer Extragalactic Representative Volume Survey (SERVS). SERVS consists of post-cryogenic Spitzer observations at 3.6 and 4.5 μm over five well-studied deep fields spanning 18 deg^2. In concert with data from ground-based near-infrared (NIR) and optical surveys, SERVS aims to provide a census of the properties of massive galaxies out to z ≈ 5. To accomplish this, we are using The Tractor to perform \"forced photometry.\" This technique employs prior measurements of source positions and surface brightness profiles from a high-resolution fiducial band from the VISTA Deep Extragalactic Observations survey to model and fit the fluxes at lower-resolution bands. We discuss our implementation of The Tractor over a square-degree test region within the XMM Large Scale Structure field with deep imaging in 12 NIR/optical bands. Our new multi-band source catalogs offer a number of advantages over traditional position-matched catalogs, including (1) consistent source cross-identification between bands, (2) de-blending of sources that are clearly resolved in the fiducial band but blended in the lower resolution SERVS data, (3) a higher source detection fraction in each band, (4) a larger number of candidate galaxies in the redshift range 5 \u003c z \u003c 6, and (5) a statistically significant improvement in the photometric redshift accuracy as evidenced by the significant decrease in the fraction of outliers compared to spectroscopic redshifts. Thus, forced photometry using The Tractor offers a means of improving the accuracy of multi-band extragalactic surveys designed for galaxy evolution studies. We will extend our application of this technique to the full SERVS footprint in the future.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252700","docid":252700,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1262591","fileid":1262591,"datasetid":"document","objectid":252700,"filename":"Nyland_2017_ApJS_230_9.pdf","mime_type":"application/pdf","hash":"ccc103119a8fa9b3a1e3d6fcb0dcee36","hash_type":"MD5","filesize":4646421,"mtime":"2017-05-24 19:42:31","url":"http://authors.library.caltech.edu/77715/1/Nyland_2017_ApJS_230_9.pdf"}],"eprintid":77715,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Nyland_2017_ApJS_230_9.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252701","docid":252701,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1262593","fileid":1262593,"datasetid":"document","objectid":252701,"filename":"1704.01582.pdf","mime_type":"application/pdf","hash":"0488a1b9da526e22558a4dfce3de0760","hash_type":"MD5","filesize":9795517,"mtime":"2017-05-24 19:42:38","url":"http://authors.library.caltech.edu/77715/2/1704.01582.pdf"}],"eprintid":77715,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1704.01582.pdf","content":"submitted"}],"note":"© 2017 The American Astronomical Society. \n\nReceived 2016 December 30; revised 2017 April 4; accepted 2017 April 11; published 2017 May 24. \n\nWe thank the referee for providing us with thoughtful comments that have significantly improved the quality of this work. We also thank Scott Ransom for assisting us with the implementation of parallelization in our Python driver script. The National Radio Astronomy Observatory is a facility of the National Science Foundation operated under cooperative agreement by Associated Universities, Inc. G.W. acknowledges financial support for this work from NSF grant AST-1517863 and from NASA through programs GO-13306, GO-13677, GO-13747, \u0026 GO-13845/14327 from the Space Telescope Science Institute, which is operated by AURA, Inc., under NASA contract NAS 5-26555. M.V. acknowledges support from the European Commission Research Executive Agency (FP7-SPACE-2013-1 GA 607254), the South African Department of Science and Technology (DST/CON 0134/2014), and the Italian Ministry for Foreign Affairs and International Cooperation (PGR GA ZA14GR02). \n\nThis work is based on observations made with the Spitzer Space Telescope, which is operated by the Jet Propulsion Laboratory, California Institute of Technology under a contract with NASA. Support for this work was provided by the grant associated with Spitzer proposal 11086. Our analysis includes observations obtained with the MegaPrime/MegaCam instrument, a joint project of CFHT and CEA/IRFU, at the Canada–France–Hawaii Telescope (CFHT), which is operated by the National Research Council (NRC) of Canada, the Institut National des Science de l'Univers of the Centre National de la Recherche Scientifique (CNRS) of France, and the University of Hawaii. This study is also based in part on data products produced at Terapix available at the Canadian Astronomy Data Centre as part of the Canada–France–Hawaii Telescope Legacy Survey, a collaborative project of NRC and CNRS. We additionally utilized data from the VIMOS VLT Deep Survey, obtained from the VVDS database operated by Cesam, Laboratoire d'Astrophysique de Marseille, France. \n\nThe authors have made use of Astropy, a community-developed core Python package for Astronomy (Astropy Collaboration et al. 2013). We also used Montage, which is funded by the National Science Foundation under grant No. ACI-1440620, and was previously funded by the National Aeronautics and Space Administration's Earth Science Technology Office, Computation Technologies Project, under Cooperative Agreement Number NCC5-626 between NASA and the California Institute of Technology. \n\nFacilities: Spitzer (IRAC), VISTA, CFHT.","id":77715,"rev_number":13,"userid":18,"eprint_dir":"disk0/00/07/77/15","datestamp":"2017-05-24 21:10:46","lastmod":"2017-05-24 21:10:46","status_changed":"2017-05-24 21:10:46","type":"article","metadata_visibility":"show","creators":[{"given":"Kristina","family":"Nyland","id":"Nyland-K","orcid":""},{"given":"Mark","family":"Lacy","id":"Lacy-M","orcid":""},{"given":"Anna","family":"Sajina","id":"Sajina-A","orcid":""},{"given":"Janine","family":"Pforr","id":"Pforr-J","orcid":""},{"given":"Duncan","family":"Farrah","id":"Farrah-D","orcid":""},{"given":"Gillian","family":"Wilson","id":"Wilson-G","orcid":""},{"given":"Jason","family":"Surace","id":"Surace-J-A","orcid":"0000-0001-7291-0087"},{"given":"Boris","family":"Häußler","id":"Häußler-B","orcid":""},{"given":"Mattia","family":"Vaccari","id":"Vaccari-M","orcid":""},{"given":"Matt","family":"Jarvis","id":"Jarvis-M-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"catalogs; Galaxies: evolution ; methods: data analysis; surveys; techniques: image processing","date":"2017-05","date_type":"published","publication":"Astrophysical Journal Supplement Series","volume":"230","number":"1","pagerange":"Art. No. 9","id_number":"CaltechAUTHORS:20170524-124220253","refereed":true,"issn":"1538-4365","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170524-124220253","related_url":[{"url":"https://doi.org/10.3847/1538-4365/aa6fed","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-4365/aa6fed/meta","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1704.01582","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Aihara H., Armstrong R., Bickerton S. et al 2017 arXiv:1702.08449\nPreprint\nAstropy Collaboration, Robitaille T. P., Tollerud E. J. et al 2013 A\u0026A 558 A33\nCrossref \nBerriman G. B. and Good J. C. 2017 PASP 975 058006\nCrossrefADS \nBertin E. 2011 ASP Conf. Ser. 442, Astronomical Data Analysis Software and Systems XX ed I. N. Evans et al (San Francisco, CA: ASP) 435\nADS \nBertin E. and Arnouts S. 1996 A\u0026AS 117 393\nCrossrefADS \nBolzonella M., Miralles J.-M. and Pelló R. 2000 A\u0026A 363 476\nADS \nBudavári T. and Basu A. 2016 AJ 152 86\nIOPscienceADS \nDark Energy Survey Collaboration, Abbott T., Abdalla F. B. et al 2016 MNRAS 460 1270\nCrossrefADS \nFazio G. G., Hora J. L., Allen L. E. et al 2004 ApJS 154 10\nIOPscienceADS \nFeigelson E. D. and Babu G. J. 2012 Modern Statistical Methods for Astronomy (Cambridge: Cambridge Univ. Press)\nCrossref \nFlewelling H. A., Magnier E. A., Chambers K. C. et al 2016 arXiv:1612.05243\nPreprint\nGwyn S. D. J. 2012 AJ 143 38\nIOPscienceADS \nHönig S. F., Watson D., Kishimoto M. et al 2017 MNRAS 464 1693\nCrossrefADS \nHora J. L., Marengo M., Park R. et al 2012 Proc. SPIE 8442 844239\nCrossref \nHuber M. and PS1-IPP Team, P.S.C. 2015 American Astronomical Society Meeting Abstracts #225 336.17\nADS \nHurley P. D., Oliver S., Betancourt M. et al 2017 MNRAS 464 885\nCrossrefADS \nIlbert O., Capak P., Salvato M. et al 2009 ApJ 690 1236\nIOPscienceADS \nJarvis M. J., Bonfield D. G., Bruce V. A. et al 2013 MNRAS 428 1281\nCrossrefADS \nKron R. G. 1980 ApJS 43 305\nCrossrefADS \nLang D., Hogg D. W. and Mykytyn D. 2016a The Tractor: Probabilistic Astronomical Source Detection and Measurement Astrophysics Source Code Library ascl:1604.008\n \nLang D., Hogg D. W. and Schlegel D. J. 2016b AJ 151 36\nIOPscienceADS \nLawrence A., Warren S. J., Almaini O. et al 2007 MNRAS 379 1599\nCrossrefADS \nLe Fèvre O., Cassata P., Cucciati O. et al 2013 A\u0026A 559 A14\nCrossrefADS \nLe Fèvre O., Tasca L. A. M., Cassata P. et al 2015 A\u0026A 576 A79\nCrossrefADS \nLonsdale C. J., Smith H. E., Rowan-Robinson M. et al 2003 PASP 115 897\nIOPscienceADS \nMancone C. L., Gonzalez A. H., Moustakas L. A. and Price A. 2013 PASP 125 1514\nIOPscienceADS \nMaraston C. 2005 MNRAS 362 799\nCrossrefADS \nMarquez M. J., Budavári T. and Sarro L. M. 2014 A\u0026A 563 A14\nCrossrefADS \nMauduit J.-C., Lacy M., Farrah D. et al 2012 PASP 124 714\nIOPscienceADS \nMerlin E., Amorín R., Castellano M. et al 2016a A\u0026A 590 A30\nCrossrefADS \nMerlin E., Bourne N., Castellano M. et al 2016b A\u0026A 595 A97\nCrossrefADS \nMerlin E., Fontana A., Ferguson H. C. et al 2015 A\u0026A 582 A15\nCrossrefADS \nOesch P. A., Bouwens R. J., Illingworth G. D. et al 2014 ApJ 786 108\nIOPscienceADS \nOliver S. J., Bock J., Altieri B. et al 2012 MNRAS 424 1614\nCrossrefADS \nPapovich C., Shipley H. V., Mehrtens N. et al 2016 ApJS 224 28\nIOPscienceADS \nPeng C. Y., Ho L. C., Impey C. D. and Rix H.-W. 2002 AJ 124 266\nIOPscienceADS \nPforr J., Maraston C. and Tonini C. 2013 MNRAS 435 1389\nCrossrefADS \nRichards G. T., Myers A. D., Peters C. M. et al 2015 ApJS 219 39\nIOPscienceADS \nSteidel C. C., Adelberger K. L., Shapley A. E. et al 2003 ApJ 592 728\nIOPscienceADS \nSteidel C. C., Hunt M. P., Shapley A. E. et al 2002 ApJ 576 653\nIOPscienceADS \nTaylor M. B. 2005 ASP Conf. Ser. 347, Astronomical Data Analysis Software and Systems XIV ed P. Shopbell, M. Britton and R. Ebert (San Francisco, CA: ASP) 29\nADS \nTimlin J. D., Ross N. P., Richards G. T. et al 2016 ApJS 225 1\nIOPscienceADS \nVaccari M. 2015 in The Many Facets of Extragalactic Radio Surveys: Towards New Scientific Challenges, Galaxy Evolution I (Trieste: SISSA) 27\nADS \nVaccari M., Covone G., Radovich M. et al 2017 arXiv:1704.01495\nPreprint\nWang W.-H., Barger A. J. and Cowie L. L. 2012 ApJ 744 155\nIOPscienceADS \nWerner M. W., Roellig T. L., Low F. J. et al 2004 ApJS 154 1\nIOPscienceADS \nWright A. H., Robotham A. S. G., Bourne N. et al 2016 MNRAS 460 765\nCrossrefADS \nYan H., Dickinson M., Eisenhardt P. R. M. et al 2004 ApJ 616 63"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Kristina Nyland et al 2017 ApJS 230 9","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"AST-1517863"},{"agency":"NASA","grant_number":"GO-13306"},{"agency":"NASA","grant_number":"GO-13677"},{"agency":"NASA","grant_number":"GO-13747"},{"agency":"NASA","grant_number":"GO-13845/14327"},{"agency":"NASA","grant_number":"NAS 5-26555"},{"agency":"European Research Council (ERC)","grant_number":"GA 607254"},{"agency":"South African Department of Science and Technology","grant_number":"DST/CON 0134/2014"},{"agency":"Italian Ministry for Foreign Affairs and International Cooperation","grant_number":"PGR GA ZA14GR02"},{"agency":"NASA/JPL/Caltech","grant_number":""},{"agency":"Spitzer","grant_number":"11086"},{"agency":"NSF","grant_number":"ACI-1440620"},{"agency":"NASA","grant_number":"NCC5-626"},{"agency":"Department of Science and Technology (South Africa)","grant_number":"DST/CON 0134/2014"},{"agency":"Ministero Affari Esteri e della Cooperazione internazionale (MAECI)","grant_number":"PGR GA ZA14GR02"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Infrared Processing and Analysis Center (IPAC)"]}