{"title":"Implications of an Electron-Hopping Model for Charge Transport through Donor−Bridge−Acceptor Assemblies Connected to Metal Electrodes","uri":"","abstract":"An electron-hopping model for electrode-to-electrode charge transport through donor-bridge-acceptor assemblies (J. Phys. Chem. B 2003, 107, 10687) is further developed by detailed electrostatic analysis of the assembly and treatment of the steady-state kinetics. Charge transport between the two electrodes proceeds via the D−B−A bridges:  D transfers an electron to A through the bridge. The newly formed D+ and A- are then rapidly reduced and oxidized, respectively, at the electrodes giving rise to a steady state in which the current depends on the rate of electron transfer from D to A. The driving force dependence of the nuclear factor for the D to A electron transfer results in the current through the D−B−A bridge increasing with applied voltage (positive differential conductance) in the normal free-energy region but decreasing in the inverted region (negative differential conductance). The electronic factors can be manipulated by changing the separations between the electrodes and DBA or the length of B or by changing the nature of the bridge material. Decreasing the electronic factor for D to A electron transfer decreases the flux at a given applied voltage in the normal region, but the effect is much greater in the inverted region. Possible parallel tunneling and electron hopping mechanisms that could contribute to the current and interfere with the region of negative differential resistance are analyzed in detail. For the coupled electron-transfer sequence considered here, changing electronic factors result in dramatic shifts of the reaction profile.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252716","docid":252716,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1262693","fileid":1262693,"datasetid":"document","objectid":252716,"filename":"jp048133k.pdf","mime_type":"application/pdf","hash":"d9012f4e3fc871f380ac4a81d538fa86","hash_type":"MD5","filesize":202558,"mtime":"2017-05-24 21:12:28","url":"http://authors.library.caltech.edu/77723/1/jp048133k.pdf"}],"eprintid":77723,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"jp048133k.pdf","content":"published"}],"note":"© 2004 American Chemical Society. \n\nReceived 29 April 2004. Published online 16 July 2004. Published in print 1 August 2004. \n\nThis research was carried out at Brookhaven National Laboratory under contract DE-AC02-98CH10886 with the U.S. Department of Energy and supported by its Division of Chemical Sciences, Office of Basic Energy Sciences. \n\nNote Added after ASAP Posting. A variable in eq 58 was changed from that which was originally published on 7/16/2004. The correct version was posted on 7/28/2004.","id":77723,"rev_number":8,"userid":772,"eprint_dir":"disk0/00/07/77/23","datestamp":"2017-05-24 21:38:50","lastmod":"2017-05-24 21:38:50","status_changed":"2017-05-24 21:38:50","type":"article","metadata_visibility":"show","creators":[{"given":"Norman","family":"Sutin","id":"Sutin-N","orcid":""},{"given":"Bruce S.","family":"Brunschwig","id":"Brunschwig-B-S","orcid":"0000-0002-6135-6727"},{"given":"Carol","family":"Creutz","id":"Creutz-C","orcid":""},{"given":"Stephen W.","family":"Feldberg","id":"Feldberg-S-W","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2004-08-12","date_type":"published","publication":"Journal of Physical Chemistry B","volume":"108","number":"32","pagerange":"12092-12102","id_number":"CaltechAUTHORS:20170524-141116151","refereed":true,"issn":"1520-6106","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170524-141116151","related_url":[{"url":"http://dx.doi.org/10.1021/jp048133k","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/jp048133k","type":"pub","description":"Article"}],"referencetext":["Aviram, A.; Ratner, M. A. Chem. Phys. Lett. 1974, 29, 277−283.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(2) Ratner, M. A.; Davis, B.; Kemp, M.; Mujica, V.; Roitberg, A.; Yaliraki, S. Ann. N.Y. Acad. Sci. 1998, 852, 22−37.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(3) Ratner, M. A.; Jortner, J. In Molecular Electronics; Ratner, M. A., Jortner, J., Eds.; Blackwell:  Oxford, U.K., 1997; pp 5−72 and references therein.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(4) Nitzan, A.; Ratner, M. A. Science 2003, 300, 1384−1389.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(5) Chabinyc, M. L.; Chen, X.; Holmlin, R. E.; Jacobs, H.; Skulason, H.; Frisbie, C. D.; Mujica, V.; Ratner, M. A.; Rampi, M. A.; Whitesides, G. M. J. Am. Chem. Soc. 2002, 124, 11730−11736.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(6) Holmlin, R. E.; Haag, R.; Chabinyc, M. L.; Ismagilov, R. F.; Cohen, A. E.; Terfort, A.; Rampi, M. A.; Whitesides, G. M. J. Am. Chem. Soc. 2001, 123, 5075−5085.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(7) Reed, M. A.; Zhou, C.; Muller, C. J.; Burgin, T. P.; Tour, J. M. Science 1997, 278, 252−254.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(8) Tian, W.; Datta, S.; Hong, S.; Reifenberger, R.; Henderson, J. I.; Kubiak, C. P. J. Chem. Phys. 1998, 109, 2874−2882.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(9) Marcus, R. A.; Sutin, N. Biochim. Biophys. Acta 1985, 811, 265−322.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nAdams, D.; Brus, L.; Chidsey, C. E. D.; Creager, S.; Creutz, C.; Kagan, C. R.; Kamat, P. V.; Lieberman, M.; Lindsay, S.; Marcus, R. A.; Metzger, R. M.; Michel-Beyerle, M. E.; Miller, J. R.; Newton, M. D.; Rolison, D. R.; Sankey, O.; Schanze, K. S.; Yardley, J.; Zhu, X. J. Phys. Chem. B 2003, 107, 6668−6697.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(11) Sutin, N.; Brunschwig, B. S.; Creutz, C. J. Phys. Chem B 2003, 107, 10687−10690.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(12) Schmickler, W. Chem. Phys. 2003, 289, 349−357.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(13) Schmickler, W.; Rampi, M. A.; Tran, E.; Whitesides, G. M. Faraday Discuss. 2004, 125, 171−177.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(14) Experiments with assemblies such as those modeled here have been described recently in ref 13. Although the experimental details are yet to be presented, the results reported appear to be confined to observation of Nernstian, equilibrium currents.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(15) Segal, D.; Nitzan, A.; Davis, W. B.; Wasielewski, M. R.; Ratner, M. A. J. Phys. Chem. B 2000, 104, 3817−3829.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(16) Segal, D.; Nitzan, A.; Ratner, M.; Davis, W. B. J. Phys. Chem. B 2000, 104, 2790−2793.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(17) Mujica, V.; Nitzan, A.; Datta, S.; Ratner, M. A.; Kubiak, C. P. J. Phys. Chem. B 2003, 107, 91−95.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(18) Brown, T. M.; Friend, R. H.; Millard, I. S.; Lacey, D. J.; Butler, T.; Burroughes, J. H.; Cacialli, F. J. App. Phys. 2003, 93, 6159−6172.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(19) We note that similarity of this circuit to that used in the Kelvin probe. See Janata, J.; Josowicz, M. Anal. Chem. 1997, 69, A293−A296.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nThe sign convention used here for Vapp is opposite to that used in ref 11.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(21) Trasatti, S. Pure Appl. Chem. 1986, 58, 955−966.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(22) Our convention for rate constants is that reactions in the counterclockwise direction (left to right as written) have a positive subscript; reactions in the counterclockwise direction (right to left as written) have a negative subscript.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(23) For our present purposes, this simplification is acceptable. Furthermore, this analysis provides a template for a more detailed treatment.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(24) Marcus, R. A. J. Chem. Phys. 1965, 43, 679−701.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(25) Gosavi, S.; Marcus, R. A. J. Phys. Chem. B 2000, 104, 2067-2072.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(26) Feldberg, S. W.; Newton, M. D.; Smalley, J. F. In Electroanalytical Chemistry Series; Bard, A. J., Rubinstein, I., Eds.; Marcel Dekker:  New York, in press.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(27) Marcus, R. A. J. Phys. Chem. 1963, 67, 853−857.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(28) Hush, N. S. Electrochim. Acta 1968, 13, 1005−1023.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(29) Newton, M. D. Chem. Rev. 1991, 91, 767−792.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nSmalley, J. F.; Finklea, H. O.; Chidsey, C. E. D.; Linford, M. R.; Creager, S. E.; Ferraris, J. P.; Chalfant, K.; Zawodzinsk, T.; Feldberg, S. W.; Newton, M. D. J. Am. Chem. Soc. 2003, 125, 2004−2013.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(31) Newton, M. D.; Cave, R. J. In Molecular Electronics; Ratner, M. A., Jortner, J., Eds.; Blackwell:  Oxford, U.K., 1997; pp 73−118.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(32) Since the individual bridges are homogeneous, eq 75 can be used for the distance dependence of the coupling element; that is, β2 is increased by 0.7 Å-1 with d0 = 3 Å.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(33) Sumi, H.; Kakitani, T. Chem. Phys. Lett. 1996, 252, 85−93.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(34) Sumi, H.; Kakitani, T. J. Phys. Chem. B 2001, 105, 9603−9622.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(35) It has been argued in refs 33 and 34 that thermally activated hopping to and from an intermediate site and tunneling through that site should be treated not as parallel processes but rather as limiting forms of a single process. A useful parameter describing the behavior of the system between these limits is the ratio of τel, the lifetime of the electron at the intermediate site, to τn, the nuclear reorganization (thermalization) time of the site. Trapping occurs when the structural fluctuations at the intermediate site are very rapid, whereas the tunneling limit is reached when thermalization of the site is very slow. “Hot” hopping from the intermediate before it has thermalized is the dominant mechanism between these extremes.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(36) Bixon, M.; Jortner, J. Chem. Phys. 2002, 281, 393−408.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(37) Renger, T.; Marcus, R. A. J. Phys. Chem. A 2003, 107, 8404-8419.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(38) Mujica, V.; Kemp, M.; Ratner, M. A. J. Chem. Phys. 1994, 101, 6849−6855.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(39) Note that ktun and klim for the electrode reactions may decrease at high overvoltage since increasing the magnitude of the applied voltage may increase the energy gaps for the operative superexchange mechanism and hence decrease HI,II, H1, or H3. However, this effect is mitigated by the decreased energy gaps for complementary superexchange mechanisms; as the energy gap for electron superexchange increases, that for hole superexchange decreases, and vice versa."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Implications of an Electron-Hopping Model for Charge Transport through Donor−Bridge−Acceptor Assemblies Connected to Metal Electrodes\nNorman Sutin, Bruce S. Brunschwig, Carol Creutz, and Stephen W. Feldberg\nThe Journal of Physical Chemistry B 2004 108 (32), 12092-12102\nDOI: 10.1021/jp048133k","other_numbering_system":null,"funders":[{"agency":"Department of Energy (DOE)","grant_number":"DE-AC02-98CH10886"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}