{"title":"Accurate Energies and Structures for Large Water Clusters Using the X3LYP Hybrid Density Functional","uri":"","abstract":"We predict structures and energies of water clusters containing up to 19 waters with X3LYP, an extended hybrid density functional designed to describe noncovalently bound systems as accurately as covalent systems. Our work establishes X3LYP as the most practical ab initio method today for calculating accurate water cluster structures and energies. We compare X3LYP/aug-cc-pVTZ energies to the most accurate theoretical values available (n = 2−6, 8), MP2 with basis set superposition error (BSSE) corrections extrapolated to the complete basis set limit. Our energies match these reference energies remarkably well, with a root-mean-square difference of 0.1 kcal/mol/water. X3LYP also has ten times less BSSE than MP2 with similar basis sets, allowing one to neglect BSSE at moderate basis sizes. The net result is that X3LYP is ∼100 times faster than canonical MP2 for moderately sized water clusters.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252724","docid":252724,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1262768","fileid":1262768,"datasetid":"document","objectid":252724,"filename":"jp047502%2B.pdf","mime_type":"application/pdf","hash":"0779f8e48fd256f063acefe588d4ea45","hash_type":"MD5","filesize":164420,"mtime":"2017-05-24 21:40:40","url":"http://authors.library.caltech.edu/77728/1/jp047502%252B.pdf"}],"eprintid":77728,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"jp047502%2B.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252727","docid":252727,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1262814","fileid":1262814,"datasetid":"document","objectid":252727,"filename":"jp047502%2Bsi20040810_082450.pdf","mime_type":"application/pdf","hash":"c3cc58fdbd38acad165530026f25c53b","hash_type":"MD5","filesize":329779,"mtime":"2017-05-24 22:00:41","url":"http://authors.library.caltech.edu/77728/2/jp047502%252Bsi20040810_082450.pdf"}],"eprintid":77728,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"jp047502%2Bsi20040810_082450.pdf","content":"supplemental"}],"note":"© 2004 American Chemical Society. \n\nReceived 9 June 2004. Published online 2 November 2004. Published in print 1 November 2004. \n\nThis research was funded partially by NSF (CHE 9985574), by NIH (HD 36385-02), and by DOE-ASCI. The facilities of the Materials and Process Simulation Center used in these studies were funded by ARO-DURIP, ONR-DURIP, NSF-MRI, a SUR grant from IBM, and the Beckman Institute. In addition, the Materials and Process Simulation Center is funded by grants from ARO-MURI, ONR-MURI, ONR-DARPA, NIH, NSF, General Motors, ChevronTexaco, Seiko-Epson, and Asahi Kasei. We thank Mr. Christopher L. McClendon for initial suggestions and Prof. Jian Wan, Central China Normal University, for helping with some of the calculations.","id":77728,"rev_number":11,"userid":772,"eprint_dir":"disk0/00/07/77/28","datestamp":"2017-05-24 22:04:11","lastmod":"2017-05-24 22:04:11","status_changed":"2017-05-24 22:04:11","type":"article","metadata_visibility":"show","creators":[{"given":"Julius T.","family":"Su","id":"Su-Julius-T","orcid":""},{"given":"Xin","family":"Xu","id":"Xu-Xin","orcid":""},{"given":"William A., III","family":"Goddard","id":"Goddard-W-A-III","orcid":"0000-0003-0097-5716"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2004-11-25","date_type":"published","publication":"Journal of Physical Chemistry A","volume":"108","number":"47","pagerange":"10518-10526","id_number":"CaltechAUTHORS:20170524-144024380","refereed":true,"issn":"1089-5639","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170524-144024380","related_url":[{"url":"http://dx.doi.org/10.1021/jp047502+","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/jp047502%2B","type":"pub","description":"Article"},{"url":"http://pubs.acs.org/doi/suppl/10.1021/jp047502%2B","type":"pub","description":"Supporting Information"}],"referencetext":["(1) Xu, X.; Goddard, W. A., III. The X3LYP extended density functional for accurate descriptions of nonbond interactions, spin states, and thermochemical properties. Proc. Natl. Acad. Sci. U.S.A. 2004, 101 (9), 2673−2677.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(2) Xu, X.; Goddard, W. A., III. Bonding Properties of the Water Dimer:  A Comparative Study of Density Functional Theories. J. Phys. Chem. A 2004, 108 (12), 2305−2313.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(3) Xantheas, S. S.; Burnham, C. J.; Harrison, R. J. Development of transferable interaction models for water. II. Accurate energetics of the first few water clusters from first principles. J. Chem. Phys. 2002, 116 (4), 1493−1499.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(4) Maheshwary, S.; Patel, N.; Sathyamurthy, N.; Kulkarni, A. D.; Gadre, S. R. Structure and Stability of Water Clusters (H2O)n, n = 8−20:  An Ab Initio Investigation. J. Phys. Chem. A 2001, 105 (46), 10525−10537.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(5) Lee, H. M.; Suh, S. B.; Kim, K. S. Structures, energies, and vibrational spectra of water undecamer and dodecamer:  An ab initio study. J. Chem. Phys. 2001, 114 (24), 10749−10756.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(6) Lee, H. M.; Suh, S. B.; Lee, J. Y.; Tarakeshwar, P.; Kim, K. S. Structures, energies, vibrational spectra, and electronic properties of water monomer to decamer. J. Chem. Phys. 2000, 112, 9759. Erratum:  J. Chem. Phys. 2001, 114 (7), 3343.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(7) Lee, H. M.; Suh, S. B.; Lee, J. Y.; Tarakeshwar, P.; Kim, K. S. Structures, energies, vibrational spectra, and electronic properties of water monomer to decamer. J. Chem. Phys. 2000, 112 (22), 9759−9772.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(8) Xantheas, S. S.; Apra, E. The binding energies of the D2d and S4 water octamer isomers:  High-level electronic structure and empirical potential results. J. Chem. Phys. 2004, 120 (2), 823−828.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(9) Lee, C.; Yang, W.; Parr, R. G. Development of the Colle-Salvetti correlation-energy formula into a functional of the electron density. Phys. Rev. B:  Condens. Matter Mater. Phys. 1988, 37 (2), 785−9.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nVosko, S. H.; Wilk, L.; Nusair, M. Accurate spin-dependent electron liquid correlation energies for local spin density calculations:  a critical analysis. Can. J. Phys. 1980, 58 (8), 1200−11.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(11) Stephens, P. J.; Devlin, F. J.; Chabalowski, C. F.; Frisch, M. J. Ab Initio Calculation of Vibrational Absorption and Circular Dichroism Spectra Using Density Functional Force Fields. J. Phys. Chem. 1994, 98 (45), 11623−7.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(12) Estrin, D. A.; Paglieri, L.; Corongiu, G.; Clementi, E. Small Clusters of Water Molecules Using Density Functional Theory. J. Phys. Chem. 1996, 100 (21), 8701−11.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(13) Kim, K.; Jordan, K. D. Comparison of Density Functional and MP2 Calculations on the Water Monomer and Dimer. J. Phys. Chem. 1994, 98 (40), 10089−94.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(14) Laasonen, K.; Parrinello, M.; Car, R.; Lee, C.; Vanderbilt, D. Structures of small water clusters using gradient-corrected density functional theory. Chem. Phys. Lett. 1993, 207 (2−3), 208−13.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(15) Lee, C.; Chen, H.; Fitzgerald, G. Structures of the water hexamer using density functional methods. J. Chem. Phys. 1994, 101 (5), 4472−3.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(16) Kutzelnigg, W.; Klopper, W. Wave functions with terms linear in the interelectronic coordinates to take care of the correlation cusp. I. General theory. J. Chem. Phys. 1991, 94 (3), 1985−2001.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(17) Halkier, A.; Klopper, W.; Helgaker, T.; Jorgensen, P.; Taylor, P. R. Basis set convergence of the interaction energy of hydrogen-bonded complexes. J. Chem. Phys. 1999, 111 (20), 9157−9167.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(18) Becke, A. D. Density-functional thermochemistry. III. The role of exact exchange. J. Chem. Phys. 1993, 98 (7), 5648−52.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(19) Jaguar 5.0; Schrodinger, L.L.C:  Portland, OR, 1991−2003.OpenURL CALIFORNIA INST OF TECHNOLOGY\nSaebo, S.; Tong, W.; Pulay, P. Efficient elimination of basis-set-superposition errors by the local correlation method:  accurate ab initio studies of the water dimer. J. Chem. Phys. 1993, 98 (3), 2170−5.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(21) Saebo, S.; Pulay, P. Local treatment of electron correlation. Ann. Rev. Phys. Chem. 1993, 44, 213−36.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(22) Pipek, J.; Mezey, P. G. A fast intrinsic localization procedure applicable for ab initio and semiempirical linear combination of atomic orbital wave functions. J. Chem. Phys. 1989, 90 (9), 4916−26.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(23) Hariharan, P. C.; Pople, J. A. Effect of d-functions on molecular orbital energies for hydrocarbons. Chem. Phys. Lett. 1972, 16 (2), 217−19.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(24) Kendall, R. A.; Dunning, T. H., Jr.; Harrison, R. J. Electron affinities of the first-row atoms revisited. Systematic basis sets and wave functions. J. Chem. Phys. 1992, 96 (9), 6796−806.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(25) Boys, S. F.; Bernardi, F. The calculation of small molecular interactions by the differences of separate total energies. Some procedures with reduced errors. Mol. Phys. 1970, 19 (4), 553−566.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(26) Xantheas, S. S. On the importance of the fragment relaxation energy terms in the estimation of the basis set superposition error correction to the intermolecular interaction energy. J. Chem. Phys. 1996, 104 (21), 8821−8824.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(27) Szalewicz, K.; Jeziorski, B. Comment on “On the importance of the fragment relaxation energy terms in the estimation of the basis set superposition error correction to the intermolecular interaction energy” [J. Chem. Phys. 1996, 104, 8821.]. J. Chem. Phys. 1998, 109 (3), 1198−1200.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(28) Wales, D. J.; Hodges, M. P. Global minima of water clusters (H2O)n, n\u003c21, described by an empirical potential. Chem. Phys. Lett. 1998, 286 (1, 2), 65−72.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(29) Pedulla, J. M.; Vila, F.; Jordan, K. D., Binding energy of the ring form of (H2O)6:  comparison of the predictions of conventional and localized-orbital MP2 calculations. J. Chem. Phys. 1996, 105 (24), 11091−11099.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nKim, K. S.; Tarakeshwar, P.; Lee, J. Y. Molecular Clusters of Pi-Systems:  Theoretical Studies of Structures, Spectra, and Origin of Interaction Energies. Chem. Rev. 2000, 100 (11), 4145−4185.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(31) Tsai, C. J.; Jordan, K. D., Theoretical study of the (H2O)6 water cluster. Chem. Phys. Lett. 1993, 213 (1−2), 181−8.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(32) Kim, K.; Jordan, K. D.; Zwier, T. S., Low-Energy Structures and Vibrational Frequencies of the Water Hexamer:  Comparison with Benzene-(H2O)6. J. Am. Chem. Soc. 1994, 116 (25), 11568−9.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(33) Liu, K.; Brown, M. G.; Carter, C.; Saykally, R. J.; Gregory, J. K.; Clary, D. C. Characterization of a cage form of the water hexamer. Nature (London) 1996, 381 (6582), 501−503.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(34) Kim, J.; Kim, K. S. Structures, binding energies, and spectra of isoenergetic water hexamer clusters:  Extensive ab initio studies. J. Chem. Phys. 1998, 109 (14), 5886−5895.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(35) Kryachko, E. S. Ab initio studies of the conformations of water hexamer:  modeling the pentacoordinated hydrogen-bonded pattern in liquid water. Chem. Phys. Lett. 1999, 314 (3, 4), 353−363.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(36) Losada, M.; Leutwyler, S. Water hexamer clusters:  Structures, energies, and predicted mid-infrared spectra. J. Chem. Phys. 2002, 117 (5), 2003−2016.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(37) Liu, K.; Brown, M. G.; Saykally, R. J. Terahertz Laser Vibration−Rotation Tunneling Spectroscopy and Dipole Moment of a Cage Form of the Water Hexamer. J. Phys. Chem. A 1997, 101 (48), 8995−9010.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(38) Nauta, K.; Miller, R. E. Formation of cyclic water hexamer in liquid helium:  the smallest piece of ice. Science (Washington, D.C.) 2000, 287 (5451), 293−295.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(39) Fajardo, M. E.; Tam, S. Observation of the cyclic water hexamer in solid parahydrogen. J. Chem. Phys. 2001, 115 (15), 6807−6810.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nKeutsch, F. N.; Saykally, R. J. Water clusters:  untangling the mysteries of the liquid, one molecule at a time. Proc. Natl. Acad. Sci. U.S.A. 2001, 98, (19), 10533−10540.[CrossRef], [PubMed], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(41) Sadlej, J.; Buch, V.; Kazimirski, J. K.; Buck, U. Theoretical study of structure and spectra of cage clusters (H2O)n, n = 7−10. J. Phys. Chem. A 1999, 103 (25), 4933−4947.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(42) Gruenloh, C. J.; Carney, J. R.; Arrington, C. A.; Zwier, T. S.; Fredericks, S. Y.; Jordan, K. D. Infrared spectrum of a molecular ice cube:  the S4 and D2d water octamers in benzene-(water)8. Science (Washington, D.C.) 1997, 276 (5319), 1678−1681.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(43) Buck, U.; Ettischer, I.; Melzer, M.; Buch, V.; Sadlej, J. Structure and spectra of three-dimensional (H2O)n clusters, n=8, 9, 10. Phys. Rev. Lett. 1998, 80, (12), 2578−2581.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(44) Gregory, J. K.; Clary, D. C. A Theoretical Study of the Cage Water Hexamer Structure. J. Phys. Chem. A 1997, 101 (36), 6813−6819.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(45) Severson, M. W.; Buch, V. Quantum Monte Carlo simulation of intermolecular excited vibrational states in the cage water hexamer. J. Chem. Phys. 1999, 111 (24), 10866−10875.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(46) Burnham, C. J.; Xantheas, S. S.; Miller, M. A.; Applegate, B. E.; Miller, R. E. The formation of cyclic water complexes by sequential ring insertion:  Experiment and theory. J. Chem. Phys. 2002, 117 (3), 1109−1122.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(47) Masella, M.; Flament, J. P. A pairwise and two many-body models for water:  influence of nonpairwise effects upon the stability and geometry of (H2O)n cyclic (n = 3−6) and cagelike (n = 6−20) clusters. J. Chem. Phys. 1997, 107 (21), 9105−9116.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(48) Hodges, M. P.; Stone, A. J.; Xantheas, S. S. Contribution of Many-Body Terms to the Energy for Small Water Clusters:  A Comparison of ab Initio Calculations and Accurate Model Potentials. J. Phys. Chem. A 1997, 101 (48), 9163−9168.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(49) Pedulla, J. M.; Kim, K.; Jordan, K. D. Theoretical study of the n-body interaction energies of the ring, cage and prism forms of (H2O)6. Chem. Phys. Lett. 1998, 291 (1, 2), 78−84.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nXantheas, S. S. Ab initio studies of cyclic water clusters (H2O)n, n=1−6. II. Analysis of many-body interactions. J. Chem. Phys. 1994, 100 (10), 7523−34.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(51) Benedict, W. S.; Gailar, N.; Plyler, E. K. Rotation−vibration spectra of deuterated water vapor. J. Chem. Phys. 1956, 24, 1139−65.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(52) Kuchitsu, K.; Morino, Y. Estimation of anharmonic potential constants. II. Bent XY2 molecules. Bull. Chem. Soc. Jpn. 1965, 38 (5), 814−24.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(53) Fredin, L.; Nelander, B.; Ribbegard, G. Infrared spectrum of the water dimer in solid nitrogen. I. Assignment and force constant calculations. J. Chem. Phys. 1977, 66 (9), 4065−72.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(54) Nelander, B. Infrared spectrum of the water-hydrogen sulfide complex. J. Chem. Phys. 1978, 69, (8), 3670−1.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(55) Bentwood, R. M.; Barnes, A. J.; Orville-Thomas, W. J. Studies of intermolecular interactions by matrix isolation vibrational spectroscopy. Self-association of water. J. Mol. Spectrosc. 1980, 84 (2), 391−404.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(56) Tursi, A. J.; Nixon, E. R. Matrix-isolation study of the water dimer in solid nitrogen. J. Chem. Phys. 1970, 52 (3), 1521−8.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(57) Murphy, R. B.; Beachy, M. D.; Friesner, R. A.; Ringnalda, M. N. Pseudospectral localized Moeller−Plesset methods:  theory and calculation of conformational energies. J. Chem. Phys. 1995, 103 (4), 1481−90."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Accurate Energies and Structures for Large Water Clusters Using the X3LYP Hybrid Density Functional\nJulius T. Su, Xin Xu, and William A. Goddard III\nThe Journal of Physical Chemistry A 2004 108 (47), 10518-10526\nDOI: 10.1021/jp047502+","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"CHE 9985574"},{"agency":"NIH","grant_number":"HD 36385-02"},{"agency":"Department of Energy (DOE)","grant_number":""},{"agency":"Army Research Office (ARO)","grant_number":""},{"agency":"Office of Naval Research (ONR)","grant_number":""},{"agency":"IBM","grant_number":""},{"agency":"Caltech Beckman Institute","grant_number":""},{"agency":"Defense Advanced Research Projects Agency (DARPA)","grant_number":""},{"agency":"General Motors","grant_number":""},{"agency":"ChevronTexaco","grant_number":""},{"agency":"Seiko-Epson","grant_number":""},{"agency":"Asahi Kasei","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}