{"title":"A diamagnetic inequality for semigroup differences","uri":"","abstract":"The diamagnetic inequality for the magnetic Schrödinger semigroup is extended to the difference of the semigroups of magnetic Schrödinger operators with Neumann and Dirichlet boundary conditions on arbitrary open domains and rather general magnetic vector potentials A and potentials V. In particular, this bound renders moot all the technical issues in the recent proofs of the independence of the boundary conditions for the integrated density of states for magnetic Schrödinger operators: Independence of the boundary conditions for the free case, that is, for vanishing potentials and vector potentials, immediately implies independence of the boundary conditions of the\nintegrated density of states for a large class of magnetic Schrödinger operators.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252717","docid":252717,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1262715","fileid":1262715,"datasetid":"document","objectid":252717,"filename":"p286.pdf","mime_type":"application/pdf","hash":"3edada24709be7a5db0316f15a14a50a","hash_type":"MD5","filesize":272512,"mtime":"2017-05-24 21:16:42","url":"http://authors.library.caltech.edu/77724/1/p286.pdf"}],"eprintid":77724,"pos":1,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"p286.pdf","content":"submitted"},{"id":"http://authors.library.caltech.edu/id/document/252720","docid":252720,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1262740","fileid":1262740,"datasetid":"document","objectid":252720,"filename":"286.pdf","mime_type":"application/pdf","hash":"49f1b9f4e526a5aab35d85e9109046c7","hash_type":"MD5","filesize":208662,"mtime":"2017-05-24 21:27:32","url":"http://authors.library.caltech.edu/77724/2/286.pdf"}],"eprintid":77724,"pos":2,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"286.pdf","content":"published"}],"note":"© 2004 Walter de Gruyter Berlin; New York.\n\nSupported in part by NSF grants DMS-9707661 and DMS-0140592. \n\nIt is a pleasure to thank Alexander Elgart for discussions\nand Hendrik Vogt for pointing us to [30]. D.H. also thanks Ari Laptev and Kjell-Ove Widman for their hospitality at the Mittag-Leffler institute.","id":77724,"rev_number":14,"userid":18,"eprint_dir":"disk0/00/07/77/24","datestamp":"2017-05-24 21:35:40","lastmod":"2017-05-24 21:35:40","status_changed":"2017-05-24 21:35:40","type":"article","metadata_visibility":"show","creators":[{"given":"Dirk","family":"Hundertmark","id":"Hundertmark-D","orcid":""},{"given":"Barry","family":"Simon","id":"Simon-B","orcid":"0000-0003-2561-8539"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2004-07","date_type":"published","publication":"Journal für die reine und angewandte Mathematik (Crelles Journal)","volume":"2004","number":"571","pagerange":"107-130","id_number":"CaltechAUTHORS:20170524-141635977","refereed":true,"issn":"0075-4102","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170524-141635977","related_url":[{"url":"https://doi.org/10.1515/crll.2004.036","type":"doi","description":"Article"},{"url":"https://www.degruyter.com/view/j/crll.2004.2004.issue-571/crll.2004.036/crll.2004.036.xml","type":"pub","description":"Article"}],"referencetext":["[1] C. D. Aliprantis and O. Burkinshaw, Positive compact operators on Banach lattices, Math. Z. 174 (1980), no.\n3, 289–298.\n[2] J. Avron, I. Herbst, and B. Simon, Schro¨dinger operators with magnetic fields, I. General interactions, Duke\nMath. J. 45 (1978), 847–883.\n[3] J. Avron and B. Simon, Almost periodic Schro¨dinger operators, II. The integrated density of states, Duke\nMath. J. 50 (1983), 369–391.\n[4] O. Bratteli and D. W. Robinson, Operator algebras and quantum statistical mechanics. 2, Equilibrium\nstates, Models in quantum statistical mechanics, Second edition, Texts and Monographs in Physics, Springer-\nVerlag, Berlin 1997.\n[5] K. Broderix, D. Hundertmark, and H. Leschke, Self-averaging, decomposition, and asymptotic properties of\nthe density of states for random Schro¨dinger operators with constant magnetic field, in: Path integrals from\nmeV to MeV, Tutzing 1993, eds. H. Grabert, A. Inomata, L. S. Schulman, and U. Weiss, World Scientific,\nSingapore 1993.\n[6] K. Broderix, D. Hundertmark, and H. Leschke, Continuity properties of Schro¨dinger semigroups with magnetic\nfields, Rev. Math. Phys. 12 (2000), no. 2, 181–225.\n[7] R. Carmona and J. Lacroix, Spectral theory of random Schro¨dinger operators, Probability and its Applications,\nBirkha¨user, Boston 1990.\n[8] J. M. Combes, R. Schrader, and R. Seiler, Classical bounds and limits for energy distributions of Hamilton\noperators in electromagnetic fields, Ann. Physics 111 (1978), no. 1, 1–18.\n[9] H. L. Cycon, R. G. Froese, W. Kirsch, and B. Simon, Schro¨dinger operators: With application to quantum\nmechanics and global geometry, Springer, Berlin 1984.\n[10] G. Dal Maso, An introduction to G-convergence, Birkha¨user, Boston 1992.\n[11] E. B. Davies, Heat kernels and spectral theory, Cambridge Tracts Math. 92, Cambridge University Press,\nCambridge 1990.\n[12] E. B. Davies and B. Simon, Spectral properties of the Neumann Laplacian of horns, Geom. Funct. Anal. 2\n(1992), 105–117.\n[13] P. G. Dodds and D. H. Fremlin, Compact operators in Banach lattices, Israel J. Math. 34 (1979), no. 4,\n287–320.\n[14] S.-I. Doi, A. Iwatsuka, and T. Mine, The uniqueness of the integrated density of states for the Schro¨dinger\noperators with magnetic fields, Math. Z. 237 (2001), no. 2, 335–371.\n[15] J. Droese and W. Kirsch, The e¤ect of boundary conditions on the density of states for random Schro¨dinger\noperators, Stochastic Process. Appl. 23 (1986), no. 1, 169–175.\n[16] M. Fisher, The free energy of a macroscopic system, Arch. Rat. Mech. Anal. 17 (1964), 377–410.\n[17] D. Gilbarg and N. Trudinger, Elliptic Partial Di¤erential Equations of Second Order, Classics in Mathematics,\nSpringer, Berlin 1998.\n[18] R. Hempel, L. Seco, and B. Simon, The essential spectrum of Neumann Laplacians on some bounded singular\ndomains, J. Funct. Anal. 102 (1991), 448–483.\n[19] H. Hess, R. Schrader, and D. A. Uhlenbrock, Domination of semigroups and generalization of Kato’s\ninequality, Duke Math. J. 44 (1977), no. 4, 893–904.\n[20] T. Hupfer, H. Leschke, P. Mu¨ ller, and S. Warzel, The absolute continuity of the integrated density of states\nfor magnetic Schro¨dinger operators with certain unbounded random potentials, Comm. Math. Phys. 221\n(2001), no. 2, 229–254.\n[21] T. Hupfer, H. Leschke, P. Mu¨ ller, and S. Warzel, Existence and uniqueness of the integrated density of states\nfor Schro¨dinger operators with magnetic fields and unbounded random potentials, Rev. Math. Phys. 13\n(2001), no. 12, 1547–1581.\n[22] T. Kato, Schro¨dinger operators with singular potentials, Proceedings of the International Symposium on\nPartial Di¤erential Equations and the Geometry of Normed Linear Spaces, Jerusalem 1972, Israel J. Math.\n13 (1972), 135–148.\n[23] W. Kirsch, Random Schro¨dinger operators. A course, Schro¨dinger operators (Sønderborg 1988), Lect. Notes\nPhys. 345, Springer, Berlin (1989), 264–370.\n[24] W. Kirsch and F. Martinelli, On the density of states of Schro¨dinger operators with a random potential, J.\nPhys. A 15 (1982), no. 7, 2139–2156.\n[25] W. Kirsch and F. Martinelli, On the essential selfadjointness of stochastic Schro¨dinger operators, Duke Math.\nJ. 50 (1983), no. 4, 1255–1260.\n[26] H. Leinfelder, A remark on a paper: ‘‘A compactness condition for linear operators of function spaces’’\n(J. Oper. Th. 1 (1979), no. 1, 49–54) by L. D. Pitt, Bayreuther Math. Schr. 11 (1982), 57–66.\n[27] H. Leinfelder and C. Simader, Schro¨dinger operators with singular magnetic vector potentials, Math. Z. 176\n(1981), no. 1, 1–19.\n[28] I. Lifshits, S. Gredeskul, and L. Pastur, Introduction to the theory of disordered systems, Translated from the\nRussian by Eugene Yankovsky, Wiley-Interscience Publication, John Wiley \u0026 Sons, New York 1988.\n[29] V. Liskevich and A. Manavi, Dominated semigroups with singular complex potentials, J. Funct. Anal. 151\n(1997), no. 2, 281–305.\n[30] A. Manavi, Zur Sto¨rung von dominierten C0-Halbgruppen auf Banachfunktionenra¨umen mit ordnungstetiger\nNorm und sektoriellen Formen mit singula¨ren komplexen Potentialen, Ph.D. Thesis, Technical\nUniversity Dresden, 2001 (in German).\n[31] H. Matsumoto, On the integrated density of states for the Schro¨dinger operators with certain random electromagnetic\npotentials, J. Math. Soc. Japan 45 (1993), no. 2, 197–214.\n[32] S. Nakamura, A remark on the Dirichlet-Neumann decoupling and the integrated density of states, J. Funct.\nAnal. 179 (2001), no. 1, 136–152.\n[33] S. Nakao, On the spectral distribution of the Schro¨dinger operator with random potential, Japan. J. Math.\n(N.S.) 3 (1977), no. 1, 111–139.\n[34] E.-M. Ouhabaz, Invariance of closed convex sets and domination criteria for semigroups, Pot. Anal. 5 (1996),\nno. 6, 611–625.\n[35] L. Pastur, The Schro¨dinger equation with random potential, Theor. Math. Phys. 6 (1971), 299–306, Russian\noriginal: Teoret. Mat. Fiz. 6 (1971), no. 3, 415–424.\n[36] L. Pastur, Spectral properties of disordered systems in the one-body approximation, Comm. Math. Phys. 75\n(1980), no. 2, 179–196.\n[37] L. Pastur and A. Figotin, Spectra of random and almost-periodic operators, Fundamental Principles of\nMathematical Sciences, Grundl. Math. Wiss. 297, Springer, Berlin 1992.\n[38] L. D. Pitt, A compactness condition for linear operators of function spaces, J. Oper. Th. 1 (1979), no. 1,\n49–54.\n[39] M. Reed and B. Simon, Methods of modern mathematical physics, I: Functional analysis, Revised and\nenlarged edition, Academic Press, New York 1980.\n[40] M. Reed and B. Simon, Methods of modern mathematical physics, II: Self-adjointness, Academic Press, New\nYork 1975.\n[41] M. Reed and B. Simon, Methods of modern mathematical physics, IV: Analysis of operators, Academic\nPress, New York 1978.\n[42] G. Roepstor¤, Path integral approach to quantum physics. An introduction, Texts and Monographs in\nPhysics, Springer-Verlag, Berlin 1994.\n[43] D. Ruelle, Statistical mechanics. Rigorous results, Reprint of the 1989 edition, World Scientific River Edge,\nNJ; Imperial College Press, London 1999.\n[44] E. M. Stein, Singular integrals and di¤erentiability properties of functions, Princeton University Press,\nPrinceton 1970.\n[45] B. Simon, Universal diamagnetism of spinless bose systems, Phys. Rev. Lett. 36 (1976), 1083–1084.\n[46] B. Simon, An abstract Kato’s inequality for generators of positivity preserving semi-groups, Ind. Math. J. 26\n(1977), 1067–1073.\n[47] B. Simon, A canonical decomposition for quadratic forms with applications to monotone convergence theorems,\nJ. Funct. Anal. 28 (1978), no. 3, 377–385.\n[48] B. Simon, Classical boundary conditions as a technical tool in modern mathematical physics, Adv. Math. 30\n(1978), no. 3, 268–281.\n[49] B. Simon, Functional integration and quantum physics, Academic Press, New York 1979.\n[50] B. Simon, Maximal and minimal Schro¨dinger forms, J. Oper. Th. 1 (1979), 37–47.\n[51] B. Simon, Kato’s inequality and the comparison of semi-groups, J. Funct. Anal. 32 (1979), 97–101.\n[52] B. Simon, The Neumann Laplacian of a jelly roll, Proc. Amer. Math. Soc. 114 (1992), 783–785.\n[53] P. Stollmann, Admissible and regular potentials for Schro¨dinger forms, J. Oper. Th. 18 (1987), no. 1,\n139–151.\n[54] P. Stollmann and J. Voigt, A regular potential which is nowhere in L1, Lett. Math. Phys. 9 (1985), no. 3,\n227–230.\n[55] H. Tanaka, Stochastic di¤erential equations with reflecting boundary condition in convex regions, Hiroshima\nMath. J. 9 (1979), no. 1, 163–177.\n[56] N. Ueki, On spectra of random Schro¨dinger operators with magnetic fields, Osaka J. Math. 31 (1994), no. 1,\n177–187.\n[57] J. Voigt, Absorption semigroups, their generators, and Schro¨dinger semigroups, J. Funct. Anal. 67 (1986),\nno. 2, 167–205.\n[58] J. Voigt, Absorption semigroups, J. Oper. Th. 20 (1988), no. 1, 117–131.\n[59] J. Weidmann, Stetige Abha¨ngigkeit der Eigenwerte und Eigenfunktionen elliptischer Di¤erentialoperatoren\nvom Gebiet, Continuous dependence of eigenvalues and eigenfunctions of elliptic di¤erential operators on\nthe domain, Math. Scand. 54 (1984), no. 1, 51–69 (in German).\n[60] H. Weyl, Das asymptotische Verteilungsgesetz der Eigenwerte linearer partieller Di¤erentialgleichungen (mit\neiner Anwendung auf die Theorie der Hohlraumstrahlung), Math. Ann. 71 (1912), 441–479 (in German).\n[61] R. J. Williams, Reflected Brownian motion: Hunt processes and semimartingale representation, in: Barcelona\nSeminar on Stochastic Analysis (St. Feliu de Guxols 1991), Progr. Probab. 32, Birkha¨user, Basel (1993), 216–\n221.\n[62] R. J. Williams and W. A. Zheng, On reflecting Brownian motion—a weak convergence approach, Ann. Inst.\nH. Poincare´ Probab. Statist. 26 (1990), no. 3, 461–488."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"DMS-9707661"},{"agency":"NSF","grant_number":"DMS-0140592"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}