{"title":"Adiabatic theorem for the Gross–Pitaevskii equation","uri":"","abstract":"We prove an adiabatic theorem for the nonautonomous semilinear Gross–Pitaevskii equation. More precisely, we assume that the external potential decays suitably at infinity and the linear Schrödinger operator −Δ+V_s admits exactly one bound state, which is ground state, for any s∈[0,1]. In the nonlinear setting, the ground state bifurcates into a manifold of (small) ground state solutions. We show that, if the initial condition is at the ground state manifold, bifurcated from the ground state of −Δ+V_0, then, for any fixed s∈[0,1], as ε→0, the solution will converge to the ground state manifold bifurcated from the ground state of −Δ+V_s. Moreover, the limit is of the same mass to the initial condition.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252746","docid":252746,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263003","fileid":1263003,"datasetid":"document","objectid":252746,"filename":"1508.02351.pdf","mime_type":"application/pdf","hash":"5f558b72c83bca3bd204f5cb6b30cdef","hash_type":"MD5","filesize":348869,"mtime":"2017-05-25 15:07:52","url":"http://authors.library.caltech.edu/77748/1/1508.02351.pdf"}],"eprintid":77748,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1508.02351.pdf","content":"submitted"}],"note":"© 2017 Taylor \u0026 Francis. \n\nPartly supported by NSF grant DMS-1308985 and DMS-1443225.","id":77748,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/77/48","datestamp":"2017-05-25 15:50:46","lastmod":"2017-05-25 15:50:46","status_changed":"2017-05-25 15:50:46","type":"article","metadata_visibility":"show","creators":[{"given":"Zhou","family":"Gang","id":"Gang-Zhou","orcid":""},{"given":"Philip","family":"Grech","id":"Grech-P","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Adiabatic theory, non-autonomous dynamical systems, non-linear Schrödinger equation, soliton","date":"2017-02-28","date_type":"published","publication":"Communications in Partial Differential Equations","volume":"42","number":"5","pagerange":"731-756","id_number":"CaltechAUTHORS:20170525-080748355","refereed":true,"issn":"0360-5302","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170525-080748355","related_url":[{"url":"http://dx.doi.org/10.1080/03605302.2017.1293687 ","type":"doi","description":"Article"},{"url":"http://www.tandfonline.com/doi/full/10.1080/03605302.2017.1293687","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1508.02351","type":"arxiv","description":"Discussion Paper"}],"referencetext":["[1] B. Anderson and M. Kasevich, Macroscopic quantum interference from atomic tunnel\narrays, Science, 282 (1998), pp. 1686–1689.\n[2] J. Avron and A. Elgart, Adiabatic theorem without a gap condition, Comm. Math.\nPhys., 203 (1999), pp. 445–463.\n[3] J. Avron, M. Fraas, G. Graf, and P. Grech, Optimal time-schedule for adiabatic\nevolution, Phys. Rev. A, 82 (2010).\n[4] J. Avron, R. Seiler, and L. Yaffe, Adiabatic theorems and applications to the quantum\nHall effect, Comm. Math. Phys., 110 (1987), pp. 33–49.\n[5] , Erratum: ”Adiabatic theorems and applications to the quantum Hall effect, Comm.\nMath. Phys., 156 (1993), pp. 649–650.\n[6] M. Born and V. Fock, Beweis des Adiabatensatzes, Z. Phys. A: Hadrons and Nuclei,\n51 (1928), pp. 165–180.\n[7] F. Bornemann, Homogeneization in time of singularly perturbed mechanical systems,\nLecture Notes in Mathematics, Springer: Berlin, Heidelberg, 1998.\n[8] V. Buslaev and G. Perelman, Scattering for the nonlinear schrödinger equation: states\nthat are close to a soliton, Algebra i Analiz, 4 (1992), pp. 63–102.\n[9] V. S. Buslaev and C. Sulem, On asymptotic stability of solitary waves for nonlinear\nSchrödinger equations, Ann. Inst. H. Poincaré Anal. Non Linéaire, 20 (2003), pp. 419–475.\n[10] S. Cuccagna, On asymptotic stability of ground states of NLS, Rev. Math. Phys., 155\n(2003), pp. 877–903.\n[11] S. Cuccagna, E. Kirr, and D. Pelinovsky, Parametric resonance of ground states in\nthe nonlinear Schrödinger equation, J. Differential Equations, 220 (2006), pp. 85–120.\n[12] S. Cuccagna and M. Maeda, On small energy stabilization in the nls with a trapping\npotential, Analysis and PDE.\n[13] S. Cuccagna and T. Mizumachi, On asymptotic stability in energy space of ground\nstates for nonlinear Schrödinger equations, Comm. Math. Phys., 284 (2008), pp. 51–77.\n[14] J. Fröhlich, S. Gustafson, B. Jonsson, and I. Sigal, Solitary wave dynamics in an\nexternal potential, Comm. Math. Phys., 250 (2004), pp. 613–642.\n[15] Z. Gang, N-th order Fermi golden rule for nonlinear Schrödinger equations, Journal of\nMathematical Physics, to appear.\n[16] Z. Gang and I. Sigal, Asymptotic stability of nonlinear Schrödinger equations with a\npotential, Adv. Math., 216 (2007).\n[17] J. Ginibre and G. Velo, On the global Cauchy problem for some non linear Schrödinger\nequations, Ann. Inst. H. Poincaré, sec. C, 1 (1984), pp. 309–323.\n[18] , The global Cauchy problem for the non linear Schrödinger equation revisited, Ann.\nInst. H. Poincaré, sec. C, 2 (1984), pp. 309–327.\n[19] M. Goldberg, Dispersive bounds for the three-dimensional Schrödinger equation with\nalmost critical potentials, Geom. Funct. Anal., 16 (2006), pp. 517–536.\n[20] J. Holmer and M. Zworski, Slow soliton interaction with delta impurities, J. Mod.\nDyn., 1 (2007), pp. 689–718.\n[21] A. Joye, General adiabatic evolution with a gap condition, Comm. Math. Phys., 275\n(2007), pp. 139–162.\n[22] A. Joye and C.-E. Pfister, Comm. Math. Phys, 140 (1991), pp. 15–41.\n[23] T. Kato, Perturbation theory for linear operators, Classics in mathematics, Springer:\nBerlin, Heidelberg, 1995.\n[24] L. Landau, Zur Theorie der Energieübertragung, ii, Phys. Z. Sowjet., 2 (1932), pp. 46–51.\n[25] K. Nakanishi, T. V. Phan, and T.-P. Tsai, Small solutions of nonlinear Schrödinger\nequations near first excited states, J. Funct. Anal., 263 (2012), pp. 703–781.\n[26] G. Nenciu, Linear adiabatic theory. Exponential estimates, Comm. Math. Phys., 152\n(1993), pp. 479–496.\n[27] G. Nenciu and G. Rasche, On the adiabatic theorem for nonself-adjoint Hamiltonians,\nJ. Phys. A, 25 (1992), pp. 5741–5751.\n[28] C. Orzel, A. Tuchman, M. Fenselau, M. Yasuda, and M. Kasevich, Squeezed\nstates in a Bose-Einstein condensate, Science, 291 (2001), pp. 2386–2389.\n[29] P. Pickl, Derivation of the time dependent Gross-Pitaevskii equation with external fields,\nRev. Math. Phys., 27 (2015), pp. 1550003, 45.\n[30] H. A. Rose and M. I. Weinstein, On the bound states of the nonlinear Schrödinger\nequation with a linear potential, Phys. D, 30 (1988), pp. 207–218.\n[31] C. Sparber, Weakly Nonlinear Time-Adiabatic Theory, to appear Ann. H. Poincaré, 2015.\n[32] W. Salem, On the quasi-static evolution of nonequilibrium steady states, Ann. H. Poincaré,\n8 (2007).\n[33] , Solitary wave dynamics in time-dependent potentials, J. Math. Phys., 49 (2008),\npp. 032101–1 to –29.\n[34] W. Schlag, Dispersive estimates for Schrödinger operators: a survey,\narXiv:math/0501037, Proc. of the PDE meeting at the IAS, Princeton in March\n2004 (2005).\n[35] B. Schlein, Derivation of effective evolution equations from many body quantum dynamics,\nProceedings of the XVIth international congress on mathematical physics, arXiv:0910.3969\n(2009).\n[36] A. Soffer and M. Weinstein, Multichannel nonlinear scattering for nonintegrable equations,\nComm. Math. Phys., 133 (1990), pp. 119–146.\n[37] , Multichannel nonlinear scattering for nonintegrable equations II. The case of anisotropic\npotentials and data, J. Diff. Eq., 98 (1992), pp. 376–390.\n[38] , Selection of the ground state for nonlinear Schrödinger equations, Rev. Math. Phys.,\n16 (2004), pp. 977–1071.\n[39] A. Soffer and M. Weinstein, Theory of nonlinear dispersive waves and ground state\nselection, Phys. Rev. Lett., (2005), p. 213905.\n[40] T.-P. Tsai and H.-T. Yau, Asymptotic dynamics of nonlinear Schrödinger equations:\nresonance-dominated and dispersion-dominated solutions, Comm. Pure Appl. Math., 55\n(2002), pp. 153–216.\n[41] , Classification of asymptotic profiles for nonlinear Schrödinger equations with small\ninitial data, Adv. Theor. Math. Phys., 6 (2002), pp. 107–139.\n[42] H. Yau and T. Tsai, Asymptotic dynamics of nonlinear Schrödinger equations:\nResonance-dominated and dispersion-dominated solutions, Comm. Pure Appl. Math., 55\n(2002), pp. 153–216.\n[43] C. Zener, Non-adiabatic crossing of energy levels, Proc. Roy. Soc. London, Series A 137,\n(1932), pp. 692–702."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"DMS-1308985"},{"agency":"NSF","grant_number":"DMS-1443225"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}