{"title":"Flow-induced vibration of a circular cylinder surrounded by two, four and eight wake-control cylinders","uri":"","abstract":"The present work investigates the use of a polar array of 2, 4 and 8 wake-control cylinders as a means to suppress the vortex-induced vibration (VIV) of a larger circular cylinder. The diameter of the control cylinders and the gap between their walls have been varied in 27 different configurations. Experiments have been performed in water at Reynolds numbers between 5000 and 50,000. Cross-flow amplitude of displacement, frequency of vibration, mean drag and fluctuating lift coefficients are presented. While some configurations of control cylinders suppressed VIV, others produced a galloping-like response. The best VIV suppressor was composed of 8 control cylinders and mitigated 99% of the peak amplitude of vibration when compared to that of a plain cylinder; mean drag was increased by 12%. A polar array of 4 control cylinders was the most efficient configuration to minimize the mean drag, but the system developed severe vibrations combining VIV and a galloping-like response. The system appeared to be very sensitive to the parameters investigated; small variations in the size and position of the control cylinders produced unexpected responses.","documents":null,"note":"© 2017 Elsevier Inc. \n\nReceived 24 October 2016, Revised 13 March 2017, Accepted 13 March 2017, Available online 18 March 2017.","id":77745,"rev_number":7,"userid":18,"eprint_dir":"disk0/00/07/77/45","datestamp":"2017-05-25 15:58:51","lastmod":"2017-05-25 15:58:51","status_changed":"2017-05-25 15:58:51","type":"article","metadata_visibility":"show","creators":[{"given":"M.","family":"Silva-Ortega","id":"Silva-Ortega-M","orcid":""},{"given":"G. R. S.","family":"Assi","id":"Assi-G-R-S","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Vortex-induced vibration; Galloping; Suppression; Wake control; Drag reduction","date":"2017-07","date_type":"published","publication":"Experimental Thermal and Fluid Science","volume":"85","number":"","pagerange":"354-362","id_number":"CaltechAUTHORS:20170525-073333553","refereed":true,"issn":"0894-1777 ","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170525-073333553","related_url":[{"url":"https://doi.org/10.1016/j.expthermflusci.2017.03.020","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0894177717300833","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"M. Silva-Ortega, G.R.S. Assi, Flow-induced vibration of a circular cylinder surrounded by two, four and eight wake-control cylinders, Experimental Thermal and Fluid Science, Volume 85, July 2017, Pages 354-362, ISSN 0894-1777, https://doi.org/10.1016/j.expthermflusci.2017.03.020.\n(http://www.sciencedirect.com/science/article/pii/S0894177717300833)","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["GALCIT"]}