{"title":"Faster initiating olefin metathesis catalysts from introducing double bonds into cyclopropyl, cyclobutyl and cyclopentyl derivatives of Hoveyda-Grubbs precatalysts","uri":"","abstract":"We have used the M06-D3 flavor of density functional theory (DFT) to investigate the structures and free energies of initiation for a series of Hoveyda-Grubbs-like complexes in which the isopropoxy part replaced by selected saturated or unsaturated derivatives of cyclopropane, cyclobutane and cyclopentane. We show that the introduction of the double bond into this part of the complex weakens the ruthenium-oxygen bond, creating a series of potential catalysts capable of fast initiation metathesis. The addition to the nitro group in the para position of the benzylidene part of the complex also creates a potentially highly efficient ruthenium catalyst. We demonstrate that the Gibbs free energy of activation correlates with various structural and computational parameters of the precatalyst, including the Ru-O bond strength and partial charges on selected atoms.","documents":null,"note":"© 2017 Elsevier B.V. \n\nReceived 7 September 2016, Revised 20 December 2016, Accepted 26 December 2016, Available online 1 April 2017.","id":77746,"rev_number":6,"userid":18,"eprint_dir":"disk0/00/07/77/46","datestamp":"2017-05-25 15:58:11","lastmod":"2017-05-25 15:58:11","status_changed":"2017-05-25 15:58:11","type":"article","metadata_visibility":"show","creators":[{"given":"B.","family":"Trzaskowski","id":"Trzaskowski-B","orcid":""},{"given":"W. A.","family":"Goddard","id":"Goddard-W-A-III","orcid":"0000-0003-0097-5716"},{"given":"K.","family":"Grela","id":"Grela-K","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"DFT; Olefin metathesis; Ruthenium; Hoveyda-Grubbs catalyst; Double-bond\n\n","date":"2017-05","date_type":"published","publication":"Molecular Catalysis","volume":"433","number":"","pagerange":"313-320","id_number":"CaltechAUTHORS:20170525-074754954","refereed":true,"issn":"2468-8231","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170525-074754954","related_url":[{"url":"https://doi.org/10.1016/j.mcat.2016.12.018","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S1381116916305799","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"B. Trzaskowski, W.A. Goddard, K. Grela, Faster initiating olefin metathesis catalysts from introducing double bonds into cyclopropyl, cyclobutyl and cyclopentyl derivatives of Hoveyda-Grubbs precatalysts, Molecular Catalysis, Volume 433, May 2017, Pages 313-320, ISSN 2468-8231, https://doi.org/10.1016/j.mcat.2016.12.018.\n(http://www.sciencedirect.com/science/article/pii/S1381116916305799)","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}