{"title":"Testing General Relativity with Stellar Orbits around the Supermassive Black Hole in Our Galactic Center","uri":"","abstract":"We demonstrate that short-period stars orbiting around the supermassive black hole in our Galactic center can successfully be used to probe the gravitational theory in a strong regime. We use 19 years of observations of the two best measured short-period stars orbiting our Galactic center to constrain a hypothetical fifth force that arises in various scenarios motivated by the development of a unification theory or in some models of dark matter and dark energy. No deviation from general relativity is reported and the fifth force strength is restricted to an upper 95% confidence limit of |α|\u003c0.016 at a length scale of λ=150 astronomical units. We also derive a 95% confidence upper limit on a linear drift of the argument of periastron of the short-period star S0-2 of |ω_(S0-2)|\u003c1.6×10^(-3)  rad/yr, which can be used to constrain various gravitational and astrophysical theories. This analysis provides the first fully self-consistent test of the gravitational theory using orbital dynamic in a strong gravitational regime, that of a supermassive black hole. A sensitivity analysis for future measurements is also presented.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252769","docid":252769,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263174","fileid":1263174,"datasetid":"document","objectid":252769,"filename":"PhysRevLett.118.211101.pdf","mime_type":"application/pdf","hash":"78b9dc5bd2352ffe0a624fa97f132a60","hash_type":"MD5","filesize":451941,"mtime":"2017-05-25 17:37:17","url":"http://authors.library.caltech.edu/77755/1/PhysRevLett.118.211101.pdf"}],"eprintid":77755,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"PhysRevLett.118.211101.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252770","docid":252770,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263181","fileid":1263181,"datasetid":"document","objectid":252770,"filename":"supplemental.pdf","mime_type":"application/pdf","hash":"6208d58882cbb490925a3cc4a601aeac","hash_type":"MD5","filesize":60219,"mtime":"2017-05-25 17:41:43","url":"http://authors.library.caltech.edu/77755/2/supplemental.pdf"}],"eprintid":77755,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"supplemental.pdf","content":"supplemental"}],"note":"© 2017 American Physical Society. \n\nReceived 22 December 2016; revised manuscript received 14 March 2017; published 25 May 2017. \n\nA. H. thanks W. Folkner and P. Wolf for the interesting discussions. Support for this work was provided by NSF Grant No. AST-1412615, the Heising-Simon Foundation, the Levine-Leichtman Family Foundation, the Galactic Center Board of Advisors, and Janet Marott for her support of the research on S0-38 through the Galactic Center Stellar Patron Program.","id":77755,"rev_number":13,"userid":18,"eprint_dir":"disk0/00/07/77/55","datestamp":"2017-05-25 17:56:21","lastmod":"2017-05-25 17:56:21","status_changed":"2017-05-25 17:56:21","type":"article","metadata_visibility":"show","creators":[{"given":"A.","family":"Hees","id":"Hees-A","orcid":""},{"given":"T.","family":"Do","id":"Do-Tuan","orcid":""},{"given":"A. M.","family":"Ghez","id":"Ghez-A-M","orcid":""},{"given":"G. D.","family":"Martinez","id":"Martinez-G-D","orcid":""},{"given":"S.","family":"Naoz","id":"Naoz-S","orcid":""},{"given":"E. E.","family":"Becklin","id":"Becklin-E-E","orcid":""},{"given":"A.","family":"Boehle","id":"Boehle-A","orcid":""},{"given":"S.","family":"Chappell","id":"Chappell-S","orcid":""},{"given":"D","family":"Chu","id":"Chu-D","orcid":""},{"given":"A.","family":"Dehghanfar","id":"Dehghanfar-A","orcid":""},{"given":"K.","family":"Kosmo","id":"Kosmo-K","orcid":""},{"given":"J. R.","family":"Lu","id":"Lu-J-R","orcid":""},{"given":"K.","family":"Matthews","id":"Matthews-K","orcid":""},{"given":"M. R.","family":"Morris","id":"Morris-M-R","orcid":""},{"given":"S.","family":"Sakai","id":"Sakai-S","orcid":""},{"given":"R.","family":"Schödel","id":"Schödel-R","orcid":""},{"given":"G.","family":"Witzel","id":"Witzel-G","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-26","date_type":"published","publication":"Physical Review Letters","volume":"118","number":"21","pagerange":"Art. No. 211101","id_number":"CaltechAUTHORS:20170525-103713870","refereed":true,"issn":"0031-9007","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170525-103713870","related_url":[{"url":"https://doi.org/10.1103/PhysRevLett.118.211101","type":"doi","description":"Article"},{"url":"https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.118.211101","type":"pub","description":"Article"},{"url":"https://journals.aps.org/prl/supplemental/10.1103/PhysRevLett.118.211101","type":"pub","description":"Supplemental Material"}],"referencetext":["I. Debono and G. F. Smoot, General relativity and cosmology: Unsolved questions and future directions, Universe 2, 23 (2016).\nT. Clifton, P. G. Ferreira, A. Padilla, and C. Skordis, Modified gravity and cosmology, Phys. Rep. 513, 1 (2012).\nB. Famaey and S. S. McGaugh, Modified Newtonian dynamics (MOND): Observational phenomenology and relativistic extensions, Living Rev. Relativ. 15, 10 (2012).\nE. Berti et al., Testing general relativity with present and future astrophysical observations, Classical Quantum Gravity 32, 243001 (2015).\nC. M. Will, Theory and Experiment in Gravitational Physics (Cambridge University Press, Cambridge, England, 1993), p. 396.\nC. M. Will, The confrontation between general relativity and experiment, Living Rev. Relativ. 17, 4 (2014).\nS. G. Turyshev, Experimental tests of general relativity: Recent progress and future directions, Usp. Fiz. Nauk 179, 3 (2009); Experimental tests of general relativity: recent progress and future directions, [Sov. Phys. Usp. 52, 1 (2009)].\nJ. D. Tasson, The standard-model extension and gravitational tests, Symmetry 8, 111 (2016); A. Hees, Q. G. Bailey, A. Bourgoin, H. Pihan-Le Bars, C. Guerlin, and C. Le Poncin-Lafitte, Tests of Lorentz symmetry in the gravitational sector, Universe 2, 30 (2016).\nI. H. Stairs, Testing general relativity with pulsar timing, Living Rev. Relativ. 6, 5 (2003); M. Kramer, Pulsars as probes of gravity and fundamental physics, Int. J. Mod. Phys. D 25, 1630029 (2016).\nD. Psaltis, Probes and tests of strong-field gravity with observations in the electromagnetic spectrum, Living Rev. Relativ. 11, 9 (2008).\nT. Johannsen, Testing the no-hair theorem with observations of black holes in the electromagnetic spectrum, Classical Quantum Gravity 33, 124001 (2016); Sgr A* and general relativity, 33, 113001 (2016).\nD. Psaltis, Measurements of black hole spins and tests of strong‐field general relativity, AIP Conf. Proc. 714, 29 (2004).\nE. Fischbach, D. Sudarsky, A. Szafer, C. Talmadge, and S. H. Aronson, Reanalysis of the Eoumltvös Experiment, Phys. Rev. Lett. 56, 3 (1986).\nC. Talmadge, J.-P. Berthias, R. W. Hellings, and E. M. Standish, Model-Independent Constraints on Possible Modifications of Newtonian Gravity, Phys. Rev. Lett. 61, 1159 (1988).\nE. Fischbach and C. Talmadge, Six years of the fifth force, Nature (London) 356, 207 (1992).\nE. Fischbach and C. L. Talmadge, editors, The Search for Non-Newtonian Gravity (Springer, New York, 1999).\nE. G. Adelberger, B. R. Heckel, and A. E. Nelson, Tests of the gravitational inverse-square law, Annu. Rev. Nucl. Part. Sci. 53, 77 (2003).\nE. G. Adelberger, J. H. Gundlach, B. R. Heckel, S. Hoedl, and S. Schlamminger, Torsion balance experiments: A low-energy frontier of particle physics, Prog. Part. Nucl. Phys. 62, 102 (2009).\nY. Fujii, Nature (London) 234, 5 (1971); T. R. Taylor and G. Veneziano, Dilaton couplings at large distances, Phys. Lett. B 213, 450 (1988); D. B. Kaplan and M. B. Wise, Couplings of a light dilaton and violations of the equivalence principle, J. High Energy Phys. 2000, 037; D. E. Krause and E. Fischbach, in Gyros, Clocks, Interferometers ...: Testing Relativistic Gravity in Space edited by C. Lämmerzahl, C. W. F. Everitt, and F. W. Hehl (Springer, New York, 2001), p. 292, Vol. 562.\nI. Bars and M. Visser, Feeble Intermediate-Range Forces from Higher Dimensions, Phys. Rev. Lett. 57, 25 (1986); E. Floratos, Low scale unification, Newton’s law and extra dimensions, Phys. Lett. B 465, 95 (1999); A. Kehagias and K. Sfetsos, Deviations from the 1/r2 Newton law due to extra dimensions, 472, 39 (2000); C. D. Hoyle, U. Schmidt, B. R. Heckel, E. G. Adelberger, J. H. Gundlach, D. J. Kapner, and H. E. Swanson, Submillimeter Test of the Gravitational Inverse-Square Law: A Search for “Large” Extra Dimensions, Phys. Rev. Lett. 86, 1418 (2001); W. D. Goldberger and M. B. Wise, Modulus Stabilization with Bulk Fields, 83, 4922 (1999).\nN. Arkani-Hamed, S. Dimopoulos, and G. Dvali, The hierarchy problem and new dimensions at a millimeter, Phys. Lett. B 429, 263 (1998); Phenomenology, astrophysics, and cosmology of theories with submillimeter dimensions and TeV scale quantum gravity, Phys. Rev. D 59, 086004 (1999); G. Dvali, G. Gabadadze, and M. Porrati, Metastable gravitons and infinite volume extra dimensions, Phys. Lett. B 484, 112 (2000); I. I. Kogan, S. Mouslopoulos, A. Papazoglou, and G. G. Ross, Multibrane worlds and modification of gravity at large scales, Nucl. Phys. B595, 225 (2001); I. Antoniadis, K. Benakli, A. Laugier, and T. Maillard, Brane to bulk supersymmetry breaking and radion force at micron distances, B662, 40 (2003).\nI. Antoniadis, S. Dimopoulos, and G. Dvali, Millimetre-range forces in superstring theories with weak-scale, B516, 70 (1998); S. Dimopoulos and G. F. Giudice, Macroscopic forces from supersymmetry, Phys. Lett. B 379, 105 (1996).\nJ. A. Frieman and B.-A. Gradwohl, Dark Matter and the Equivalence Principle, Phys. Rev. Lett. 67, 2926 (1991); B.-A. Gradwohl and J. A. Frieman, Dark matter, long-range forces, and large-scale structure, Astrophys. J. 398, 407 (1992); C. W. Stubbs, Experimental Limits on any Long Range Nongravitational Interaction between Dark Matter and Ordinary Matter, Phys. Rev. Lett. 70, 119 (1993); S. M. Carroll, S. Mantry, M. J. Ramsey-Musolf, and C. W. Stubbs, Dark-Matter-Induced Violation of the Weak Equivalence Principle, 103, 011301 (2009); S. M. Carroll, S. Mantry, and M. J. Ramsey-Musolf, Implications of a scalar dark force for terrestrial experiments, Phys. Rev. D 81, 063507 (2010).\nL. Perivolaropoulos, PPN parameter γ and solar system constraints of massive Brans-Dicke theories, 81, 047501 (2010); J. Alsing, E. Berti, C. M. Will, and H. Zaglauer, Gravitational radiation from compact binary systems in the massive Brans-Dicke theory of gravity, 85, 064041 (2012).\nJ. W. Moffat, Scalar-tensor-vector gravity theory, J. Cosmol. Astropart. Phys. 2006, 004.\nS. Capozziello, T. Harko, T. S. Koivisto, F. S. N. Lobo, and G. Olmo, Hybrid metric-Palatini gravity, Universe 1, 199 (2015).\nV. I. Zakharov, Pis’Ma Zh. Tekh. Fiz. 12, 447 (1970); C. M. Will, Bounding the mass of the graviton using gravitational-wave observations of inspiralling compact binaries, Phys. Rev. D 57, 2061 (1998); M. Visser, Mass for the Graviton, Gen. Relativ. Gravit. 30, 1717 (1998); T. Damour, I. I. Kogan, and A. Papazoglou, Spherically symmetric spacetimes in massive gravity, Phys. Rev. D 67, 064009 (2003); E. Babichev, C. Deffayet, and R. Ziour, Recovery of general relativity in massive gravity via the Vainshtein mechanism, 82, 104008 (2010).\nK. Hinterbichler, Theoretical aspects of massive gravity, Rev. Mod. Phys. 84, 671 (2012).\nR. Spero, J. K. Hoskins, R. Newman, J. Pellam, and J. Schultz, Test of the Gravitational Inverse-Square Law at Laboratory Distances, Phys. Rev. Lett. 44, 1645 (1980); J. K. Hoskins, R. D. Newman, R. Spero, and J. Schultz, Experimental tests of the gravitational inverse-square law for mass separations from 2 to 105 cm, Phys. Rev. D 32, 3084 (1985); N. Mio, K. Tsubono, and H. Hirakawa, Experimental test of the law of gravitation at small distances, 36, 2321 (1987); M. V. Moody and H. J. Paik, Gauss’s Law Test of Gravity at Short Range, Phys. Rev. Lett. 70, 1195 (1993); U. Mohideen and A. Roy, Precision Measurement of the Casimir Force from 0.1 to 0.9μm, 81, 4549 (1998); J. C. Long, H. W. Chan, A. B. Churnside, E. A. Gulbis, M. C. M. Varney, and J. C. Price, New experimental limits on macroscopic forces below 100 microns, Nature (London) 421, 922 (2003); J. Chiaverini, S. J. Smullin, A. A. Geraci, D. M. Weld, and A. Kapitulnik, New Experimental Constraints on Non-Newtonian Forces below 100  μm, Phys. Rev. Lett. 90, 151101 (2003); C. D. Hoyle, D. J. Kapner, B. R. Heckel, E. G. Adelberger, J. H. Gundlach, U. Schmidt, and H. E. Swanson, Submillimeter tests of the gravitational inverse-square law, Phys. Rev. D 70, 042004 (2004); S. J. Smullin, A. A. Geraci, D. M. Weld, J. Chiaverini, S. Holmes, and A. Kapitulnik, Constraints on Yukawa-type deviations from Newtonian gravity at 20 microns, 72, 122001 (2005); R. S. Decca, D. López, H. B. Chan, E. Fischbach, D. E. Krause, and C. R. Jamell, Constraining New Forces in the Casimir Regime Using the Isoelectronic Technique, Phys. Rev. Lett. 94, 240401 (2005); D. J. Kapner, T. S. Cook, E. G. Adelberger, J. H. Gundlach, B. R. Heckel, C. D. Hoyle, and H. E. Swanson, Tests of the Gravitational Inverse-Square Law below the Dark-Energy Length Scale, 98, 021101 (2007); R. S. Decca, D. López, E. Fischbach, G. L. Klimchitskaya, D. E. Krause, and and V. M. Mostepanenko, Tests of new physics from precise measurements of the Casimir pressure between two gold-coated plates, Phys. Rev. D 75, 077101 (2007); L.-C. Tu, S.-G. Guan, J. Luo, C.-G. Shao, and L.-X. Liu, Null Test of Newtonian Inverse-Square Law at Submillimeter Range with a Dual-Modulation Torsion Pendulum, Phys. Rev. Lett. 98, 201101 (2007); E. G. Adelberger, B. R. Heckel, S. Hoedl, C. D. Hoyle, D. J. Kapner, and A. Upadhye, Particle-Physics Implications of a Recent Test of the Gravitational Inverse-Square Law, 98, 131104 (2007); A. A. Geraci, S. J. Smullin, D. M. Weld, J. Chiaverini, and A. Kapitulnik, Improved constraints on non-Newtonian forces at 10 microns, Phys. Rev. D 78, 022002 (2008); M. Masuda and M. Sasaki, Limits on Nonstandard Forces in the Submicrometer Range, Phys. Rev. Lett. 102, 171101 (2009); A. O. Sushkov, W. J. Kim, D. A. R. Dalvit, and S. K. Lamoreaux, New Experimental Limits on Non-Newtonian Forces in the Micrometer Range, 107, 171101 (2011); S.-Q. Yang, B.-F. Zhan, Q.-L. Wang, C.-G. Shao, L.-C. Tu, W.-H. Tan, and J. Luo, Test of the Gravitational Inverse Square Law at Millimeter Ranges, 108, 081101 (2012); Y.-J. Chen, W. K. Tham, D. E. Krause, D. López, E. Fischbach, and R. S. Decca, Stronger Limits on Hypothetical Yukawa Interactions in the 30–8000 nm Range, 116, 221102 (2016).\nJ. Murata and S. Tanaka, Review of short-range gravity experiments in the LHC era, Classical Quantum Gravity 32, 033001 (2015).\nL. Iorio, Constraints on the range λ of Yukawa-like modifications to the Newtonian inverse-square law of gravitation from Solar System planetary motions, J. High Energy Phys. 2007, 041; Constraints from orbital motions around the Earth of the environmental fifth-force hypothesis for the OPERA superluminal neutrino phenomenology, 2012, 073.\nD. M. Lucchesi and R. Peron, LAGEOS II pericenter general relativistic precession (1993–2005): Error budget and constraints in gravitational physics, Phys. Rev. D 89, 082002 (2014); R. Peron, Testing General Relativistic Predictions with the LAGEOS Satellites, Adv. High Energy Phys. 2014, 791367 (2014).\nJ. Müller, J. G. Williams, and S. G. Turyshev, Lunar laser ranging contributions to relativity and geodesy, Astrophysics and Space Science Library 349, 457 (2008).\nA. S. Konopliv, S. W. Asmar, W. M. Folkner, O. Karatekin, D. C. Nunes, S. E. Smrekar, C. F. Yoder, and M. T. Zuber, Mars high resolution gravity fields from MRO, Mars seasonal gravity, and other dynamical parameters, Icarus 211, 401 (2011).\nA. Hees, W. M. Folkner, R. A. Jacobson, and R. S. Park, Constraints on MOND theory from radio tracking data of the Cassini spacecraft, Phys. Rev. D 89, 102002 (2014); Z.-W. Li, S.-F. Yuan, C. Lu, and Y. Xie, New upper limits on deviation from the inverse-square law of gravity in the solar system: a Yukawa parameterization, Res. Astron. Astrophys. 14, 139 (2014).\nD. Borka, P. Jovanović, V. B. Jovanović, and A. F. Zakharov, Constraining the range of Yukawa gravity interaction from S2 star orbits, J. Cosmol. Astropart. Phys. 2013, 050; A. F. Zakharov, P. Jovanović, D. Borka, and V. B. Jovanović, Constraining the range of Yukawa gravity interaction from S2 star orbits II: Bounds on graviton mass, 2016, 045.\nA. M. Ghez, B. L. Klein, M. Morris, and E. E. Becklin, High Proper-Motion Stars in the Vicinity of Sagittarius A*: Evidence for a Supermassive Black Hole at the Center of Our Galaxy, Astrophys. J. 509, 678 (1998).\nA. M. Ghez, M. Morris, E. E. Becklin, A. Tanner, and T. Kremenek, The accelerations of stars orbiting the Milky Way’s central black hole, Nature (London) 407, 349 (2000).\nA. M. Ghez, G. Duchêne, K. Matthews, S. D. Hornstein, A. Tanner, J. Larkin, M. Morris, E. E. Becklin, S. Salim, T. Kremenek, D. Thompson, B. T. Soifer, G. Neugebauer, and I. McLean, The First Measurement of Spectral Lines in a Short-Period Star Bound to the Galaxy’s Central Black Hole: A Paradox of Youth, Astrophys. J. Lett. 586, L127 (2003).\nA. M. Ghez, S. Salim, S. D. Hornstein, A. Tanner, J. R. Lu, M. Morris, E. E. Becklin, and G. Duchêne, Stellar Orbits around the Galactic Center Black Hole, Astrophys. J. 620, 744 (2005).\nA. M. Ghez, S. D. Hornstein, J. R. Lu, A. Bouchez, D. Le Mignant, M. A. van Dam, P. Wizinowich, K. Matthews, M. Morris, E. E. Becklin, R. D. Campbell, J. C. Y. Chin, S. K. Hartman, E. M. Johansson, R. E. Lafon, P. J. Stomski, and D. M. Summers, The First Laser Guide Star Adaptive Optics Observations of the Galactic Center: Sgr A*’s Infrared Color and the Extended Red Emission in its Vicinity, Astrophys. J. 635, 1087 (2005).\nA. M. Ghez, S. Salim, N. N. Weinberg, J. R. Lu, T. Do, J. K. Dunn, K. Matthews, M. R. Morris, S. Yelda, E. E. Becklin, T. Kremenek, M. Milosavljevic, and J. Naiman, Measuring distance and properties of the Milky Way’s central supermassive black hole with stellar orbits, Astrophys. J. 689, 1044 (2008).\nL. Meyer, A. M. Ghez, R. Schödel, S. Yelda, A. Boehle, J. R. Lu, T. Do, M. R. Morris, E. E. Becklin, and K. Matthews, The Shortest-Known–Period Star Orbiting Our Galaxy’s Supermassive Black Hole, Science 338, 84 (2012).\nA. Boehle, A. M. Ghez, R. Schödel, L. Meyer, S. Yelda, S. Albers, G. D. Martinez, E. E. Becklin, T. Do, J. R. Lu, K. Matthews, M. R. Morris, B. Sitarski, and G. Witzel, An improved distance and mass estimate for Sgr A* from a multistar orbit analysis, Astrophys. J. 830, 17 (2016).\nR. Genzel, A. Eckart, T. Ott, and F. Eisenhauer, On the nature of the dark mass in the centre of the Milky Way, Mon. Not. R. Astron. Soc. 291, 219 (1997).\nA. Eckart and R. Genzel, Stellar proper motions in the central 0.1 pc of the Galaxy, Mon. Not. R. Astron. Soc. 284, 576 (1997).\nR. Schödel et al., A star in a 15.2-year orbit around the supermassive black hole at the centre of the Milky Way, Nature (London) 419, 694 (2002).\nA. Eckart, R. Genzel, T. Ott, and R. Schödel, Stellar orbits near Sagittarius A*, Mon. Not. R. Astron. Soc. 331, 917 (2002).\nF. Eisenhauer, R. Schödel, R. Genzel, T. Ott, M. Tecza, R. Abuter, A. Eckart, and T. Alexander, A Geometric Determination of the Distance to the Galactic Center, Astrophys. J. Lett. 597, L121 (2003).\nF. Eisenhauer et al., SINFONI in the Galactic Center: Young Stars and Infrared Flares in the Central Light-Month, Astrophys. J. 628, 246 (2005).\nS. Gillessen, F. Eisenhauer, T. K. Fritz, H. Bartko, K. Dodds-Eden, O. Pfuhl, T. Ott, and R. Genzel, The orbit of the star S2 around SgrA* from VLT and Keck data, Astrophys. J. Lett. 707, L114 (2009).\nS. Gillessen, F. Eisenhauer, S. Trippe, T. Alexander, R. Genzel, F. Martins, and T. Ott, Monitoring stellar orbits around the massive black hole in the Galactic center, Astrophys. J. 692, 1075 (2009).\nS. Gillessen, P. M. Plewa, F. Eisenhauer, R. Sari, I. Waisberg, M. Habibi, O. Pfuhl, E. George, J. Dexter, S. von Fellenberg, T. Ott, and R. Genzel, An update on monitoring stellar orbits in the Galactic center, Astrophys. J. 837, 30 (2017).\nT. Alexander, Stellar processes near the massive black hole in the Galactic center, Phys. Rep. 419, 65 (2005).\nM. Jaroszynski, Relativistic effects in proper motions of stars surrounding the Galactic center, Acta Astronaut. 48, 653 (1998); P. C. Fragile and G. J. Mathews, Reconstruction of Stellar Orbits Close to Sagittarius A*: Possibilities for Testing General Relativity, Astrophys. J. 542, 328 (2000); G. F. Rubilar and A. Eckart, Periastron shifts of stellar orbits near the Galactic Center, Astron. Astrophys. 374, 95 (2001); N. N. Weinberg, M. Milosavljević, and A. M. Ghez, Stellar Dynamics at the Galactic Center with an Extremely Large Telescope, Astrophys. J. 622, 878 (2005); S. Zucker, T. Alexander, S. Gillessen, F. Eisenhauer, and R. Genzel, Probing Post-Newtonian Physics near the Galactic Black Hole with Stellar Redshift Measurements, Astrophys. J. Lett. 639, L21 (2006); G. V. Kraniotis, Periapsis and gravitomagnetic precessions of stellar orbits in Kerr and Kerr–de Sitter black hole spacetimes, Classical Quantum Gravity 24, 1775 (2007); C. M. Will, Testing the general relativistic “no-hair” theorems using the Galactic center black hole SgrA*, Astrophys. J. Lett. 674, L25 (2008); D. Merritt, T. Alexander, S. Mikkola, and C. M. Will, Testing properties of the Galactic center black hole using stellar orbits, Phys. Rev. D 81, 062002 (2010); R. Angélil and P. Saha, Relativistic redshift effects and the galactic-center stars, Astrophys. J. 711, 157 (2010); R. Angélil, P. Saha, and D. Merritt, Towards relativistic orbit fitting of Galactic center stars and pulsars, 720, 1303 (2010); L. Iorio, Long-term classical and general relativistic effects on the radial velocities of the stars orbiting Sgr A*, Mon. Not. R. Astron. Soc. 411, 453 (2011); R. Angélil and P. Saha, Galactic-center S stars as a prospective test of the Einstein equivalence principle, Astrophys. J. Lett. 734, L19 (2011); L. Sadeghian and C. M. Will, Long-term classical and general relativistic effects on the radial velocities of the stars orbiting Sgr A*, Classical Quantum Gravity 28, 225029 (2011); R. Angélil and P. Saha, Clocks around Sgr A*, Mon. Not. R. Astron. Soc. 444, 3780 (2014); F. Zhang, Y. Lu, and Q. Yu, On testing the Kerr metric of the massive black hole in the Galactic center via stellar orbital motion: Full general relativistic treatment, Astrophys. J. 809, 127 (2015); D. Borka, P. Jovanović, V. B. Jovanović, and A. F. Zakharov, Constraints on \nR\nn\n gravity from precession of orbits of S2-like stars, Phys. Rev. D 85, 124004 (2012); S. Capozziello, D. Borka, P. Jovanović, and V. B. Jovanović, Constraining extended gravity models by S2 star orbits around the Galactic centre, 90, 044052 (2014); A. F. Zakharov, D. Borka, V. B. Jovanović, and P. Jovanović, Constraints on \nR\nn\n gravity from precession of orbits of S2-like stars: A case of a bulk distribution of mass, Adv. Space Res. 54, 1108 (2014); D. Borka, S. Capozziello, P. Jovanović, and V. B. Jovanović, Probing hybrid modified gravity by stellar motion around Galactic centre, Astropart. Phys. 79, 41 (2016).\nL. B. Lucy, Mass estimates for visual binaries with incomplete orbits, Astron. Astrophys. 563, A126 (2014).\nJ. R. Lu, A. M. Ghez, S. D. Hornstein, M. Morris, and E. E. Becklin, IRS 16 SW: A New Comoving Group of Young Stars in the Central Parsec of the Milky Way, Astrophys. J. Lett. 625, L51 (2005).\nR. Schödel, S. Yelda, A. Ghez, J. H. Girard, L. Labadie, R. Rebolo, A. Pérez-Garrido, and M. R. Morris, Holographic imaging of crowded fields: high angular resolution imaging with excellent quality at very low cost, Mon. Not. R. Astron. Soc. 429, 1367 (2013).\nE. Diolaiti, O. Bendinelli, D. Bonaccini, L. Close, D. Currie, and G. Parmeggiani, Analysis of isoplanatic high resolution stellar fields by starfinder code, Astron. Astrophys. Suppl. Ser. 147, 335 (2000).\nJ. R. Lu, A. M. Ghez, S. D. Hornstein, M. R. Morris, E. E. Becklin, and K. Matthews, A disk of young stars at the Galactic center as determined by individual stellar orbits, Astrophys. J. 690, 1463 (2009).\nS. Yelda, J. R. Lu, A. M. Ghez, W. Clarkson, J. Anderson, T. Do, and K. Matthews, Improving Galactic center astrometry by reducing the effects of geometric distortion, 725, 331 (2010); Erratum, 726, 114(E) (2011).\nS. Yelda, A. M. Ghez, J. R. Lu, T. Do, L. Meyer, M. R. Morris, and K. Matthews, Properties of the remnant clockwise disk of young stars in the Galactic center, Astrophys. J. 783, 131 (2014).\nP. L. Wizinowich, D. Le Mignant, A. H. Bouchez, R. D. Campbell, J. C. Y. Chin, A. R. Contos, M. A. van Dam, S. K. Hartman, E. M. Johansson, R. E. Lafon, H. Lewis, P. J. Stomski, D. M. Summers, C. G. Brown, P. M. Danforth, C. E. Max, and D. M. Pennington, The W. M. Keck Observatory Laser Guide Star Adaptive Optics System: Overview, Publ. Astron. Soc. Pac. 118, 297 (2006).\nM. A. van Dam, A. H. Bouchez, D. Le Mignant, E. M. Johansson, P. L. Wizinowich, R. D. Campbell, J. C. Y. Chin, S. K. Hartman, R. E. Lafon, P. J. Stomski, Jr., and D. M. Summers, The W. M. Keck Observatory Laser Guide Star Adaptive Optics System: Performance Characterization, Publ. Astron. Soc. Pac. 118, 310 (2006).\nM. J. Reid, K. M. Menten, S. Trippe, T. Ott, and R. Genzel, The Position of Sagittarius A*. III. Motion of the Stellar Cusp, Astrophys. J. 659, 378 (2007).\nT. Do, A. M. Ghez, M. R. Morris, J. R. Lu, K. Matthews, S. Yelda, and J. Larkin, High angular resolution integral-field spectroscopy of the Galaxy’s nuclear cluster: A missing stellar cusp?, Astrophys. J. 703, 1323 (2009).\nT. Do, J. R. Lu, A. M. Ghez, M. R. Morris, S. Yelda, G. D. Martinez, S. A. Wright, and K. Matthews, Stellar populations in the central 0.5 pc of the galaxy. I. A new method for constructing luminosity functions and surface-density profiles, Astrophys. J. 764, 154 (2013).\nF. Feroz and M. P. Hobson, Multimodal nested sampling: An efficient and robust alternative to MCMC methods for astronomical data analysis, Mon. Not. R. Astron. Soc. 384, 449 (2008); F. Feroz, M. P. Hobson, and M. Bridges, multinest: An efficient and robust Bayesian inference tool for cosmology and particle physics, 398, 1601 (2009).\nJ. N. Bahcall and R. A. Wolf, Star distribution around a massive black hole in a globular cluster, Astrophys. J. 209, 214 (1976).\nR. Schödel, D. Merritt, and A. Eckart, The nuclear star cluster of the Milky Way: Proper motions and mass, Astron. Astrophys. 502, 91 (2009).\nT. Do, G. D. Martinez, S. Yelda, A. M. Ghez, J. Bullock, M. Kaplinghat, J. R. Lu, A. H. G. Peter, and K. Phifer, 3D stellar kinematics at the Galactic center: Measuring the nuclear star cluster spatial density profile, black hole mass, and distance, Astrophys. J. Lett. 779, L6 (2013).\nS. N. Chappell, A. M. Ghez, T. Do, G. D. Martinez, S. Yelda, B. N. Sitarski, J. R. Lu, and M. R. Morris, The late-type stellar density profile in the Galactic center: A statistical approach, Proc. Int. Astron. Union 11, 235 (2016).\nR. Schödel, E. Gallego-Cano, H. Dong, F. Nogueras-Lara, A. T. Gallego-Calvente, P. Amaro-Seoane, and H. Baumgardt, The Distribution of Stars around the Milky Way’s Central Black Hole II: Diffuse Light from Sub-Giants and Dwarfs, arXiv:1701.03817.\nR. Lupton, Statistics in Theory and Practice (Princeton University Press, Princeton, NJ, 1993); A. D. Gottlieb, Asymptotic equivalence of the jackknife and infinitesimal jackknife variance estimators for some smooth statistics, Ann. Inst. Stat. Math. 55, 555 (2003).\nSee Supplemental Material at http://link.aps.org/supplemental/10.1103/PhysRevLett.118.211101 for a table with our results.\nT. Damour and G. Esposito-Farese, Nonperturbative Strong-Field Effects in Tensor-Scalar Theories of Gravitation, Phys. Rev. Lett. 70, 2220 (1993).\nJ. Khoury and A. Weltman, Chameleon cosmology, Phys. Rev. D 69, 044026 (2004); Chameleon Fields: Awaiting Surprises for Tests of Gravity in Space, Phys. Rev. Lett. 93, 171104 (2004); J. Khoury, Theories of Dark Energy with Screening Mechanisms, arXiv:1011.5909; A. I. Vainshtein, To the problem of nonvanishing gravitation mass, Phys. Lett. 39B, 393 (1972); A. Hees and A. Füzfa, Combined cosmological and Solar System constraints on chameleon mechanism, Phys. Rev. D 85, 103005 (2012); K. Hinterbichler and J. Khoury, Screening Long-Range Forces through Local Symmetry Restoration, Phys. Rev. Lett. 104, 231301 (2010); K. Hinterbichler, J. Khoury, A. Levy, and A. Matas, Symmetron cosmology, Phys. Rev. D 84, 103521 (2011).\nB. P. Abbott et al. (LIGO Scientific and Virgo Collaborations), Observation of Gravitational Waves from a Binary Black Hole Merger, Phys. Rev. Lett. 116, 061102 (2016); et al., Tests of General Relativity with GW150914, 116, 221101 (2016).\nC. P. Burgess and J. Cloutier, Astrophysical evidence for a weak new force?, Phys. Rev. D 38, 2944 (1988).\nH. Maeda and N. Dadhich, Matter without matter: Kaluza-Klein spacetime in Einstein-Gauss-Bonnet gravity, 75, 044007 (2007); A. Gualandris, S. Gillessen, and D. Merritt, The Galactic Centre star S2 as a dynamical probe for intermediate-mass black holes, Mon. Not. R. Astron. Soc. 409, 1146 (2010); E. Hackmann, B. Hartmann, C. Lämmerzahl, and P. Sirimachan, Test particle motion in the space-time of a Kerr black hole pierced by a cosmic string, Phys. Rev. D 82, 044024 (2010); L. Iorio, Observational constraints on spatial anisotropy of G from orbital motions, Classical Quantum Gravity 28, 225027 (2011); V. Enolskii, B. Hartmann, V. Kagramanova, J. Kunz, C. Lämmerzahl, and P. Sirimachan, Particle motion in Hořava-Lifshitz black hole space-times, Phys. Rev. D 84, 084011 (2011); L. Iorio, Model-independent constraints on \nr\n3\n extra-interactions from orbital motions, Ann. Phys. (Berlin) 524, 371 (2012); Constraints on Galileon-induced precessions from Solar System orbital motions, J. Cosmol. Astropart. Phys. 2012, 001; Constraining the electric charges of some astronomical bodies in Reissner–Nordström spacetimes and generic r−2-type power-law potentials from orbital motions, Gen. Relativ. Gravit. 44, 1753 (2012); V. Diemer, K. Eilers, B. Hartmann, I. Schaffer, and C. Toma, Geodesic motion in the space-time of a noncompact boson star, Phys. Rev. D 88, 044025 (2013); M. Halilsoy, O. Gurtug, and S. H. Mazharimousavi, Rindler modified Schwarzschild geodesics, Gen. Relativ. Gravit. 45, 2363 (2013); L. Iorio, Exact expressions for the pericenter precession caused by some dark matter distributions and constraints on them from orbital motions in the Solar System, in the double pulsar and in the Galactic center, Galaxies 1, 6 (2013); A. J. S. Capistrano, W. L. Roque, and R. S. Valada, Weyl conformastatic perihelion advance of small body objects, Mon. Not. R. Astron. Soc. 444, 1639 (2014); T. P. Sotiriou and S.-Y. Zhou, Black hole hair in generalized scalar-tensor gravity: An explicit example, Phys. Rev. D 90, 124063 (2014); Y.-P. Hu, H.-S. Zhang, J.-P. Hou, and L.-Z. Tang, Perihelion precession and deflection of light in the general spherically symmetric spacetime, Adv. High Energy Phys. 2014, 604321 (2014); R. Uniyal, N. Chandrachani Devi, H. Nandan, and K. D. Purohit, Geodesic motion in Schwarzschild spacetime surrounded by quintessence, Gen. Relativ. Gravit. 47, 16 (2015); R. Linares, M. Maceda, and D. Martínez-Carbajal, Test particle motion in the Born-Infeld black hole, Phys. Rev. D 92, 024052 (2015); C. Charmousis and M. Tsoukalas, Lovelock Galileons and black holes, 92, 104050 (2015); S. Bhattacharya, K. F. Dialektopoulos, A. E. Romano, and T. N. Tomaras, Brans-Dicke Theory with Λ \u003e 0: Black Holes and Large Scale Structures, Phys. Rev. Lett. 115, 181104 (2015); S. Bhattacharya and S. Chakraborty, Constraining some Horndeski gravity theories, Phys. Rev. D 95, 044037 (2017); S. Li, H. Lü, and H. Wei, Dyonic (A)dS black holes in Einstein-Born-Infeld theory in diverse dimensions, J. High Energy Phys. 2016, 004.\nT. Johannsen, A. E. Broderick, P. M. Plewa, S. Chatzopoulos, S. S. Doeleman, F. Eisenhauer, V. L. Fish, R. Genzel, O. Gerhard, and M. D. Johnson, Testing General Relativity with the Shadow Size of Sgr A*, Phys. Rev. Lett. 116, 031101 (2016); T. Johannsen, C. Wang, A. E. Broderick, S. S. Doeleman, V. L. Fish, A. Loeb, and D. Psaltis, Testing General Relativity with Accretion-Flow Imaging of Sgr*A, 117, 091101 (2016); Testing General Relativity with Accretion-Flow Imaging of Sgr A*, arXiv:1608.03593.\nD. Psaltis, N. Wex, and M. Kramer, A quantitative test of the no-hair theorem with Sgr A* using stars, pulsars, and the Event Horizon Telescope, Astrophys. J. 818, 121 (2016)."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"AST-1412615"},{"agency":"Heising-Simon Foundation","grant_number":""},{"agency":"Levine-Leichtman Family Foundation","grant_number":""},{"agency":"Galactic Center Board of Advisors","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}