{"title":"Galactic Sources Detected in the NuSTAR Serendipitous Survey","uri":"","abstract":"The Nuclear Spectroscopic Telescope Array (NuSTAR) provides an improvement in\nsensitivity at energies above 10 keV by two orders of magnitude over\nnon-focusing satellites, making it possible to probe deeper into the Galaxy and\nUniverse. Lansbury and collaborators recently completed a catalog of 497\nsources serendipitously detected in the 3-24 keV band using 13 deg2 of NuSTAR\ncoverage. Here, we report on an optical and X-ray study of 16 Galactic sources\nin the catalog. We identify eight of them as stars (but some or all could have\nbinary companions), and use information from Gaia to report distances and X-ray\nluminosities for three of them. There are four CVs or CV candidates, and we\nargue that NuSTAR J233426-2343.9 is a relatively strong CV candidate based\npartly on an X-ray spectrum from XMM-Newton. NuSTAR J092418-3142.2, which is\nthe brightest serendipitous source in the Lansbury catalog, and NuSTAR\nJ073959-3147.8 are LMXB candidates, but it is also possible that these two\nsources are CVs. One of the sources is a known HMXB, and NuSTAR J105008-5958.8\nis a new HMXB candidate, which has strong Balmer emission lines in its optical\nspectrum and a hard X-ray spectrum. We discuss the implications of finding\nthese HMXBs for the surface density (logN-logS) and luminosity function of\nGalactic HMXBs. We conclude that, with the large fraction of unclassified\nsources in the Galactic plane detected by NuSTAR in the 8-24 keV band, there\ncould be a significant population of low luminosity HMXBs.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252775","docid":252775,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263298","fileid":1263298,"datasetid":"document","objectid":252775,"filename":"1705.08476.pdf","mime_type":"application/pdf","hash":"9d87244090ae89e3102a6ed0b8a38cc5","hash_type":"MD5","filesize":619106,"mtime":"2017-05-25 18:52:57","url":"http://authors.library.caltech.edu/77758/1/1705.08476.pdf"}],"eprintid":77758,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1705.08476.pdf","content":"submitted"}],"note":"This work made use of data from the NuSTAR mission, a\nproject led by the California Institute of Technology, managed\nby the Jet Propulsion Laboratory, and funded by the National\nAeronautics and Space Administration. We thank the\nNuSTAR Operations, Software and Calibration teams for support\nwith the execution and analysis of these observations.\nThis research has made use of the NuSTAR Data Analysis\nSoftware (NuSTARDAS) jointly developed by the ASI Science\nData Center (ASDC, Italy) and the California Institute\nof Technology (USA). Data from Swift, XMM, and Chandra\nwere also used, and the work on serendipitous NuSTAR\nsources is partially funded by Chandra grants GO5-16154X\nand GO6-17135X. RK acknowledges support from Russian\nScience Foundation (grant 14-12-01315). We acknowledge\nuseful discussions with A. Shaw, and we thank the referee for\nhelpful comments. This work has made use of data from the\nEuropean Space Agency (ESA) mission Gaia, processed by\nthe Gaia Data Processing and Analysis Consortium (DPAC).\nFunding for the DPAC has been provided by national institutions,\nin particular the institutions participating in the Gaia\nMultilateral Agreement. This research had made use of the\nSIMBAD database and the VizieR catalog access tool, CDS,\nStrasbourg, France","id":77758,"rev_number":8,"userid":999,"eprint_dir":"disk0/00/07/77/58","datestamp":"2017-05-25 18:55:17","lastmod":"2017-05-25 18:55:17","status_changed":"2017-05-25 18:55:17","type":"monograph","metadata_visibility":"show","creators":[{"given":"John A.","family":"Tomsick","id":"Tomsick-J-A","orcid":""},{"given":"George B.","family":"Lansbury","id":"Lansbury-G-B","orcid":""},{"given":"Farid","family":"Rahoui","id":"Rahoui-F","orcid":"0000-0001-7655-4120"},{"given":"Maïca","family":"Clavel","id":"Clavel-M","orcid":""},{"given":"Francesca M.","family":"Fornasini","id":"Fornasini-F-M","orcid":""},{"given":"Jaesub","family":"Hong","id":"Hong-Jaesub","orcid":""},{"given":"James","family":"Aird","id":"Aird-J","orcid":""},{"given":"David M.","family":"Alexander","id":"Alexander-D-M","orcid":""},{"given":"Arash","family":"Bodaghee","id":"Bodaghee-A","orcid":""},{"given":"Jeng-Lun","family":"Chiu","id":"Chiu-Jeng-Lun","orcid":""},{"given":"Jonathan E.","family":"Grindlay","id":"Grindlay-J-E","orcid":""},{"given":"Charles J.","family":"Hailey","id":"Hailey-C-J","orcid":""},{"given":"Fiona A.","family":"Harrison","id":"Harrison-F-A","orcid":"0000-0003-2992-8024"},{"given":"Roman A.","family":"Krivonos","id":"Krivonos-R-A","orcid":"0000-0003-2737-5673"},{"given":"Kaya","family":"Mori","id":"Mori-Kaya","orcid":"0000-0002-9709-5389"},{"given":"Daniel","family":"Stern","id":"Stern-D","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-23","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170525-114748455","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170525-114748455","related_url":[{"url":"http://arxiv.org/abs/1705.08476","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Abbott, B. P., Abbott, R., Abbott, T. D., et al. 2016, Physical Review Letters,\n116, 061102\nAird, J., Alexander, D. M., Ballantyne, D. R., et al. 2015, ApJ, 815, 66\nAjello, M., Alexander, D. M., Greiner, J., et al. 2012, ApJ, 749, 21\nAlexander, D. M., Stern, D., Del Moro, A., et al. 2013, ApJ, 773, 125\nBarlow, E. J., Knigge, C., Bird, A. J., et al. 2006, MNRAS, 372, 224\nBird, A. J., Bazzano, A., Malizia, A., et al. 2016, ApJS, 223, 15\nBond, H. E., Grauer, A. D., Burstein, D., \u0026 Marzke, R. O. 1987, PASP, 99,\n1097\nBrorby, M., Kaaret, P., Prestwich, A., \u0026 Mirabel, I. F. 2016, MNRAS, 457,\n4081\nBrown, A. G. A., Vallenari, A., Prusti, T., et al. 2016, A\u0026A, 595, A2\nBurrows, D. N., Hill, J. E., Nousek, J. A., et al. 2005, Space Science\nReviews, 120, 165\nCastor, J. I., Abbott, D. C., \u0026 Klein, R. I. 1975, ApJ, 195, 157\nCivano, F., Hickox, R. C., Puccetti, S., et al. 2015, ApJ, 808, 185\nCoburn, W., Heindl, W. A., Rothschild, R. E., et al. 2002, ApJ, 580, 394\nCox, A. N., 2000, Allen’s astrophysical quantities, 4th ed. Publisher: New\nYork: AIP Press; Springer; Edited by Arthur N. Cox.\nDempsey, R. C., Linsky, J. L., Schmitt, J. H. M. M., \u0026 Fleming, T. A. 1993,\nApJ, 413, 333\nEvans, I. N., Primini, F. A., Glotfelty, K. J., et al. 2010, ApJS, 189, 37\nEvans, P. A., Osborne, J. P., Beardmore, A. P., et al. 2014, ApJS, 210, 8\nFornasini, F. M., Tomsick, J. A., Bodaghee, A., et al. 2014, ApJ, 796, 105\nFornasini, F. M., Tomsick, J. A., Hong, J., et al. 2017, ApJS, 229, 33\nFranciosini, E., Pallavicini, R., \u0026 Tagliaferri, G. 2003, A\u0026A, 399, 279\nGarcia, M. R., McClintock, J. E., Narayan, R., et al. 2001, ApJ, 553, L47\nGüver, T., \u0026 Özel, F. 2009, MNRAS, 400, 2050\nHalpern, J. P., Leighly, K. M., Marshall, H. L., Eracleous, M., \u0026\nStorchi-Bergmann, T. 1998, PASP, 110, 1394\nHarrison, F. A., Craig, W. W., Christensen, F. E., et al. 2013, ApJ, 770, 103\nHong, J., Mori, K., Hailey, C. J., et al. 2016, ApJ, 825, 132\nHunsch, M., Schmitt, J. H. M. M., Schroder, K.-P., \u0026 Zickgraf, F.-J. 1998,\nA\u0026A, 330, 225\nIllarionov, A. F., \u0026 Sunyaev, R. A. 1975, A\u0026A, 39, 185\nin’t Zand, J. J. M., Bassa, C. G., Jonker, P. G., et al. 2008, A\u0026A, 485, 183\nJenniskens, P., \u0026 Desert, F.-X. 1994, A\u0026AS, 106, 39\nKalberla, P. M. W., Burton, W. B., Hartmann, D., et al. 2005, A\u0026A, 440, 775\nKennea, J. A., Mukai, K., Sokoloski, J. L., et al. 2009, ApJ, 701, 1992\nKrivonos, R., Revnivtsev, M., Churazov, E., et al. 2007, A\u0026A, 463, 957\nKrivonos, R., Tsygankov, S., Lutovinov, A., et al. 2012, A\u0026A, 545, A27\nKrivonos, R. A., Tsygankov, S. S., Lutovinov, A. A., et al. 2015, ApJ, 809,\n140\nLansbury, G. B., Stern, D., Aird, J., et al. 2017, ApJ, 836, 99\nLuna, G. J. M., Sokoloski, J. L., Mukai, K., \u0026 Nelson, T. 2013, A\u0026A, 559,\nA6\nLutovinov, A. A., Revnivtsev, M. G., Tsygankov, S. S., \u0026 Krivonos, R. A.\n2013, MNRAS, 431, 327\nMarshall, D. J., Robin, A. C., Reylé, C., Schultheis, M., \u0026 Picaud, S. 2006,\nA\u0026A, 453, 635\nMineo, S., Gilfanov, M., \u0026 Sunyaev, R. 2012, MNRAS, 419, 2095\nMontes, D., Fernandez-Figueroa, M. J., de Castro, E., \u0026 Sanz-Forcada, J.\n1997, A\u0026AS, 125\nMotch, C., Lopes de Oliveira, R., \u0026 Smith, M. A. 2015, ApJ, 806, 177\nMukai, K., Luna, G. J. M., Cusumano, G., et al. 2016, MNRAS, 461, L1\nMullaney, J. R., Del-Moro, A., Aird, J., et al. 2015, ApJ, 808, 184\nPlotkin, R. M., Gallo, E., \u0026 Jonker, P. G. 2013, ApJ, 773, 59\nPostnov, K., Oskinova, L., \u0026 Torrejón, J. M. 2017, MNRAS, 465, L119\nPretorius, M. L., \u0026 Knigge, C. 2012, MNRAS, 419, 1442\nPrusti, T., de Bruijne, J. H. J., Brown, A. G. A., et al. 2016, A\u0026A, 595, A1\nRahoui, F., Tomsick, J. A., Fornasini, F. M., Bodaghee, A., \u0026 Bauer, F. E.\n2014, A\u0026A, 568, A54\nRauw, G., Nazé, Y., Wright, N. J., et al. 2015, ApJS, 221, 1\nRevnivtsev, M., Sazonov, S., Krivonos, R., Ritter, H., \u0026 Sunyaev, R. 2008,\nA\u0026A, 489, 1121\nRingwald, F. A., Thorstensen, J. R., \u0026 Hamwey, R. M. 1994, MNRAS, 271,\n323\nRiquelme, M. S., Torrejón, J. M., \u0026 Negueruela, I. 2012, A\u0026A, 539, A114\nRitter, H., \u0026 Kolb, U. 2003, A\u0026A, 404, 301\nRosen, S. R., Webb, N. A., Watson, M. G., et al. 2016, A\u0026A, 590, A1\nSazonov, S., Revnivtsev, M., Gilfanov, M., Churazov, E., \u0026 Sunyaev, R.\n2006, A\u0026A, 450, 117\nShrader, C. R., Hamaguchi, K., Sturner, S. J., et al. 2015, ApJ, 799, 84\nStrüder, L., Briel, U., Dennerl, K., et al. 2001, A\u0026A, 365, L18\nSugizaki, M., Mitsuda, K., Kaneda, H., et al. 2001, ApJS, 134, 77\nTsygankov, S. S., Wijnands, R., Lutovinov, A. A., Degenaar, N., \u0026\nPoutanen, J. 2017, arXiv:1703.04634, submitted to MNRAS\nVerbunt, F., Bunk, W. H., Ritter, H., \u0026 Pfeffermann, E. 1997, A\u0026A, 327,\n602\nVerner, D. A., Ferland, G. J., Korista, K. T., \u0026 Yakovlev, D. G. 1996, ApJ,\n465, 487\nVoss, R., \u0026 Ajello, M. 2010, ApJ, 721, 1843\nWalter, R., Lutovinov, A. A., Bozzo, E., \u0026 Tsygankov, S. S. 2015,\nA\u0026A Rev., 23, 2\nWenger, M., Ochsenbein, F., Egret, D., et al. 2000, A\u0026AS, 143, 9\nWilms, J., Allen, A., \u0026 McCray, R. 2000, ApJ, 542, 914\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NASA","grant_number":"GO5-16154X"},{"agency":"NASA","grant_number":"GO6-17135X"},{"agency":"Russian Science Foundation","grant_number":"14-12-01315"},{"agency":"NASA/JPL/Caltech","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Space Radiation Laboratory","NuSTAR"]}