{"title":"Abnormality Detection in Correlated Gaussian Molecular Nano-Networks: Design and Analysis","uri":"","abstract":"A nano-abnormality detection scheme (NADS) in molecular nano-networks is studied. This is motivated by the fact that early detection of diseases such as cancer plays a crucial role in their successful treatment. The proposed NADS is in fact a two-tier network of sensor nano-machines (SNMs) in the first tier and a data-gathering node (DGN) at the sink. The SNMs detect the presence of competitor cells (abnormality) by variations in input and/or parameters of a nano-communications channel. The noise of SNMs as their nature suggest is considered correlated in time and space and herein assumed additive Gaussian. In the second step, the SNMs transmit micro-scale messages over a noisy micro-communications channel (MCC) to the DGN, where a decision is made upon fusing the received signals. We find an optimum design of detectors for each of the NADS tiers based on the end-to-end NADS performance. The detection performance of each SNM is analyzed by setting up a generalized likelihood ratio test. Next, taking into account the effect of the MCC, the overall performance of the NADS is analyzed in terms of probabilities of misdetection and false alarm. In addition, computationally efficient expressions to quantify the NADS performance are derived by providing, respectively, an approximation and an upper bound for the probabilities of misdetection and false alarm. This in turn enables formulating a design problem, where the optimized concentration of SNMs in a sample is obtained for a high probability of detection and a limited probability of false alarm. The results indicate that otherwise ignoring the spatial and temporal correlation of SNM noise in the analysis, leads to an NADS that noticeably underperforms in operations.The results indicate how effective fusion of the noisy observations collected from a number of SNMs with limited capabilities could provide an acceptable detection performance.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252763","docid":252763,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263135","fileid":1263135,"datasetid":"document","objectid":252763,"filename":"07869411.pdf","mime_type":"application/pdf","hash":"7e4193dc82ca26b7400a7a4f6859682d","hash_type":"MD5","filesize":1880055,"mtime":"2017-05-25 17:07:30","url":"http://authors.library.caltech.edu/77751/1/07869411.pdf"}],"eprintid":77751,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"07869411.pdf","content":"published"}],"note":"© 2017 IEEE. \n\nManuscript received November 24, 2015; revised April 25, 2016 and October 30, 2016; accepted January 5, 2017. Date of publication March 2, 2017; date of current version April 27, 2017.","id":77751,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/77/51","datestamp":"2017-05-25 18:18:41","lastmod":"2017-05-25 18:18:41","status_changed":"2017-05-25 18:18:41","type":"article","metadata_visibility":"show","creators":[{"given":"Siavash","family":"Ghavami","id":"Ghavami-S","orcid":""},{"given":"Farshad","family":"Lahouti","id":"Lahouti-F","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Abnormality detection, Molecular communication, mathematical modeling, correlation","date":"2017-04","date_type":"published","publication":"IEEE Transactions on NanoBioscience","volume":"16","number":"3","pagerange":"189-202","id_number":"CaltechAUTHORS:20170525-100726337","refereed":true,"issn":"1536-1241","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170525-100726337","related_url":[{"url":"http://dx.doi.org/10.1109/TNB.2017.2659678","type":"doi","description":"Article"},{"url":"http://ieeexplore.ieee.org/document/7869411","type":"pub","description":"Article"}],"referencetext":["1.  \nA. Jemal, F. Bray, M. M. Center, J. Ferlay, E. Ward, D. Forman, \"Global cancer statistics\", CA A Cancer J. Clinicians, vol. 61, no. 2, pp. 69-90, 2011.\n Show Context CrossRef  Caltech Connect\n2.  \n\"The global economic of cancer report\", Feb. 2017.\n Show Context  Caltech Connect\n3.  \nP. Qiu, Z. J. Wang, K. J. R. Liu, \"Genomic processing for cancer classification and prediction—Abroad review of the recent advances in model-based genomoric and proteomic signal processing for cancer detection\", IEEE Trans. Signal Process., vol. 24, no. 1, pp. 100-110, Jan. 2007.\n Show Context  Caltech Connect\n4.  \nP. Qiu, Z. J. Wang, K. J. R. Liu, \"Cancer nanotechnology: Opportunities and challenges\", Nature Rev. Cancer, vol. 5, no. 1, pp. 161-171, Mar. 2005.\n Show Context  Caltech Connect\n5.  \nM. M.-C. Cheng et al., \"Nanotechnologies for biomolecular detection and medical diagnostics\", Current Opinion Chem. Biol., vol. 10, no. 1, pp. 11-19, Feb. 2006.\n Show Context CrossRef  Caltech Connect\n6.  \nJ. C. Chang et al., \"Gene expression profiling for the prediction of therapeutic response to docetaxel in patients with breast cancer\", Lancet, vol. 362, no. 9381, pp. 362-369, 2003.\n Show Context CrossRef  Caltech Connect\n7.  \nL. J. van ’t Veer et al., \"Gene expression profiling predicts clinical outcome of breast cancer\", Nature, vol. 415, no. 6871, pp. 530-536, 2002.\n Show Context  Caltech Connect\n8.  \nE. Stern et al., \"Label-free biomarker detection from whole blood\", Nature Nanotechnol., vol. 5, no. 2, pp. 138-142, 2010.\n Show Context CrossRef  Caltech Connect\n9.  \nG. Peng et al., \"Detection of lung breast colorectal and prostate cancers from exhaled breath using a single array of nanosensors\", Brit. J. Cancer, vol. 103, no. 4, pp. 542-551, 2010.\n Show Context CrossRef  Caltech Connect\n10.  \nM. J. Gunter et al., \"Insulin insulin-like growth factor-i and risk of breast cancer in postmenopausal women\", J. Nat. Cancer Inst., vol. 101, no. 1, pp. 48-60, 2009.\n Show Context CrossRef  Caltech Connect\n11.  \nC. Danelon, M. Lindemann, C. Borin, D. Fournier, M. Winterhalter, \"Channel-forming membrane proteins as molecular sensors\", IEEE Trans. Nanobiosci., vol. 3, no. 1, pp. 46-48, Mar. 2004.\n Quick Abstract  Show Context View Article Full Text: PDF\t(169KB)\n12.  \nA. SalmanOgli, A. Rostami, M. Abasi, \"Design and simulation of nano-bio sensors for dye molecules targeting to enhance targeting efficiency (smart targeting)\", IEEE Trans. Nanobiosci., vol. 12, no. 1, pp. 21-28, Mar. 2013.\n Quick Abstract  Show Context View Article Full Text: PDF\t(1323KB)\n13.  \nS. Sanga et al., \"Mathematical modeling of cancer progression and response to chemotherapy\", Expert Rev. Anticancer Therapy, vol. 6, no. 10, pp. 1361-1376, 2006.\n Show Context CrossRef  Caltech Connect\n14.  \nV. Cristini, J. Lowengrub, Q. Nie, \"Journal of mathematical biology\", IEEE Signal Proc. Mag., vol. 46, no. 3, pp. 191-224, Mar. 2003.\n Show Context  Caltech Connect\n15.  \nB. Atakan, O. Akan, \"An information theoretical approach for molecular communication\", Proc. 2nd Bio-Inspired Models Netw. Inf. Comput. Syst. Bionetics, pp. 33-40, Dec. 2007.\n Quick Abstract  Show Context View Article Full Text: PDF\t(347KB)\n16.  \nB. Atakan, O. Akan, \"On channel capacity and error compensation in molecular communication\" in Transactions on Computational Systems Biology, Berlin, Germany:Springer-Verlag, vol. 10, pp. 59-80, 2008.\n Show Context CrossRef  Caltech Connect\n17.  \nM. Pierobon, I. F. Akyildiz, \"Diffusion-based noise analysis for molecular communication in nanonetworks\", IEEE Trans. Signal Process., vol. 59, no. 6, pp. 2532-2547, Jun. 2011.\n Quick Abstract  Show Context View Article Full Text: PDF\t(2093KB)\n18.  \nY. Savir, T. Tlusty, \"Optimal design of a molecular recognizer: Molecular recognition as a Bayesian signal detection problem\", IEEE J. Sel. Topics Signal Process., vol. 2, no. 3, pp. 390-399, Jun. 2008.\n Quick Abstract  Show Context View Article Full Text: PDF\t(600KB)\n19.  \nT. Nakano, T. Suda, Y. Okaie, M. J. Moore, A. V. Vasilakos, \"Molecular communication among biological nanomachines: A layered architecture and research issues\", IEEE Trans. Nanobiosci., vol. 13, no. 3, pp. 169-197, Sep. 2014.\n Quick Abstract  Show Context View Article Full Text: PDF\t(1610KB)\n20.  \nI. F. Akyildiz, J. M. Jornet, \"The Internet of nano-things\", IEEE Wireless Commun., vol. 17, no. 6, pp. 58-63, Dec. 2010.\n Quick Abstract  Show Context View Article Full Text: PDF\t(718KB)\n21.  \nS. Ghavami, F. Lahouti, A. Masoudi-Nejad, \"Modeling and analysis of abnormality detection in biomolecular nano-networks\", Nano Commun. Netw., vol. 3, no. 4, pp. 229-241, Dec. 2012.\n Show Context CrossRef  Caltech Connect\n22.  \nX. Wu et al., \"Immunofluorescent labeling of cancer marker Her2 and other cellular targets with semiconductor quantum dots\", Nature Biotechnol., vol. 21, no. 1, pp. 41-46, 2003.\n Show Context CrossRef  Caltech Connect\n23.  \nJ. K. Jaiswal, H. Mattoussi, J. M. Mauro, S. M. Simon, \"Long-term multiple color imaging of live cells using quantum dot bioconjugates\", Nature Biotechnol., vol. 21, pp. 47-51, Dec. 2002.\n Show Context CrossRef  Caltech Connect\n24.  \nX. Huang et al., \"A reexamination of active and passive tumor targeting by using rod-shaped gold nanocrystals and covalently conjugated peptide ligands\", ACS Nano, vol. 4, no. 10, pp. 5887-5896, 2010.\n Show Context CrossRef  Caltech Connect\n25.  \nR. Lévy, U. Shaheen, Y. Cesbron, V. Sée, \"Gold nanoparticles delivery in mammalian live cells: A critical review\", Nano Rev., pp. 1-18, Feb. 2010.\n Show Context CrossRef  Caltech Connect\n26.  \nE. A. Neuwelt, P. Varallyay, A. G. Bago, L. L. Muldoon, G. Nesbit, R. Nixon, \"Imaging of iron oxide nanoparticles by MR and light microscopy in patients with malignant brain tumours\", Neuropathol. Appl. Neurobiol., vol. 30, no. 5, pp. 456-471, 2004.\nCrossRef  Caltech Connect\n27.  \nF. K. Moritz et al., \"A multimodal nanoparticle for preoperative magnetic resonance imaging and intraoperative optical brain tumor delineation\", J. Cancer Res., vol. 63, no. 12, pp. 8122-8125, 2003.\n Caltech Connect\n28.  \nM. O. Oyewumi, R. A. Yokel, M. Jay, T. Coakley, R. J. Mumper, \"Comparison of cell uptake biodistribution and tumor retention of folate-coated and PEG-coated gadolinium nanoparticles in tumor-bearing mice\", J. Controlled Release, vol. 95, no. 3, pp. 613-626, Mar. 2004.\nCrossRef  Caltech Connect\n29.  \nL. Levy, Y. Sahoo, K.-S. Kim, E. J. Bergey, P. N. Prasad, \"Nanochemistry: Synthesis and characterization of multifunctional nanoclinics for biological applications\", Chem. Mater., vol. 14, no. 9, pp. 3715-3721, 2002.\nCrossRef  Caltech Connect\n30.  \nE. Bergey et al., \" DC magnetic field induced magnetocytolysis of cancer cells targeted by LH-RH magnetic nanoparticles in vitro \", Biomed. Microdevices, vol. 4, no. 4, pp. 293-299, Dec. 2002.\nCrossRef  Caltech Connect\n31.  \nE. A. Schellenberger, A. Bogdanov, D. Högemann, J. Tait, R. Weissleder, L. Josephson, \"Annexin V—CLIO: A nanoparticle for detecting apoptosis by MRI\", J. Mol. Imag., vol. 1, no. 2, pp. 102-107, 2002.\n Show Context CrossRef  Caltech Connect\n32.  \nF. Yan et al., \"Synthesis and characterization of silica-embedded iron oxide nanoparticles for magnetic resonance imaging\", J. Nanosci. Nanotechnol., vol. 4, no. 1, pp. 72-76, 2004.\nCrossRef  Caltech Connect\n33.  \nA. P. Alivisatos, \"Semiconductor clusters nanocrystals and quantum dots\", Science, vol. 271, no. 5251, pp. 933-937, 1996.\nCrossRef  Caltech Connect\n34.  \nW. C. W Chan, D. J. Maxwell, X. Gao, R. E. Bailey, M. Han, S. Nie, \"Luminescent quantum dots for multiplexed biological detection and imaging\", Current Opinion Biotechnol., vol. 13, no. 1, pp. 40-46, Feb. 2002.\nCrossRef  Caltech Connect\n35.  \nA. M. Derfus, W. C. W. Chan, S. N. Bhatia, \"Probing the cytotoxicity of semiconductor quantum dots\", Nano Lett., vol. 4, no. 1, pp. 11-18, 2004.\nCrossRef  Caltech Connect\n36.  \nE. B. Voura, J. K. Jaiswal, H. Mattoussi, S. M. Simon1, \"Tracking metastatic tumor cell extravasation with quantum dot nanocrystals and fluorescence emission-scanning microscopy\", Nature Med., vol. 10, no. 9, pp. 993-998, 2004.\nCrossRef  Caltech Connect\n37.  \nY. Cui, Q. Wei, H. Park, C. M. Lieber, \"Nanowire nanosensors for highly sensitive and selective detection of biological and chemical species\", Science, vol. 293, no. 5533, pp. 1289-1292, Aug. 2001.\nCrossRef  Caltech Connect\n38.  \nJ. R. Heath, \"Nanosystems biology and cancer\", Abstracts Papers Amer. Chem. Soc., vol. 230, p. U187, Aug. 2005.\n Caltech Connect\n39.  \nR. J. Chen et al., \"Noncovalent functionalization of carbon nanotubes for highly specific electronic biosensors\", Proc. Nat. Acad. Sci. USA, vol. 100, no. 9, pp. 4984-4989, 2003.\nCrossRef  Caltech Connect\n40.  \nA. T. Woolley, C. Guillemette, L. C. Chin, D. E. Housman, C. M. Lieber, \"Direct haplotyping of kilobase-size DNA using carbon nanotube probes\", Nature Biotechnol., vol. 18, no. 7, pp. 760-763, 2000.\nCrossRef  Caltech Connect\n41.  \nR. Duncan, \"The dawning era of polymer therapeutics\", Nature Rev. Drug Discovery, vol. 2, no. 5, pp. 347-360, 2003.\nCrossRef  Caltech Connect\n42.  \nA. H. Nashat, M. Moronne, M. Ferrari, \"Detection of functional groups and antibodies on microfabricated surfaces by confocal microscopy\", Biotechnol. Bioeng., vol. 60, no. 2, pp. 137-146, Oct. 1998.\nCrossRef  Caltech Connect\n43.  \nS. Santra, P. Zhang, K. Wang, R. Tapec, W. Tan, \"Conjugation of biomolecules with luminophore-doped silica nanoparticles for photostable biomarkers\", Anal. Chem., vol. 73, no. 20, pp. 4988-4993, 2001.\nCrossRef  Caltech Connect\n44.  \nX. Zhao, R. Tapec-Dytioco, W. Tan, \"Ultrasensitive DNA detection using highly fluorescent bioconjugated nanoparticles\", J. Amer. Chem. Soc., vol. 125, no. 38, pp. 11474-11475, 2003.\nCrossRef  Caltech Connect\n45.  \nF. Wang, L. Liu, W. J. Li, \"Graphene-based glucose sensors: A brief review\", IEEE Trans. Nanobiosci., vol. 14, no. 8, pp. 818-834, Dec. 2015.\n Quick Abstract  Show Context View Article Full Text: PDF\t(2221KB)\n46.  \nE. Zarepour, N. Hassan, M. Hassan, C. T. Chou, M. E. Warkiani, \"Design and analysis of a wireless nanosensor network for monitoring human lung cells\", Proc. 10th EAI Int. Conf. Body Area Netw, pp. 139-145, Sep. 2015.\n Show Context CrossRef  Caltech Connect\n47.  \nM. S. Mannoor et al., \"Graphene-based wireless bacteria detection on tooth enamel\", Nature Commun., vol. 3, Mar. 2012.\n Show Context CrossRef  Caltech Connect\n48.  \nI. F. Akyildiz, M. Pierobon, S. Balasubramaniam, Y. Koucheryavy, \"The Internet of bio-nano things\", IEEE Commun. Mag., vol. 53, no. 3, pp. 32-40, Mar. 2015.\n Quick Abstract  Show Context View Article Full Text: PDF\t(1599KB)\n49.  \nI. F. Akyildiz, F. Brunetti, C. Blázquez, \"Nanonetworks: A new communication paradigm\", Comput. Netw., vol. 52, no. 12, pp. 2260-2279, Aug. 2008.\n Show Context CrossRef  Caltech Connect\n50.  \nG. E. Santagati, T. Melodia, L. Galluccio, S. Palazzo, \"Ultrasonic networking for E-health applications\", IEEE Wireless Commun., vol. 20, no. 4, pp. 74-81, Aug. 2013.\n Quick Abstract  Show Context View Article Full Text: PDF\t(217KB)\n51.  \nG. E. Santagati, T. Melodia, L. Galluccio, S. Palazzo, \"Medium access control and rate adaptation for ultrasonic intrabody sensor networks\", IEEE/ACM Trans. Netw., vol. 23, no. 4, pp. 1121-1134, Aug. 2015.\n Quick Abstract  Show Context View Article Full Text: PDF\t(1829KB)\n52.  \nH. Guo, P. Johari, J. M. Jornet, Z. Sun, \"Intra-body optical channel modeling for in vivo wireless nanosensor networks\", IEEE Trans. Nanobiosci., vol. 15, no. 1, pp. 41-52, Jan. 2016.\n Quick Abstract  Show Context View Article Full Text: PDF\t(3241KB)\n53.  \nJ. M. Jornet, I. F. Akyildiz, \"Channel modeling and capacity analysis for electromagnetic wireless nanonetworks in the terahertz band\", IEEE Trans. Wireless Commun., vol. 10, no. 10, pp. 3211-3221, Oct. 2011.\n Quick Abstract  Show Context View Article Full Text: PDF\t(391KB)\n54.  \nG. Tkaćik, A. M. Walczak, W. Bialek, \"Optimizing information flow in small genetic networks. III. A self-interacting gene\", Phys. Rev. E Stat. Phys. Plasmas Fluids Relat. Interdiscip. Top., vol. 85, pp. 041903, Apr. 2012.\n Show Context  Caltech Connect\n55.  \nG. Tkaćik, A. M. Walczak, W. Bialek, \"Optimizing information flow in small genetic networks\", Phys. Rev. E Stat. Phys. Plasmas Fluids Relat. Interdiscip. Top., vol. 80, no. 3, pp. 031920, Sep. 2009.\n Show Context  Caltech Connect\n56.  \nA. M. Walczak, G. Tkačik, W. Bialek, \"Optimizing information flow in small genetic networks. II. Feed-forward interactions\", Phys. Rev. E Stat. Phys. Plasmas Fluids Relat. Interdiscip. Top., vol. 81, no. 4, pp. 041905, Apr. 2010.\n Show Context CrossRef  Caltech Connect\n57.  \nF. Tostevin, P. R. ten Wolde, \"Mutual information in time-varying biochemical systems\", Phys. Rev. E Stat. Phys. Plasmas Fluids Relat. Interdiscip. Top., vol. 81, no. 6, pp. 061917, Jun. 2010.\n Show Context CrossRef  Caltech Connect\n58.  \n\"IEEE Recommended Practice for Nanoscale and Molecular Communication Framework, IEEE Standard 1906.1-2015\", pp. 1-64, Jan. 2016.\n Show Context  Caltech Connect\n59.  \nV. Krivan, P. Lánský, J. P. Rospars, \"Coding of periodic pulse stimulation in chemoreceptors\", Biosystems, vol. 67, no. 1, pp. 121-128, 2002.\n Show Context CrossRef  Caltech Connect\n60.  \nM. J. Saxton, \"Anomalous diffusion due to binding: A Monte Carlo study\", Biophys. J., vol. 70, no. 3, pp. 1250-1262, 1996.\n Show Context CrossRef  Caltech Connect\n61.  \nC. J. Camacho, S. R. Kimura, C. DeLisi, S. Vajda, \"Kinetics of desolvation-mediated protein–protein binding\", Biophys. J., vol. 78, no. 3, pp. 1094-1105, Mar. 2000.\n Show Context CrossRef  Caltech Connect\n62.  \nB. Li, M. G. Genton, M. Sherman, \"Testing the covariance structure of multivariate random fields\", Biometrika, vol. 95, no. 4, pp. 813-829, 2008.\n Show Context CrossRef  Caltech Connect\n63.  \nH. Wackernagel, Multivariate Geostatistics: An Introduction With Applications, Berlin, Germany:Springer-Verlag, 2003.\n Show Context CrossRef  Caltech Connect\n64.  \nM. J. Moore, T. Suda, K. Oiwa, \"Molecular communication: Modeling noise effects on information rate\", IEEE Trans. Nanobiosci., vol. 8, no. 2, pp. 169-180, Jun. 2009.\n Quick Abstract  Show Context View Article Full Text: PDF\t(330KB)\n65.  \nM. Pierobon, I. F. Akyildiz, \"Noise analysis in ligand-binding reception for molecular communication in nanonetworks\", IEEE Trans. Signal Process., vol. 59, no. 9, pp. 4168-4182, Sep. 2011.\n Quick Abstract  Show Context View Article Full Text: PDF\t(1583KB)\n66.  \nM. U. Mahfuz, D. Makrakis, H. T. Mouftah, \"A comprehensive study of sampling-based optimum signal detection in concentration-encoded molecular communication\", IEEE Trans. Nanobiosci., vol. 13, no. 3, pp. 208-222, Sep. 2014.\n Quick Abstract  Show Context View Article Full Text: PDF\t(3343KB)\n67.  \nM. U. Mahfuz, D. Makrakis, H. T. Mouftah, \"Strength-based optimum signal detection in concentration-encoded pulse-transmitted OOK molecular communication with stochastic ligand-receptor binding\", Simul. Model. Pract. Theory, vol. 42, pp. 189-209, Mar. 2014.\n Show Context CrossRef  Caltech Connect\n68.  \nS. Ghavami, R. S. Adve, F. Lahouti, \"Information rates of ASK-based molecular communication in fluid media\", IEEE Trans. Mol. Biol. Multi-Scale Commun., vol. 1, no. 3, pp. 277-291, Sep. 2015.\n Quick Abstract  Show Context View Article Full Text: PDF\t(941KB)\n69.  \nM. S. Kuran, H. B. Yilmaz, T. Tugcu, B. Özerman, \"Energy model for communication via diffusion in nanonetworks\", Nano Commun. Netw., vol. 1, no. 2, pp. 86-95, Jun. 2010.\n Show Context CrossRef  Caltech Connect\n70.  \nD. Kilinc, O. B. Akan, \"Receiver design for molecular communication\", IEEE J. Sel. Areas Commun., vol. 31, no. 12, pp. 705-714, Dec. 2013.\n Quick Abstract  Show Context View Article Full Text: PDF\t(1045KB)\n71.  \nA. Noel, K. C. Cheung, R. Schober, \"Improving receiver performance of diffusive molecular communication with enzymes\", IEEE Trans. Nanobiosci., vol. 13, no. 1, pp. 31-43, Mar. 2014.\n Quick Abstract  Show Context View Article Full Text: PDF\t(1924KB)\n72.  \nH. B. Yilmaz, C.-B. Chae, B. Tepekule, A. E. Pusane, \"Arrival modeling and error analysis for molecular communication via diffusion with drift\", Proc. 2nd Annu. Int. Conf. Nanosc. Comput. Commun. (NANOCOM), pp. 26:1-26:6, Sep. 2015.\n Show Context  Caltech Connect Access at ACM\n73.  \nH. V. Poor, An Introduction to Signal Detection and Estimation, New York, NY, USA:Springer-Verlag, 1994.\n Show Context CrossRef  Caltech Connect\n74.  \nP. K. Varshney, C. S. Burrus, C. Sidney, Distributed Detection and Data Fusion (Signal Processing and Data Fusion), New York, NY, USA:Springer, 1997."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"S. Ghavami and F. Lahouti, \"Abnormality Detection in Correlated Gaussian Molecular Nano-Networks: Design and Analysis,\" in IEEE Transactions on NanoBioscience, vol. 16, no. 3, pp. 189-202, April 2017.\ndoi: 10.1109/TNB.2017.2659678\nURL: http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=\u0026arnumber=7869411\u0026isnumber=7913738","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}