{"title":"The SAMI Galaxy Survey: the cluster redshift survey, target selection and cluster properties","uri":"","abstract":"We describe the selection of galaxies targeted in eight low-redshift clusters (APMCC0917, A168, A4038, EDCC442, A3880, A2399, A119 and A85; 0.029 \u003c z \u003c 0.058) as part of the Sydney-AAO Multi-Object Integral field spectrograph Galaxy Survey (SAMI-GS). We have conducted a redshift survey of these clusters using the AAOmega multi-object spectrograph on the 3.9-m Anglo-Australian Telescope. The redshift survey is used to determine cluster membership and to characterize the dynamical properties of the clusters. In combination with existing data, the survey resulted in 21 257 reliable redshift measurements and 2899 confirmed cluster member galaxies. Our redshift catalogue has a high spectroscopic completeness (∼94 per cent) for rpetro ≤ 19.4 and cluster-centric distances R \u003c 2R200. We use the confirmed cluster member positions and redshifts to determine cluster velocity dispersion, R200, virial and caustic masses, as well as cluster structure. The clusters have virial masses 14.25 ≤ log(M200/M_⊙) ≤ 15.19. The cluster sample exhibits a range of dynamical states, from relatively relaxed-appearing systems, to clusters with strong indications of merger-related substructure. Aperture- and point spread function matched photometry are derived from Sloan Digital Sky Survey and VLT Survey Telescope/ATLAS imaging and used to estimate stellar masses. These estimates, in combination with the redshifts, are used to define the input target catalogue for the cluster portion of the SAMI-GS. The primary SAMI-GS cluster targets have R \u003cR200, velocities |vpec| \u003c 3.5σ200 and stellar masses 9.5 ≤ log(M^∗_(approx)/M_⊙) ≤ 12. Finally, we give an update on the SAMI-GS progress for the cluster regions.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252785","docid":252785,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263456","fileid":1263456,"datasetid":"document","objectid":252785,"filename":"stx562.pdf","mime_type":"application/pdf","hash":"3e8ead365ead21d6c396478beac250f1","hash_type":"MD5","filesize":8046430,"mtime":"2017-05-25 21:36:25","url":"http://authors.library.caltech.edu/77767/1/stx562.pdf"}],"eprintid":77767,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"stx562.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252787","docid":252787,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263474","fileid":1263474,"datasetid":"document","objectid":252787,"filename":"1703.00997.pdf","mime_type":"application/pdf","hash":"59454b3383d29e75a9e6edcaba0bd539","hash_type":"MD5","filesize":6437737,"mtime":"2017-05-25 21:49:35","url":"http://authors.library.caltech.edu/77767/2/1703.00997.pdf"}],"eprintid":77767,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1703.00997.pdf","content":"supplemental"}],"note":"© 2017 The Authors. Published by Oxford University Press on behalf of the Royal Astronomical Society \n\nAccepted 2017 March 2. Received 2017 February 28; in original form 2016 December 12. \n\nWe thank Chris Lidman for useful discussions on reducing the AAOmega data. MSO, SB and SMC acknowledge the funding support from the Australian Research Council through a Future Fellowship (FT140100255, FT140101166, FT100100457, respectively). JTA acknowledges the award of a SIEF John Stocker Fellowship. GVK, JPM, JdJ, GS, KK and EMH acknowledge financial support from the Netherlands Research School for Astronomy (NOVA) and Target. Target is supported by Samenwerkingsverband Noord Nederland, European fund for regional development, Dutch Ministry of economic affairs, Pieken in de Delta, Provinces of Groningen and Drenthe. JdJ and EH are supported by NWO grant 614.061.610. This work was supported by the UK Science and Technology Facilities Council through the ‘Astrophysics at Oxford’ grant ST/K00106X/1. RLD acknowledges travel and computer grants from Christ Church, Oxford, and support from the Oxford Centre for Astrophysical Surveys which is funded by the Hintze Family Charitable Foundation. Support for AMM is provided by NASA through Hubble Fellowship grant #HST-HF2-51377 awarded by the Space Telescope Science Institute, which is operated by the Association of Universities for Research in Astronomy, Inc., for NASA, under contract NAS5-26555. NS acknowledges support of a University of Sydney Postdoctoral Research Fellowship. \n\nThe SAMI Galaxy Survey is based on observations made at the Anglo-Australian Telescope. The Sydney-AAO Multi-object Integral field spectrograph (SAMI) was developed jointly by the University of Sydney and the Australian Astronomical Observatory. The SAMI input catalogue is based on the data taken from the Sloan Digital Sky Survey, the GAMA Survey and the VST ATLAS Survey. The SAMI Galaxy Survey is funded by the Australian Research Council Centre of Excellence for All-sky Astrophysics (CAASTRO), through project number CE110001020, and other participating institutions. The SAMI Galaxy Survey website is http://sami-survey.org/. \n\nGAMA is a joint European–Australasian project based around a spectroscopic campaign using the Anglo-Australian Telescope. The GAMA input catalogue is based on the data taken from the Sloan Digital Sky Survey and the UKIRT Infrared Deep Sky Survey. Complementary imaging of the GAMA regions is being obtained by a number of independent survey programmes including GALEX MIS, VST KiDS, VISTA VIKING, WISE, Herschel-ATLAS, GMRT and ASKAP providing UV to radio coverage. GAMA is funded by the STFC (UK), the ARC (Australia), the AAO and the participating institutions. The GAMA website is http://www.gama-survey.org/. \n\nFunding for SDSS-III has been provided by the Alfred P. Sloan Foundation, the Participating Institutions, the National Science Foundation and the U.S. Department of Energy Office of Science. The SDSS-III web site is http://www.sdss3.org/. SDSS-III is managed by the Astrophysical Research Consortium for the Participating Institutions of the SDSS-III Collaboration including the University of Arizona, the Brazilian Participation Group, Brookhaven National Laboratory, Carnegie Mellon University, University of Florida, the French Participation Group, the German Participation Group, Harvard University, the Instituto de Astrofisica de Canarias, the Michigan State/Notre Dame/JINA Participation Group, Johns Hopkins University, Lawrence Berkeley National Laboratory, Max Planck Institute for Astrophysics, Max Planck Institute for Extraterrestrial Physics, New Mexico State University, New York University, Ohio State University, Pennsylvania State University, University of Portsmouth, Princeton University, the Spanish Participation Group, University of Tokyo, University of Utah, Vanderbilt University, University of Virginia, University of Washington, and Yale University. Based on data products (VST/ATLAS) from observations made with ESO Telescopes at the La Silla Paranal Observatory under programme ID 177.A-3011(A-J). This research has made use of the APASS data base, located at the AAVSO web site. Funding for APASS has been provided by the Robert Martin Ayers Sciences Fund.","id":77767,"rev_number":12,"userid":772,"eprint_dir":"disk0/00/07/77/67","datestamp":"2017-05-25 22:20:32","lastmod":"2017-05-25 22:20:32","status_changed":"2017-05-25 22:20:32","type":"article","metadata_visibility":"show","creators":[{"given":"M. S.","family":"Owers","id":"Owers-M-S","orcid":""},{"given":"A. M.","family":"Medling","id":"Medling-A-M","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"surveys, galaxies: clusters: individual: (APMCC0917, A168, A4038, EDCC442, A3880, A2399, A119, A85)","date":"2017-06","date_type":"published","publication":"Monthly Notices of the Royal Astronomical Society","volume":"468","number":"2","pagerange":"1824-1849","id_number":"CaltechAUTHORS:20170525-143605448","refereed":true,"issn":"0035-8711","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170525-143605448","related_url":[{"url":"https://doi.org/10.1093/mnras/stx562","type":"doi","description":"Article"},{"url":"https://academic.oup.com/mnras/article/468/2/1824/3063895/The-SAMI-Galaxy-Survey-the-cluster-redshift-survey","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1703.00997","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Ahn C. P. et al., 2012, ApJS, 203, 21\nAllen J. T. et al., 2015, MNRAS, 446, 1567\nBaldry I. K., Balogh M. L., Bower R. G., Glazebrook K., Nichol R. C.,\nBamford S. P., Budavari T., 2006, MNRAS, 373, 469\nBaldry I. K. et al., 2014, MNRAS, 441, 2440\nBeers T. C., Flynn K., Gebhardt K., 1990, AJ, 100, 32\nBekki K., 1999, ApJ, 510, L15\nBekki K., 2014, MNRAS, 438, 444\nBekki K., Couch W. J., Shioya Y., 2002, ApJ, 577, 651\nBell E. F., McIntosh D. H., Katz N., Weinberg M. D., 2003, ApJS, 149,\n289\nBertin E., 2010, Astrophysics Source Code Library, record ascl:1010.068\nBertin E., Arnouts S., 1996, A\u0026AS, 117, 393\nBertin E., Arnouts S., 2010, Astrophysics Source Code Library, record\nascl:1010.064\nBertin E., Mellier Y., Radovich M., Missonnier G., Didelon P., Morin B.,\n2002, in Bohlender D. A., Durand D., Handley T. H., eds, ASP Conf.\nSer. Vol. 281, Astronomical Data Analysis Software and Systems XI.\nAstron. Soc. Pac., San Francisco, p. 228\nBland-Hawthorn J. et al., 2011, Opt. Express, 19, 2649\nB¨ohringer H. et al., 2007, A\u0026A, 469, 363\nBolton A. S. et al., 2012, AJ, 144, 144\nBoselli A., Gavazzi G., 2006, PASP, 118, 517\nBou´e G., Durret F., Adami C., Mamon G. A., Ilbert O., Cayatte V., 2008,\nA\u0026A, 489, 11\nBravo-Alfaro H., Caretta C. A., Lobo C., Durret F., Scott T., 2009, A\u0026A,\n495, 379\nBrinchmann J., Charlot S., White S. D. M., Tremonti C., Kauffmann G.,\nHeckman T., Brinkmann J., 2004, MNRAS, 351, 1151\nBrough S. et al., 2013, MNRAS, 435, 2903\nBryant J. J., Bland-Hawthorn J., Fogarty L. M. R., Lawrence J. S., Croom\nS. M., 2014, MNRAS, 438, 869\nBryant J. J. et al., 2015, MNRAS, 447, 2857\nByrd G., Valtonen M., 1990, ApJ, 350, 89\nCarlberg R. G., Yee H. K. C., Ellingson E., 1997, ApJ, 478, 462\nCava A. et al., 2009, A\u0026A, 495, 707\nChilingarian I. V., Melchior A.-L., Zolotukhin I. Y., 2010, MNRAS, 405,\n1409\nColless M., Dunn A. M., 1996, ApJ, 458, 435\nColless M. et al., 2001, MNRAS, 328, 1039\nCovey K. R. et al., 2007, AJ, 134, 2398\nCroom S. M. et al., 2012, MNRAS, 421, 872\nCroton D. J. et al., 2005, MNRAS, 356, 1155\nde Jong J. T. A. et al., 2015, A\u0026A, 582, A62\nDe Propris R. et al., 2002, MNRAS, 329, 87\nden Hartog R., Katgert P., 1996, MNRAS, 279, 349\nDiaferio A., 1999, MNRAS, 309, 610\nDressler A., Shectman S. A., 1988, AJ, 95, 985\nDriver S. P. et al., 2009, Astron. Geophys., 50, e12\nDriver S. P. et al., 2011, MNRAS, 413, 971\nDriver S. P. et al., 2016, MNRAS, 455, 3911\nDurret F., Felenbok P., Lobo C., Slezak E., 1998, A\u0026AS, 129, 281\nDurret F., Lima Neto G. B., Forman W., 2005, A\u0026A, 432, 809\nEvrard A. E. et al., 2008, ApJ, 672, 122\nFadda D., GirardiM., Giuricin G., Mardirossian F., Mezzetti M., 1996, ApJ,\n473, 670\nFogarty L. M. R. et al., 2014, MNRAS, 443, 485\nGeller M. J., Beers T. C., 1982, PASP, 94, 421\nGifford D., Miller C. J., 2013, ApJ, 768, L32\nGifford D., Miller C., Kern N., 2013, ApJ, 773, 116\nGirardi M., Giuricin G., Mardirossian F., Mezzetti M., Boschin W., 1998,\nApJ, 505, 74\nGullieuszik M. et al., 2015, A\u0026A, 581, A41\nGunn J. E., Gott J. R. I., 1972, ApJ, 176, 1\nHallman E. J., Markevitch M., 2004, ApJ, 610, L81\nHill D. T. et al., 2011, MNRAS, 412, 765\nHopkins A. M. et al., 2013, MNRAS, 430, 2047\nHowell S. B., 1989, PASP, 101, 616\nIchinohe Y., Werner N., Simionescu A., Allen S. W., Canning R. E. A.,\nEhlert S., Mernier F., Takahashi T., 2015, MNRAS, 448, 2971\nJiang L., Helly J. C., Cole S., Frenk C. S., 2014, MNRAS, 440, 2115\nJones D. H. et al., 2009, MNRAS, 399, 683\nKatgert P. et al., 1996, A\u0026A, 310, 8\nKauffmann G. et al., 2003a, MNRAS, 341, 54\nKauffmann G. et al., 2003b, MNRAS, 346, 1055\nKempner J. C., Sarazin C. L., Ricker P. M., 2002, ApJ, 579, 236\nKriessler J. R., Beers T. C., 1997, AJ, 113, 80\nLarson R. B., Tinsley B. M., Caldwell C. N., 1980, ApJ, 237, 692\nLewis I. et al., 2002, MNRAS, 334, 673\nLiske J. et al., 2015, MNRAS, 452, 2087\nMcFarland J. P., Verdoes-Kleijn G., Sikkema G., Helmich E. M., Boxhoorn\nD. R., Valentijn E. A., 2013, Exp. Astro., 35, 45\nMcGee S. L., Balogh M. L., Bower R. G., Font A. S., McCarthy I. G., 2009,\nMNRAS, 400, 937\nMamon G. A., Biviano A., Bou´e G., 2013, MNRAS, 429, 3079\nMerluzzi P. et al., 2013, MNRAS, 429, 1747\nMiszalski B., Shortridge K., SaundersW., Parker Q. A., Croom S. M., 2006,\nMNRAS, 371, 1537\nMoore B., Katz N., Lake G., Dressler A., Oemler A., 1996, Nature, 379,\n613\nMurray S. G., Power C., Robotham A. S. G., 2013, Astron. Comput., 3,\n23\nNascimento R. S., Ribeiro A. L. B., Trevisan M., Carrasco E. R., Plana H.,\nDupke R., 2016, MNRAS, 460, 2193\nNorberg P. et al., 2002, MNRAS, 336, 907\nNulsen P. E. J., 1982, MNRAS, 198, 1007\nOld L. et al., 2014, MNRAS, 441, 1513\nOld L. et al., 2015, MNRAS, 449, 1897\nOwers M. S., Nulsen P. E. J., Couch W. J., Markevitch M., Poole G. B.,\n2009a, ApJ, 692, 702\nOwers M. S., Couch W. J., Nulsen P. E. J., 2009b, ApJ, 693, 901\nOwers M. S., Randall S. W., Nulsen P. E. J., Couch W. J., David L. P.,\nKempner J. C., 2011a, ApJ, 728, 27\nOwers M. S., Nulsen P. E. J., Couch W. J., 2011b, ApJ, 741, 122\nOwers M. S. et al., 2013, ApJ, 772, 104\nOwers M. S. et al., 2014, ApJ, 780, 163\nPeng Y.-j. et al., 2010, ApJ, 721, 193\nPinkney J., Roettiger K., Burns J. O., Bird C. M., 1996, ApJS, 104, 1\nPisani A., 1996, MNRAS, 278, 697\nPopesso P., B¨ohringer H., Romaniello M., Voges W., 2005, A\u0026A, 433,\n415\nPracy M. B., Owers M. S., Couch W. J., Kuntschner H., Bekki K., Briggs\nF., Lah P., Zwaan M., 2012, MNRAS, 420, 2232\nRamella M. et al., 2007, A\u0026A, 470, 39\nRines K., Diaferio A., 2006, AJ, 132, 1275\nRines K., Geller M. J., Kurtz M. J., Diaferio A., 2003, AJ, 126, 2152\nRobotham A. et al., 2010, PASA, 27, 76\nRobotham A. S. G. et al., 2011, MNRAS, 416, 2640\nSaunders W. et al., 2004, in Moorwood A. F. M., Iye M., eds, Proc. SPIE\nConf. Ser. Vol. 5492, Ground-based Instrumentation for Astronomy.\nSPIE, Bellingham, p. 389\nSchaefer A. L. et al., 2017, MNRAS, 464, 121\nSchlegel D. J., Finkbeiner D. P., Davis M., 1998, ApJ, 500, 525\nSerra A. L., Diaferio A., 2013, ApJ, 768, 116\nSerra A. L., Diaferio A., Murante G., Borgani S., 2011, MNRAS, 412, 800\nShanks T. et al., 2013, The Messenger, 154, 38\nShanks T. et al., 2015, MNRAS, 451, 4238\nSharp R., Birchall M. N., 2010, PASA, 27, 91\nSharp R., Parkinson H., 2010, MNRAS, 408, 2495\nSharp R. et al., 2006, in McLean I. S., Iye M., eds, Proc. SPIE Conf. Ser.\nVol. 6269, Ground-based and Airborne Instrumentation for Astronomy.\nSPIE, Bellingham, p. 62690G\nSilverman B. W., 1986, Monographs on Statistics and Applied Probability.\nChapman and Hall, London\nSmith G. A. et al., 2004, in Moorwood A. F. M., Iye M., eds, Proc. SPIE\nConf. Ser. Vol. 5492, Ground-based Instrumentation for Astronomy.\nSPIE, Bellingham, p. 410\nStoughton C. et al., 2002, AJ, 123, 485\nSvensmark J., Wojtak R., Hansen S. H., 2015, MNRAS, 448, 1644\nTaylor E. N. et al., 2011, MNRAS, 418, 1587\nTaylor E. N. et al., 2015, MNRAS, 446, 2144\nTremonti C. A. et al., 2004, ApJ, 613, 898\nvan Haarlem M. P., Frenk C. S., White S. D. M., 1997, MNRAS, 287, 817\nWojtak R., Łokas E. L., 2007, MNRAS, 377, 843\nWojtak R., Łokas E. L., Mamon G. A., Gottl¨ober S., Prada F., Moles M.,\n2007, A\u0026A, 466, 437\nYork D. G. et al., 2000, AJ, 120, 1579\nZabludoff A. I., Huchra J. P., Geller M. J., 1990, ApJS, 74, 1\nZabludoff A. I., Franx M., Geller M. J., 1993, ApJ, 419, 47"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"M. S. Owers, J. T. Allen, I. Baldry, J. J. Bryant, G. N. Cecil, L. Cortese, S. M. Croom, S. P. Driver, L. M. R. Fogarty, A. W. Green, E. Helmich, J. T. A. de Jong, K. Kuijken, S. Mahajan, J. McFarland, M. B. Pracy, A. G. S. Robotham, G. Sikkema, S. Sweet, E. N. Taylor, G. Verdoes Kleijn, A. E. Bauer, J. Bland-Hawthorn, S. Brough, M. Colless, W. J. Couch, R. L Davies, M. J. Drinkwater, M. Goodwin, A. M. Hopkins, I. S. Konstantopoulos, C. Foster, J. S. Lawrence, N. P. F Lorente, A. M. Medling, N. Metcalfe, S. N. Richards, J. van de Sande, N. Scott, T. Shanks, R. Sharp, A. D. Thomas, C. Tonini; The SAMI Galaxy Survey: the cluster redshift survey, target selection and cluster properties. Mon Not R Astron Soc 2017; 468 (2): 1824-1849. doi: 10.1093/mnras/stx562","other_numbering_system":null,"funders":[{"agency":"Australian Research Council","grant_number":"FT140100255"},{"agency":"Australian Research Council","grant_number":"FT140101166"},{"agency":"Australian Research Council","grant_number":"FT100100457"},{"agency":"SIEF John Stocker Fellowship","grant_number":""},{"agency":"Nederlandse Onderzoekschool voor de Astronomie (NOVA)","grant_number":""},{"agency":"Samenwerkingsverband Noord Nederland European fund","grant_number":""},{"agency":"Ministry of Economic Affairs (Netherlands)","grant_number":""},{"agency":"Pieken in de Delta","grant_number":""},{"agency":"Provinces of Groningen and Drenthe","grant_number":""},{"agency":"Nederlandse Organisatie voor Wetenschappelijk Onderzoek (NWO)","grant_number":"614.061.610"},{"agency":"Science and Technology Facilities Council (STFC)","grant_number":"ST/K00106X/1"},{"agency":"Christ Church, Oxford","grant_number":""},{"agency":"Oxford Centre for Astrophysical Surveys","grant_number":""},{"agency":"Hintze Family Charitable Foundation","grant_number":""},{"agency":"NASA","grant_number":"HST-HF2-51377"},{"agency":"NASA","grant_number":"NAS5-26555"},{"agency":"University of Sydney","grant_number":""},{"agency":"Australian Research Council","grant_number":"CE110001020"},{"agency":"Science and Technology Facilities Council (STFC)","grant_number":""},{"agency":"Australian Astronomical Observatory (AAO)","grant_number":""},{"agency":"Alfred P. Sloan Foundation","grant_number":""},{"agency":"Robert Martin Ayers Sciences Fund","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}