{"title":"Osteogenic cell functionality on 3-dimensional nano-scaffolds with varying stiffness","uri":"","abstract":"Creating implants that lead to optimal bone remodeling has been a challenge for more than two decades because of a lack of thorough knowledge of cell behavior in three-dimensional (3D) environments Limitations in traditional fabrication techniques and difficulties in characterizing cell-scaffold interactions have limited our understanding of how factors like scaffold pore size and distribution, as well as stiffness affect cell response.\nTo date, cellular activity on 3D substrates with stiffness ranging from a few kPa to hundreds of MPa has been investigated extensively (Cui et al., 2009; Fu et al., 2011; Hulbert et al., 1970; Hollinger et al., 1996; Johnson and Herschler, 2011; Karageorgiou and Kaplan, 2005). Fabrication limitations have restricted scaffolds with strut dimensions on the order of a few microns, a size comparable to the dimensions of osteoblasts, to have compressive moduli ranging from 10 kPa to 200 kPa, which has limited our understanding of how scaffolds stiffness affects mineral deposition. Cell viability and functionality on 3D scaffolds with compressive moduli in the MPa range and with strut dimensions on the order of a few microns have not yet been reported. We employed two-photon lithography to create periodic 3D nano-architectures with ∼99% porosity, ∼2 μm strut diameters, and ∼2–9 MPa structural stiffness to explore the influence of scaffold properties on the viability of osteoblasts in a microenvironment similar to that of natural bone. These nanolattices were made out of a polymeric core coated with different materials and had unit cells with tetrakaidecahedral geometry and a 25 μm pore size. The unit cells were tessellated in space to form a lattice with lateral dimensions of 200×200 μm and a height of 50 μm. Some of the polymer nanolattices were coated with a conformal 120 nm-thick layer of SiO_2, others were coated with 120 nm of Ti. All nanolattices had a ∼20 nm-thick outermost layer of TiO_2. Osteogenic cells were grown on the nanolattices for 28 days and the resulting cell morphology and depositions were characterized via scanning electron microscopy (SEM), energy dispersive spectroscopy (EDS), and Raman spectroscopy. These analyses revealed significant cell attachment and the presence of hydroxyapatite (Ca_(10)(PO_4)_6(OH)_2), tricalcium phosphate (Ca_3(PO_4)_2) and metaphosphates ([Ca_2(P_2O_7)]n), chemical species normally found in natural bone. Such osteogenic functionality suggests that 3-dimensional nano-architected materials can be used as effective scaffolds for cell growth and proliferation, which could eventually lead to the generation of better bone implants.","documents":null,"note":"© 2017 Elsevier Ltd. \n\nReceived 4 October 2016, Revised 4 January 2017, Accepted 6 January 2017, Available online 13 January 2017.","id":77764,"rev_number":7,"userid":18,"eprint_dir":"disk0/00/07/77/64","datestamp":"2017-05-25 21:29:04","lastmod":"2017-05-25 21:29:04","status_changed":"2017-05-25 21:29:04","type":"article","metadata_visibility":"show","creators":[{"given":"Alessandro","family":"Maggi","id":"Maggi-A","orcid":""},{"given":"Jessica","family":"Allen","id":"Allen-J","orcid":""},{"given":"Tejal","family":"Desai","id":"Desai-T-A","orcid":""},{"given":"Julia R.","family":"Greer","id":"Greer-J-R","orcid":"0000-0002-9675-1508"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Two photon lithography; Bone scaffolds; Mechanical properties; Compression; Mineralization","date":"2017-05","date_type":"published","publication":"Extreme Mechanics Letters","volume":"13","number":"","pagerange":"1-9","id_number":"CaltechAUTHORS:20170525-140501296","refereed":true,"issn":"2352-4316","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170525-140501296","related_url":[{"url":"https://doi.org/10.1016/j.eml.2017.01.002","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S2352431616302097","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Alessandro Maggi, Jessica Allen, Tejal Desai, Julia R. Greer, Osteogenic cell functionality on 3-dimensional nano-scaffolds with varying stiffness, Extreme Mechanics Letters, Volume 13, May 2017, Pages 1-9, ISSN 2352-4316, https://doi.org/10.1016/j.eml.2017.01.002.\n(http://www.sciencedirect.com/science/article/pii/S2352431616302097)","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}