{"title":"Jupiter’s interior and deep atmosphere: The initial pole-to-pole passes with the Juno spacecraft","uri":"","abstract":"On 27 August 2016, the Juno spacecraft acquired science observations of Jupiter, passing less than 5000 kilometers above the equatorial cloud tops. Images of Jupiter’s poles show a chaotic scene, unlike Saturn’s poles. Microwave sounding reveals weather features at pressures deeper than 100 bars, dominated by an ammonia-rich, narrow low-latitude plume resembling a deeper, wider version of Earth’s Hadley cell. Near-infrared mapping reveals the relative humidity within prominent downwelling regions. Juno’s measured gravity field differs substantially from the last available estimate and is one order of magnitude more precise. This has implications for the distribution of heavy elements in the interior, including the existence and mass of Jupiter’s core. The observed magnetic field exhibits smaller spatial variations than expected, indicative of a rich harmonic content.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252800","docid":252800,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263581","fileid":1263581,"datasetid":"document","objectid":252800,"filename":"821.full.pdf","mime_type":"application/pdf","hash":"342e17fc6b758a70a7af69c83ce8992f","hash_type":"MD5","filesize":613691,"mtime":"2017-05-25 23:22:46","url":"http://authors.library.caltech.edu/77779/1/821.full.pdf"}],"eprintid":77779,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"821.full.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252802","docid":252802,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263594","fileid":1263594,"datasetid":"document","objectid":252802,"filename":"aal2108_Bolton_SM.pdf","mime_type":"application/pdf","hash":"d5c881d7b626abbf5383b27c4b50d58e","hash_type":"MD5","filesize":2105089,"mtime":"2017-05-25 23:33:05","url":"http://authors.library.caltech.edu/77779/2/aal2108_Bolton_SM.pdf"}],"eprintid":77779,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"aal2108_Bolton_SM.pdf","content":"supplemental"}],"note":"© 2017 American Association for the Advancement of Science.  \n\nReceived 13 December 2016; accepted 1 May 2017. \n\nWe acknowledge the important contributions of M. H. Acuña, A. Coradini, and M. J. Klein to the Juno project. The images in Fig. 1 were processed by citizen scientist R. Tkachenko as part of Juno’s outreach program. The visible map shown in Fig. 2 is based on observations made with the NASA/ESA Hubble Space Telescope (HST) under program GO14334, the Outer Planet Atmospheric Legacy Program. Support for the Juno project is provided under NASA grant NNM06AA75C to Southwest Research Institute; NASA grant NNN12AA01C to the Jet Propulsion Laboratory/Caltech; Centre National d’Études Spatiales (T.G. and Y.M.); and Agenzia Spaziale Italiana (ASI) (A.A., D.G., L.I., and A.M.). The JIRAM and Ka-band instruments are funded by ASI; HST is funded by NASA through a grant from the Space Telescope Science Institute, which is operated by the Association of Universities for Research in Astronomy Inc. under NASA contract NAS5-26555. All maps from this program can be retrieved at https://archive.stsci.edu/prepds/opal/. Supporting data are available in the supplementary materials. As agreed with NASA, fully calibrated Juno data are released on schedule via the NASA Planetary Data System at https://pds.nasa.gov/.","id":77779,"rev_number":16,"userid":18,"eprint_dir":"disk0/00/07/77/79","datestamp":"2017-06-06 22:22:59","lastmod":"2017-06-06 22:23:50","status_changed":"2017-06-06 22:22:59","type":"article","metadata_visibility":"show","creators":[{"given":"S. J.","family":"Bolton","id":"Bolton-S-J","orcid":""},{"given":"A.","family":"Ingersoll","id":"Ingersoll-A-P","orcid":"0000-0002-2035-9198"},{"given":"C.","family":"Li","id":"Li-Cheng","orcid":""},{"given":"E.","family":"Stone","id":"Stone-E-C","orcid":""},{"given":"D.","family":"Stevenson","id":"Stevenson-D-J","orcid":"0000-0001-9432-7159"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-26","date_type":"published","publication":"Science","volume":"356","number":"6340","pagerange":"821-825","id_number":"CaltechAUTHORS:20170525-162241748","refereed":true,"issn":"0036-8075","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170525-162241748","related_url":[{"url":"http://dx.doi.org/10.1126/science.aal2108","type":"doi","description":"Article"},{"url":"http://science.sciencemag.org/content/356/6340/821","type":"pub","description":"Article"},{"url":"http://www.sciencemag.org/content/356/6340/821/suppl/DC1","type":"pub","description":"Supplemental Materials"}],"referencetext":["↵ J. E. P. Connerney, A. Adriani, F. Allegrini, F. Bagenal, S. J. Bolton, B. Bonfond, S. W. H. Cowley, J.-C. Gerard, G. R. Gladstone, D. Grodent, G. Hospodarsky, J. L. Jorgensen, W. S. Kurth, S. M. Levin, B. Mauk, D. J. McComas, A. Mura, C. Paranicas, E. J. Smith, R. M. Thorne, P. Valek, J. Waite, Jupiter’s magnetosphere and aurorae observed by the Juno spacecraft during its first polar orbits. Science 356, 826–832 (2017).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ C. J. Hansen, M. A. Caplinger, A. Ingersoll, M. A. Ravine, E. Jensen, S. Bolton, G. Orton, Junocam: Juno’s outreach camera. Space Sci. Rev. 10.1007/s11214-014-0079-x (2014). doi:10.1007/s11214-014-0079-xGoogle Scholar\n↵T. Gehrels, in Jupiter: Studies of the Interior, Atmosphere, Magnetosphere and Satellites, T. Gehrels, Ed. (Univ. of Arizona Press, 1976), pp. 531–563.\n↵ E. García-Melendo, A. Sanchez-Lavega, A study of the stability of jovian zonal winds from HST images: 1995–2000. Icarus 152, 316–330 (2001). doi:10.1006/icar.2001.6646Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\n↵ X. S. Asay-Davis, P. S. Marcus, M. H. Wong, I. de Pater, Changes in Jupiter’s zonal velocity between 1979 and 2008. Icarus 211, 1215–1232 (2011). doi:10.1016/j.icarus.2010.11.018Caltech ConnectCrossRefGoogle Scholar\n↵ A. P. Ingersoll, R. F. Beebe, S. A. Collins, G. E. Hunt, J. L. Mitchell, P. Muller, B. A. Smith, R. J. Terrile, Zonal velocity and texture in the jovian atmosphere inferred from Voyager images. Nature 280, 773–775 (1979). doi:10.1038/280773a0Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\n↵ D. A. Godfrey, A hexagonal feature around Saturn’s north pole. Icarus 76, 335–356 (1988). doi:10.1016/0019-1035(88)90075-9Caltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵ N. Barrado-Izagirre, S. Perez-Hoyos, A. Sanchez-Lavega, Brightness power spectral distribution and waves in Jupiter’s upper cloud and hazes. Icarus 202, 181–196 (2009). doi:10.1016/j.icarus.2009.02.015Caltech ConnectCrossRefGoogle Scholar\n↵ A. Antuñano, T. del Río-Gaztelurrutia, A. Sánchez-Lavega, R. Hueso, Dynamics of Saturn’s polar regions. J. Geophys. Res. 120, 155–176 (2015). doi:10.1002/2014JE004709Caltech ConnectCrossRefGoogle Scholar\n↵ U. A. Dyudina, A. P. Ingersoll, S. P. Ewald, A. R. Vasavada, R. A. West, K. H. Baines, T. W. Momary, A. D. Del Genio, J. M. Barbara, C. C. Porco, R. K. Achterberg, F. M. Flasar, A. A. Simon-Miller, L. N. Fletcher, Saturn’s south polar vortex compared to other large vortices in the Solar System. Icarus 202, 240–248 (2009). doi:10.1016/j.icarus.2009.02.014Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\n↵ M. A. Janssen, M. Hofstadter, S. Gulkis, A. Ingersoll, M. Allison, S. Bolton, S. Levin, L. Kamp, Microwave remote sensing of Jupiter’s atmosphere from an orbiting spacecraft. Icarus 173, 447–453 (2005). doi:10.1016/j.icarus.2004.08.012Caltech ConnectCrossRefGoogle Scholar\n↵ M. A. Janssen, J. E. Oswald, S. T. Brown, S. Gulkis, S. M. Levin, S. J. Bolton, M. D. Allison, S. K. Atreya, D. Gautier, A. P. Ingersoll, J. I. Lunine, G. S. Orton, T. C. Owen, P. G. Steffes, V. Adumitroaie, A. Bellotti, L. A. Jewell, C. Li, L. Li, S. Misra, F. A. Oyafuso, D. Santos-Costaz, E. Sarkissian, R. Williamson, J. K. Arballo, A. Kitiyakaral, A. Ulloa-Severino, J. C. Chen, F. W. Maiwald, A. S. Sahakian, P. J. Pingree, K. A. Lee, A. S. Mazer, R. Redick, R. E. Hodges, R. C. Hughes, G. Bedrosian, D. E. Dawson, W. A. Hatch, D. S. Russell, N. F. Chamberlain, M. S. Zawadskil, B. Khayatianl, B. R. Franklin, H. A. Conley, J. G. Kempenaar, M. S. Lool, E. T. Sunada, V. Vorperion, C. C. Wang, MWR: Microwave radiometer for the Juno mission to Jupiter. Space Sci. Rev. 10.1007/s11214-017-0349-5 (2017). doi:10.1007/s11214-017-0349-5Caltech ConnectCrossRefGoogle Scholar\n↵ W. M. Folkner, R. Woo, S. Nandi, Ammonia abundance in Jupiter’s atmosphere derived from the attenuation of the Galileo probe’s radio signal. J. Geophys. Res. 103, 22847–22855 (1998). doi:10.1029/98JE01635Caltech ConnectCrossRefGoogle Scholar\n↵ M. H. Wong, P. R. Mahaffy, S. K. Atreya, H. B. Niemann, T. C. Owen, Updated Galileo probe mass spectrometer measurements of carbon, oxygen, nitrogen, and sulfur on Jupiter. Icarus 171, 153–170 (2004). doi:10.1016/j.icarus.2004.04.010Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\n↵M. A. Janssen, Ed., Atmospheric Remote Sensing by Microwave Radiometry (Wiley, 1993).\n↵ P. G. Steffes et al., high-precision laboratory measurements supporting retrieval of water vapor, gaseous ammonia, and aqueous ammonia clouds with the Juno Microwave Radiometer (MWR). Space Sci. Rev. 10.1007/s11214-016-0265-0 (2017). doi:10.1007/s11214-016-0265-0Caltech ConnectCrossRefGoogle Scholar\n↵ C. Li, A. Ingersoll, M. Janssen, S. Levin, S. Bolton, V. Adumitroaie, M. Allison, J. Arballo, A. Bellotti, S. Brown, S. Ewald, L. Jewell, S. Misra, G. Orton, F. Oyafuso, P. Steffes, R. Williamson, Geophys. Res. Lett. 10.1002/2017GL073159 (2017). doi:10.1002/2017GL073159Caltech ConnectCrossRef\n↵ S. K. Atreya, A. S. Wong, K. H. Baines, M. H. Wong, T. C. Owen, Jupiter’s ammonia clouds—localized or ubiquitous? Planet. Space Sci. 53, 498–507 (2005). doi:10.1016/j.pss.2004.04.002Caltech ConnectCrossRefGoogle Scholar\n↵ A. Adriani, G. Filacchione, T. Di Iorio, D. Turrini, R. Noschese, A. Cicchetti, D. Grassi, A. Mura, G. Sindoni, M. Zambelli, G. Piccioni, M. T. Capria, F. Tosi, R. Orosei, B. M. Dinelli, M. L. Moriconi, E. Roncon, J. I. Lunine, H. N. Becker, A. Bini, A. Barbis, L. Calamai, C. Pasqui, S. Nencioni, M. Rossi, M. Lastri, R. Formaro, A. Olivieri, JIRAM, the Jovian Infrared Auroral Mapper. Space Sci. Rev. 10.1007/s11214-014-0094-y (2014). doi:10.1007/s11214-014-0094-yCaltech ConnectCrossRefGoogle Scholar\n↵ B. A. Archinal, M. F. A’Hearn, E. Bowell, A. Conrad, G. J. Consolmagno, R. Courtin, T. Fukushima, D. Hestroffer, J. L. Hilton, G. A. Krasinsky, G. Neumann, J. Oberst, P. K. Seidelmann, P. Stooke, D. J. Tholen, P. C. Thomas, I. P. Williams, Report of the IAU Working Group on Cartographic Coordinates and Rotational Elements: 2009. Celestial Mech. Dyn. Astron. 109, 101–135 (2010). doi:10.1007/s10569-010-9320-4Caltech ConnectCrossRefGoogle Scholar\n↵ G. Sindoni, D. Grassi, A. Adriani, A. Mura, M. L. Moriconi, B. M. Dinelli, G. Filacchione, F. Tosi, G. Piccioni, A. Migliorini, F. Altieri, F. Fabiano, D. Turrini, R. Noschese, A. Cicchetti, S. Stefani, S. J. Bolton, J. E. P. Connerney, S. K. Atreya, F. Bagenal, C. Hansen, A. Ingersoll, M. Jansen, S. M. Levin, J. I. Lunine, G. Orton, M. Amoroso, Characterization of the white ovals on Jupiter’s southern hemisphere using the first data by Juno/JIRAM instrument Geophys. Res. Lett. 10.1002/2017GL072940 (2017). doi:10.1002/2017GL072940Caltech ConnectCrossRefGoogle Scholar\n↵ D. Grassi, A. Adriani, A. Mura, B. M. Dinelli, G. Sindoni, D. Turrini, G. Filacchione, A. Migliorini, M. L. Moriconi, F. Tosi, R. Noschese, A. Cicchetti, F. Altieri, F. Fabiano, G. Piccioni, S. Stefani, S. Atreya, J. Lunine, G. Orton, A. Ingersoll, S. Bolton, S. Levin, J. Connerney, Preliminary results on the composition of Jupiter’s troposphere in Hot Spot regions from the JIRAM/Juno instrument. Geophys. Res. Lett. 10.1002/2017GL072841 (2017). doi:10.1002/2017GL072841Caltech ConnectCrossRefGoogle Scholar\n↵ M. Roos-Serote, S. K. Atreya, M. K. Wong, P. Drossart, On the water abundance in the atmosphere of Jupiter. Planet. Space Sci. 52, 397–414 (2004). doi:10.1016/j.pss.2003.06.007Caltech ConnectCrossRefGoogle Scholar\n↵ R. Jacobson, R. Haw, T. McElrath, P. Antreasian, A comprehensive orbit reconstruction for the Galileo Prime mission in the J2000 system. Adv. Astronaut. Sci. 103, 465–486 (1999).Caltech ConnectGoogle Scholar\n↵ M. Parisi, E. Galanti, S. Finocchiaro, L. Iess, Y. Kaspi, Probing the depth of Jupiter’s Great Red Spot with the Juno gravity experiment. Icarus 267, 232–242 (2016). doi:10.1016/j.icarus.2015.12.011Caltech ConnectCrossRefGeoRefGoogle Scholar\n↵ J. K. Campbell, S. P. Synnott, Gravity field of the jovian system from Pioneer and Voyager tracking data. Astrophys. J. 90, 364–372 (1985).Caltech ConnectGoogle Scholar\n↵\nThe JUP230 solution corresponds to the gravity field of Jupiter calculated by R. A. Jacobson in 2003 using Pioneer, Voyager, and Galileo data as released on http://ssd.jpl.nasa.gov/?gravity_fields_op\n↵\nThe JUP310 solution corresponds to the gravity field of Jupiter calculated by R. A. Jacobson in 2013 using Pioneer, Voyager, Galileo, and New Horizons data as released on http://ssd.jpl.nasa.gov/?gravity_fields_op\n↵ N. Nettelmann, A. Becker, B. Holst, R. Redmer, Jupiter models with improved ab initio hydrogen equation of state (H-REOS.2). Astrophys. J. 750, 52 (2012). doi:10.1088/0004-637X/750/1/52Caltech ConnectCrossRefGoogle Scholar\n↵ Y. Kaspi, T. Guillot, E. Galanti, Y. Miguel, R. Helled, W. Hubbard, B. Militzer, S. Wahl, S. Levin, J. Connerney, S. Bolton, The effect of differential rotation on Jupiter’s low-degree even gravity moments. Geophys. Res. Lett. 10.1002/2017GL073629 (2017). doi:10.1002/2017GL073629Caltech ConnectCrossRefGoogle Scholar\n↵ S. Wahl et al., Gravity measurements and the role of a dilute core. Geophys. Res. Lett. 10.1002/2017GL073160 (2017). doi:10.1002/2017GL073160Caltech ConnectCrossRefGoogle Scholar\n↵ J. E. P. Connerney, M. Benn, J. B. Bjarno, T. Denver, J. Espley, J. L. Jorgensen, P. S. Jorgensen, P. Lawton, A. Malinnikova, J. M. Merayo, S. Murphy, J. Odom, R. Oliversen, R. Schnurr, D. Sheppard, E. J. Smith, The Juno magnetic field investigation. Space Sci. Rev. 10.1007/s11214-017-0334-z (2017). doi:10.1007/s11214-017-0334-zCaltech ConnectCrossRefGoogle Scholar\n↵ J. E. P. Connerney, M. H. Açuna, N. F. Ness, T. Satoh, New models of Jupiter’s magnetic field constrained by the Io Flux Tube footprint. J. Geophys. Res. 103, 11929–11939 (1998). doi:10.1029/97JA03726Caltech ConnectCrossRefGoogle Scholar\n↵J. E. P. Connerney, Planetary magnetism. In G. Schubert, T. Spohn, Eds., in Treatise on Geophysics, Volume 10: Planets and Satellites, G. Schubert, T. Spohn, Eds. (Elsevier, 2015), pp. 195–237; https://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20150011017.pdf.\n↵ R. Smoluchowski, Jupiter’s molecular hydrogen layer and the magnetic field. Astrophys. J. 200, L119–L121 (1975). doi:10.1086/181911Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\n↵ W. J. Nellis, S. T. Weir, A. C. Mitchell, Metallization and electrical conductivity of hydrogen in Jupiter. Science 273, 936–938 (1996). doi:10.1126/science.273.5277.936pmid:8688072Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ M. French, A. Becker, W. Lorenzen, N. Nettelmann, M. Bethkenhagen, J. Wicht, R. Redmer, Ab initio simulations for material properties along the Jupiter adiabat. Astrophys. J. Suppl. Ser. 202, 5 (2012). doi:10.1088/0067-0049/202/1/5Caltech ConnectCrossRefGoogle Scholar\n↵T. Guillot, D. J. Stevenson, W. B. Hubbard, D. Saumon, in Jupiter, F. Bagenal, T. Dowling, W. B. McKinnon, Eds. (Cambridge Univ. Press, 2004), chap. 3.\n↵ W. B. Hubbard, B. Militzer, Astrophys. J. 820, 80 (2016). doi:10.1051/0004-6361/201629732Caltech ConnectCrossRef\n↵ Y. Miguel, T. Guillot, L. Fayon, Jupiter internal structure: The effect of different equations of state. Astron. Astrophys. 596, A114 (2016). doi:10.1051/0004-6361/201629732Caltech ConnectCrossRefGoogle Scholar\n↵ T. R. Hanley, P. G. Steffes, B. M. Karpowicz, A new model of the hydrogen and helium-broadened microwave opacity of ammonia based on extensive laboratory measurements. Icarus 202, 316–335 (2009). doi:10.1016/j.icarus.2009.02.002Caltech ConnectCrossRefGoogle Scholar\nK. Devaraj, P. G. Steffes, D. Duong, The centimeter-wavelength opacity of ammonia under deep jovian conditions. Icarus 241, 165–179 (2014). doi:10.1016/j.icarus.2014.06.017Caltech ConnectCrossRefGeoRefGoogle Scholar\nA. Bellotti, P. G. Steffes, G. Chinsomboom, Laboratory measurements of the 5-20 cm wavelength opacity of ammonia, water vapor and methane under simulated conditions for the deep jovian atmosphere. Icarus 280, 255–267 (2016). doi:10.1016/j.icarus.2016.07.013Caltech ConnectCrossRefGoogle Scholar\nE. C. Morris, R. W. Parsons, Microwave absorption by gas mixtures at pressures up to several hundred bars. I. Experimental technique and results. Aust. J. Phys. 23, 335–349 (1971).Caltech ConnectGoogle Scholar\nV. R. Eshleman, G. L. Tyler, G. E. Wood, G. F. Lindal, J. D. Anderson, G. S. Levy, T. A. Croft, Radio science with Voyager at Jupiter: Initial Voyager 2 results and a Voyager 1 measure of the Io torus. Science 206, 959–962 (1979). doi:10.1126/science.206.4421.959pmid:17733914Caltech ConnectAbstract/FREE Full TextGoogle Scholar\nM. K. Bird, S. W. Asmar, J. P. Brenkle, P. Edenhofer, O. Funke, M. Pätzold, H. Volland, Ulysses radio occultation observations of the Io plasma torus during the Jupiter encounter. Science 257, 1531–1535 (1992). doi:10.1126/science.257.5076.1531pmid:17776163Caltech ConnectAbstract/FREE Full TextGoogle Scholar\nS. W. Asmar, J. W. Armstrong, L. Iess, P. Tortora, Spacecraft Doppler tracking: Noise budget and accuracy achievable in precision radio science observations. Radio Sci. 40, n/a (2005). doi:10.1029/2004RS003101Caltech ConnectCrossRefGoogle Scholar\nJ. A. Barnes, A. R. Chi, L. S. Cutler, D. J. Healey, D. B. Leeson, T. E. McGunigal, J. A. Mullen, W. L. Smith, R. L. Sydnor, R. F. C. Vessot, G. M. R. Winkler, Characterization of frequency stability. IEEE Trans. Instrum. Meas. IM-20, 105–120 (1971). doi:10.1109/TIM.1971.5570702Caltech ConnectCrossRefGoogle Scholar\nW. M. Kaula, Theory of Satellite Geodesy: Applications of Satellites to Geodesy (Blaisdell, Waltham, MA, 1966).\nG. Bierman, Factorization Methods for Discrete Sequential Estimation (Academic Press, 1997).\nA. Milani, G. Gronchi, Theory of Orbit Determination (Cambridge Univ. Press, 2010).\nS. V. Gavrilov, V. N. Zharkov, Love numbers of the giant planets. Icarus 32, 443–449 (1977). doi:10.1016/0019-1035(77)90015-XCaltech ConnectCrossRefWeb of ScienceGoogle Scholar\nM. Parisi, E. Galanti, S. Finocchiaro, L. Iess, Y. Kaspi, Probing the depth of Jupiter’s Great Red Spot with the Juno gravity experiment. Icarus 267, 232–242 (2016). doi:10.1016/j.icarus.2015.12.011Caltech ConnectCrossRefGeoRefGoogle Scholar\nD. H. Atkinson, J. B. Pollack, A. Seiff, The Galileo Probe Doppler Wind Experiment: Measurement of the deep zonal winds on Jupiter. J. Geophys. Res. 103, 22911–22928 (1998).doi:10.1016/j.pss.2010.05.003Caltech ConnectCrossRefGoogle Scholar\nD. Grassi, A. Adriani, M. L. Moriconi, N. I. Ignatiev, E. D’Aversa, F. Colosimo, A. Negrão, L. Brower, B. M. Dinelli, A. Coradini, G. Piccioni, Jupiter’s hot spots: Quantitative assessment of the retrieval capabilities of future IR spectro-imagers. Planet. Space Sci. 58, 1265–1278 (2010). doi:10.1016/j.pss.2010.05.003Caltech ConnectCrossRefGoogle Scholar\nC. R. Rodgers, Inverse Methods for Atmospheric Sounding: Theory and Practice (World Scientific, 2000).\nP. G. J. Irwin, N. A. Teanby, R. de Kok, L. N. Fletcher, C. J. A. Howett, C. C. C. Tsang, C. F. Wilson, S. B. Calcutt, C. A. Nixon, P. D. Parrish, The NEMESIS planetary atmosphere radiative transfer and retrieval tool. J. Quant. Spectrosc. Radiat. Transf. 109, 1136–1150 (2008). doi:10.1016/j.jqsrt.2007.11.006Caltech ConnectCrossRefGoogle Scholar\nA. Kylling, K. Stamnes, S.-C. Tsay, A reliable and efficient two-stream algorithm for spherical radiative transfer: Documentation of accuracy in realistic layered media. J. Atmos. Chem. 21, 115–150 (1995). doi:10.1007/BF00696577Caltech ConnectCrossRefGoogle Scholar\nA. P. Showman, T. E. Dowling, Nonlinear simulations of Jupiter’s 5-micron hot spots. Science 289, 1737–1740 (2000). doi:10.1126/science.289.5485.1737pmid:10976064Caltech ConnectAbstract/FREE Full TextGoogle Scholar\nR. Hueso, A. Sánchez-Lavega, Motions in hot spot-plume regions using Voyager images. Icarus 136, 353–357 (1998). doi:10.1006/icar.1998.6018Caltech ConnectCrossRefGoogle Scholar\n↵ D. Choi, A. P. Showman, A. R. Vasavada, A. A. Simon-Miller, Meteorology of Jupiter’s equatorial hot spot and plumes from Cassini. Icarus 223, 832–843 (2013). doi:10.1016/j.icarus.2013.02.001"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Jupiter’s interior and deep atmosphere: The initial pole-to-pole passes with the Juno spacecraft\nBy S. J. Bolton, A. Adriani, V. Adumitroaie, M. Allison, J. Anderson, S. Atreya, J. Bloxham, S. Brown, J. E. P. Connerney, E. DeJong, W. Folkner, D. Gautier, D. Grassi, S. Gulkis, T. Guillot, C. Hansen, W. B. Hubbard, L. Iess, A. Ingersoll, M. Janssen, J. Jorgensen, Y. Kaspi, S. M. Levin, C. Li, J. Lunine, Y. Miguel, A. Mura, G. Orton, T. Owen, M. Ravine, E. Smith, P. Steffes, E. Stone, D. Stevenson, R. Thorne, J. Waite, D. Durante, R. W. Ebert, T. K. Greathouse, V. Hue, M. Parisi, J. R. Szalay, R. Wilson\nScience  26 May 2017:\nVol. 356, Issue 6340, pp. 821-825\nDOI: 10.1126/science.aal2108","other_numbering_system":null,"funders":[{"agency":"NASA","grant_number":"NNM06AA75C"},{"agency":"NASA","grant_number":"NNN12AA01C"},{"agency":"Centre National d’Études Spatiales (CNES)","grant_number":""},{"agency":"Agenzia Spaziale Italiana (ASI)","grant_number":""},{"agency":"NASA","grant_number":"NAS5-26555"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":["Space Radiation Laboratory"]}