{"title":"The Complete Calibration of the Color-Redshift Relation (C3R2) Survey: Survey Overview and Data Release 1","uri":"","abstract":"A key goal of the Stage IV dark energy experiments Euclid, LSST and WFIRST is\nto measure the growth of structure with cosmic time from weak lensing analysis\nover large regions of the sky. Weak lensing cosmology will be challenging: in\naddition to highly accurate galaxy shape measurements, statistically robust and\naccurate photometric redshift (photo-z) estimates for billions of faint\ngalaxies will be needed in order to reconstruct the three-dimensional matter\ndistribution. Here we present an overview of and initial results from the\nComplete Calibration of the Color-Redshift Relation (C3R2) survey, designed\nspecifically to calibrate the empirical galaxy color-redshift relation to the\nEuclid depth. These redshifts will also be important for the calibrations of\nLSST and WFIRST. The C3R2 survey is obtaining multiplexed observations with\nKeck (DEIMOS, LRIS, and MOSFIRE), the Gran Telescopio Canarias (GTC; OSIRIS),\nand the Very Large Telescope (VLT; FORS2 and KMOS) of a targeted sample of\ngalaxies most important for the redshift calibration. We focus spectroscopic\nefforts on under-sampled regions of galaxy color space identified in previous\nwork in order to minimize the number of spectroscopic redshifts needed to map\nthe color-redshift relation to the required accuracy. Here we present the C3R2\nsurvey strategy and initial results, including the 1283 high confidence\nredshifts obtained in the 2016A semester and released as Data Release 1.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252789","docid":252789,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263498","fileid":1263498,"datasetid":"document","objectid":252789,"filename":"1704.06665.pdf","mime_type":"application/pdf","hash":"3b1797ab5d82316ae973bc8706a67062","hash_type":"MD5","filesize":4141076,"mtime":"2017-05-25 22:17:28","url":"http://authors.library.caltech.edu/77770/1/1704.06665.pdf"}],"eprintid":77770,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1704.06665.pdf","content":"submitted"}],"note":"The authors thank the referee, Marcin Sawicki, for a helpful\nreport that improved this paper. D.M. would like to thank\nGiuseppe Longo, Audrey Galametz, Sotiria Fotopoulou, and\nGeorge Helou for helpful conversations. D.M., P.C., D.S.,\nand J.R. acknowledge support by NASA ROSES grant 12-\nEUCLID12-0004. J.R. and D.S. are supported by JPL, run by\nCaltech for NASA. F.C. acknowledges support by MINECO\ngrant ESP2015-88861. The authors wish to recognize and\nacknowledge the very significant cultural role and reverence\nthat the summit of Mauna Kea has always had within the\nindigenous Hawaiian community. We are most fortunate\nto have the opportunity to conduct observations from this\nmountain.","id":77770,"rev_number":8,"userid":999,"eprint_dir":"disk0/00/07/77/70","datestamp":"2017-05-25 22:23:04","lastmod":"2017-05-25 22:23:04","status_changed":"2017-05-25 22:23:04","type":"monograph","metadata_visibility":"show","creators":[{"given":"Daniel","family":"Masters","id":"Masters-D","orcid":""},{"given":"Daniel","family":"Stern","id":"Stern-D","orcid":""},{"given":"Judith G.","family":"Cohen","id":"Cohen-J-G","orcid":""},{"given":"Peter","family":"Capak","id":"Capak-P","orcid":""},{"given":"Jason","family":"Rhodes","id":"Rhodes-J","orcid":""},{"given":"Francisco","family":"Castander","id":"Castander-F","orcid":""},{"given":"Stephane","family":"Paltani","id":"Paltani-S","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2017-04-21","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170525-151351304","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170525-151351304","related_url":[{"url":"http://arxiv.org/abs/1704.06665","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Ben´ıtez, N. 2000, ApJ, 536, 571\nBrammer, G. B., van Dokkum, P. G., \u0026 Coppi, P. 2008, ApJ, 686, 1503\nBrown, M. J. I., Moustakas, J., Smith, J.-D. T., et al. 2014, ApJS, 212, 18\nCapak, P., Aussel, H., Ajiki, M., et al. 2007, ApJS, 172, 99\nCarrasco Kind, M., \u0026 Brunner, R. J. 2013, MNRAS, 432, 1483\nDahlen, T., Mobasher, B., Faber, S. M., et al. 2013, ApJ, 775, 93\nDore, O., Bock, J., Ashby, M., et al. 2014, ArXiv e-prints ´\nFaber, S. M., Phillips, A. C., Kibrick, R. I., et al. 2003, in Society of\nPhoto-Optical Instrumentation Engineers (SPIE) Conference Series, Vol.\n4841, Instrument Design and Performance for Optical/Infrared\nGround-based Telescopes, ed. M. Iye \u0026 A. F. M. Moorwood, 1657–1669\nGrogin, N. A., Kocevski, D. D., Faber, S. M., et al. 2011, ApJS, 197, 35\nHuterer, D., Takada, M., Bernstein, G., \u0026 Jain, B. 2006, MNRAS, 366, 101\nIlbert, O., Capak, P., Salvato, M., et al. 2009, ApJ, 690, 1236\nIvezic, Z., Tyson, J. A., Abel, B., et al. 2008, ArXiv e-prints\nKartaltepe, J. S., Sanders, D. B., Le Floc’h, E., et al. 2010, ApJ, 709, 572\nKohonen, T. 1990, Proceedings of the IEEE, 78, 1464\nKriek, M., Shapley, A. E., Reddy, N. A., et al. 2014, ArXiv e-prints\nLaigle, C., McCracken, H. J., Ilbert, O., et al. 2016, ApJS, 224, 24\nLaureijs, R., Amiaux, J., Arduini, S., et al. 2011, ArXiv e-prints\nLe Fevre, O., Tasca, L. A. M., Cassata, P., et al. 2015, A\u0026A, 576, A79 `\nLilly, S. J., Le Fevre, O., Renzini, A., et al. 2007, ApJS, 172, 70 `\n11\nMassey, P., \u0026 Gronwall, C. 1990, ApJ, 358, 344\nMasters, D., Capak, P., Stern, D., et al. 2015, ApJ, 813, 53\nMcLean, I. S., Steidel, C. C., Epps, H. W., et al. 2012, in Society of\nPhoto-Optical Instrumentation Engineers (SPIE) Conference Series, Vol.\n8446, Society of Photo-Optical Instrumentation Engineers (SPIE)\nConference Series, 0\nNewman, J. A. 2008, ApJ, 684, 88\nNewman, J. A., Cooper, M. C., Davis, M., et al. 2013, ApJS, 208, 5\nOke, J. B., Cohen, J. G., Carr, M., et al. 1995, PASP, 107, 375\nRahman, M., Menard, B., Scranton, R., Schmidt, S. J., \u0026 Morrison, C. B. ´\n2015, MNRAS, 447, 3500\nSalvato, M., Hasinger, G., Ilbert, O., et al. 2009, ApJ, 690, 1250\nScoville, N., Aussel, H., Brusa, M., et al. 2007, ApJS, 172, 1\nSpeagle, J. S., Capak, P. L., Eisenstein, D. J., Masters, D. C., \u0026 Steinhardt,\nC. L. 2016, MNRAS, 461, 3432\nSpergel, D., Gehrels, N., Baltay, C., et al. 2015, ArXiv e-prints\nSteidel, C. C., Rudie, G. C., Strom, A. L., et al. 2014, ApJ, 795, 165\nStickley, N. R., Capak, P., Masters, D., et al. 2016, ArXiv e-prints\nTrump, J. R., Impey, C. D., McCarthy, P. J., et al. 2007, ApJS, 172, 383"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NASA","grant_number":"12-EUCLID12-0004"},{"agency":"Ministerio de Economía, Industria y Competitividad (MINECO)","grant_number":"ESP2015-88861"},{"agency":"NASA/JPL/Caltech","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Infrared Processing and Analysis Center (IPAC)"]}