{"title":"The distribution of ammonia on Jupiter from a preliminary inversion of Juno Microwave Radiometer data","uri":"","abstract":"The Juno Microwave Radiometer (Juno/MWR) measured the thermal emission from Jupiter's atmosphere from the cloud tops at about one bar to as deep as a hundred bars of pressure during its first flyby over Jupiter (PJ1). The nadir brightness temperatures show that the Equatorial Zone is likely to be an ideal adiabat, which allows a determination of the deep ammonia abundance in the range  362^(+33)_(-33) ppm. The combination of Markov Chain Monte Carlo method and Tikhonov regularization is studied to invert Jupiter's global ammonia distribution assuming a prescribed temperature profile. The result shows 1) ammonia is depleted globally down to 50-60 bars except within a few degrees of the equator, 2) the North Equatorial Belt is more depleted in ammonia than elsewhere, and 3) the ammonia concentration shows a slight inversion starting from about 7 bars to 2 bars. These results are robust regardless of the choice of water abundance.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252817","docid":252817,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263687","fileid":1263687,"datasetid":"document","objectid":252817,"filename":"Li_et_al-2017-Geophysical_Research_Letters.pdf","mime_type":"application/pdf","hash":"77433671a7f1c1be09e4f93b06724767","hash_type":"MD5","filesize":1082729,"mtime":"2017-05-26 15:12:25","url":"http://authors.library.caltech.edu/77794/1/Li_et_al-2017-Geophysical_Research_Letters.pdf"}],"eprintid":77794,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Li_et_al-2017-Geophysical_Research_Letters.pdf","content":"accepted"}],"note":"© 2017 American Geophysical Union. \n\nManuscript Accepted: 15 May 2017; Manuscript Revised: 14 May 2017; Manuscript Received: 20 February 2017. \n\nThe research was carried out at the Jet Propulsion Laboratory, California Institute of Technology, under a contract with the National Aeronautics and Space Administration. C.L. was supported by a NASA Earth and Space Science Fellowship and by the NASA Postdoctoral Fellowship. The Juno mission and the team members at JPL were supported by NASA grant number NNN12AA01C. We thank all Juno team members for the collaborative efforts. We note that Juno/MWR data can be accessed on the Planetary Data System (PDS) https://pds.nasa.gov/.","id":77794,"rev_number":11,"userid":18,"eprint_dir":"disk0/00/07/77/94","datestamp":"2017-06-06 22:25:21","lastmod":"2017-06-06 22:25:21","status_changed":"2017-06-06 22:25:21","type":"article","metadata_visibility":"show","creators":[{"given":"Cheng","family":"Li","id":"Li-Cheng","orcid":""},{"given":"Andrew","family":"Ingersoll","id":"Ingersoll-A-P","orcid":"0000-0002-2035-9198"},{"given":"Michael","family":"Janssen","id":"Janssen-M-A","orcid":""},{"given":"Steven","family":"Levin","id":"Levin-S","orcid":""},{"given":"Scott","family":"Bolton","id":"Bolton-S-J","orcid":""},{"given":"Virgil","family":"Adumitroaie","id":"Adumitroaie-V","orcid":""},{"given":"Michael","family":"Allison","id":"Allison-M","orcid":""},{"given":"John","family":"Arballo","id":"Arballo-J","orcid":""},{"given":"Amadeo","family":"Bellotti","id":"Bellotti-A","orcid":""},{"given":"Shannon","family":"Brown","id":"Brown-S","orcid":""},{"given":"Shawn","family":"Ewald","id":"Ewald-S-P","orcid":""},{"given":"Laura","family":"Jewell","id":"Jewell-L","orcid":""},{"given":"Sidharth","family":"Misra","id":"Misra-S","orcid":""},{"given":"Glenn","family":"Orton","id":"Orton-G-S","orcid":""},{"given":"Fabiano","family":"Oyafuso","id":"Oyafuso-F","orcid":""},{"given":"Paul","family":"Steffes","id":"Steffes-P","orcid":""},{"given":"Ross","family":"Williamson","id":"Williamson-R","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"Jupiter; Juno; atmosphere; ammonia; retrieval\n","date":"2017-05-25","date_type":"inpress","publication":"Geophysical Research Letters","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170526-081219993","refereed":true,"issn":"0094-8276","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170526-081219993","related_url":[{"url":"http://dx.doi.org/10.1002/2017GL073159","type":"doi","description":"Article"},{"url":"http://onlinelibrary.wiley.com/doi/10.1002/2017GL073159/abstract","type":"pub","description":"Article"}],"referencetext":["Achterberg, R. K., B. J. Conrath, and P. J. Gierasch (2006), Cassini CIRS retrievals of ammonia in Jupiter's upper troposphere, Icarus, 182(1), 169-180.\nAllison, M. (2000), A similarity model for the windy jovian thermocline, Planetary and Space Science, 48(7-8), 753-774.\nAsplund, M., N. Grevesse, A. J. Sauval, and P. Scott (2009), The Chemical Composition of the Sun, Annu Rev Astron Astr, 47, 481-522.\nBellotti, A., P. G. Steffes, and G. Chinsomboom (2016), Laboratory measurements of the 5-20 cm wavelength opacity of ammonia, water vapor, and methane under simulated conditions for the deep jovian atmosphere, Icarus, 280, 255-267.\nBjoraker, G. L., M. H. Wong, I. de Pater, and M. Adamkovics (2015), Jupiter's Deep Cloud Structure Revealed Using Keck Observations of Spectrally Resolved Line Shapes, Astrophys J, 810(2).\nBolton, S., et al. (2017), Jupiter’s interior and deep atmosphere: the first close polar pass with the Juno spacecraft, submitted to Science.\nBrown, S. T., M. A. Janssen, and S. Misra (2017), Performance Analysis of the Juno Microwave Radiometer in Jupiter Orbit, This Issue.\nde Pater, I., and S. T. Massie (1985), Models of the Millimeter-Centimeter Spectra of the Giant Planets, Icarus, 62(1), 143-171.\nde Pater, I., D. Dunn, P. Romani, and K. Zahnle (2001), Reconciling Galileo probe data and ground-based radio observations of ammonia on Jupiter, Icarus, 149(1), 66-78.\nde Pater, I., R. J. Sault, B. Butler, D. DeBoer, and M. H. Wong (2016), Peering through Jupiter's clouds with radio spectral imaging, Science, 352(6290), 1198-1201.\nFletcher, L. N., T. Greathouse, G. Orton, J. Sinclair, R. Giles, P. Irwin, and T. Encrenaz (2016), Mid-infrared mapping of Jupiter’s temperatures, aerosol opacity and chemical distributions with IRTF/TEXES, Icarus, 278, 128-161.\nFolkner, W. M., R. Woo, and S. Nandi (1998), Ammonia abundance in Jupiter's atmosphere derived from the attenuation of the Galileo probe's radio signal, J Geophys Res-Planet, 103(E10), 22847-22855.\nGierasch, P. J., B. J. Conrath, and J. A. Magalhaes (1986), Zonal Mean Properties of Jupiter Upper Troposphere from Voyager Infrared Observations, Icarus, 67(3), 456-483.\nGoodman, J., and J. Weare (2010), Ensemble Samplers with Affine Invariance, Comm App Math Com Sc, 5(1), 65-80.\nHanley, T. R., P. G. Steffes, and B. M. Karpowicz (2009), A new model of the hydrogen and helium-broadened microwave opacity of ammonia based on extensive laboratory measurements, Icarus, 202(1), 316-335.\nHastings, W. K. (1970), Monte-Carlo Sampling Methods Using Markov Chains and Their Applications, Biometrika, 57(1), 97-\u0026.\nIngersoll, A. P., M. Allison, A. Bellotti, S. J. Bolton, M. A. Janssen, C. Li, J. Lunine, and G. Orton (2017), Implications of the ammonia distribution on Jupiter from 1 to 100 bars as measured by the Juno microwave radiometer, submitted to GRL.\nJanssen, M., J. Oswald, S. Brown, S. Gulkis, S. Levin, S. Bolton, M. Allison, S. Atreya, D. Gautier, and A. Ingersoll (2017), MWR: Microwave Radiometer for the Juno Mission to Jupiter, Space Sci Rev, 1-47.\nKaspi, Y., G. R. Flierl, and A. P. Showman (2009), The deep wind structure of the giant planets: Results from an anelastic general circulation model, Icarus, 202(2), 525-542.\nKreisch, C. D., J. A. O'Sullivan, R. E. Arvidson, D. V. Politte, L. He, N. T. Stein, J. Finkel, E. A. Guinness, M. J. Wolff, and M. G. A. Lapotre (2017), Regularization of Mars Reconnaissance Orbiter CRISM along-track oversampled hyperspectral imaging observations of Mars, Icarus, 282, 136-151.\nOrton, G. S., et al. (2017), Multiple-Wavelength Sensing of Jupiter During the Juno Mission’s First Perijove Passage, This Issue.\nQuemerais, E., J. L. Bertaux, O. Korablev, E. Dimarellis, C. Cot, B. R. Sandel, and D. Fussen (2006), Stellar occultations observed by SPICAM on Mars express, J Geophys Res-Planet, 111(E9).\nRodgers, C. D. (2000), Inverse methods for atmospheric sounding: theory and practice, World scientific.\nSchneider, T., and J. J. Liu (2009), Formation of Jets and Equatorial Superrotation on Jupiter, J Atmos Sci, 66(3), 579-601.\nSeiff, A., D. B. Kirk, T. C. D. Knight, R. E. Young, J. D. Mihalov, L. A. Young, F. S. Milos, G. Schubert, R. C. Blanchard, and D. Atkinson (1998), Thermal structure of Jupiter's atmosphere near the edge of a 5-mu m hot spot in the north equatorial belt, J Geophys Res-Planet, 103(E10), 22857-22889.\nSimon-Miller, A. A., B. J. Conrath, P. J. Gierasch, G. S. Orton, R. K. Achterberg, F. M. Flasar, and B. M. Fisher (2006), Jupiter's atmospheric temperatures: From Voyager IRIS to Cassini CIRS, Icarus, 180(1), 98-112.\nTikhonov, A. N., V. I. A. k. Arsenin, and F. John (1977), Solutions of ill-posed problems, Winston Washington, DC.\nWong, M. H., P. R. Mahaffy, S. K. Atreya, H. B. Niemann, and T. C. Owen (2004), Updated Galileo probe mass spectrometer measurements of carbon, oxygen, nitrogen, and sulfur on Jupiter, Icarus, 171(1), 153-170."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Li, C., et al. (2017), The distribution of ammonia on Jupiter from a preliminary inversion of Juno Microwave Radiometer data, Geophys. Res. Lett., 44, doi:10.1002/2017GL073159","other_numbering_system":null,"funders":[{"agency":"NASA/JPL/Caltech","grant_number":""},{"agency":"NASA","grant_number":"NNN12AA01C"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}