{"title":"Pulsed laser-deposited n-Si/NiO_x photoanodes for stable and efficient photoelectrochemical water splitting","uri":"","abstract":"An electrocatalytic and stable nickel oxide (NiO_x) thin layer was successfully deposited on an n-Si (100) substrate by pulsed laser deposition (PLD), acting as a photoanode for efficient photo-oxidation of water under solar illumination. It was revealed that the formed n-Si/NiO_x heterojunction with good Schottky contact could improve photogenerated charge separation, and thus n-Si photoanodes deposited with a 105 nm-thick NiO_x electrocatalytic layer exhibited a photovoltage of ∼350 mV, leading to greatly improved photoelectrochemical performances for water oxidation. The stability of the photoanode was significantly enhanced with the increasing thickness of NiO_x protective layers. This study demonstrates a simple and effective method to enable the use of planar n-Si (100) substrates as efficient and durable photoanodes for practical solar water oxidation.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252829","docid":252829,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263790","fileid":1263790,"datasetid":"document","objectid":252829,"filename":"c7cy00114b.pdf","mime_type":"application/pdf","hash":"bf508a2e562fe2a47d216882ad5dfc06","hash_type":"MD5","filesize":2024425,"mtime":"2017-05-26 16:50:50","url":"http://authors.library.caltech.edu/77805/1/c7cy00114b.pdf"}],"eprintid":77805,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"c7cy00114b.pdf","content":"inpress"},{"id":"http://authors.library.caltech.edu/id/document/252830","docid":252830,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263797","fileid":1263797,"datasetid":"document","objectid":252830,"filename":"c7cy00114b1_si.pdf","mime_type":"application/pdf","hash":"12b747141c5b7e77aa13f4fdd6e0bb75","hash_type":"MD5","filesize":388741,"mtime":"2017-05-26 16:52:59","url":"http://authors.library.caltech.edu/77805/2/c7cy00114b1_si.pdf"}],"eprintid":77805,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"c7cy00114b1_si.pdf","content":"supplemental"}],"note":"© 2017 The Royal Society of Chemistry. \n\nReceived 19th January 2017; Accepted 14th May 2017; First published on 15 May 2017. \n\nThe authors gratefully acknowledge the financial support from the National Natural Science Foundation of China (51672210, 51323011 and 51236007), the Program for New Century Excellent Talents in University (NCET-13-0455), the Natural Science Foundation of Shaanxi Province (2014KW07-02), the Natural Science Foundation of Jiangsu Province (BK 20141212) and the Nano Research Program of Suzhou City (ZXG201442). S. Shen is supported by the Foundation for the Author of National Excellent Doctoral Dissertation of P. R. China (201335), the National Program for Support of Top-notch Young Professionals, and the “Fundamental Research Funds for the Central Universities”. S. S. Mao acknowledges the support from the Shenzhen Peacock Plan (No. 1208040050847074).","id":77805,"rev_number":14,"userid":18,"eprint_dir":"disk0/00/07/78/05","datestamp":"2017-05-26 17:08:16","lastmod":"2017-05-26 17:08:16","status_changed":"2017-05-26 17:08:16","type":"article","metadata_visibility":"show","creators":[{"given":"Lingyun","family":"He","id":"He-Lingyun","orcid":""},{"given":"Wu","family":"Zhou","id":"Zhou-Wu","orcid":""},{"given":"Dongping","family":"Cai","id":"Cai-Dongping","orcid":""},{"given":"Samuel S.","family":"Mao","id":"Mao-Samuel-S","orcid":""},{"given":"Ke","family":"Sun","id":"Sun-Ke","orcid":"0000-0001-8209-364X"},{"given":"Shaohua","family":"Shen","id":"Shen-Shaohua","orcid":"0000-0001-8536-7386"}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-15","date_type":"inpress","publication":"Catalysis Science and Technology","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170526-095044384","refereed":true,"issn":"2044-4753","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170526-095044384","related_url":[{"url":"http://dx.doi.org/10.1039/c7cy00114b","type":"doi","description":"Article"},{"url":"http://pubs.rsc.org/en/Content/ArticleLanding/2017/CY/C7CY00114B","type":"pub","description":"Article"}],"referencetext":["M. I. Hoffert, Science, 2010, 329, 1292–1294 CrossRef CAS PubMed .\n2.S. J. Davis, K. Caldeira and H. D. Matthews, Science, 2010, 329, 1330–1333 CrossRef CAS PubMed .\n3.J. Hill, E. Nelson, D. Tilman, S. Polasky and D. Tiffany, Proc. Natl. Acad. Sci. U. S. A., 2006, 103, 11206–11210 CrossRef CAS PubMed .\n4.N. S. Lewis and D. G. Nocera, Energy Environ. Sci., 2006, 103, 15729–15735 CrossRef CAS PubMed .\n5.J. Hou, Z. Wang, C. Yang, H. Cheng, S. Jiao and H. Zhu, Energy Environ. Sci., 2013, 6, 3322–3330 CAS .\n6.J. Hou, C. Yang, H. Cheng, S. Jiao, O. Takeda and H. Zhu, Energy Environ. Sci., 2014, 7, 3758–3768 CAS .\n7.J. Hou, H. Cheng, O. Takeda and H. Zhu, Energy Environ. Sci., 2015, 8, 1348–1357 CAS .\n8.A. Fujishima and K. Honda, Nature, 1972, 238, 37–38 CrossRef CAS PubMed .\n9.K. Sun, S. H. Shen, Y. Q. Liang, P. E. Burrows, S. S. Mao and D. L. Wang, Chem. Rev., 2014, 114, 8662–8719 CrossRef CAS PubMed .\n10.M. J. Kenney, M. Gong, Y. G. Li, J. Z. Wu, J. Feng, M. Lanza and H. J. Dai, Science, 2013, 342, 836–840 CrossRef CAS PubMed .\n11.J. C. Hill, A. T. Landers and J. A. Switzer, Nat. Mater., 2015, 14, 1150–1156 CrossRef CAS PubMed .\n12.N. C. Strandwitz, D. J. Comstock, R. L. Grimm, A. C. Nichols-Nielander, J. Elam and N. S. Lewis, J. Phys. Chem. C, 2013, 117, 4931–4936 CAS .\n13.M. T. Mayer, C. Du and D. W. Wang, J. Am. Chem. Soc., 2012, 134, 12406–12409 CrossRef CAS PubMed .\n14.X. P. Qi, G. W. She, X. Huang, T. P. Zhang, H. M. Wang, L. X. Mu and W. S. Shi, Nanoscale, 2014, 6, 3182–3189 RSC .\n15.C. R. Cox, M. T. Winkler, J. J. H. Pijpers, T. Buonassisi and D. G. Nocera, Energy Environ. Sci., 2013, 6, 532–538 CAS .\n16.X. H. Zhou, R. Liu, K. Sun, K. M. Papadantonakis, B. S. Brunschwigad and N. S. Lewis, Energy Environ. Sci., 2016, 9, 892–897 CAS .\n17.K. Sun, X. L. Pang, S. H. Shen, X. Q. Qian, J. S. Cheung and D. L. Wang, Nano Lett., 2013, 13, 2064–2072 CrossRef CAS PubMed .\n18.K. Sun, M. T. McDowell, A. C. Nielander, S. Hu, M. R. Shaner, F. Yang, B. S. Brunschwig and N. S. Lewis, J. Phys. Chem. Lett., 2015, 6, 592–598 CrossRef CAS PubMed .\n19.J. J. H. Pijpers, M. T. Winkler, Y. Surendranath, T. Buonassisi and D. G. Nocera, Proc. Natl. Acad. Sci. U. S. A., 2011, 108, 10056–10061 CrossRef CAS PubMed .\n20.Y. J. Hwang, A. Boukai and P. D. Yang, Nano Lett., 2009, 9, 410–415 CrossRef CAS PubMed .\n21.T. J. LaTempa, S. Rani, N. Z. Bao and C. A. Grimes, Nanoscale, 2012, 4, 2245–2250 RSC .\n22.S. Hu, M. R. Shaner, J. A. Beardslee, M. Lichterman, B. S. Brunschwig and N. S. Lewis, Science, 2014, 344, 1005–1009 CrossRef CAS PubMed .\n23.R. H. Coridan, M. Shaner, C. Wiggenhorn, B. S. Brunschwig and N. S. Lewis, J. Phys. Chem. C, 2013, 117, 6949–6957 CAS .\n24.R. H. Coridan, K. A. Arpin, B. S. Brunschwig, P. V. Braun and N. S. Lewis, Nano Lett., 2014, 14, 2310–2317 CrossRef CAS PubMed .\n25.M. M. Shi, X. W. Pan, W. M. Qiu, D. X. Zheng, M. S. Xu and H. Z. Chen, Int. J. Hydrogen Energy, 2011, 36, 15153–15159 CrossRef CAS .\n26.A. Kargar, K. Sun, Y. Jing, C. Choi, H. S. Jeong, Y. C. Zhou, K. Madsen, P. Naughton, S. Jin, G. Y. Jung and D. L. Wang, Nano Lett., 2013, 13, 3017–3022 CrossRef CAS PubMed .\n27.K. Sun, S. H. Shen, J. S. Cheung, X. L. Pang, N. Park, J. G. Zhou, Y. F. Hu, Z. L. Sun, S. Y. Noh, C. T. Riley, P. K. L. Yu, S. Jin and D. L. Wang, Phys. Chem. Chem. Phys., 2014, 16, 4612–4625 RSC .\n28.B. Mei, B. Seger, T. Pedersen, M. Malizia, O. Hansen, I. Chorkendorff and P. C. K. Vesborg, J. Phys. Chem. Lett., 2014, 5, 1948–1952 CrossRef CAS PubMed .\n29.M. G. Kast, L. J. Enman, N. J. Gurnon, A. Nadarajah and S. W. Boettcher, ACS Appl. Mater. Interfaces, 2014, 6, 22830–22837 CAS .\n30.X. J. Li, W. H. Lu, W. L. Dong, Q. Chen, D. Wu, W. Z. Zhou and L. W. Chen, Nanoscale, 2013, 5, 5257–5261 RSC .\n31.T. Yang, H. Wang, X. M. Ou, C. S. Lee and X. H. Zhang, Adv. Mater., 2012, 24, 6199–6203 CrossRef CAS PubMed .\n32.J. M. Spurgeon, S. W. Boettcher, M. D. Kelzenberg, B. S. Brunschwig, H. A. Atwater and N. S. Lewis, Adv. Mater., 2010, 22, 3277–3281 CrossRef CAS PubMed .\n33.B. Fabre, G. P. Lopinski and D. D. M. Wayner, J. Phys. Chem. B, 2003, 107, 14326–14335 CrossRef CAS .\n34.Q. Ding, F. Meng, C. R. English, M. Cabán-Acevedo, M. J. Shearer, D. Liang, A. S. Daniel, R. J. Hamers and S. Jin, J. Am. Chem. Soc., 2014, 136, 8504–8507 CrossRef CAS PubMed .\n35.C. C. L. McCrory, S. H. Jung, J. C. Peters and T. F. Jaramillo, J. Am. Chem. Soc., 2013, 135, 16977–16987 CrossRef CAS PubMed .\n36.L. Trotochaud, J. K. Ranney, K. N. Williams and S. W. Boettcher, J. Am. Chem. Soc., 2012, 134, 17253–17261 CrossRef CAS PubMed .\n37.K. Sun, N. Park, Z. Sun, J. Zhou, J. Wang, X. Pang, S. H. Shen, S. Y. Noh, Y. Jing, S. Jin, P. Yu and D. L. Wang, Energy Environ. Sci., 2012, 5, 7872–7877 CAS .\n38.X. H. Zhou, R. Liu, K. Sun, D. Friedrich, M. T. McDowell, F. Yang, S. T. Omelchenko, F. H. Saadi, A. C. Nielander, S. Yalamanchili, K. M. Papadantonakis, B. S. Brunschwig and N. S. Lewis, Energy Environ. Sci., 2015, 8, 2644–2649 CAS .\n39.S. Tripathi, R. J. Choudhary, A. Tripathi, V. Baranwal, A. C. Pandey, J. W. Gerlach, C. Dar and D. Kanjilal, Nucl. Instrum. Methods Phys. Res., Sect. B, 2008, 266, 1533–1536 CrossRef CAS .\n40.D. H. Lowndes, D. B. Geohegan, A. A. Puretzky, D. P. Norton and C. M. Rouleau, Science, 1996, 273, 898–903 CAS .\n41.D. B. Chrisey and G. K. Hubler, Pulsed Laser Deposition of Thin Films, Wiley, New York, 1994, p. 327 Search PubMed .\n42.M. C. Biesinger, B. P. Payne, L. W. M. Lau, A. Gerson and R. S. C. Smart, Surf. Interface Anal., 2009, 41, 324–332 CrossRef CAS .\n43.L. Trotochaud, S. L. Young, J. K. Ranney and S. W. Boettcher, J. Am. Chem. Soc., 2014, 136, 6744–6753 CrossRef CAS PubMed .\n44.K. M. H. Young and T. W. Hamann, Chem. Commun., 2014, 50, 8727–8730 RSC .\n45.J. W. Lang, L. B. Kong, W. J. Wu, Y. C. Luo and L. Kang, Chem. Commun., 2008, 4213–4215 RSC .\n46.M. E. G. Lyons and M. P. Brandon, Int. J. Electrochem. Sci., 2008, 3, 1386–1424 CAS .\n47.J. H. Kim, K. Zhu, Y. F. Yan, C. L. Perkins and A. J. Frank, Nano Lett., 2010, 10, 4099–4104 CrossRef CAS PubMed .\n48.M. Wehrens-Dijksma and P. H. L. Notten, Electrochim. Acta, 2006, 51, 3609–3621 CrossRef CAS .\n49.K. W. Nam, W. S. Yoon and K. B. Kim, Electrochim. Acta, 2002, 47, 3201–3209 CrossRef CAS .\n50.G. A. Niklasson and C. G. Granqvist, J. Mater. Chem., 2007, 17, 127–156 RSC .\n51.L. Trotochaud, T. J. Mills and S. W. Boettcher, J. Phys. Chem. Lett., 2013, 4, 931–935 CrossRef CAS PubMed .\n52.S. Bai, M. T. Cao, Y. Z. Jin, X. L. Dai, X. Y. Liang, Z. Z. Ye, M. Li, J. P. Cheng, X. Z. Xiao, Z. W. Wu, Z. H. Xia, B. Q. Sun, E. G. Wang, Y. Q. Mo, F. Gao and F. L. Zhang, Adv. Energy Mater., 2014, 4, 1301460 CrossRef .\n53.B. Mei, A. A. Permyakova, R. Frydendal, D. Bae, T. Pedersen, P. Malacrida, O. Hansen, I. E. L. Stephens, P. C. K. Vesborg, B. Seger and I. Chorkendorff, J. Phys. Chem. Lett., 2014, 5, 3456–3461 \n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"National Natural Science Foundation of China","grant_number":"51672210"},{"agency":"National Natural Science Foundation of China","grant_number":"51323011"},{"agency":"National Natural Science Foundation of China","grant_number":"51236007"},{"agency":"Program for New Century Excellent Talents in University","grant_number":"NCET-13-0455"},{"agency":"Natural Science Foundation of Shaanxi Province","grant_number":"2014KW07-02"},{"agency":"Natural Science Foundation of Jiangsu Province","grant_number":"BK 20141212"},{"agency":"Nano Research Program of Suzhou City","grant_number":"ZXG201442"},{"agency":"Foundation for the Author of National Excellent Doctoral Dissertation","grant_number":"201335"},{"agency":"National Program for Support of Top-notch Young Professionals","grant_number":""},{"agency":"Fundamental Research Funds for the Central Universities","grant_number":""},{"agency":"Shenzhen Peacock Plan","grant_number":"1208040050847074"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["JCAP"]}