{"title":"Outstanding hydrogen evolution reaction catalyzed by porous nickel diselenide electrocatalysts","uri":"","abstract":"To relieve our strong reliance on fossil fuels and to reduce greenhouse effects, there is an ever-growing interest in using electrocatalytic water splitting to produce green, renewable, and environment-benign hydrogen fuel via the hydrogen evolution reaction. For commercially feasible water electrolysis, it is imperative to develop electrocatalysts that perform as efficiently as Pt but using only earth-abundant commercial materials. However, the highest performance current catalysts consist of nanostructures made by using complex methods. Here we report a porous nickel diselenide (NiSe_2) catalyst that is superior for water electrolysis, exhibiting much better catalytic performance than most first-row transition metal dichalcogenide-based catalysts, well-studied MoS_2, and WS_2-based catalysts. Indeed NiSe2 performs comparably to the state-of-the-art Pt catalysts. We fabricate NiSe_2 directly from commercial nickel foam by acetic acid-assisted surface roughness engineering. To understand the origin of the high performance, we use first-principles calculations to identify the active sites. This work demonstrates the commercial possibility of hydrogen production via water electrolysis using porous bulk NiSe_2 catalysts.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252834","docid":252834,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263836","fileid":1263836,"datasetid":"document","objectid":252834,"filename":"c7ee00802c.pdf","mime_type":"application/pdf","hash":"0112c0525196baa85c1f9c7efb5ee9f2","hash_type":"MD5","filesize":2625503,"mtime":"2017-05-26 17:14:39","url":"http://authors.library.caltech.edu/77809/1/c7ee00802c.pdf"}],"eprintid":77809,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"c7ee00802c.pdf","content":"inpress"},{"id":"http://authors.library.caltech.edu/id/document/252835","docid":252835,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1263841","fileid":1263841,"datasetid":"document","objectid":252835,"filename":"c7ee00802c1_si.pdf","mime_type":"application/pdf","hash":"aefbc1c8689bdb19aaf84b772885fe3b","hash_type":"MD5","filesize":846397,"mtime":"2017-05-26 17:17:13","url":"http://authors.library.caltech.edu/77809/2/c7ee00802c1_si.pdf"}],"eprintid":77809,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"c7ee00802c1_si.pdf","content":"supplemental"}],"note":"© 2017 The Royal Society of Chemistry. \n\nReceived 22nd March 2017; Accepted 17th May 2017; First published on 17th May 2017. \n\nThis project was mainly funded by the US Defense Threat Reduction Agency (DTRA) under grant FA 7000-13-1-0001, and the US Department of Energy under a grant DE-SC0010831. J. S. and S. C. also acknowledge the support from TcSUH as the TcSUH Robert A. Welch Professorships in High Temperature Superconducting (HTSg) and Chemical Materials (E-0001). Y. L. acknowledges the support from Resnick Prize Postdoctoral Fellowship at Caltech. W. A. G. and Y. L. acknowledge support from NSF (CBET 1512759). The calculations were performed on PEREGRINE (NREL), XSEDE (NSF ACI-1053575), and NERSC (DOE DE-AC02-05CH11231). J. M. B. acknowledges the support from the National Science Foundation (CAREER Award ECCS-1240510) and the Robert A. Welch Foundation (E-1728). ","id":77809,"rev_number":12,"userid":18,"eprint_dir":"disk0/00/07/78/09","datestamp":"2017-05-26 17:25:48","lastmod":"2017-05-26 17:25:48","status_changed":"2017-05-26 17:25:48","type":"article","metadata_visibility":"show","creators":[{"given":"Haiqing","family":"Zhou","id":"Zhou-Haiqing","orcid":""},{"given":"Fang","family":"Yu","id":"Yu-Fang","orcid":""},{"given":"Yuanyue","family":"Liu","id":"Liu-Yuanyue","orcid":"0000-0002-5880-8649"},{"given":"Jingying","family":"Sun","id":"Sun-Jingying","orcid":""},{"given":"Zhuan","family":"Zhu","id":"Zhu-Zhuan","orcid":""},{"given":"Ran","family":"He","id":"He-Ran","orcid":""},{"given":"Jiming","family":"Bao","id":"Bao-Jiming","orcid":"0000-0002-6819-0117"},{"given":"William A., III","family":"Goddard","id":"Goddard-W-A-III","orcid":"0000-0003-0097-5716"},{"given":"Shuo","family":"Chen","id":"Chen-Shuo","orcid":""},{"given":"Zhifeng","family":"Ren","id":"Ren-Zhifeng","orcid":"0000-0001-8233-3332"}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-17","date_type":"inpress","publication":"Energy and Environmental Science","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170526-101433912","refereed":true,"issn":"1754-5692","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170526-101433912","related_url":[{"url":"http://dx.doi.org/10.1039/c7ee00802c","type":"doi","description":"Article"},{"url":"http://pubs.rsc.org/en/Content/ArticleLanding/2017/EE/C7EE00802C#!divAbstract","type":"pub","description":"Article"}],"referencetext":["1.J. O. M. Bockris, Int. J. Hydrogen Energy, 2002, 27, 731–740 CrossRef CAS .\n2.H. B. Gray, Nat. Chem., 2009, 1, 7 CrossRef CAS PubMed .\n3.M. S. Dresselhaus and I. L. Thomas, Nature, 2001, 414, 332–337 CrossRef CAS PubMed .\n4.M. S. Faber and S. Jin, Energy Environ. Sci., 2014, 7, 3519–3542 CAS .\n5.C. G. Morales-Guio, L. A. Stern and X. L. Hu, Chem. Soc. Rev., 2014, 43, 6555–6569 RSC .\n6.M. R. Gao, Y. F. Xu, J. Jiang and S. H. Yu, Chem. Soc. Rev., 2013, 42, 2986–3017 RSC .\n7.Y. Y. Liu, J. J. Wu, K. P. Hackenberg, J. Zhang, Y. Wang, Y. C. Yang, K. Keyshar, J. Gu, T. Ogitsu, R. Vajtai, J. Lou, P. M. Ajayan, B. C. Wood and B. I. Yakobson, 2016, ar-Xiv:1608.05755.\n8.M. Cabán-Acevedo, M. L. Stone, J. R. Schmidt, J. G. Thomas, Q. Ding, H. C. Chang, M. L. Tsai, J. H. He and S. Jin, Nat. Mater., 2015, 14, 1245–1251 CrossRef PubMed .\n9.F. M. Wang, J. S. Li, F. Wang, T. A. Shifa, Z. Z. Cheng, Z. X. Wang, K. Xu, X. Y. Zhan, Q. S. Wang, Y. Huang, C. Jiang and J. He, Adv. Funct. Mater., 2015, 25, 6077–6083 CrossRef CAS .\n10.M. A. Lukowski, A. S. Daniel, C. R. English, F. Meng, A. Forticaux, R. J. Hamers and S. Jin, Energy Environ. Sci., 2014, 7, 2608–2613 CAS .\n11.J. Lin, Z. W. Peng, G. Wang, D. Zakhidov, E. Larios, M. J. Yacaman and J. M. Tour, Adv. Energy Mater., 2014, 4, 1301875 CrossRef .\n12.D. J. Li, U. N. Maiti, J. Lim, D. S. Choi, W. J. Lee, Y. Oh, G. Y. Lee and S. O. Kim, Nano Lett., 2014, 14, 1228–1233 CrossRef CAS PubMed .\n13.D. S. Kong, H. T. Wang, Z. Y. Lu and Y. Cui, J. Am. Chem. Soc., 2014, 136, 4897–4900 CrossRef CAS PubMed .\n14.X. D. Wang, Y. F. Xu, H. S. Rao, W. J. Xu, H. Y. Chen, W. X. Zhang, D. B. Kuang and C. Y. Su, Energy Environ. Sci., 2016, 9, 1468–1475 CAS .\n15.Z. P. Chen, W. C. Ren, L. B. Gao, B. L. Liu, S. F. Pei and H. M. Cheng, Nat. Mater., 2011, 10, 424–428 CrossRef CAS PubMed .\n16.H. Q. Zhou, Y. M. Wang, R. He, F. Yu, J. Y. Sun, F. Wang, Y. C. Lan, Z. F. Ren and S. Chen, Nano Energy, 2016, 20, 29–36 CrossRef CAS .\n17.X. G. Wang, Y. V. Kolen’ko, X. Q. Bao, K. Kovnir and L. F. Liu, Angew. Chem., Int. Ed., 2015, 54, 8188–8192 CrossRef CAS PubMed .\n18.H. Q. Zhou, F. Yu, Y. F. Huang, J. Y. Sun, Z. Zhu, R. J. Nielsen, R. He, J. M. Bao, W. A. Goddard III, S. Chen and Z. F. Ren, Nat. Commun., 2016, 7, 12765 CrossRef CAS PubMed .\n19.H. I. Karunadasa, E. Montalvo, Y. J. Sun, M. Majda, J. R. Long and C. J. Chang, Science, 2012, 335, 698–702 CrossRef CAS PubMed .\n20.E. J. Popczun, C. G. Read, C. W. Roske, N. S. Lewis and R. E. Schaak, Angew. Chem., Int. Ed., 2014, 53, 5427–5430 CrossRef CAS PubMed .\n21.M. R. Gao, J. X. Liang, Y. R. Zheng, Y. F. Xu, J. Jiang, Q. Gao, J. Li and S. H. Yu, Nat. Commun., 2015, 6, 5982 CrossRef CAS PubMed .\n22.J. Kibsgaard, Z. B. Chen, B. N. Reinecke and T. F. Jaramillo, Nat. Mater., 2012, 11, 963–969 CrossRef CAS PubMed .\n23.R. Wu, J. F. Zhang, Y. M. Shi, D. L. Liu and B. Zhang, J. Am. Chem. Soc., 2015, 137, 6983–6986 CrossRef CAS PubMed .\n24.J. Q. Tian, Q. Liu, A. M. Asiri and X. P. Sun, J. Am. Chem. Soc., 2014, 136, 7587–7590 CrossRef CAS PubMed .\n25.B. Hinnemann, P. G. Moses, J. Bonde, K. P. Jørgensen, J. H. Nielsen, S. Horch, I. Chorkendorff and J. K. Nørskov, J. Am. Chem. Soc., 2005, 127, 5308–5309 CrossRef CAS PubMed .\n26.D. S. Kong, J. J. Cha, H. T. Wang, H. R. Lee and Y. Cui, Energy Environ. Sci., 2013, 6, 3553–3558 CAS .\n27.F. M. Wang, Y. C. Li, T. A. Shifa, K. L. Liu, F. Wang, Z. X. Wang, P. Xu, Q. S. Wang and J. He, Angew. Chem., Int. Ed., 2016, 55, 6919–6924 CrossRef CAS PubMed .\n28.S. J. Peng, L. L. Li, X. P. Han, W. P. Sun, M. Srinivasan, S. G. Mhaisalkar, F. Y. Cheng, Q. Y. Yan, J. Chen and S. Ramakrishna, Angew. Chem., Int. Ed., 2014, 126, 12802–12807 CrossRef .\n29.D. Y. Wang, M. Gong, H. L. Chou, C. J. Pan, H. A. Chen, Y. Wu, M. C. Lin, M. Guan, J. Yang, C. W. Chen, Y. L. Wang, B. J. Hwang, C. C. Chen and H. J. Dai, J. Am. Chem. Soc., 2015, 137, 1587–1592 CrossRef CAS PubMed .\n30.C. Heras and F. A. Rueda, J. Phys.: Condens. Matter, 2000, 12, 5317–5324 CrossRef .\n31.H. Q. Zhou, F. Yu, J. Y. Sun, H. T. Zhu, I. K. Mishra, S. Chen and Z. F. Ren, Nano Lett., 2016, 16, 7604–7609 CrossRef CAS PubMed .\n32.Y. H. Li, P. F. Liu, L. F. Pan, H. F. Wang, Z. Z. Yang, L. R. Zheng, P. Hu, H. J. Zhao, L. Gu and H. G. Yang, Nat. Commun., 2015, 6, 8064 CrossRef CAS PubMed .\n33.Y. J. Tang, M. R. Gao, C. H. Liu, S. L. Li, H. L. Jiang, Y. Q. Lan, M. Han and S. H. Yu, Angew. Chem., Int. Ed., 2015, 54, 12928–12932 CrossRef CAS PubMed .\n34.M. S. Faber, R. Dziedzic, M. A. Lukowski, N. S. Kaiser, Q. Ding and S. Jin, J. Am. Chem. Soc., 2014, 136, 10053–10061 CrossRef CAS PubMed .\n35.J. K. Nørskov, T. Bligaard, A. Logadottir, J. R. Kitchin, J. G. Chen, S. Pandelov and U. Stimming, J. Electrochem. Soc., 2005, 152, J23–J26 CrossRef .\n36.A. Hung, J. Muscat, I. Yarovsky and S. P. Russo, Surf. Sci., 2002, 513, 511–524 CrossRef CAS .\n37.Y. Y. Liu, Y. M. Wang, B. I. Yakobson and B. C. Wood, Phys. Rev. Lett., 2014, 113, 028304 CrossRef PubMed .\n38.Y. Y. Liu, B. V. Merinov and W. A. Goddard III, Proc. Natl. Acad. Sci. U. S. A., 2016, 113, 3735–3739 \n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Defense Threat Reduction Agency (DTRA)","grant_number":"FA 7000-13-1-0001"},{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0010831"},{"agency":"Texas Center for Superconductivity","grant_number":""},{"agency":"Resnick Sustainability Institute","grant_number":""},{"agency":"NSF","grant_number":"CBET-1512759"},{"agency":"NSF","grant_number":"ACI-1053575"},{"agency":"Department of Energy (DOE)","grant_number":"DE-AC02-05CH11231"},{"agency":"NSF","grant_number":"ECCS-1240510"},{"agency":"Robert A. Welch Foundation","grant_number":"E-1728"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["Resnick Sustainability Institute"]}