{"title":"Geologic map of the east-central Meadow Valley Mountains, and implications for reconstruction of the Mormon Peak detachment, Nevada","uri":"","abstract":"The role of low-angle faults in accommodating extension within the upper crust remains controversial because the existence of these faults markedly defies extant continuum theories of how crustal faults form, and once initiated, how they continue to slip. Accordingly, for many proposed examples, basic kinematic problems like slip direction, dip angle while active, and magnitude of offset are keenly debated. A well-known example is the Miocene Mormon Peak detachment and overlying Mormon Peak allochthon of southern Nevada (USA), whose origin and evolution have been debated for several decades. Here, we use geologic mapping in the Meadow Valley Mountains to help define the geometry and kinematics of emplacement of the Mormon Peak allochthon, the hanging wall of the Mormon Peak detachment. Pre-exten­sion structural markers, inherited from the east-vergent Sevier thrust belt of Meso­zoic age, are well suited to constrain the geometry and kine­matics of the detachment. In this study, we add to these markers a newly mapped Sevier-­age monoclinal flexure preserved in the hanging wall of the detachment. The bounding axial surfaces of the flexure can be readily matched to the base and top of the frontal Sevier thrust ramp, which is exposed in the footwall of the detachment to the east in the Mormon Mountains and Tule Springs Hills. Multiple proxies for the slip direction of the detachment, including the mean tilt direction of hanging wall fault blocks, the trend of striations measured on the fault plane, and other structural features, indicate that it is approximately S77°W (257°). Given the observed structural separation lines between the hanging wall and footwall, this slip direction indicates 12–13 km of horizontal displacement on the detachment (14–15 km net slip), lower than a previous estimate of 20–22 km, which was based on erroneous assumptions in regard to the geometry of the thrust system. Based on a new detailed map compilation of the region and recently published low-temperature thermochronologic data, palinspastic constraints also preclude earlier suggestions that the Mormon Peak allochthon is a composite of diachronously emplaced, surficial landslide deposits. Although earlier suggestions that the initiation angle of the detachment in the central Mormon Mountains is ∼ 20°–25° remain valid, the geometry of the Sevier-age monocline in the Meadow Valley Mountains and other structural data suggest that the initial dip of the detachment steepens toward the north beneath the southernmost Clover Mountains, where the hanging wall includes kilometer-scale accumulations of volcanic and volcaniclastic strata.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252859","docid":252859,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1264253","fileid":1264253,"datasetid":"document","objectid":252859,"filename":"GES01148.1.full.pdf","mime_type":"application/pdf","hash":"dc97ab5fd845e0a3838cacda2b2beb8e","hash_type":"MD5","filesize":8640906,"mtime":"2017-05-30 14:55:36","url":"http://authors.library.caltech.edu/77818/1/GES01148.1.full.pdf"}],"eprintid":77818,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"GES01148.1.full.pdf","content":"inpress"}],"note":"© 2017 Geological Society of America. \n\nReceived 1 October 2014; Revision received 30 November 2016; Accepted 5 April 2017. \n\nThis research was supported by NSF Grant EAR-1250565 awarded to B. Wernicke and J. Eiler, and by the Caltech Tectonics Observatory of the Gordon and Betty Moore Foundation.","id":77818,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/78/18","datestamp":"2017-06-05 20:24:08","lastmod":"2017-06-05 20:24:08","status_changed":"2017-06-05 20:24:08","type":"article","metadata_visibility":"show","creators":[{"given":"E.","family":"Swanson","id":"Swanson-E","orcid":""},{"given":"B. P.","family":"Wernicke","id":"Wernicke-B-P","orcid":"0000-0002-7659-8358"}],"ispublished":"inpress","subjects":null,"full_text_status":"none","keywords":"","date":"2017-05-26","date_type":"inpress","publication":"Geosphere","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170530-075528473","refereed":true,"issn":"1553-040X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170530-075528473","related_url":[{"url":"http://dx.doi.org/10.1130/GES01148.1","type":"doi","description":"Article"},{"url":"http://geosphere.gsapubs.org/content/early/2017/05/26/GES01148.1","type":"pub","description":"Article"},{"url":"http://geosphere.geoscienceworld.org/content/early/2017/05/26/GES01148.1","type":"pub","description":"Article"}],"referencetext":["Abers, G.A., 1991, Possible seismogenic shallow-dipping normal faults in the Woodlark-D’Entrecasteaux\nextensional province, Papua New Guinea: Geology, v. 19, p. 1205–1208, doi: 10 .1130\n/0091 -7613 (1991)019 \u003c1205: PSSDNF\u003e2 .3 .CO;2 .\nAllmendinger, R.W., Cardozo, N.C., and Fisher, D., 2013, Structural Geology Algorithms: Vectors\nand Tensors: Cambridge, UK, Cambridge University Press, 289 p.\nAnders, M.H., Christie-Blick, N., and Walker, C.D., 2006, Distinguishing between rooted and rootless\ndetachments: A case study from the Mormon Mountains of southeastern Nevada: The\nJournal of Geology, v. 114, p. 645–664, doi: 10 .1086 /507612 .\nAnderson, R.E., 1971, Thin-skin distension in Tertiary rocks of southeastern Nevada: Geological Society\nof America Bulletin, v. 82, p. 43–58, doi: 10 .1130 /0016 -7606 (1971)82 [43: TSDITR]2 .0 .CO;2 .\nAnderson, R.E., and Barnhard, T.P., 1993, Aspects of three-dimensional strain at the margin of\nthe extensional orogen, Virgin River depression area, Nevada, Utah, and Arizona: Geological\nSociety of America Bulletin, v. 105, p. 1019–1052, doi: 10 .1130 /0016 -7606 (1993)105 \u003c1019:\nAOTDSA\u003e2 .3 .CO;2 .\nAnderson, R.E., Felger, T.J., Diehl, S.F., Page, W.R., and Workman, J.B., 2010, Integration of tectonic,\nsedimentary, and geohydrologic processes leading to a small-scale extension model\nfor the Mormon Mountains area north of Lake Mead, Lincoln County, Nevada, in Umhoefer,\nP.J., Beard, L.S., and Lamb, M.A., eds., Miocene Tectonics of the Lake Mead Region, Central\nBasin and Range: Geological Society of America Special Paper 463, p. 395–426, doi: 10 .1130\n/2010 .2463 (18) .\nArmstrong, R.L., 1970, Geochronology of Tertiary igneous rooks, eastern Basin and Range province,\nwestern Utah, eastern Nevada, and vicinity, USA: Geochimica et Cosmochimica Acta,\nv. 34, p. 203–232, doi: 10 .1016 /0016 -7037 (70)90007 -4 .\nAxen, G.J., 1984, Thrusts in the eastern Spring Mountains, Nevada: Geometry and mechanical\nimplications: Geological Society of America Bulletin, v. 95, p. 1202–1207, doi: 10 .1130 /0016\n-7606 (1984)95 \u003c1202: TITESM\u003e2 .0 .CO;2 .\nAxen, G.J., 1991, Tertiary extension, magmatism, and thrust reactivation in the southern Great\nBasin, and a mechanical model for detachment faulting [Ph.D. thesis]: Cambridge, Massachusetts,\nHarvard University, 235 p.\nAxen, G.J., 1993, Ramp-flat detachment faulting and low-angle normal reactivation of the Tule\nSprings thrust, southern Nevada: Geological Society of America Bulletin, v. 105, p. 1076–\n1090, doi: 10 .1130 /0016 -7606 (1993)105 \u003c1076: RFDFAL\u003e2 .3 .CO;2 .\nAxen, G.J., 2004, Mechanics of low-angle normal faults, in Karner, G.D., Taylor, B., Driscoll, N.W.,\nand Kohlstedt, D.L., eds., Rheology and Deformation of the Lithosphere at Continental Margins:\nNew York, Columbia University Press, p. 46–91, doi: 10 .7312 /karn12738 -004 .\nAxen, G.J., Wernicke, B.P., Skelly, M.F., and Taylor, W.J., 1990, Mesozoic and Cenozoic tectonics of\nthe Sevier thrust belt in the Virgin River Valley area, southern Nevada, in Wernicke, B.P., ed.,\nBasin and Range Extensional Tectonics near the Latitude of Las Vegas, Nevada: Geological\nSociety of America Memoir 176, p. 123–154, doi: 10 .1130 /MEM176 -p123 .\nBidgoli, T.S., Stockli, D.F., and Walker, J.D., 2015, Low-temperature thermochronologic constraints\non the kinematic histories of the Castle Cliffs, Tule Springs, and Mormon Peak detachments,\nsouthwestern Utah and southeastern Nevada: Geosphere, v. 11, p. 850–867, doi:\n10 .1130 /GES01083 .1 .\nBohannon, R.G., 1983, Mesozoic and Cenozoic tectonic development of the Muddy, North\nMuddy, and northern Black Mountains, Clark County, Nevada, in Miller, D.M., Todd, V.R., and\nHoward, K.A., eds., Tectonic and Stratigraphic Studies in the Eastern Great Basin: Geological\nSociety of America Memoir 157, p. 125–148, doi: 10 .1130 /MEM157 -p125 .\nBurchfiel, B.C., Fleck, R.J., Secor, D.T., Vincelette, R.R., and Davis, G.A., 1974, Geology of the\nSpring Mountains, Nevada: Geological Society of America Bulletin, v. 85, p. 1013–1022, doi:\n10 .1130 /0016 -7606 (1974)85 \u003c1013: GOTSMN\u003e2 .0 .CO;2 .\nBurchfiel, B.C., Wernicke, B., Willemin, J.H., Axen, G.J., and Cameron, S.C., 1982, A new type of\ndecollement thrust: Nature, v. 300, p. 513–515, doi: 10 .1038 /300513a0 .\nBurchfiel, B.C., Cameron, C.S., and Royden, L.H., 1997, Geology of the Wilson Cliffs–Potosi Mountain\nArea, Southern Nevada: International Geology Review, v. 39, p. 830–854, doi: 10 .1080\n/00206819709465304 .\nCardozo, N., and Allmendinger, R.W., 2013, Spherical projections with OSXStereonet: Computers\n\u0026 Geosciences, v. 51, p. 193–205, doi: 10 .1016 /j .cageo .2012 .07 .021 .\nCarpenter, D.G., Carpenter, J.A., Bradley, M.D., Franz, U.A., and Reber, S.J., 1989, Comment on\n“On the role of isostasy in the evolution of normal fault systems”: Geology, v. 17, p. 774–776,\ndoi: 10 .1130 /0091 -7613 (1989)017 \u003c0774: CAROOT\u003e2 .3 .CO;2 .\nCarr, M.D., 1983, Geometry and structural history of the Mesozoic thrust belt in the Goodsprings\ndistrict, southern Spring Mountains, Nevada: Geological Society of America Bulletin, v. 94,\np. 1185–1198, doi: 10 .1130 /0016 -7606 (1983)94 \u003c1185: GASHOT\u003e2 .0 .CO;2 .\nChiaraluce, L., Chiarabba, C., Collettini, C., Puccinini, L., and Cocco, M., 2007, Architecture and\nmechanics of an active low-angle normal fault: Alto Tiberina Fault, northern Apennines,\nItaly: Journal of Geophysical Research, v. 112, B10310, doi: 10 .1029 /2007JB005015 .\nCollettini, C., and Sibson, R.H., 2001, Normal faults, normal friction?: Geology, v. 29, p. 927–930,\ndoi: 10 .1130 /0091 -7613 (2001)029 \u003c0927: NFNF\u003e2 .0 .CO;2 .\nCook, E.F., 1965, Stratigraphy of Tertiary volcanic rocks in eastern Nevada: Nevada Bureau of\nMines and Geology Report 11, 67 p. (incl. geologic map, scale 1:500,000).\nDavis, G.A., Anderson, J.L., Frost, E.G., and Shackelford, T.J., 1980, Mylonitization and detachment\nfaulting in the Whipple-Buckskin-Rawhide Mountains terrane, southeastern California\nand western Arizona, in Crittenden, M.D., Jr., Coney, P.J., and Davis, G.H., eds., Cordilleran\nMetamorphic Core Complexes: Geological Society of America Memoir 153, p. 79–130, doi:\n10 .1130 /MEM153 -p79 .\nDavis, G.H., and Coney, P.J., 1979, Geologic development of Cordilleran metamorphic core complexes:\nGeology, v. 7, p. 120–124, doi: 10 .1130 /0091 -7613 (1979)7 \u003c120: GDOTCM\u003e2 .0 .CO;2 .\nDavis, G.H., and Hardy, J.J., 1981, The Eagle Pass detachment, southeastern Arizona: Product of\nmid-Miocene listric(?) normal faulting in the southern Basin and Range: Geological Society\nof America Bulletin, v. 92, p. 749–762, doi: 10 .1130 /0016 -7606 (1981)92 \u003c749: TEPDSA\u003e2 .0 .CO;2 .\nDiehl, S.F., Anderson, R.E., and Humphrey, J.D., 2010, Fluid flow, solution collapse, and massive\ndissolution at detachment faults, Mormon Mountains, Nevada, in Umhoefer, P.J., Beard, L.S.,\nand Lamb, M.A., eds., Miocene Tectonics of the Lake Mead Region, Central Basin and Range:\nGeological Society of America Special Paper 463, p. 427–441, doi: 10 .1130 /2010 .2463 (19) .\nEkren, E.B., Orkild, P.P., Sargent, K.A., and Dixon, G.L., 1977, Geologic map of Tertiary rocks,\nLincoln County, Nevada: U.S. Geological Survey Miscellaneous Investigations Map I-1041,\nscale 1:250,000.\nElliott, J.R., Walters, R.J., England, P.C., Jackson, J.A., Li, Z., and Parsons, B., 2010, Extension on\nthe Tibetan plateau: Recent normal faulting measured by InSAR and body wave seismology:\nGeophysical Journal International, v. 183, p. 503–535, doi: 10 .1111 /j .1365 -246X .2010 .04754 .x .\nEllis, B.J., 1985, Thin-skinned extension superposed on frontal Sevier thrust faults, Mormon\nMountains, southern Nevada [M.S. thesis]: Syracuse, New York, Syracuse University, 87 p.\nGoddard, E.N., Trask, P.D., De Ford, R.K., Rove, O.N., Singewald, J.T., and Overbeck, R.M., 1948,\nRock-color chart: Boulder, Colorado, Geological Society of America.\nHintze, L.F., 1986, Stratigraphy and structure of the Beaver Dam Mountains, Utah, in Griffin, D.T., and\nPhillips, W.R., eds., Thrusting and Extensional Structures and Mineralization in the Beaver Dam\nMountains, Southwestern Utah: Utah Geological Association Special Publication 15, p. 1–36.\nJackson, J.A., and White, N.J., 1989, Normal faulting in the upper continental crust: Observations\nfrom regions of active extension: Journal of Structural Geology, v. 11, p. 15–36, doi: 10 .1016\n/0191 -8141 (89)90033 -3 .\nJones, J.C., and Stone, R.W., 1920, Deposits in southern Nevada, in Stone, R.W., et al., eds., Gypsum\nDeposits of the United States: U.S. Geological Survey Bulletin 697, p. 155–160.\nLangenheim, R.L., Jr., and Larson, E.R., 1973, Correlation of Great Basin stratigraphic units: Nevada\nBureau of Mines and Geology Bulletin 72, 36 p.\nLister, G.S., and Davis, G.A., 1989, The origin of core complexes and detachment faults formed\nduring Tertiary continental extension in the northern Colorado River region, USA: Journal of\nStructural Geology, v. 11, p. 65–94, doi: 10 .1016 /0191 -8141 (89)90036 -9 .\nLivaccari, R.F., Geissman, J.W., and Reynolds, S.J., 1993, Paleomagnetic evidence for large-magnitude,\nlow-angle normal faulting in a metamorphic core complex: Nature, v. 361, p. 56–59,\ndoi: 10 .1038 /361056a0 .\nLongwell, C.R., Pampeyan, E.H., Bowyer, B., and Roberts, R.J., 1965, Geology and mineral deposits\nof Clark County, Nevada: Nevada Bureau of Mines and Geology Bulletin 62, 218 p.\nMarvin, R.F., Byers, F.M., Mehnert, H.H., Orkild, P.P., and Stern, P.W., 1970, Radiometric ages and\nstratigraphic sequence of volcanic and plutonic rocks, southern Nye and western Lincoln\nCounties, Nevada: Geological Society of America Bulletin, v. 81, p. 2657–2676, doi: 10 .1130\n/0016 -7606 (1970)81 [2657: RAASSO]2 .0 .CO;2 .\nMcNair, A.H., 1951, Paleozoic stratigraphy of part of northwestern Arizona: American Association\nof Petroleum Geologists Bulletin, v. 35, p. 503–541.\nMiller, E.L., Dumitru, T.A., Brown, R.W., and Gans, P.B., 1999, Rapid Miocene slip on the Snake\nRange–Deep Creek Range fault system, east-central Nevada: Geological Society of America\nBulletin, v. 111, p. 886–905, doi: 10 .1130 /0016 -7606 (1999)111 \u003c0886: RMSOTS\u003e2 .3 .CO;2 .\nMirabella, F., Brozzetti, F., Lupattelli, A., and Barchi, M.R., 2011, Tectonic evolution of a low-angle\nextensional fault system from restored cross sections in the Northern Apennines (Italy): Tectonics,\nv. 30, TC6002, doi: 10 .1029 /2011TC002890 .\nNoble, D.C., and McKee, E.H., 1972, Description and K-Ar ages of volcanic units of the Caliente\nvolcanic field, Lincoln County, Nevada, and Washington County, Utah: Isochron/West, no. 5,\np. 17–24.\nNovak, S.W., 1984, Eruptive history of the rhyolitic Kane Springs Wash Volcanic Center, Nevada:\nJournal of Geophysical Research, v. 89, p. 8603–8615, doi: 10 .1029 /JB089iB10p08603 .\nOlmore, S.D., 1971, Style and evolution of thrusts in the region of the Mormon Mountains, Nevada\n[Ph.D. thesis]: Salt Lake City, University of Utah, 213 p.\nPampeyan, E.H., 1993, Geologic map of the Meadow Valley Mountains, Lincoln and Clark Counties,\nNevada: U.S. Geological Survey Miscellaneous Investigation Map I-2173, scale 1:50,000.\nReber, S.J., 1952, Stratigraphy and structure of the south-central and northern Beaver Dam\nMountains, Utah, in Thune, H.W., ed., Cedar City, Utah to Las Vegas, Nevada: Intermountain\nAssociation of Petroleum Geologists Guidebook to the Geology of Utah 7, p. 101–108.\nRigo, A., Lyon-Caen, H., Armijo, R., Deschamps, A., Hatzfeld, D., Markropulous, K., Papadimitriou,\nP., and Kassaras, I., 1996, A microseismic study of the western part of the Gulf of Corinth\n(Greece): Implications for large-scale normal faulting mechanism: Geophysical Journal International,\nv. 126, p. 663–688, doi: 10 .1111 /j .1365 -246X .1996 .tb04697 .x .\nRowley, P.D., Anderson, J.J., and Williams, P.L., 1975, A summary of Tertiary volcanic stratigraphy\nof the southwestern high plateaus and adjacent Great Basin, Utah: U.S. Geological\nSurvey Bulletin 1405-B, 20 p.\nSingleton, J.S., 2013, Development of extension-parallel corrugations in the Buckskin-Rawhide\nmetamorphic core complex, west-central Arizona: Geological Society of America Bulletin,\nv. 125, p. 453–472, doi: 10 .1130 /B30672 .1 .\nSkelly, M.F., 1987, The geology of the Moapa Peak area, southern Mormon Mountains, Clark and\nLincoln Counties, Nevada [M.S. thesis]: Flagstaff, Northern Arizona University, 150 p.\nSpencer, J.E., and Reynolds, S.J., 1991, Tectonics of mid-Tertiary extension along a transect\nthrough west-central Arizona: Tectonics, v. 10, p. 1204–1221, doi: 10 .1029 /91TC01160 .\nSteiger, R.H., and Jäger, E., 1977, Subcommission on Geochronology: Convention on the use of\ndecay constants in geo- and cosmochronology: Earth and Planetary Science Letters, v. 36,\np. 359–362, doi: 10 .1016 /0012 -821X (77)90060 -7 .\nStyron, R.H., and Hetland, E.A., 2014, Estimated likelihood of observing a large earthquake on\na continental low-angle normal fault and implications for low-angle normal fault activity:\nGeophysical Research Letters, v. 41, p. 2342–2350, doi: 10 .1002 /2014GL059335 .\nSwanson, E.M., Wernicke, B.P., Eiler, J.M., and Losh, S., 2012, Temperatures and fluids on faults\nbased on carbonate clumped-isotope thermometry: American Journal of Science, v. 312,\np. 1–21, doi: 10 .2475 /01 .2012 .01 .\nSwanson, E.M., Wernicke, B.P., and Hauge, T.A., 2016, Episodic dissolution, precipitation, and\nslip on the Heart Mountain detachment, Wyoming: The Journal of Geology, v. 124, p. 75–97,\ndoi: 10 .1086 /684253 .\nTaylor, W.J., 1984, Superposition of thin-skinned normal faulting on Sevier orogenic belt thrusts,\nnorthern Mormon Mountains, Lincoln County, Nevada [M.S. thesis]: Syracuse, New York,\nSyracuse University, 80 p.\nTschanz, C.M., and Pampeyan, E.H., 1970, Geology and mineral deposits of Lincoln County, Nevada:\nNevada Bureau of Mines and Geology Bulletin 73, 187 p.\nWalker, C.D., 2008, A gravity slide origin for the Mormon Peak detachment: Re-examining the\nevidence for extreme extension in the Mormon Mountains, southeastern Nevada, U.S.A.\n[Ph.D. thesis]: New York, Columbia University, 690 p.\nWalker, C.D., Anders, M.H., and Christie-Blick, N., 2007, Kinematic evidence for downdip movement\non the Mormon Peak detachment: Geology, v. 35, p. 259–262, doi: 10 .1130 /G23396A .1 .\nWernicke, B., 1982, Processes of extensional tectonics [Ph.D. thesis]: Cambridge, Massachusetts\nInstitute of Technology, 171 p.\nWernicke, B., 1995, Low-angle normal faults and seismicity: A review: Journal of Geophysical\nResearch, v. 100, p. 20,159–20,174, doi: 10 .1029 /95JB01911 .\nWernicke, B., and Axen, G.J., 1988, On the role of isostasy in the evolution of normal fault systems:\nGeology, v. 16, p. 848–851, doi: 10 .1130 /0091 -7613 (1988)016 \u003c0848: OTROII\u003e2 .3 .CO;2 .\nWernicke, B., Walker, J.D., and Beaufait, M.S., 1985, Structural discordance between Neogene\ndetachments and frontal Sevier thrusts, central Mormon Mountains, southern Nevada: Tectonics,\nv. 4, p. 213–246, doi: 10 .1029 /TC004i002p00213 .\nWernicke, B., Snow, J.K., Axen, G.J., Burchfiel, B.C., Hodges, K.V., Walker, J.D., and Guth, P.L.,\n1989, Extensional tectonics in the Basin and Range province between the southern Sierra\nNevada and the Colorado Plateau: American Geophysical Union Field Trip Guidebook T138,\n80 p.\nWong, M.S., and Gans, P.B., 2008, Geologic, structural, and thermochronologic constraints\non the tectonic evolution of the Sierra Mazatán core complex, Sonora, Mexico: New insights\ninto metamorphic core complex formation: Tectonics, v. 27, TC4013, doi: 10 .1029\n/2007TC002173 ."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"E. Swanson and B.P. Wernicke.\nGeologic map of the east-central Meadow Valley Mountains, and implications for reconstruction of the Mormon Peak detachment, Nevada.\nGeosphere, GES01148.1, first published on May 26, 2017,  doi:10.1130/GES01148.1","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"EAR-1250565"},{"agency":"Caltech Tectonics Observatory","grant_number":""},{"agency":"Gordon and Betty Moore Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"Gail","local_group":["Caltech Tectonics Observatory"]}