{"title":"Learning recurrent representations for hierarchical behavior modeling","uri":"","abstract":"We propose a framework for detecting action patterns from motion sequences and modeling the sensory-motor relationship of animals, using a generative recurrent neural network. The network has a discriminative part (classifying actions) and a generative part (predicting motion), whose recurrent cells are laterally connected, allowing higher levels of the network to represent high level behavioral phenomena. We test our framework on two types of data, fruit fly behavior and online handwriting. Our results show that 1) taking advantage of unlabeled sequences, by predicting future motion, significantly improves action detection performance when training labels are scarce, 2) the network learns to represent high level phenomena such as writer identity and fly gender, without supervision, and 3) simulated motion trajectories, generated by treating motion prediction as input to the network, look realistic and may be used to qualitatively evaluate whether the model has learnt generative control rules.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252872","docid":252872,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1264336","fileid":1264336,"datasetid":"document","objectid":252872,"filename":"1611.00094","mime_type":"application/pdf","hash":"ccd35f6ed2b302f2524f511fc97fefa0","hash_type":"MD5","filesize":7802017,"mtime":"2017-05-30 16:50:58","url":"http://authors.library.caltech.edu/77821/1/1611.00094"}],"eprintid":77821,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1611.00094","content":"submitted"}],"note":"","id":77821,"rev_number":12,"userid":6,"eprint_dir":"disk0/00/07/78/21","datestamp":"2017-05-30 17:16:33","lastmod":"2017-05-30 19:51:50","status_changed":"2017-05-30 17:16:33","type":"conference_item","metadata_visibility":"show","creators":[{"given":"Eyrun","family":"Eyjolfsdottir","id":"Eyjólfsdóttir-E","orcid":""},{"given":"Kristin","family":"Branson","id":"Branson-K","orcid":""},{"given":"Yisong","family":"Yue","id":"Yue-Yisong","orcid":""},{"given":"Pietro","family":"Perona","id":"Perona-P","orcid":"0000-0002-7583-5809"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-04","date_type":"published","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170530-090151819","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170530-090151819","related_url":[{"url":"https://arxiv.org/abs/1611.00094","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Mart´ın Abadi, Ashish Agarwal, Paul Barham, Eugene Brevdo, Zhifeng Chen, Craig Citro, Greg S.\nCorrado, Andy Davis, Jeffrey Dean, Matthieu Devin, Sanjay Ghemawat, Ian Goodfellow, Andrew\nHarp, Geoffrey Irving, Michael Isard, Yangqing Jia, Rafal Jozefowicz, Lukasz Kaiser, Manjunath\nKudlur, Josh Levenberg, Dan Mane, Rajat Monga, Sherry Moore, Derek Murray, Chris Olah, ´\nMike Schuster, Jonathon Shlens, Benoit Steiner, Ilya Sutskever, Kunal Talwar, Paul Tucker, Vincent\nVanhoucke, Vijay Vasudevan, Fernanda Viegas, Oriol Vinyals, Pete Warden, Martin Watten- ´\nberg, Martin Wicke, Yuan Yu, and Xiaoqiang Zheng. TensorFlow: Large-scale machine learning\non heterogeneous systems, 2015. URL http://tensorflow.org/. Software available from\ntensorflow.org.\nDavid J Anderson and Pietro Perona. Toward a science of computational ethology. Neuron, 84(1):\n18–31, 2014.\nPierre Baldi. Autoencoders, unsupervised learning, and deep architectures. ICML unsupervised and\ntransfer learning, 27(37-50):1, 2012.\nGordon J Berman, Daniel M Choi, William Bialek, and Joshua W Shaevitz. Mapping the stereotyped\nbehaviour of freely moving fruit flies. Journal of The Royal Society Interface, 11(99):20140672,\n2014.\nValentino Braitenberg. Vehicles Experiments in Synthetic Psychology. MIT Press, 1984.\nKyunghyun Cho, Bart Van Merrienboer, Caglar Gulcehre, Dzmitry Bahdanau, Fethi Bougares, Hol- ¨\nger Schwenk, and Yoshua Bengio. Learning phrase representations using rnn encoder-decoder\nfor statistical machine translation. arXiv preprint arXiv:1406.1078, 2014.\nJunyoung Chung, Kyle Kastner, Laurent Dinh, Kratarth Goel, Aaron C Courville, and Yoshua Bengio.\nA recurrent latent variable model for sequential data. In Advances in neural information\nprocessing systems, pp. 2962–2970, 2015.\nEyrun Eyjolfsdottir, Steve Branson, Xavier P Burgos-Artizzu, Eric D Hoopfer, Jonathan Schor,\nDavid J Anderson, and Pietro Perona. Detecting social actions of fruit flies. In Computer Vision–\nECCV 2014, pp. 772–787. Springer, 2014.\nAlan Graves, Abdel-rahman Mohamed, and Geoffrey Hinton. Speech recognition with deep recurrent\nneural networks. In Acoustics, Speech and Signal Processing (ICASSP), 2013 IEEE International\nConference on, pp. 6645–6649. IEEE, 2013.\nAlex Graves. Generating sequences with recurrent neural networks. arXiv preprint\narXiv:1308.0850, 2013.\nSepp Hochreiter and Jurgen Schmidhuber. Long short-term memory. ¨ Neural computation, 9(8):\n1735–1780, 1997.\nMayank Kabra, Alice A Robie, Marta Rivera-Alba, Steven Branson, and Kristin Branson. Jaaba:\ninteractive machine learning for automatic annotation of animal behavior. nature methods, 10(1):\n64–67, 2013.\nMarcus Liwicki and Horst Bunke. Iam-ondb-an on-line english sentence database acquired from\nhandwritten text on a whiteboard. In Document Analysis and Recognition, 2005. Proceedings.\nEighth International Conference on, pp. 956–961. IEEE, 2005.\nLaurens van der Maaten and Geoffrey Hinton. Visualizing data using t-sne. Journal of Machine\nLearning Research, 9(Nov):2579–2605, 2008.\nVolodymyr Mnih, Koray Kavukcuoglu, David Silver, Andrei A Rusu, Joel Veness, Marc G Bellemare,\nAlex Graves, Martin Riedmiller, Andreas K Fidjeland, Georg Ostrovski, et al. Human-level\ncontrol through deep reinforcement learning. Nature, 518(7540):529–533, 2015.\nJ Moore. Some thoughts on the relation between behavior analysis and behavioral neuroscience.\nThe Psychological Record, 52(3):261, 2002.\nKevin Patrick Murphy. Dynamic bayesian networks: representation, inference and learning. PhD\nthesis, University of California, Berkeley, 2002.\nAntti Rasmus, Mathias Berglund, Mikko Honkala, Harri Valpola, and Tapani Raiko. Semisupervised\nlearning with ladder networks. In Advances in Neural Information Processing Systems,\npp. 3532–3540, 2015.\nWilliam M Roberts, Steven B Augustine, Kristy J Lawton, Theodore H Lindsay, Tod R Thiele,\nEduardo J Izquierdo, Serge Faumont, Rebecca A Lindsay, Matthew Cale Britton, Navin Pokala,\net al. A stochastic neuronal model predicts random search behaviors at multiple spatial scales in\nc. elegans. eLife, 5:e12572, 2016.\nDE Rumenlhart, Geoffrey E Hinton, and Ronald J Williams. Learning internal representation by\nerror propagation, parallel distributed processing. Explor. Microstruct. Cognition, 1:318–362,\n1986.\nDavid Silver, Aja Huang, Chris J Maddison, Arthur Guez, Laurent Sifre, George Van Den Driessche,\nJulian Schrittwieser, Ioannis Antonoglou, Veda Panneershelvam, Marc Lanctot, et al. Mastering\nthe game of go with deep neural networks and tree search. Nature, 529(7587):484–489, 2016.\nHerbert A Simon. The sciences of the artificial. MIT press, 1996.\nKathleen K Siwicki and Edward A Kravitz. Fruitless, doublesex and the genetics of social behavior\nin drosophila melanogaster. Current opinion in neurobiology, 19(2):200–206, 2009.\nNiko Tinbergen. On aims and methods of ethology. Zeitschrift fur Tierpsychologie ¨ , 20(4):410–433,\n1963.\nHarri Valpola. From neural pca to deep unsupervised learning. Adv. in Independent Component\nAnalysis and Learning Machines, pp. 143–171, 2015.\nAlexander B Wiltschko, Matthew J Johnson, Giuliano Iurilli, Ralph E Peterson, Jesse M Katon,\nStan L Pashkovski, Victoria E Abraira, Ryan P Adams, and Sandeep Robert Datta. Mapping\nsub-second structure in mouse behavior. Neuron, 88(6):1121–1135, 2015."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"","local_group":null}