{"title":"Asymmetric recognition of HIV-1 Envelope trimer by V1V2 loop-targeting antibodies","uri":"","abstract":"The HIV-1 envelope (Env) glycoprotein binds to host cell receptors to mediate membrane fusion. The prefusion Env trimer is stabilized by V1V2 loops that interact at the trimer apex. Broadly neutralizing antibodies (bNAbs) against V1V2 loops, exemplified by PG9, bind asymmetrically as a single Fab to the apex of the symmetric Env trimer using a protruding CDRH3 to penetrate the Env glycan shield. Here we characterized a distinct mode of V1V2 epitope recognition by the new bNAb BG1 in which two Fabs bind asymmetrically per Env trimer using a compact CDRH3. Comparisons between cryo-EM structures of Env trimer complexed with BG1 (6.2Å resolution) and PG9 (11.5Å resolution) revealed a new V1V2-targeting strategy by BG1. Analyses of the EM structures provided information relevant to vaccine design including molecular details for different modes of asymmetric recognition of Env trimer and a binding model for BG1 recognition of V1V2 involving glycan flexibility.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252876","docid":252876,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1264393","fileid":1264393,"datasetid":"document","objectid":252876,"filename":"e27389-download.pdf","mime_type":"application/pdf","hash":"178cdfb25091cfca191360ef9d552775","hash_type":"MD5","filesize":90195347,"mtime":"2017-05-30 17:32:08","url":"http://authors.library.caltech.edu/77827/1/e27389-download.pdf"}],"eprintid":77827,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"e27389-download.pdf","content":"accepted"}],"note":"© 2017, Wang et al. This article is distributed under the terms of the Creative Commons Attribution License permitting unrestricted use and redistribution provided that the original author and source are credited. \n\nReceived April 01, 2017; Accepted May 24, 2017; Published May 26, 2017. \n\nWe thank Zhiheng Yu, Chuan Hong, and Rick Huang (Janelia Farm) and Mark Yeager and Kelly Dryden (University of Virginia) for assistance with cryo-EM data collection and\nmotion correction, Alasdair McDowall and Songye Chen for training in cryo-EM techniques and data processing, and the Gordon and Betty Moore and Beckman Foundations for gifts to Caltech to support electron microscopy and to the Caltech\nMolecular Observatory to support X-ray crystallography. Cryo-EM data for the PG9-Env-8ANC195 complex structure was collected at the Molecular Electron Microscopy Core facility at the University of Virginia, which is supported by the School of Medicine and an NIH grant (G20-RR31199). The Titan Krios microscope and Falcon II direct detector used for data collection  at University of Virginia was supported by NIH SIG grant S10-RR025067 and NIH SIG S10-OD018149. Operations at the Stanford Synchrotron Radiation Lightsource are supported by the US Department of Energy and the National Institutes of Health. We also thank Jost Vielmetter and the Caltech Protein Expression Center for transfections and protein expression, and members of the P.J.B. and M.C.N. laboratories for helpful discussions and critical reading of the manuscript. This research was supported by the National Institutes of Health Grant 2 P50 GM082545-06 (to P.J.B.), National Institute Of Allergy and Infectious Diseases of the National Institutes of Health Grant HIVRAD P01 AI100148 (to P.J.B. and M.C.N.), the Bill and Melinda Gates Foundation Collaboration for AIDS Vaccine Discovery Grant 1040753 (to M.C.N. and P.J.B.), and a Comprehensive Antibody-Vaccine Immune Monitoring Consortium Grant 1032144 (M.S.S.). The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health.","id":77827,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/78/27","datestamp":"2017-05-30 18:01:20","lastmod":"2017-05-30 18:01:20","status_changed":"2017-05-30 18:01:20","type":"article","metadata_visibility":"show","creators":[{"given":"Haoqing","family":"Wang","id":"Wang-Haoqing","orcid":""},{"given":"Harry B.","family":"Gristick","id":"Gristick-H-B","orcid":""},{"given":"Louise","family":"Scharf","id":"Scharf-L","orcid":""},{"given":"Anthony P., Jr.","family":"West","id":"West-A-P-Jr","orcid":""},{"given":"Rachel P.","family":"Galimidi","id":"Galimidi-R-P","orcid":""},{"given":"Michael S.","family":"Seaman","id":"Seaman-M-S","orcid":""},{"given":"Natalia T.","family":"Freund","id":"Freund-N-T","orcid":""},{"given":"Michel C.","family":"Nussenzweig","id":"Nussenzweig-M-C","orcid":""},{"given":"Pamela J.","family":"Bjorkman","id":"Bjorkman-P-J","orcid":"0000-0002-2277-3990"}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-26","date_type":"inpress","publication":"eLife","volume":"6","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170530-103124593","refereed":true,"issn":"2050-084X","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170530-103124593","related_url":[{"url":"http://dx.doi.org/10.7554/eLife.27389","type":"doi","description":"Article"},{"url":"https://elifesciences.org/content/6/e27389","type":"pub","description":"Article"}],"referencetext":["1. Wyatt R, Sodroski J (1998) The HIV-1 envelope glycoproteins: fusogens, antigens,\n778 and immunogens. Science 280: 1884-1888.\n779 2. McCoy LE, Burton DR (2017) Identification and specificity of broadly neutralizing\n780 antibodies against HIV. Immunol Rev 275: 11-20.\n781 3. Klein F, Mouquet H, Dosenovic P, Scheid JF, Scharf L, Nussenzweig MC (2013)\n782 Antibodies in HIV-1 vaccine development and therapy. Science 341: 1199-1204.\n783 4. Landais E, Huang X, Havenar-Daughton C, Murrell B, Price MA, Wickramasinghe L,\n784 Ramos A, Bian CB, Simek M, Allen S, Karita E, Kilembe W, Lakhi S, Inambao M,\n785 Kamali A, Sanders EJ, Anzala O, Edward V, Bekker LG, Tang J, Gilmour J,\n786 Kosakovsky-Pond SL, Phung P, Wrin T, Crotty S, Godzik A, Poignard P (2016)\n787 Broadly Neutralizing Antibody Responses in a Large Longitudinal Sub-Saharan\n788 HIV Primary Infection Cohort. PLoS Pathog 12: e1005369.\n789 5. Klein F, Halper-Stromberg A, Horwitz JA, Gruell H, Scheid JF, Bournazos S, Mouquet\n790 H, Spatz LA, Diskin R, Abadir A, Zang T, Dorner M, Billerbeck E, Labitt RN,\n791 Gaebler C, Marcovecchio PM, Incesu RB, Eisenreich TR, Bieniasz PD, Seaman\n792 MS, Bjorkman PJ, Ravetch JV, Ploss A, Nussenzweig MC (2012) HIV therapy by\n793 a combination of broadly neutralizing antibodies in humanized mice. Nature 492:\n794 118-122.\n795 6. Barouch DH, Whitney JB, Moldt B, Klein F, Oliveira TY, Liu J, Stephenson KE, Chang\n796 HW, Shekhar K, Gupta S, Nkolola JP, Seaman MS, Smith KM, Borducchi EN,\n797 Cabral C, Smith JY, Blackmore S, Sanisetty S, Perry JR, Beck M, Lewis MG,\n798 Rinaldi W, Chakraborty AK, Poignard P, Nussenzweig MC, Burton DR (2013)\n799 Therapeutic efficacy of potent neutralizing HIV-1-specific monoclonal antibodies\n800 in SHIV-infected rhesus monkeys. Nature 503: 224-228.\n801 7. Shingai M, Nishimura Y, Klein F, Mouquet H, Donau OK, Plishka R, Buckler-White A,\n802 Seaman M, Piatak M, Jr., Lifson JD, Dimitrov DS, Nussenzweig MC, Martin MA\n803 (2013) Antibody-mediated immunotherapy of macaques chronically infected with\n804 SHIV suppresses viraemia. Nature 503: 277-280.\n805 8. Caskey M, Klein F, Lorenzi JC, Seaman MS, West AP, Jr., Buckley N, Kremer G,\n806 Nogueira L, Braunschweig M, Scheid JF, Horwitz JA, Shimeliovich I, Ben-\n807 Avraham S, Witmer-Pack M, Platten M, Lehmann C, Burke LA, Hawthorne T,\n808 Gorelick RJ, Walker BD, Keler T, Gulick RM, Fatkenheuer G, Schlesinger SJ,\n809 Nussenzweig MC (2015) Viraemia suppressed in HIV-1-infected humans by\n810 broadly neutralizing antibody 3BNC117. Nature 522: 487-491.\n811 9. Caskey M, Schoofs T, Gruell H, Settler A, Karagounis T, Kreider EF, Murrell B, Pfeifer\n812 N, Nogueira L, Oliveira TY, Learn GH, Cohen YZ, Lehmann C, Gillor D,\n813 Shimeliovich I, Unson-O'Brien C, Weiland D, Robles A, Kummerle T, Wyen C,\n814 Levin R, Witmer-Pack M, Eren K, Ignacio C, Kiss S, West AP, Jr., Mouquet H,\n815 Zingman BS, Gulick RM, Keler T, Bjorkman PJ, Seaman MS, Hahn BH,\n816 Fatkenheuer G, Schlesinger SJ, Nussenzweig MC, Klein F (2017) Antibody 10-\n817 1074 suppresses viremia in HIV-1-infected individuals. Nat Med 23: 185-191.\n818 10. Lynch RM, Boritz E, Coates EE, DeZure A, Madden P, Costner P, Enama ME,\n819 Plummer S, Holman L, Hendel CS, Gordon I, Casazza J, Conan-Cibotti M,\n820 Migueles SA, Tressler R, Bailer RT, McDermott A, Narpala S, O'Dell S, Wolf G,\n821 Lifson JD, Freemire BA, Gorelick RJ, Pandey JP, Mohan S, Chomont N,\n822 Fromentin R, Chun TW, Fauci AS, Schwartz RM, Koup RA, Douek DC, Hu Z,\n823 Capparelli E, Graham BS, Mascola JR, Ledgerwood JE, Team VRCS (2015)\n824 Virologic effects of broadly neutralizing antibody VRC01 administration during\n825 chronic HIV-1 infection. Sci Transl Med 7: 319ra206.\n11. West AP, Jr., Scharf L, Scheid JF, Klein F, Bjorkman PJ, Nussenzweig MC (2014)\n827 Structural Insights on the Role of Antibodies in HIV-1 Vaccine and Therapy. Cell\n828 156: 633-648.\n829 12. Burton DR, Mascola JR (2015) Antibody responses to envelope glycoproteins in\n830 HIV-1 infection. Nat Immunol 16: 571-576.\n831 13. Garces F, Lee JH, de Val N, Torrents de la Pena A, Kong L, Puchades C, Hua Y,\n832 Stanfield RL, Burton DR, Moore JP, Sanders RW, Ward AB, Wilson IA (2015)\n833 Affinity Maturation of a Potent Family of HIV Antibodies Is Primarily Focused on\n834 Accommodating or Avoiding Glycans. Immunity 43: 1053-1063.\n835 14. Gristick HB, von Boehmer L, West AP, Jr., Schamber M, Gazumyan A, Golijanin J,\n836 Seaman MS, Fatkenheuer G, Klein F, Nussenzweig MC, Bjorkman PJ (2016)\n837 Natively glycosylated HIV-1 Env structure reveals new mode for antibody\n838 recognition of the CD4-binding site. Nat Struct Mol Biol 23: 906-915.\n839 15. Julien JP, Cupo A, Sok D, Stanfield RL, Lyumkis D, Deller MC, Klasse PJ, Burton\n840 DR, Sanders RW, Moore JP, Ward AB, Wilson IA (2013) Crystal structure of a\n841 soluble cleaved HIV-1 envelope trimer. Science 342: 1477-1483.\n842 16. Kong L, Torrents de la Pena A, Deller MC, Garces F, Sliepen K, Hua Y, Stanfield RL,\n843 Sanders RW, Wilson IA (2015) Complete epitopes for vaccine design derived\n844 from a crystal structure of the broadly neutralizing antibodies PGT128 and\n845 8ANC195 in complex with an HIV-1 Env trimer. Acta Crystallogr D Biol\n846 Crystallogr 71: 2099-2108.\n847 17. Kwon YD, Pancera M, Acharya P, Georgiev IS, Crooks ET, Gorman J, Joyce MG,\n848 Guttman M, Ma X, Narpala S, Soto C, Terry DS, Yang Y, Zhou T, Ahlsen G,\n849 Bailer RT, Chambers M, Chuang GY, Doria-Rose NA, Druz A, Hallen MA,\n850 Harned A, Kirys T, Louder MK, O'Dell S, Ofek G, Osawa K, Prabhakaran M,\n851 Sastry M, Stewart-Jones GB, Stuckey J, Thomas PV, Tittley T, Williams C,\n852 Zhang B, Zhao H, Zhou Z, Donald BR, Lee LK, Zolla-Pazner S, Baxa U, Schon\n853 A, Freire E, Shapiro L, Lee KK, Arthos J, Munro JB, Blanchard SC, Mothes W,\n854 Binley JM, McDermott AB, Mascola JR, Kwong PD (2015) Crystal structure,\n855 conformational fixation and entry-related interactions of mature ligand-free HIV-1\n856 Env. Nat Struct Mol Biol 22: 522-531.\n857 18. Lyumkis D, Julien JP, de Val N, Cupo A, Potter CS, Klasse PJ, Burton DR, Sanders\n858 RW, Moore JP, Carragher B, Wilson IA, Ward AB (2013) Cryo-EM structure of a\n859 fully glycosylated soluble cleaved HIV-1 envelope trimer. Science 342: 1484-\n860 1490.\n861 19. Pancera M, Zhou T, Druz A, Georgiev IS, Soto C, Gorman J, Huang J, Acharya P,\n862 Chuang GY, Ofek G, Stewart-Jones GB, Stuckey J, Bailer RT, Joyce MG, Louder\n863 MK, Tumba N, Yang Y, Zhang B, Cohen MS, Haynes BF, Mascola JR, Morris L,\n864 Munro JB, Blanchard SC, Mothes W, Connors M, Kwong PD (2014) Structure\n865 and immune recognition of trimeric pre-fusion HIV-1 Env. Nature 514: 455-461.\n866 20. Scharf L, Wang H, Gao H, Chen S, McDowall AW, Bjorkman PJ (2015) Broadly\n867 Neutralizing Antibody 8ANC195 Recognizes Closed and Open States of HIV-1\n868 Env. Cell 162: 1379-1390.\n869 21. Stewart-Jones GBE, Soto C, Lemmin T, Chuang G-Y, Druz A, Kong R, Thomas PV,\n870 Wagh K, Zhou T, Behrens A-J, Bylund T, Choi CW, Davison JR, Georgiev IS,\n871 Joyce MG, Do Kwon Y, Pancera M, Taft J, Yang Y, Zhang B, Shivatare SS,\n872 Shivatare VS, Lee C-CD, Wu CY, Bewley CA, Burton DR, Koff WC, Connors M,\n873 Crispin M, Baxa U, Korber BT, Wong CH, Mascola JR, Kwong PD (2016)\n874 Trimeric HIV-1-Env Structures Define Glycan Shields from Clades A, B, and G.\n875 Cell 165: 813-826.\n22. Ward AB, Wilson IA (2017) The HIV-1 envelope glycoprotein structure: nailing down\n877 a moving target. Immunol Rev 275: 21-32.\n878 23. Liu J, Bartesaghi A, Borgnia MJ, Sapiro G, Subramaniam S (2008) Molecular\n879 architecture of native HIV-1 gp120 trimers. Nature 455: 109-113.\n880 24. Tran EE, Borgnia MJ, Kuybeda O, Schauder DM, Bartesaghi A, Frank GA, Sapiro G,\n881 Milne JL, Subramaniam S (2012) Structural mechanism of trimeric HIV-1\n882 envelope glycoprotein activation. PLoS Pathog 8: e1002797.\n883 25. Wang H, Cohen AA, Galimidi RP, Gristick HB, Jensen GJ, Bjorkman PJ (2016) Cryo-\n884 EM structure of a CD4-bound open HIV-1 envelope trimer reveals structural\n885 rearrangements of the gp120 V1V2 loop. Proc Natl Acad Sci U S A 113: E7151-\n886 E7158.\n887 26. Gorman J, Soto C, Yang MM, Davenport TM, Guttman M, Bailer RT, Chambers M,\n888 Chuang GY, DeKosky BJ, Doria-Rose NA, Druz A, Ernandes MJ, Georgiev IS,\n889 Jarosinski MC, Joyce MG, Lemmin TM, Leung S, Louder MK, McDaniel JR,\n890 Narpala S, Pancera M, Stuckey J, Wu X, Yang Y, Zhang B, Zhou T, Program\n891 NCS, Mullikin JC, Baxa U, Georgiou G, McDermott AB, Bonsignori M, Haynes\n892 BF, Moore PL, Morris L, Lee KK, Shapiro L, Mascola JR, Kwong PD (2016)\n893 Structures of HIV-1 Env V1V2 with broadly neutralizing antibodies reveal\n894 commonalities that enable vaccine design. Nat Struct Mol Biol 23: 81-90.\n895 27. McLellan JS, Pancera M, Carrico C, Gorman J, Julien JP, Khayat R, Louder R,\n896 Pejchal R, Sastry M, Dai K, O'Dell S, Patel N, Shahzad-ul-Hussan S, Yang Y,\n897 Zhang B, Zhou T, Zhu J, Boyington JC, Chuang GY, Diwanji D, Georgiev I, Kwon\n898 YD, Lee D, Louder MK, Moquin S, Schmidt SD, Yang ZY, Bonsignori M, Crump\n899 JA, Kapiga SH, Sam NE, Haynes BF, Burton DR, Koff WC, Walker LM, Phogat\n900 S, Wyatt R, Orwenyo J, Wang LX, Arthos J, Bewley CA, Mascola JR, Nabel GJ,\n901 Schief WR, Ward AB, Wilson IA, Kwong PD (2011) Structure of HIV-1 gp120\n902 V1/V2 domain with broadly neutralizing antibody PG9. Nature 480: 336-343.\n903 28. Pancera M, Shahzad-Ul-Hussan S, Doria-Rose NA, McLellan JS, Bailer RT, Dai K,\n904 Loesgen S, Louder MK, Staupe RP, Yang Y, Zhang B, Parks R, Eudailey J,\n905 Lloyd KE, Blinn J, Alam SM, Haynes BF, Amin MN, Wang LX, Burton DR, Koff\n906 WC, Nabel GJ, Mascola JR, Bewley CA, Kwong PD (2013) Structural basis for\n907 diverse N-glycan recognition by HIV-1-neutralizing V1-V2-directed antibody\n908 PG16. Nat Struct Mol Biol 20: 804-813.\n909 29. Pan R, Gorny MK, Zolla-Pazner S, Kong XP (2015) The V1V2 Region of HIV-1\n910 gp120 Forms a Five-Stranded Beta Barrel. J Virol 89: 8003-8010.\n911 30. Julien JP, Lee JH, Cupo A, Murin CD, Derking R, Hoffenberg S, Caulfield MJ, King\n912 CR, Marozsan AJ, Klasse PJ, Sanders RW, Moore JP, Wilson IA, Ward AB\n913 (2013) Asymmetric recognition of the HIV-1 trimer by broadly neutralizing\n914 antibody PG9. Proc Natl Acad Sci U S A 110: 4351-4356.\n915 31. Liu Q, Acharya P, Dolan MA, Zhang P, Guzzo C, Lu J, Kwon A, Gururani D, mMiao\n916 H, Bylund T, Chuang G-Y, Druz A, Zhou T, Rice WJ, Wigge C, Carragher B,\n917 Potter CS, Kwong PD, Lusso P (2017) Quaternary contact in the initial interaction\n918 of CD4 with the HIV-1 envelope trimer. Nat Struct Mol Biol 24: 370-378..\n919 32. Lee JH, Andrabi R, Su CY, Yasmeen A, Julien JP, Kong L, Wu NC, McBride R, Sok\n920 D, Pauthner M, Cottrell CA, Nieusma T, Blattner C, Paulson JC, Klasse PJ,\n921 Wilson IA, Burton DR, Ward AB (2017) A Broadly Neutralizing Antibody Targets\n922 the Dynamic HIV Envelope Trimer Apex via a Long, Rigidified, and Anionic beta-\n923 Hairpin Structure. Immunity 46: 690-702.\n924 33. Freund NT, Wang H, Scharf L, Nogueira L, Horwitz JA, Bar-On Y, Golijanin J,\n925 Sievers SA, Sok D, Cai H, Cesar Lorenzi JC, Halper-Stromberg A, Toth I,\n926 Piechocka-Trocha A, Gristick HB, van Gils MJ, Sanders RW, Wang LX, Seaman MS, Burton DR, Gazumyan A, Walker BD, West AP, Jr., Bjorkman PJ,\n928 Nussenzweig MC (2017) Coexistence of potent HIV-1 broadly neutralizing\n929 antibodies and antibody-sensitive viruses in a viremic controller. Sci Transl Med\n930 9.\n931 34. Escolano A, Dosenovic P, Nussenzweig MC (2017) Progress toward active or\n932 passive HIV-1 vaccination. J Exp Med 214: 3-16.\n933 35. Walker LM, Huber M, Doores KJ, Falkowska E, Pejchal R, Julien JP, Wang SK,\n934 Ramos A, Chan-Hui PY, Moyle M, Mitcham JL, Hammond PW, Olsen OA, Phung\n935 P, Fling S, Wong CH, Phogat S, Wrin T, Simek MD, Principal Investigators PG,\n936 Koff WC, Wilson IA, Burton DR, Poignard P (2011) Broad neutralization coverage\n937 of HIV by multiple highly potent antibodies. Nature 477: 466–470.\n938 36. Walker LM, Phogat SK, Chan-Hui PY, Wagner D, Phung P, Goss JL, Wrin T, Simek\n939 MD, Fling S, Mitcham JL, Lehrman JK, Priddy FH, Olsen OA, Frey SM,\n940 Hammond PW, Miiro G, Serwanga J, Pozniak A, McPhee D, Manigart O,\n941 Mwananyanda L, Karita E, Inwoley A, Jaoko W, Dehovitz J, Bekker LG,\n942 Pitisuttithum P, Paris R, Allen S, Kaminsky S, Zamb T, Moyle M, Koff WC,\n943 Poignard P, Burton DR (2009) Broad and Potent Neutralizing Antibodies from an\n944 African Donor Reveal a New HIV-1 Vaccine Target. Science 326: 285-289.\n945 37. Bonsignori M, Hwang KK, Chen X, Tsao CY, Morris L, Gray E, Marshall DJ, Crump\n946 JA, Kapiga SH, Sam NE, Sinangil F, Pancera M, Yongping Y, Zhang B, Zhu J,\n947 Kwong PD, O'Dell S, Mascola JR, Wu L, Nabel GJ, Phogat S, Seaman MS,\n948 Whitesides JF, Moody MA, Kelsoe G, Yang X, Sodroski J, Shaw GM, Montefiori\n949 DC, Kepler TB, Tomaras GD, Alam SM, Liao HX, Haynes BF (2011) Analysis of\n950 a clonal lineage of HIV-1 envelope V2/V3 conformational epitope-specific broadly\n951 neutralizing antibodies and their inferred unmutated common ancestors. J Virol\n952 85: 9998-10009.\n953 38. Doria-Rose NA, Schramm CA, Gorman J, Moore PL, Bhiman JN, DeKosky BJ,\n954 Ernandes MJ, Georgiev IS, Kim HJ, Pancera M, Staupe RP, Altae-Tran HR,\n955 Bailer RT, Crooks ET, Cupo A, Druz A, Garrett NJ, Hoi KH, Kong R, Louder MK,\n956 Longo NS, McKee K, Nonyane M, O'Dell S, Roark RS, Rudicell RS, Schmidt SD,\n957 Sheward DJ, Soto C, Wibmer CK, Yang Y, Zhang Z, Program NCS, Mullikin JC,\n958 Binley JM, Sanders RW, Wilson IA, Moore JP, Ward AB, Georgiou G, Williamson\n959 C, Abdool Karim SS, Morris L, Kwong PD, Shapiro L, Mascola JR (2014)\n960 Developmental pathway for potent V1V2-directed HIV-neutralizing antibodies.\n961 Nature 509: 55-62.\n962 39. Pancera M, McLellan JS, Wu X, Zhu J, Changela A, Schmidt SD, Yang Y, Zhou T,\n963 Phogat S, Mascola JR, Kwong PD (2010) Crystal structure of PG16 and chimeric\n964 dissection with somatically related PG9: structure-function analysis of two\n965 quaternary-specific antibodies that effectively neutralize HIV-1. J Virol 84: 8098-\n966 8110.\n967 40. Pejchal R, Walker LM, Stanfield RL, Phogat SK, Koff WC, Poignard P, Burton DR,\n968 Wilson IA (2010) Structure and function of broadly reactive antibody PG16 reveal\n969 an H3 subdomain that mediates potent neutralization of HIV-1. Proc Natl Acad\n970 Sci U S A 107: 11483-11488.\n971 41. Swindells MB, Porter CT, Couch M, Hurst J, Abhinandan KR, Nielsen JH, Macindoe\n972 G, Hetherington J, Martin AC (2017) abYsis: Integrated Antibody Sequence and\n973 Structure-Management, Analysis, and Prediction. J Mol Biol 429: 356-364.\n974 42. Dall'Acqua W, Goldman ER, Eisenstein E, Mariuzza RA (1996) A mutational analysis\n975 of the binding of two different proteins to the same antibody. Biochem 35: 9667-\n976 9676.\n43. Kelley RF, O'Connell MP (1993) Thermodynamic analysis of an antibody functional\n978 epitope. Biochem 32: 6828-6835.\n979 44. Wells JA, DeVos AM (1996) Hematopoietic receptor complexes. Ann Rev Biochem\n980 65: 609-634.\n981 45. Wyatt PJ (1993) Light scattering and the absolute characterization of\n982 macromolecules. Analytica Chimica Acta 272: 1-40.\n983 46. Sanders RW, Derking R, Cupo A, Julien JP, Yasmeen A, de Val N, Kim HJ, Blattner\n984 C, de la Pena AT, Korzun J, Golabek M, de Los Reyes K, Ketas TJ, van Gils MJ,\n985 King CR, Wilson IA, Ward AB, Klasse PJ, Moore JP (2013) A next-generation\n986 cleaved, soluble HIV-1 Env Trimer, BG505 SOSIP.664 gp140, expresses\n987 multiple epitopes for broadly neutralizing but not non-neutralizing antibodies.\n988 PLoS Pathog 9: e1003618.\n989 47. Scharf L, Scheid JF, Lee JH, West AP, Jr., Chen C, Gao H, Gnanapragasam PN,\n990 Mares R, Seaman MS, Ward AB, Nussenzweig MC, Bjorkman PJ (2014)\n991 Antibody 8ANC195 reveals a site of broad vulnerability on the HIV-1 envelope\n992 spike. Cell Rep 7: 785-795.\n993 48. Klein JS, Bjorkman PJ (2010) Few and far between: how HIV may be evading\n994 antibody avidity. PLoS Pathog 6: e1000908.\n995 49. Galimidi RP, Klein JS, Politzer MS, Bai S, Seaman MS, Nussenzweig MC, West AP,\n996 Jr., Bjorkman PJ (2015) Intra-spike crosslinking overcomes antibody evasion by\n997 HIV-1. Cell 160: 433–446.\n998 50. Montefiori DC (2005) Evaluating neutralizing antibodies against HIV, SIV, and SHIV\n999 in luciferase reporter gene assays. Curr Protoc Immunol Chapter 12: Unit 12 11.\n1000 51. West AP, Jr., Galimidi RP, Gnanapragasam PN, Bjorkman PJ (2012) Single-Chain\n1001 Fv-Based Anti-HIV Proteins: Potential and Limitations. J Virol 86: 195-202.\n1002 52. Scheres SH, Chen S (2012) Prevention of overfitting in cryo-EM structure\n1003 determination. Nat Methods 9: 853-854.\n1004 53. Lee JH, Ozorowski G, Ward AB (2016) Cryo-EM structure of a native, fully\n1005 glycosylated, cleaved HIV-1 envelope trimer. Science 351: 1043-1048.\n1006 54. Adams PD, Afonine PV, Bunkoczi G, Chen VB, Davis IW, Echols N, Headd JJ, Hung\n1007 LW, Kapral GJ, Grosse-Kunstleve RW, McCoy AJ, Moriarty NW, Oeffner R,\n1008 Read RJ, Richardson DC, Richardson JS, Terwilliger TC, Zwart PH (2010)\n1009 PHENIX: a comprehensive Python-based system for macromolecular structure\n1010 solution. Acta Crystallogr D Biol Crystallogr 66: 213-221.\n1011 55. Agirre J, Iglesias-Fernandez J, Rovira C, Davies GJ, Wilson KS, Cowtan KD (2015)\n1012 Privateer: software for the conformational validation of carbohydrate structures.\n1013 Nat Struct Mol Biol 22: 833-834.\n1014 56. West AP, Jr., Scharf L, Horwitz J, Klein F, Nussenzweig MC, Bjorkman PJ (2013)\n1015 Computational analysis of anti-HIV-1 antibody neutralization panel data to\n1016 identify potential functional epitope residues. Proc Natl Acad Sci U S A 110:\n1017 10598-10603.\n1018 57. Saphire EO, Parren PW, Pantophlet R, Zwick MB, Morris GM, Rudd PM, Dwek RA,\n1019 Stanfield RL, Burton DR, Wilson IA (2001) Crystal structure of a neutralizing\n1020 human IGG against HIV-1: a template for vaccine design. Science 293: 1155-\n1021 1159.\n1022 58. Scharf L, West AP, Sievers SA, Chen C, Jiang S, Gao H, Gray MD, McGuire AT,\n1023 Scheid JF, Nussenzweig MC, Stamatatos L, Bjorkman PJ (2016) Structural basis\n1024 for germline antibody recognition of HIV-1 immunogens. Elife 5.\n1025 59. Kabsch W (2010) XDS. Acta Crystallogr D Biol Crystallogr 66: 125-132.\n1026 60. Emsley P, Cowtan K (2004) Coot: model-building tools for molecular graphics. Acta\n1027 Crystallogr D Biol Crystallogr 60: 2126-2132.\n61. Schrödinger L (2011) The PyMOL Molecular Graphics System. 1.2r3pre ed: The\n1029 PyMOL Molecular Graphics System.\n1030 62. Pettersen EF, Goddard TD, Huang CC, Couch GS, Greenblatt DM, Meng EC, Ferrin\n1031 TE (2004) UCSF Chimera--a visualization system for exploratory research and\n1032 analysis. J Comput Chem 25: 1605-1612.\n1033 63. Sheskin D (2004) Handbook of Parametric and Nonparametric Statistical\n1034 Procedures. Boca Raton: Chapman \u0026 Hall/CRC. 1193 p.\n1035 64. Tang G, Peng L, Baldwin PR, Mann DS, Jiang W, Rees I, Ludtke SJ (2007) EMAN2:\n1036 an extensible image processing suite for electron microscopy. J Struct Biol 157:\n1037 38-46.\n1038 65. Huang CC, Lam SN, Acharya P, Tang M, Xiang SH, Hussan SS, Stanfield RL,\n1039 Robinson J, Sodroski J, Wilson IA, Wyatt R, Bewley CA, Kwong PD (2007)\n1040 Structures of the CCR5 N terminus and of a tyrosine-sulfated antibody with HIV-1\n1041 gp120 and CD4. Science 317: 1930-1934.\n1042 66. Scheres SH (2012) RELION: implementation of a Bayesian approach to cryo-EM\n1043 structure determination. J Struct Biol 180: 519-530.\n1044 67. Mastronarde DN (2005) Automated electron microscope tomography using robust\n1045 prediction of specimen movements. J Struct Biol 152: 36-51.\n1046 68. Brilot AF, Chen JZ, Cheng A, Pan J, Harrison SC, Potter CS, Carragher B,\n1047 Henderson R, Grigorieff N (2012) Beam-induced motion of vitrified specimen on\n1048 holey carbon film. J Struct Biol 177: 630-637.\n1049 69. Campbell MG, Cheng A, Brilot AF, Moeller A, Lyumkis D, Veesler D, Pan J, Harrison\n1050 SC, Potter CS, Carragher B, Grigorieff N (2012) Movies of ice-embedded\n1051 particles enhance resolution in electron cryo-microscopy. Structure 20: 1823-\n1052 1828.\n1053 70. Grant T, Grigorieff N (2015) Measuring the optimal exposure for single particle cryo-\n1054 EM using a 2.6 A reconstruction of rotavirus VP6. Elife 4: e06980.\n1055 71. Rohou A, Grigorieff N (2015) CTFFIND4: Fast and accurate defocus estimation from\n1056 electron micrographs. J Struct Biol 192: 216-221.\n1057 72. Goddard TD, Huang CC, Ferrin TE (2007) Visualizing density maps with UCSF\n1058 Chimera. J Struct Biol 157: 281-287.\n1059 73. Kucukelbir A, Sigworth FJ, Tagare HD (2014) Quantifying the local resolution of\n1060 cryo-EM density maps. Nat Methods 11: 63-65.\n1061 74. Stanfield RL, Zemla A, Wilson IA, Rupp B (2006) Antibody elbow angles are\n1062 influenced by their light chain class. J Mol Biol 357: 1566-1574.\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":"G20-RR31199"},{"agency":"NIH","grant_number":"S10-RR025067"},{"agency":"NIH","grant_number":"SIG S10-OD018149"},{"agency":"Department of Energy (DOE)","grant_number":""},{"agency":"NIH","grant_number":"2 P50 GM082545-06"},{"agency":"NIH","grant_number":"HIVRAD P01 AI100148"},{"agency":"Bill and Melinda Gates Foundation","grant_number":"1040753"},{"agency":"Bill and Melinda Gates Foundation","grant_number":"1032144"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}