{"title":"α-Synuclein: Stable compact and extended monomeric structures and pH dependence of dimer formation","uri":"","abstract":"The protein α-synuclein, implicated in Parkinson’s disease, was studied by combining nano-electrospray ionization (N-ESI) mass spectrometry and ion mobility. It was found that both the charge-state distribution in the mass spectra and the average protein shape deduced from ion mobility data, depend on the pH of the spray solution. Negative-ion N-ESI of pH 7 solutions yielded a broad charge-state distribution from −6 to −16, centered at −11, and ion mobility data consistent with extended protein structures. Data obtained for pH 2.5 solutions, on the other hand, showed a narrow charge-state distribution from −6 to −11, centered at −8, and ion mobilities in agreement with compact α-synuclein structures. The data indicated that there are two distinct families of structures: one consisting of relatively compact proteins with eight or less negative charges and one consisting of relatively extended structures with nine or more charges. The average cross section of a-synuclein at pH 2.5 is 33% smaller than for the extended protein sprayed from pH 7 solution. Significant dimer formation was observed when sprayed from pH 7 solution but no dimers were observed from the low pH solution. A plausible mechanism for aggregate formation in solution is proposed.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252911","docid":252911,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1264667","fileid":1264667,"datasetid":"document","objectid":252911,"filename":"art%3A10.1016%2Fj.jasms.2004.08.003.pdf","mime_type":"application/pdf","hash":"f985b05cf54112c9852a5684c6036cc7","hash_type":"MD5","filesize":345757,"mtime":"2017-05-30 22:31:37","url":"http://authors.library.caltech.edu/77837/1/art%253A10.1016%252Fj.jasms.2004.08.003.pdf"}],"eprintid":77837,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"art%3A10.1016%2Fj.jasms.2004.08.003.pdf","content":"published"}],"note":"© 2004 American Society for Mass Spectrometry. \n\nReceived: 14 April 2004; Revised: 05 August 2004; Accepted: 09 August 2004; First Online: 01 October 2004. \n\nThis research was supported by a grant from the National Science Foundation, CHE-0140215 (MTB), Beckman Macular Research Center (HBG), Parkinson’s Disease Foundation and National Parkinson Foundation (JRW), and the Beckman Foundation for a Beckman Senior Research Fellowship (JCL).","id":77837,"rev_number":7,"userid":18,"eprint_dir":"disk0/00/07/78/37","datestamp":"2017-05-30 22:49:42","lastmod":"2017-05-30 22:49:42","status_changed":"2017-05-30 22:49:42","type":"article","metadata_visibility":"show","creators":[{"given":"Summer L.","family":"Bernstein","id":"Bernstein-S-L","orcid":""},{"given":"Dengfeng","family":"Liu","id":"Liu-Dengfeng","orcid":""},{"given":"Thomas","family":"Wyttenbach","id":"Wyttenbach-T","orcid":""},{"given":"Michael T.","family":"Bowers","id":"Bowers-M-T","orcid":""},{"given":"Jennifer C.","family":"Lee","id":"Lee-Jennifer-C","orcid":""},{"given":"Harry B.","family":"Gray","id":"Gray-H-B","orcid":""},{"given":"Jay R.","family":"Winkler","id":"Winkler-J-R","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2004-10","date_type":"published","publication":"Journal of the American Society for Mass Spectrometry","volume":"15","number":"10","pagerange":"1435-1443","id_number":"CaltechAUTHORS:20170530-153130423","refereed":true,"issn":"1044-0305","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170530-153130423","related_url":[{"url":"http://dx.doi.org/10.1016/j.jasms.2004.08.003","type":"doi","description":"Article"},{"url":"https://link.springer.com/article/10.1016%2Fj.jasms.2004.08.003","type":"pub","description":"Article"},{"url":"http://rdcu.be/s68f","type":"pub","description":"Free ReadCube access"},{"url":"https://doi.org/10.1016/j.jasms.2004.08.003","type":"pub","description":"Article"}],"referencetext":["1.\n\nDunnett, S. B.; Bjorklund, A. Prospects for new restorative and neuroprotective treatments in Parkinson’s disease. Nature Suppl. 1999, 399(6738), A32-A39.\nCrossRefGoogle Scholar\n\n\n2.\n\nBaba, M.; Nakajo, S.; Tu, P. H.; Tomita, T.; Nakaya, K.; Lee, V. M. Y.; Trojanowski, J. Q.; Iwatsubo, T. Aggregation of Alpha-synuclein in Lewy bodies of sporadic Parkinson’s disease and dementia with Lewy Bodies. Am. J. Path. 1998, 152, 879–884.\nGoogle Scholar\n\n\n3.\n\nSpillantini, M. G.; Schmidt, M. L.; Lee, V. M. Y.; Trojanowski, J. Q.; Jakes, R.; Goedert, M. Alpha-synuclein in Lewy bodies. Nature 1997, 388, 839–840.\nCrossRefGoogle Scholar\n\n\n4.\n\nSelkoe, D. J. Translating cell biology into therapeutic advances in Alzheimer’s disease. Nature Suppl. 1999, 399, A23-A31.\nCrossRefGoogle Scholar\n\n\n5.\n\nBussell, R.; Eliezer, D. Residual structure and dynamics in Parkinson’s disease-associated mutants of alpha-synuclein. J. Biol. Chem. 2001, 276, 45996–46003.\nCrossRefGoogle Scholar\n\n\n6.\n\nSerpell, L. C.; Berriman, J.; Jakes, R.; Goedert, M.; Crowther, R. A. Fiber diffraction of synthetic alpha-synuclein filaments shows amyloid-like cross-beta conformation. Proc. Natl. Acad. Sci. USA 2000, 97, 4897–4902.\nCrossRefGoogle Scholar\n\n\n7.\n\nUversky, V. N.; Li, J.; Fink, A. L. Metal-triggered structural transformations, aggregation, and fibrillation of human alpha-synuclein—A possible molecular link between Parkinson’s disease and heavy metal exposure. J. Biol. Chem. 2001, 276, 44284–44296.\nCrossRefGoogle Scholar\n\n\n8.\n\nEliezer, D.; Kutluay, E.; Bussell, R.; Brown, G. Conformational properties of alpha-synuclein in its free and lipid-associated states. J. Mol. Biol. 2001, 307, 1061–1073.\nCrossRefGoogle Scholar\n\n\n9.\n\nVolles, M. J.; Lee, S. J.; Rochet, J. C.; Shtilerman, M. D.; Ding, T. T.; Kessler, J. C.; Lansbury, P. T. Vesicle permeabilization by protofibrillar alpha-synuclein: Implications for the pathogenesis and treatment of Parkinson’s disease. Biochemistry 2001, 40, 7812–7819.\nCrossRefGoogle Scholar\n\n\n10.\n\nConway, K. A.; Harper, J. D.; Lansbury, P. T. Accelerated in vitro fibril formation by a mutant alpha-synuclein linked to early-onset Parkinson disease. Nature Med. 1998, 4, 1318–1320.\nCrossRefGoogle Scholar\n\n\n11.(a)\n\nBenjamin, D. R.; Robinson, C. V.; Hendrick, J. P.; Hartl, U.; Dobson, C. M. Mass Sepctrometry of Ribosomes and Ribosomal subunits. Proc. Nat. Acad. 1998, 95, 7391–7395.\nCrossRefGoogle Scholar\n\n\n11.(b)\n\nRostom, A. A.; Fucini, P.; Benjamin, D. R.; Juenemann, R.; Nierhaus, K. H.; Hartl, F. U.; Dobson, C. M.; Robinson, C. V. Detection and selective dissociation of intact Ribosomes in a mass spectrometer. Proc. Natl. Acad. Sci. 2000, 97, 5185–5190.\nCrossRefGoogle Scholar\n\n\n12.\n\nNettleton, E. J.; Tito, P.; Sunde, M.; Bouchard, M.; Dobson, C. M.; Robinson, C. V. Characterization of the oligomeric states of insulin in self-assembly and amyloid fibril formation by mass spectrometry. J. Biophys. 2000, 79, 1053–1065.\nCrossRefGoogle Scholar\n\n\n13.\n\nvon Helden, G.; Hsu, M. T.; Kemper, P. R.; Bowers, M. T. Structures of carbon cluster ions from 3 to 60 atoms: Linears to rings to fullerenes. J. Chem. Phys. 1991, 95, 3835–3837.\nCrossRefGoogle Scholar\n\n\n14.\n\nClemmer, D. E.; Jarrold, M. F. Ion Mobility measurements and their applications to clusters and biomolecules. J. Mass Spectrom. 1997, 92, 577.\nCrossRefGoogle Scholar\n\n\n15.\n\nWyttenbach, T.; Bowers, M. T. Gas-Phase conformations: The Ion Mobility/Ion Chromatography method. Top. Curr. Chem. 2003, 225, 207–232.\nCrossRefGoogle Scholar\n\n\n16.\n\nWyttenbach, T.; von Helden, G.; Bowers, M. T. Gas-Phase conformation of biological molecules: Bradykinin. J. Am. Chem. Soc. 1996, 118, 8355–8364.\nCrossRefGoogle Scholar\n\n\n17.(a)\n\nGidden, J.; Wyttenbach, T.; Jackson, A. T.; Scrivens, J. H.; Bowers, M. T. Gas-phase conformations of synthetic polymers: Poly(ethylene glycol), Poly(propylene glycol), and Poly(tetramethylene glycol). J. Am. Chem. Soc. 2000, 122, 4692–4699.\nCrossRefGoogle Scholar\n\n\n17.(b)\n\nGidden, J.; Bowers, M. T. Gas-phase conformations of deprotonated trinucleotides (dGTT−, dTGT−, and dTTG−): The question of zwitterion formation. J. Am. Soc. Mass Spectrom. 2003, 14, 161–170.\nCrossRefGoogle Scholar\n\n\n18.(a)\n\nClemmer, D. E.; Hudgins, R. R.; Jarrold, M. F. Naked protein conformation: Cytochrome c in the gas phase. J. Am. Chem. Soc. 1995, 117, 1014.\nGoogle Scholar\n\n\n18.(b)\n\nShelimov, K. B.; Clemmer, D. E.; Hudgins, R. R.; Jarrold, M. F. Protein structure in vacuo: Gas-phase conformations of BPTI and Cytochrome c. J. Am. Chem. Soc. 1997, 119, 2240.\nCrossRefGoogle Scholar\n\n\n18.(c)\n\nHudgins, R. R.; Ratner, M. A.; Jarrold, M. F. Design of helices that are stable in vacuo. J. Am. Chem. Soc. 1998, 120, 12974.\nCrossRefGoogle Scholar\n\n\n18.(d)\n\nKohtani, M.; Kinnear, B. S.; Jarrold, M. F. Metal-ion enhanced helicity in the gas phase. J. Am. Chem. Soc. 2000, 122, 12377.\nCrossRefGoogle Scholar\n\n\n19.\n\nLi, J.; Taraszka, J. A.; Counterman, A. E.; Clemmer, D. E. Influence of solvent composition and capillary temperature on the conformations of electrosprayed ions: unfolding of compact ubiquitin conformers from pseudonative and denatured solutions. Int. J. Mass Spectrom. 1999, 185, 37.\nCrossRefGoogle Scholar\n\n\n20.\n\nCounterman, A. E.; Clemmer, D. E. Large Anhydrous Polyalanine ions: Evidence for extended helices and onset of a more compact state. J. Am. Chem. Soc. 2001, 123, 1490.\nCrossRefGoogle Scholar\n\n\n21.\n\nJakes, R.; Spillantini, M. G.; Goedert, M. Identification of 2 distinct synucleins from human brain. FEBS Lett. 1994, 345, 27–32.\nCrossRefGoogle Scholar\n\n\n22.\n\nDer-Sarkissian, A.; Jao, C. C.; Chen, J.; Langen, R. Structural organization of alpha-synuclein fibrils studied by site-directed spin labeling. J. Biol. Chem. 2003, 37530–37535.\n\n\n23.\n\nWyttenbach, T.; Kemper, P. R.; Bowers, M. T. Design of a New Electrospray Ion Mobility Mass Spectrometer. Int. J. Mass Spectrom. 2001, 212, 13–23.\nCrossRefGoogle Scholar\n\n\n24.\n\nMason, E. A.; McDaniel, E. W. Transport Properties of Ions in Gases. Wiley, New York 1978.\nGoogle Scholar\n\n\n25.\n\nCase, D. A.; Pearlman, D. A.; Caldwell, J. W.; Cheatham, T. E., III.; Wang, J.; Ross, W. S.; Simmerling, C. L.; Darden, T. A.; Merz, K. M.; Stanton, R. V.; Cheng, A. L.; Vincent, J. J.; Crowley, M.; Tsui, V.; Radmer, R. J.; Duan, Y.; Pitera, J.; Massova, I.; Seibel, G. L.; Singh, U. C.; Weiner, P. K.; Kollman, P. A. AMBER 7 Unversity of California: San Francisco, 2002.\nGoogle Scholar\n\n\n26.\n\nMathews, C. K.; van Holde, K. E. Biochemistry. Benjamin/Cummings, Redwood City, California; 1990.\nGoogle Scholar\n\n\n27.\n\nShvartsburg, A. A.; Jarrold, M. F. An Exact hard-spheres scattering model for the mobilities of polyatomic ions. Chem Phys Let. 1996, 261, 86–91.\nCrossRefGoogle Scholar\n\n\n28.\n\nChowdhury, S. K.; Katta, V.; Chait, B. T. Probing conformational changes in proteins by mass spectromery. J. Am. Chem. Soc. 1990, 112, 9012–9013.\nCrossRefGoogle Scholar\n\n\n29.\n\nJarrold, M. F. Peptides and proteins in the vapor phase. Annu. Rev. Phys. Chem. 2000, 51, 179–207.\nCrossRefGoogle Scholar\n\n\n30.\n\nUversky, V. N.; Gillespie, J. R.; Fink, A. L. Why are “Natively unfolded” proteins unstructured under physiologic conditions?. Proteins: Struct, Funct, and Genetic. 2000, 41, 415–427.\nCrossRefGoogle Scholar\n\n\n31.\n\nUversky, V. N.; Li, J.; Fink, A. L. Evidence of partially folded intermediate in a-synuclein fibril formation. J. Biol. Chem. 2001, 276, 10737–10744.\nCrossRefGoogle Scholar\n\n\n32.\n\nvon Helden, G.; Gotts, N. G.; Bowers, M. T. Experimental evidence for the formation of Fullerenes by collisional heating of carbon rings in the gas phase. Nature 1993, 363, 60–63.\nCrossRefGoogle Scholar\n\n\n33.\n\nLast, A. M.; Robinson, C. V. Protein folding and interactions revealed by Mass Spectrometry. Curr. Opin. Chem. Biol. 1999, 3, 564–570.\nCrossRefGoogle Scholar\n\n\n34.\n\nWyttenbach, T.; von Helden, G.; Bowers, M. T. Conformations of alkali ion cationized Polyethers in the gas phase: Polyethylene Glycol and Bis[(benzo-15-crown-5)-15-ylmethyl Pimelate. Int. J. Mass Spectrom. Ion Proc. 1997, 165, 377.\nCrossRefGoogle Scholar\n\n\n34.\n\nGidden, J.; Bushnell, J. E.; Bowers, M. T. Gas-Phase Conformations and Folding Energetics of Oligonucleotides: dTG− and dGT−. J. Am. Chem. Soc. 2001, 123, 5610–5611.\nCrossRefGoogle Scholar\n\n\n35.\n\nBernstein, S. L.; Wyttenbach, T.; Baumketner, A.; Shea J.-E.; Bitan, G.; Teplow, D. T.; Bowers, M. T. Amyloid β-protein: Monomer structure and early aggregation states of Aβ42 and its Pro19 alloform. J. Am. Chem. Soc. (submitted).\n\n\n36.\n\nGidden, J.; Ferzoco, A.; Baker, E. S.; Bowers, M. T. Duplex formation and the onset of helicity in dCG oligonucleotides in a solvent-free environment. J. Am. Chem. Soc. (in press).\n\n\n37.\n\nGidden, J.; Baker, E. S.; Ferzoco, A.; Bowers, M. T. Structural motifs of DNA complexes in the gas phase. Int. J. Mass Spectrom. (in press).\n\n\n38.\n\nBaker, E. S.; Bernstein, S. L.; Bowers, M. T. (mss in preparation).\n\n\n39.\n\nRostam, A. A.; Robinson, C. V. Detection of Intact GroEL chaperonin assembly by Mass Spectrometry. J. Am. Soc. 1999, 121, 4718–4719.\nCrossRefGoogle Scholar\n\n\n40.\n\nBitan, G.; Kirkitadze, M. D.; Lomakin, A.; Vollers, S. S.; Benedek, G. B.; Teplow, D. B. Amyloid β-protein (Aβ) assembly: Aβ40 and Aβ oligomerization through distinct pathways. Proc. Natl. Acad. Sci. USA 2003, 100(1), 330–335.\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Bernstein, S.L., Liu, D., Wyttenbach, T. et al. J Am Soc Mass Spectrom (2004) 15: 1435. doi:10.1016/j.jasms.2004.08.003","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"CHE-0140215"},{"agency":"Beckman Macular Research Center","grant_number":""},{"agency":"Parkinson’s Disease Foundation","grant_number":""},{"agency":"National Parkinson Foundation","grant_number":""},{"agency":"Arnold and Mabel Beckman Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}