{"title":"Rapidly star-forming galaxies adjacent to quasars at redshifts exceeding 6","uri":"","abstract":"The existence of massive (10^(11) solar masses) elliptical galaxies by redshift z ≈ 4 (refs 1, 2, 3; when the Universe was 1.5 billion years old) necessitates the presence of galaxies with star-formation rates exceeding 100 solar masses per year at z \u003e 6 (corresponding to an age of the Universe of less than 1 billion years). Surveys have discovered hundreds of galaxies at these early cosmic epochs, but their star-formation rates are more than an order of magnitude lower. The only known galaxies with very high star-formation rates at z \u003e 6 are, with one exception, the host galaxies of quasars, but these galaxies also host accreting supermassive (more than 10^9 solar masses) black holes, which probably affect the properties of the galaxies. Here we report observations of an emission line of singly ionized carbon ([C II] at a wavelength of 158 micrometres) in four galaxies at z \u003e 6 that are companions of quasars, with velocity offsets of less than 600 kilometres per second and linear offsets of less than 100 kiloparsecs. The discovery of these four galaxies was serendipitous; they are close to their companion quasars and appear bright in the far-infrared. On the basis of the [C II] measurements, we estimate star-formation rates in the companions of more than 100 solar masses per year. These sources are similar to the host galaxies of the quasars in [C II] brightness, linewidth and implied dynamical mass, but do not show evidence for accreting supermassive black holes. Similar systems have previously been found at lower redshift. We find such close companions in four out of the twenty-five z \u003e 6 quasars surveyed, a fraction that needs to be accounted for in simulations. If they are representative of the bright end of the [C II] luminosity function, then they can account for the population of massive elliptical galaxies at z ≈ 4 in terms of the density of cosmic space.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252887","docid":252887,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1264489","fileid":1264489,"datasetid":"document","objectid":252887,"filename":"nature22358.pdf","mime_type":"application/pdf","hash":"3cf1568fb8c4fe8f9d7cd675fb852116","hash_type":"MD5","filesize":2966415,"mtime":"2017-05-30 19:39:29","url":"http://authors.library.caltech.edu/77830/1/nature22358.pdf"}],"eprintid":77830,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"nature22358.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252888","docid":252888,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1264492","fileid":1264492,"datasetid":"document","objectid":252888,"filename":"1705.08662","mime_type":"application/pdf","hash":"46f25b9179b68ee5274e306596ceadbb","hash_type":"MD5","filesize":967191,"mtime":"2017-05-30 19:39:59","url":"http://authors.library.caltech.edu/77830/2/1705.08662"}],"eprintid":77830,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1705.08662","content":"submitted"}],"note":"© 2017 Macmillan Publishers Limited. \n\nReceived 23 January 2017. Accepted 21 March 2017. Published online 24 May 2017. \n\nWe thank J. Hennawi, Y. Shen, A. Myers and L. Guzzo for comments on the QSO clustering. Support for R.D. was provided by the DFG priority programme 1573 “The physics of the interstellar medium.” F.W., B.V. and E.P.F. acknowledge support through ERC grant COSMIC-DAWN. R.W. acknowledges support from the National Science Foundation of China (NSFC; grant numbers 11473004 and 11533001) and the National Key Program for Science and Technology Research and Development (grant 2016YFA0400703). ALMA is a partnership of ESO (representing its member states), NSF (USA) and NINS (Japan), together with NRC (Canada), NSC and ASIAA (Taiwan), and KASI (South Korea), in cooperation with Chile. The Joint ALMA Observatory is operated by ESO, AUI/NRAO and NAOJ. E.B. is a Carnegie-Princeton Fellow. \n\nAuthor Contributions: R.D. led the writing and analysis. F.W. was principle investigator of the ALMA programme that led to this discovery. F.W. and B.P.V. played a central part in the project design and implementation. E.P.F. provided the clustering analysis. E.B., B.P.V., E.P.F., C.M., F.W. and H.W.R. contributed to the identification of Pan-STARRS1 quasars. X.F. provided the Hubble observations of J0842+1218. All authors contributed to writing the proposal, and reviewed, discussed and commented on the manuscript. \n\nData Availability. The datasets generated and analysed during this study are available from the corresponding author on reasonable request. The ALMA observations presented here are part of the project 2015.1.01115.S (http://almascience.org/aq?project_code=2015.1.01115.S). \n\nThe authors declare no competing financial interests. \n\nReviewer Information: Nature thanks D. Frayer and the other anonymous reviewer(s) for their contribution to the peer review of this work.","id":77830,"rev_number":14,"userid":6,"eprint_dir":"disk0/00/07/78/30","datestamp":"2017-05-30 20:08:22","lastmod":"2017-05-30 20:08:22","status_changed":"2017-05-30 20:08:22","type":"article","metadata_visibility":"show","creators":[{"given":"R.","family":"Decarli","id":"Decarli-R","orcid":""},{"given":"F.","family":"Walter","id":"Walter-F","orcid":""},{"given":"B. P.","family":"Venemans","id":"Venemans-B-P","orcid":""},{"given":"E.","family":"Bañados","id":"Bañados-E","orcid":""},{"given":"F.","family":"Bertoldi","id":"Bertoldi-F","orcid":""},{"given":"C.","family":"Carilli","id":"Carilli-C-L","orcid":""},{"given":"X.","family":"Fan","id":"Fan-Xiaohui","orcid":""},{"given":"E. P.","family":"Farina","id":"Farina-E-P","orcid":""},{"given":"C.","family":"Mazzucchelli","id":"Mazzucchelli-C","orcid":""},{"given":"D.","family":"Riechers","id":"Riechers-D","orcid":""},{"given":"H.-W.","family":"Rix","id":"Rix-H-W","orcid":""},{"given":"M. A.","family":"Strauss","id":"Straus-M-A","orcid":""},{"given":"R.","family":"Wang","id":"Wang-R","orcid":""},{"given":"Y.","family":"Yang","id":"Yang-Yujin","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-25","date_type":"published","publication":"Nature","volume":"545","number":"7655","pagerange":"457-461","id_number":"CaltechAUTHORS:20170530-122922468","refereed":true,"issn":"0028-0836","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170530-122922468","related_url":[{"url":"https://dx.doi.org/10.1038/nature22358","type":"doi","description":"Article"},{"url":"http://www.nature.com/nature/journal/v545/n7655/full/nature22358.html","type":"pub","description":"Article"},{"url":"http://rdcu.be/s632","type":"pub","description":"Free ReadCube access"},{"url":"https://arxiv.org/abs/1705.08662","type":"arxiv","description":"Discussion Paper"}],"referencetext":["\nStraatman, C. M. S. et al. A substantial population of massive quiescent galaxies at z ~ 4 from ZFOURGE. Astrophys. J. 783, L14 (2014)\nArticle\nShow context\nNayyeri, H. et al. A study of massive and evolved galaxies at high redshift. Astrophys. J. 794, 68 (2014)\nArticle\nShow context\nWhitaker, K. E. et al. Quiescent galaxies in the 3D-HST survey: spectroscopic confirmation of a large number of galaxies with relatively old stellar populations at z ~ 2. Astrophys. J. 770, L39 (2013)\nArticle\nShow context\nBouwens, R. J. et al. UV luminosity functions at redshifts z ~ 4 to z ~ 10: 10,000 galaxies from HST legacy fields. Astrophys. J. 803, 34 (2015)\nArticle\nShow context\nRiechers, D. et al. A dust-obscured massive maximum-starburst galaxy at a redshift of 6.34. Nature 496, 329–333 (2013)\nCASISIPubMedArticle\nShow context\nBertoldi, F. et al. Dust emission from the most distant quasars. Astron. Astrophys. 406, L55–L58 (2003)\nISIArticle\nShow context\nWalter, F. et al. A kiloparsec-scale hyper-starburst in a quasar host less than 1 gigayear after the Big Bang. Nature 457, 699–701 (2009)\nCASPubMedArticle\nShow context\nWang, R. et al. Star formation and gas kinematics of quasar host galaxies at z ~ 6: new insights from ALMA. Astrophys. J. 773, 44 (2013)\nCASArticle\nShow context\nCarilli, C. L. \u0026 Walter, F. Cool gas in high-redshift galaxies. Annu. Rev. Astron. Astrophys. 51, 105–161 (2013)\nCASISIArticle\nShow context\nOmont, A. et al. Molecular gas and dust around a radio-quiet quasar at redshift 4.69. Nature 382, 428–431 (1996)\nCASISIPubMedArticle\nShow context\nTrakhtenbrot, B. et al. ALMA observations show major mergers among the host galaxies of fast-growing, high-redshift supermassive black holes. Astrophys. J. 836, 8 (2017)\nArticle\nShow context\nRiechers, D. A. et al. ALMA imaging of gas and dust in a galaxy protocluster at redshift 5.3: [C II] emission in “typical” galaxies and dusty starbursts ≈1 billion years after the Big Bang. Astrophys. J. 796, 84 (2014)\nCASArticle\nShow context\nNarayanan, D. et al. The formation of submillimetre-bright galaxies from gas infall over a billion years. Nature 525, 496–499 (2015)\nCASPubMedArticle\nShow context\nHabouzit, M., Volonteri, M., Latif, M., Dubois, Y. \u0026 Peirani, S. On the number density of ‘direct collapse’ black hole seeds. Mon. Not. R. Astron. Soc. 463, 529–540 (2016)\nArticle\nShow context\nHerrera-Camus, R. et al. [C II] 158 μm emission as a star formation tracer. Astrophys. J. 800, 1 (2015)\nArticle\nShow context\nDe Looze, I. et al. The applicability of far-infrared fine-structure lines as star formation rate tracers over wide ranges of metallicities and galaxy types. Astron. Astrophys. 568, A62 (2014)\nArticle\nShow context\nBañados, E. et al. The Pan-STARRS1 distant z \u003e 5.6 quasar survey: more than 100 quasars within the first Gyr of the universe. Astrophys. J. Suppl. Ser. 227, 11 (2016)\nArticle\nShow context\nWalter, F. et al. ALMA spectroscopic survey in the Hubble Ultra Deep Field: survey description. Astrophys. J. 833, 67 (2016)\nArticle\nShow context\nBothwell, M. S. et al. A survey of molecular gas in luminous sub-millimetre galaxies. Mon. Not. R. Astron. Soc. 429, 3047–3067 (2013)\nCASArticle\nShow context\nBeelen, A. et al. 350 μm dust emission from high-redshift quasars. Astrophys. J. 642, 694–694 (2006)\nCASArticle\nShow context\nDownes, D. et al. Submillimeter spectrum and dust mass of the primeval galaxy IRAS 10214+4724. Astrophys. J. 398, L25–L27 (1992)\nArticle\nShow context\nBerta, S., Lutz, D., Genzel, R., Förster-Schreiber, N. M. \u0026 Tacconi, L. J. Measures of galaxy dust and gas mass with Herschel photometry and prospects for ALMA. Astron. Astrophys. 587, A73 (2016)\nArticle\nShow context\nFarrah, D. et al. Far-infrared fine-structure line diagnostics of ultraluminous infrared galaxies. Astrophys. J. 776, 38 (2013)\nArticle\nShow context\nMalhotra, S. et al. Far-infrared spectroscopy of normal galaxies: physical conditions in the interstellar medium. Astrophys. J. 561, 766–786 (2001)\nArticle\nShow context\nAravena, M. et al. The ALMA spectroscopic survey in the Hubble Ultra Deep Field: search for [C II] line and dust emission in 6 \u003c z \u003c 8 galaxies. Astrophys. J. 833, 71 (2016)\nArticle\nShow context\nSwinbank, A. M. et al. An ALMA survey of submillimetre galaxies in the Extended Chandra Deep Field-South: detection of [C II] at z = 4.4. Mon. Not. R. Astron. Soc. 427, 1066–1074 (2012)\nArticle\nShow context\nGarcia-Vergara, C., Hennawi, J. F., Barrientos, L. F. \u0026 Rix, H.-W. Strong clustering of Lyman break galaxies around luminous quasars at z~4. Preprint at https://arxiv.org/abs/1701.01114 (2017)\nShow context\nBouwens, R. J. et al. ALMA spectroscopic survey in the Hubble Ultra Deep Field: the infrared excess of UV-selected z = 2–10 galaxies as a function of UV-continuum slope and stellar mass. Astrophys. J. 833, 72 (2016)\nArticle\nShow context\nCapak, P. L. et al. Galaxies at redshifts 5 to 6 with systematically low dust content and high [C II] emission. Nature 522, 455–458 (2015)\nPubMedArticle\nShow context\nKennicutt, R. C. \u0026 Evans, N. J. Star formation in the Milky Way and nearby galaxies. Annu. Rev. Astron. Astrophys. 50, 531–608 (2012)"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Deutsche Forschungsgemeinschaft (DFG)","grant_number":"1573"},{"agency":"European Research Council (ERC)","grant_number":"COSMIC-DAWN"},{"agency":"National Natural Science Foundation of China","grant_number":"11473004"},{"agency":"National Natural Science Foundation of China","grant_number":"11533001"},{"agency":"National Key Basic Research Program of China","grant_number":"2016YFA0400703"},{"agency":"Carnegie-Princeton Fellowship","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"TD","local_group":null}