{"title":"Trapping of peptide-based surrogates in an artificially created channel of cytochrome c peroxidase","uri":"","abstract":"As recently described, the deliberate removal of the proposed electron transfer pathway from cytochrome c peroxidase resulted in the formation of an extended ligand-binding channel. The engineered channel formed a template for the removed peptide segment, suggesting that synthetic surrogates might be introduced to replace the native electron transfer pathway. This approach could be united with the recent development of sensitizer-linked substrates to initiate and study electron transfer, allowing access to unresolved issues about redox mechanism of the enzyme. Here, we present the design, synthesis, and screening of a peptide library containing natural and unnatural amino acids to identify the structural determinants for binding this channel mutant. Only one peptide, (benzimidazole-propionic acid)-Gly-Ala-Ala, appeared to interact, and gave evidence for both reversible and kinetically trapped binding, suggesting multiple conformations for the channel protein. Notably, this peptide was the most analogous to the removed electron transfer sequence, supporting the use of a cavity-template strategy for design of specific sensitizer-linked substrates as replacements for the native electron transfer pathway.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252934","docid":252934,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1264802","fileid":1264802,"datasetid":"document","objectid":252934,"filename":"f6d5beccc301808708a078322c7b63a586bfb1d15ce34728fba5fa90b09d6597.pdf","mime_type":"application/pdf","hash":"9e1a9e39e327ab38ee53d7fd820b3876","hash_type":"MD5","filesize":265526,"mtime":"2017-05-31 16:02:52","url":"http://authors.library.caltech.edu/77847/1/f6d5beccc301808708a078322c7b63a586bfb1d15ce34728fba5fa90b09d6597.pdf"}],"eprintid":77847,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"f6d5beccc301808708a078322c7b63a586bfb1d15ce34728fba5fa90b09d6597.pdf","content":"published"}],"note":"© 2003 The Protein Society. Published by Cold Spring Harbor Laboratory Press. \n\nRECEIVED August 14, 2002; FINAL REVISION November 14, 2002; ACCEPTED November 15, 2002. \n\nWe thank Drs. Stefan Vetter, Alycen Nigro, and Laura Hunsicker-Wang as well as Alex Dunn for help and valuable discussions. This work was supported by NIH Grants GM41049 and GM48495 (to D.B.G and H.B.G.), and NIH NRSA Postdoctoral Fellowship GM20703-03 (to A-M.A.H.). \n\nThe publication costs of this article were defrayed in part by payment of page charges. This article must therefore be hereby marked “advertisement” in accordance with 18 USC section 1734 solely to indicate this fact.","id":77847,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/78/47","datestamp":"2017-05-31 16:40:26","lastmod":"2017-05-31 16:40:26","status_changed":"2017-05-31 16:40:26","type":"article","metadata_visibility":"show","creators":[{"given":"Anna-Maria A.","family":"Hays","id":"Hays-A-M-A","orcid":""},{"given":"Harry B.","family":"Gray","id":"Gray-H-B","orcid":""},{"given":"David B.","family":"Goodin","id":"Goodin-D-B","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Heme enzyme; protein engineering; protein cavities; cavity complementation; chemical rescue; electron transfer pathway; sensitizer-linked substrates","date":"2003-02","date_type":"published","publication":"Protein Science","volume":"12","number":"2","pagerange":"278-287","id_number":"CaltechAUTHORS:20170531-090242293","refereed":true,"issn":"0961-8368","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170531-090242293","related_url":[{"url":"http://dx.doi.org/10.1110/ps.0228403","type":"doi","description":"Article"},{"url":"http://onlinelibrary.wiley.com/doi/10.1110/ps.0228403/abstract","type":"pub","description":"Article"},{"url":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2312424/","type":"pmc","description":"Article"}],"referencetext":["Baldwin, E., Baase, W.A., Zhang, X., Feher, V., and Matthews, B.W. 1998. Generation of ligand binding sites in T4 lysozyme by deficiency-creating substitutions. J. Mol. Biol. 277: 467–485.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 26\nBarrick, D. 1994. Replacement of the proximal ligand of sperm whale myoglobin with free imidazole in the mutant His-93 \u003e Gly. Biochemistry 33: 6546–6554.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 134\nBeratan, D.N., Onuchic, J.N., Winkler, J.R., and Gray, H.B. 1992. Electron-tunneling pathways in proteins. Science 258: 1740–1741.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 321 | ADS\nBonagura, C.A., Sundaramoorthy, M., Bhaskar, B., and Poulos, T.L. 1999. The effects of an engineered cation site on the structure, activity, and EPR properties of cytochrome c peroxidase. Biochemistry 38: 5538–5545.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 16\nCao, Y., Musah, R.A., Wilcox, S.K., Goodin, D.B., and McRee, D.E. 1998. Protein conformer selection by ligand binding observed with crystallography. Protein Sci. 7: 72–78.\nWiley Online Library | PubMed | CAS | Web of Science® Times Cited: 18\nCarugo, O. and Argos, P. 1998. Accessibility to internal cavities and ligand binding sites monitored by protein crystallographic thermal factors. Proteins Struct. Funct. Genet. 31: 201–213.\nWiley Online Library | PubMed | CAS | Web of Science® Times Cited: 29\nDavies, T.G., Hubbard, R.E., and Tame, J.R. 1999. Relating strucuture to thermodynamics: The crystal structures and binding affinity of eight OppA-peptide complexes. Protein Sci. 8: 1432–1444.\nWiley Online Library | PubMed | CAS | Web of Science® Times Cited: 31\nDenblaauwen, T., Hoitink, C.W.G., Canters, G.W., Han, J., Loehr, T.M., and Sandersloehr, J. 1993. Resonance raman spectroscopy of the azurin His117Gly mutant—Interconversion of type-1 and type-2 copper sites through exogenous ligands. Biochemistry 32: 12455–12464.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 52\nDmochowski, I.J., Crane, B.R., Wilker, J.J., Winkler, J.R., and Gray, H.B. 1999. Optical detection of cytochrome P450 by sensitizer-linked substrates. Proc. Natl. Acad. Sci. 96: 12987–12990.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 39 | ADS\nDmochowski, I.J., Winkler, J.R., and Gray, H.B. 2000. Enantiomeric discrimination of Ru-substrates by cytochrome P450cam. J. Inorg. Biochem. 81: 221–228.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 17\nDmochowski, I.J., Dunn, A.R., Wilker, J.J., Crane, B.R., Green, M.T., Dawson, J.H., Sligar, S.G., Winkler, J.R., and Gray, H.B. 2002. Sensitizer-linked substrates and ligands: Ruthenium probes of cytochrome P450 structure and mechanism. Methods Enzymol. 357: 120–133.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 11\nDunn, A.R., Dmochowski, I.J., Bilwes, A.M., Gray, H.B., and Crane, B.R. 2001. Probing the open state of cytochrome P450cam with ruthenium-linker substrates. Proc. Natl. Acad. Sci. 98: 12420–12425.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 47 | ADS\nDunn, A.R., Hays, A.-M.A., Chiu, R., Winkler, J.R., Stout, C.D., Goodin, D.B., and Gray, H.B. 2002. Fluorescent probes for cytochrome P450 structural characterization and inhibitor screening. J. Am. Chem. Soc. 124: 10254–10255.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 10\nEriksson, A.E., Baase, W.A., Wozniak, J.A., and Matthews, B.W. 1992. A cavity-containing mutant of T4 lysozyme is stabilized by buried benzene. Nature 355: 371–373.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 142 | ADS\nErman, J.E., Vitello, L.B., Mauro, J.M., and Kraut, J. 1989. Detection of an oxyferryl porphyrin π-cation-radical intermediate in the reaction between hydrogen peroxide and a mutant yeast cytochrome c peroxidase. Evidence for tryptophan-191 involvement in the radical site of compound I. Biochemistry 28: 7992–7995.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 157\nErman, J.E., Kresheck, G.C., Vitello, L.B., and Miller, M.A. 1997. Cytochrome c/cytochrome c peroxidase complex: Effect of binding-site mutations on the thermodynamics of complex formation. Biochemistry 36: 4054–4060.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 29\nFitzgerald, M.M., Churchill, M.J., McRee, D.E., and Goodin, D.B. 1994. Small molecule binding to an artificially created cavity at the active site of cytochrome c peroxidase. Biochemistry 33: 3807–3818.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 82\nFitzgerald, M.M., Trester, M.L., Jensen, G.M., McRee, D.E., and Goodin, D.B. 1995. The role of aspartate-235 in the binding of cations to an artificial cavity at the radical site of cytochrome c peroxidase. Protein Sci. 4: 1844–1850.\nWiley Online Library | PubMed | CAS | Web of Science® Times Cited: 25\nFitzgerald, M.M., Musah, R.A., McRee, D.E., and Goodin, D.B. 1996. A ligand-gated, hinged loop rearrangement opens a channel to a buried artificial protein cavity. Nat. Struct. Biol. 3: 626–631.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 34\nGoodin, D.B. 1996. When an amide is more like histidine than imidazole: The role of axial ligands in heme catalysis. J. Biol. Inorg. Chem. 1: 360–363.\nCrossRef | CAS | Web of Science® Times Cited: 33\nGoodin, D.B. and McRee, D.E. 1993. The Asp-His-Fe triad of cytochrome-c peroxidase controls the reduction potential, electronic structure, and coupling of the tryptophan free radical to the heme. Biochemistry 32: 3313–3324.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 193\nGoodin, D.B., Mauk, A.G., and Smith, M. 1987. The peroxide complex of yeast cytochrome c peroxidase contains two distinct radical species, neither of which resides at methionine 172 or tryptophan 51. J. Biol. Chem. 262: 7719–7724.\nPubMed | CAS | Web of Science® Times Cited: 76\nGoodin, D.B., Davidson, M.G., Roe, J.A., Mauk, A.G., and Smith, M. 1991. Amino acid substitutions at tryptophan-51 of cytochrome-c peroxidase—Effects on coordination, species preference for cytochrome-c, and electron transfer. Biochemistry 30: 4953–4962.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 70\nHays, A.M., Vassiliev, I.R., Golbeck, J.H., and Debus, R. J. 1998. Role of D1-His190 in proton-coupled electron transfer reactions in photosystem II: A chemical complementation study. Biochemistry 37: 11352–11365.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 125\nHirst, J. and Goodin, D.B. 2000. Unusual oxidative chemistry of Nw-hydroxyarginine and N-hydroxyguanidine catalyzed at an engineered cavity in a heme peroxidase. J. Biol. Chem. 275: 8582–8591.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 27\nHirst, J., Wilcox, S.K., Ai, J., Moënne-Loccoz, P., Loehr, T.M., and Goodin, D.B. 2001a. Replacement of the axial histidine ligand with imidazole in cytochrome c peroxidase. 2. Effects on heme coordination and function. Biochemistry 40: 1274–1283.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 27\nHirst, J., Wilcox, S.K., Williams, P.A., Blankenship, J., McRee, D.E., and Goodin, D.B. 2001b. Replacement of the axial histidine ligand with imidazole in cytochrome c peroxidase. 1. Effects on structure. Biochemistry 40: 1265–1273.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 23\nHouseman, A.L.P., Doan, P.E., Goodin, D.B., and Hoffman, B.M. 1993. Comprehensive explanation of the anomalous EPR spectra of wild-type and mutant cytochrome-c peroxidase compound-ES. Biochemistry 32: 4430–4443.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 82\nHuyett, J.E., Doan, P.E., Gurbiel, R., Houseman, A.L.P., Sivaraja, M., Goodin, D.B., and Hoffman, B.M. 1995. Compound ES of cytochrome c peroxidase contains a Trp p-cation radical: Characterization by CW and pulsed Q-band ENDOR spectroscopy. J. Am. Chem. Soc. 117: 9033–9041.\nCrossRef | CAS | Web of Science® Times Cited: 120\nJensen, G.M., Bunte, S.W., Warshel, A., and Goodin, D.B. 1998. Energetics of cation radical formation at the proximal active site tryptophan of cytochrome c peroxidase and ascorbate peroxidase. J. Phys. Chem. B 102: 8221–8228.\nCrossRef | CAS | Web of Science® Times Cited: 36\nLeesch, V.W., Bujons, J., Mauk, A.G., and Hoffman, B.M. 2000. Cytochrome c peroxidase–cytochrome c complex: Locating the second binding domain on cytochrome c peroxidase with site-directed mutagenesis. Biochemistry 39: 10132–10139.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 36\nLin, J.-H., Perryman, A.L., Schames, J.R., and McCammon, J.A. 2002. Computational drug design accommodating receptor flexibility: The relaxed complex scheme. J. Am. Chem. Soc. 124: 5632–5633.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 86\nMa, B., Shatsky, M., Wolfson, H.J., and Nussinov, R. 2002. Multiple diverse ligands binding at a single protein site: A matter of pre-existing populations. Protein Sci. 11: 184–197.\nWiley Online Library | PubMed | CAS | Web of Science® Times Cited: 140\nMcRee, D.E., Jensen, G.M., Fitzgerald, M.M., Siegel, H.A., and Goodin, D.B. 1994. Construction of a bisaquo heme enzyme and binding by exogenous ligands. Proc. Natl. Acad. Sci. 91: 12847–12851.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 63 | ADS\nMei, H., Wang, K., Peffer, N., Weatherly, G., Cohen, D.S., Miller, M., Pielak, G., Durham, B., and Millett, F. 1999. Role of configurational gating in intracomplex electron transfer from cytochrome c to the radical cation in cytochrome c peroxidase. Biochemistry 38: 6846–6854.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 46\nMiller, M.A., Geren, L., Han, G.W., Saunders, A., Beasley, J., Pielak, G.J., Durham, B., Millett, F., and Kraut, J. 1996. Identifying the physiological electron transfer site of cytochrome c peroxidase by structure-based engineering. Biochemistry 35: 667–673.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 32\nMillett, F., Miller, M.A., Geren, L., and Durham, B. 1995. Electron transfer between cytochrome c and cytochrome c peroxidase [review]. J. Bioenerg. Biomembr. 27: 341–351.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 30\nMorton, A. and Matthews, B.W. 1995. Specificity of ligand binding in a buried nonpolar cavity of T4 lysozyme: Linkage of dynamics and structural plasticity. Biochemistry 34: 8576–8588.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 92\nMusah, R.A. and Goodin, D.B. 1997. Introduction of novel substrate oxidation into a heme peroxidase by cavity complementation: Oxidation of 2-aminothiazole and covalent modification of the enzyme. Biochemistry 36: 11665–11674.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 33\nMusah, R.A. and Goodin, D.B. 1999. Introduction of novel substrate oxidation into cytochrome c peroxidase by cavity complementation: Oxidation of 2-aminothiazone and covalent modification of the enzyme. Chemtracts 12: 79–86.\nMusah, R.A., Jensen, G.M., Rosenfeld, R.J., Bunte, S.W., McRee, D.E., and Goodin, D.B. 1997. Variation in strength of a CH to O hydrogen bond in an artificial cavity. J. Am. Chem. Soc. 119: 9083–9084.\nCrossRef | CAS | Web of Science® Times Cited: 66\nMusah, R.A., Jensen, G.M., Bunte, S.W., Rosenfeld, R.J., and Goodin, D.B. 2002. Artificial protein cavities as specific ligand-binding templates: Characterization of an engineered heterocyclic cation binding site that preserves the evolved specificity of the parent protein. J. Mol. Biol. 315: 845–857.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 19\nNewmyer, S.L. and Ortiz de Montellano, P.R. 1996. Rescue of the catalytic activity of an H42A mutant of horseradish peroxidase by exogenous imidazoles. J. Biol. Chem. 271: 14891–14896.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 55\nNicola, N.A., Minasian, E., Appleby, C.A., and Leach, S.J. 1975. Biochemistry 14: 5141.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 66\nNocek, J.M., Zhou, J.S., and Hoffman, B.M. 1997. Quenching as a four-dimensional experiment: Application to the multi-domain binding of cytochrome c by cytochrome c peroxidase. J. Electroanal. Chem. 438: 55–60.\nCrossRef | Web of Science® Times Cited: 7\nNocek, J.M., Leesch, V.W., Zhou, J.S., Jiang, M., and Hoffman, B.M. 2000. Multi-domain binding of cytochrome c peroxidase by cytochrome c: Thermodynamic vs. microscopic binding constants. Isr. J. Chem. 40: 35–46.\nWiley Online Library | CAS | Web of Science® Times Cited: 7\nPelletier, H. and Kraut, J. 1992. Crystal structure of a complex between electron transfer partners, cytochrome-c peroxidase and cytochrome-c. Science 258: 1748–1755.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 529 | ADS\nRosenfeld, R.J., Hays, A.-M.A., Musah, R.A., and Goodin, D.B. 2002. Excision of a proposed electron transfer pathway in cytochrome c peroxidase and its replacement by a ligand-binding channel. Protein Sci. 11: 1251–1259.\nWiley Online Library | PubMed | CAS | Web of Science® Times Cited: 3\nShen, T.Y., Tai, K., and McCammon, J.A. 2001. Statistical analysis of the fractal gating motions of the enzyme acetylcholinesterase. Phys. Rev. E Stat. Nonlinear Soft Matter Phys. 63: 0419021–0419026.\nCrossRef | Web of Science® Times Cited: 23 | ADS\nSinha, H.K., Dogra, S.K., and Sneh K. 1989. Environmental effects on the absorption and fluorescnce spectral characterisics of benzimidazole-2-carboxylic acid. Bull. Chem. Soc. Jpn. 62: 2668–2675.\nCrossRef | CAS | Web of Science® Times Cited: 8\nSivaraja, M., Goodin, D.B., Smith, M., and Hoffman, B.M. 1989. Identification by ENDOR of Trp191 as the free-radical site in cytochrome c peroxidase compound ES. Science 245: 738–740.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 365 | ADS\nSleigh, S.H., Seavers, P.R., Wilkinson, A.J., Ladbury, J.E., and Tame, J.R. 1999. Crystallographic and calorimetric analysis of peptide binding to OppA protein. J. Mol. Biol. 291: 393–415.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 62\nToney, M.D. and Kirsch, J.F. 1989. Direct bronsted analysis of the restoration of activity to a mutant enzyme by exogenous amines. Science 243: 1485–1488.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 181 | ADS\nUpadhyay, R.K. and Srivastava, S.D. 1994. New heterocycles: Synthesis and biological evaluation. Indian J. Heterocyclic Chem. 4: 121–124.\nCAS\nVandekamp, M., Floris, R., Hali, F.C., and Canters, G.W. 1990. Site-directed mutagenesis reveals that the hydrophobic patch of asurin mediates electron transfer. J. Am. Chem. Soc. 112: 907–908.\nCrossRef | CAS | Web of Science® Times Cited: 87\nWade, W.S., Mrksich, M., and Dervan, P.B. 1992. Design of peptides that bind in the minor groove of DNA at 5′-(A,T)G(A,T)C(A,T)-3′ sequences by a dimeric side-by-side motif. J. Am. Chem. Soc. 114: 8783–8794.\nCrossRef | CAS | Web of Science® Times Cited: 198\nWang, K., Mei, H., Geren, L., Miller, M.A., Saunders, A., Wang, X., Pielak, G.J., Durham, B., and Millett, F. 1996. Design of a ruthenium-cytochrome c derivative to measure electron transfer to the radical cation and oxyferryl heme in cytochrome c peroxidase. Biochemistry 35: 15107–15119.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 37\nWang, X. and Pielak, G.J. 1999. Equilibrium thermodynamics of a physiologically-relevant heme–protein complex. Biochemistry 38: 16876–16881.\nCrossRef | PubMed | CAS | Web of Science® Times Cited: 20\nWilker, J.J., Dmochowski, I.J., Dawson, J.H., Winkler, J.R., and Gray, H.B. 1999. Substrates for rapid delivery of electrons and holes to buried active sites in proteins. Angew. Chem. 38: 90–92.\nCrossRef | CAS | Web of Science® Times Cited: 43\nWilks, A., Sun, J., Loehr, T.M., and Ortiz de Montellano, P.R. 1995. Heme oxygenase His25Ala mutant: Replacement of the proximal histidine iron ligand by exogenous bases restores catalytic activity. J. Am. Chem. Soc. 117: 2925–2926.\nCrossRef | CAS | Web of Science® Times Cited: 46\nWirstam, M., Blomberg, M.R.A., and Siegbahn, P.E.M. 1999. Reaction mechanism of compound I formation in heme peroxidases: A density functional theory study. J. Am. Chem. Soc. 121: 10178–10185.\nCrossRef | CAS | Web of Science® Times Cited: 87\nYonetani, T. 1976. Cytochrome c peroxidase. Academic Press, New York."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Hays, A.-M. A., Gray, H. B. and Goodin, D. B. (2003), Trapping of peptide-based surrogates in an artificially created channel of cytochrome c peroxidase. Protein Science, 12: 278–287. doi:10.1110/ps.0228403","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":"GM41049"},{"agency":"NIH","grant_number":"GM48495"},{"agency":"NIH Postdoctoral Fellowship","grant_number":"GM20703-03"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}