{"title":"Converging on the Initial Mass Function of Stars","uri":"","abstract":"Understanding the origin of stellar masses—the initial mass function (IMF)— remains one of the most challenging problems in astrophysics. The IMF is a key ingredient for simulations of galaxy formation and evolution, and is used to calibrate star formation relations in extra-galactic observations. Modeling the IMF directly in hydrodynamical simulations has been attempted in several previous studies, but the most important processes that control the IMF remain poorly understood. This is because predicting the IMF from direct hydrodynamical simulations involves complex physics such as turbulence, magnetic fields, radiation feedback and mechanical feedback, all of which are difficult to model and the methods used have limitations in terms of accuracy and computational efficiency. Moreover, a physical interpretation of the simulated IMFs requires a numerically converged solution at high resolution, which has so far not been convincingly demonstrated. Here we present a resolution study of star cluster formation aimed at producing a converged IMF. We compare a set of magnetohydrodynamical (MHD) adaptive-mesh-refinement simulations with three different implementations of the thermodynamics of the gas: 1) with an isothermal equation of state (EOS), 2) with a polytropic EOS, and 3) with a simple stellar heating feedback model. We show that in the simulations with an isothermal or polytropic EOS, the number of stars and their mass distributions depend on the numerical resolution. By contrast, the simulations that employ the simple radiative feedback module demonstrate convergence in the number of stars formed and in their IMFs.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252950","docid":252950,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1264912","fileid":1264912,"datasetid":"document","objectid":252950,"filename":"Federrath_2017_J._Phys.%3A_Conf._Ser._837_012007.pdf","mime_type":"application/pdf","hash":"4c5d4f7721d5b29f7a873a27f8a66348","hash_type":"MD5","filesize":3219315,"mtime":"2017-05-31 17:53:08","url":"http://authors.library.caltech.edu/77856/1/Federrath_2017_J._Phys.%253A_Conf._Ser._837_012007.pdf"}],"eprintid":77856,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"Federrath_2017_J._Phys.%3A_Conf._Ser._837_012007.pdf","content":"published"}],"note":"© 2017 Published under licence by IOP Publishing Ltd. Content from this work may be used under the terms of the Creative Commons Attribution 3.0 licence. Any further distribution of this work must maintain attribution to the author(s) and the title of the work, journal citation and DOI. \n\nWe thank the anonymous referee for their useful comments on the manuscript. C.F. gratefully acknowledges funding provided by the Australian Research Council's Discovery Projects (grants DP150104329 and DP170100603). The simulations presented in this work used high performance computing resources provided by the Leibniz Rechenzentrum and the Gauss Centre for Supercomputing (grants pr32lo, pr48pi and GCS Large-scale project 10391), the Partnership for Advanced Computing in Europe (PRACE grant pr89mu), the Australian National Computational Infrastructure (grant ek9), and the Pawsey Supercomputing Centre with funding from the Australian Government and the Government of Western Australia, in the framework of the National Computational Merit Allocation Scheme and the ANU Allocation\nScheme. The simulation software FLASH was in part developed by the DOE-supported Flash Center for Computational Science at the University of Chicago.","id":77856,"rev_number":10,"userid":18,"eprint_dir":"disk0/00/07/78/56","datestamp":"2017-05-31 18:05:18","lastmod":"2017-05-31 18:05:18","status_changed":"2017-05-31 18:05:18","type":"article","metadata_visibility":"show","creators":[{"given":"Christoph","family":"Federrath","id":"Federrath-C","orcid":""},{"given":"Mark","family":"Krumholz","id":"Krumholz-M-R","orcid":""},{"given":"Philip F.","family":"Hopkins","id":"Hopkins-P-F","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-30","date_type":"published","publication":"Journal of Physics Conference Series","volume":"837","number":"","pagerange":"Art. No. 012007","id_number":"CaltechAUTHORS:20170531-105304416","refereed":true,"issn":"1742-6588 ","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170531-105304416","related_url":[{"url":"https://doi.org/10.1088/1742-6596/837/1/012007","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.1088/1742-6596/837/1/012007/meta","type":"pub","description":"Article"}],"referencetext":["[1]\nSalpeter E E 1955 ApJ 121 161\nCrossref  \n\n[2]\nKroupa P 2001 MNRAS 322 231-246 Preprint arXiv:astro-ph/0009005\nCrossrefPreprint  \n\n[3]\nMuench A A, Lada E A, Lada C J and Alves J 2002 ApJ 573 366-393 Preprint arXiv:astro-ph/0203122\nIOPsciencePreprint  \n\n[4]\nChabrier G 2003 Publ. Astron. Soc. Pacific 115 763-795 Preprint arXiv:astro-ph/0304382\nIOPsciencePreprint  \n\n[5]\nAlves J, Lombardi M and Lada C J 2007 A\u0026A 462 L17-L21 Preprint arXiv:astro-ph/0612126\nCrossrefPreprint  \n\n[6]\nSmith R J, Clark P C and Bonnell I A 2009 MNRAS 396 830-841 Preprint0903.3240\nCrossrefPreprint  \n\n[7]\nAndré P, Men’shchikov A, Bontemps S, Könyves V, Motte F, Schneider N, Didelon P, Minier V, Saraceno P, Ward-Thompson D, di Francesco J, White G, Molinari S, Testi L, Abergel A, Griffin M, Henning T, Royer P, Merín B, Vavrek R, Attard M, Arzoumanian D, Wilson C D, Ade P, Aussel H, Baluteau J P, Benedettini M, Bernard J P, Blommaert J A D L, Cambrésy L, Cox P, di Giorgio A, Hargrave P, Hennemann M, Huang M, Kirk J, Krause O, Launhardt R, Leeks S, Le Pennec J, Li J Z, Martin P G, Maury A, Olofsson G, Omont A, Peretto N, Pezzuto S, Prusti T, Roussel H, Russeil D, Sauvage M, Sibthorpe B, Sicilia-Aguilar A, Spinoglio L, Waelkens C, Woodcraft A and Zavagno A 2010 A\u0026A 518 L102 Preprint1005.2618\nCrossrefPreprint  \n\n[8]\nOffner S S R, Clark P C, Hennebelle P, Bastian N, Bate M R, Hopkins P F, Moraux E and Whitworth A P 2014 Protostars and Planets VI 53-75 Preprint1312.5326\nPreprint  \n\n[9]\nBate M R, Bonnell I A and Bromm V 2003 MNRAS 339 577-599 Preprint arXiv:astro-ph/0212380\nCrossrefPreprint  \n\n[10]\nClark P C, Bonnell I A and Klessen R S 2008 MNRAS 386 3-10 Preprint0803.4053\nCrossrefPreprint  \n\n[11]\nPrice D J and Bate M R 2008 MNRAS 385 1820-1834 Preprint0801.3293\nCrossrefPreprint  \n\n[12]\nGirichidis P, Federrath C, Banerjee R and Klessen R S 2011 MNRAS 413 2741-2759 Preprint1008.5255\nCrossrefPreprint  \n\n[13]\nKrumholz M R, Klein R I and McKee C F 2012 ApJ 754 71 Preprint1203.2620\nIOPsciencePreprint  \n\n[14]\nMyers A T, McKee C F, Cunningham A J, Klein R I and Krumholz M R 2013 ApJ 766 97 Preprint1211.3467\nIOPsciencePreprint  \n\n[15]\nBertelli Motta C, Clark P C, Glover S C O, Klessen R S and Pasquali A 2016 MNRAS 462 4171-4182 Preprint1608.01306\nCrossrefPreprint  \n\n[16]\nLiptai D, Price D J, Wurster J and Bate M R 2016 MNRAS Accepted (arXiv:1610.07619) (Preprint1610.07619)\nPreprint  \n\n[17]\nKrumholz M R, Klein R I and McKee C F 2007 ApJ 656 959-979 Preprint arXiv:astro-ph/0609798\nIOPsciencePreprint  \n\n[18]\nBate M R 2009 MNRAS 392 1363-1380 Preprint0811.1035\nCrossrefPreprint  \n\n[19]\nKuiper R, Klahr H, Beuther H and Henning T 2010 ApJ 722 1556-1576 Preprint1008.4516\nIOPsciencePreprint  \n\n[20]\nCommerçon B, Hennebelle P, Audit E, Chabrier G and Teyssier R 2010 A\u0026A 510 L3 Preprint0912.3138\nCrossrefPreprint  \n\n[21]\nCommerçon B, Hennebelle P and Henning T 2011 ApJ 742 L9 Preprint1110.2955\nIOPsciencePreprint  \n\n[22]\nPeters T, Banerjee R, Klessen R S and Mac Low M 2011 ApJ 729 72 Preprint1010.5905\nIOPsciencePreprint  \n\n[23]\nMyers A T, Klein R I, Krumholz M R and McKee C F 2014 MNRAS 439 3420-3438 Preprint1401.6096\nCrossrefPreprint  \n\n[24]\nNakamura F and Li Z Y 2007 ApJ 662 395-412 Preprintastro-ph/0703152\nIOPsciencePreprint  \n\n[25]\nNakamura F and Li Z Y 2011 ApJ 740 36 Preprint1107.3616\nIOPsciencePreprint  \n\n[26]\nCunningham A J, Klein R I, Krumholz M R and McKee C F 2011 ApJ 740 107 Preprint1104.1218\nIOPsciencePreprint  \n\n[27]\nFederrath C, Schrön M, Banerjee R and Klessen R S 2014 ApJ 790 128 Preprint1406.3625\nIOPsciencePreprint  \n\n[28]\nBerger M J and Colella P 1989 Journal of Computational Physics 82 64-84\nCrossref  \n\n[29]\nFryxell B, Olson K, Ricker P, Timmes F X, Zingale M, Lamb D Q, MacNeice P, Rosner R, Truran J W and Tufo H 2000 ApJ 131 273-334\nIOPscience  \n\n[30]\nDubey A, Fisher R, Graziani C, Jordan G C IV, Lamb D Q, Reid L B, Rich P, Sheeler D, Townsley D and Weide K 2008 Numerical Modeling of Space Plasma Flows Astronomical Society of the Pacific Conference Series 385 ed N V Pogorelov, E Audit and G P Zank 145\n  \n\n[31]\nWaagan K, Federrath C and Klingenberg C 2011 Journal of Computational Physics 230 3331-3351\nCrossref  \n\n[32]\nBouchut F, Klingenberg C and Waagan K 2007 Numerische Mathematik 108 7-42\nCrossref  \n\n[33]\nBouchut F, Klingenberg C and Waagan K 2010 Numerische Mathematik 115 647-679\nCrossref  \n\n[34]\nWaagan K 2009 Journal of Computational Physics 228 8609-8626\nCrossref  \n\n[35]\nFederrath C, Roman-Duval J, Klessen R S, Schmidt W and Mac Low M 2010 A\u0026A 512 A81\nCrossref  \n\n[36]\nMac Low M M and Klessen R S 2004 RvMP 76 125-194\n  \n\n[37]\nElmegreen B G 2009 IAU Symposium (IAU Symposium) 254 ed J Andersen, J Bland-Hawthorn and B Nordström 289\n  \n\n[38]\nFederrath C, Rathborne J M, Longmore S N, Kruijssen J M D, Bally J, Contreras Y, Crocker R M, Garay G, Jackson J M, Testi L and Walsh A J 2016 IAU Symposium 322 In press (arXiv:1609.08726) (Preprint1609.08726)\nPreprint  \n\n[39]\nPadoan P and Nordlund Å 2002 ApJ 576 870-879\nIOPscience  \n\n[40]\nElmegreen B G and Scalo J 2004 ARAA 42 211-273 Preprintastro-ph/0404451\nCrossrefPreprint  \n\n[41]\nKrumholz M R and McKee C F 2005 ApJ 630 250-268 Preprint arXiv:astro-ph/0505177\nIOPsciencePreprint  \n\n[42]\nMcKee C F and Ostriker E C 2007 ARAA 45 565-687 Preprint0707.3514\nCrossrefPreprint  \n\n[43]\nHennebelle P and Chabrier G 2008 ApJ 684 395-410 Preprint0805.0691\nIOPsciencePreprint  \n\n[44]\nHennebelle P and Chabrier G 2009 ApJ 702 1428-1442 Preprint0907.2765\nIOPsciencePreprint  \n\n[45]\nHennebelle P and Falgarone E 2012 A\u0026A Rev. 20 55 Preprint1211.0637\nCrossrefPreprint  \n\n[46]\nFederrath C and Klessen R S 2012 ApJ 761 156 Preprint1209.2856\nIOPsciencePreprint  \n\n[47]\nHopkins P F 2013 MNRAS 430 1653-1693 Preprint1210.0903\nCrossrefPreprint  \n\n[48]\nKrumholz M R 2014 Physics Reports 539 49 Preprint1402.0867\nCrossrefPreprint  \n\n[49]\nPadoan P, Federrath C, Chabrier G, Evans N J II, Johnstone D, Jørgensen J K, McKee C F and Nordlund Å 2014 Protostars and Planets VI 77-100 Preprint1312.5365\nPreprint  \n\n[50]\nMac Low M M, Klessen R S, Burkert A and Smith M D 1998 PhRvL 80 2754-2757 Preprint arXiv:astro-ph/9712013\nPreprint  \n\n[51]\nStone J M, Ostriker E C and Gammie C F 1998 ApJ 508 L99-L102 Preprint arXiv:astro-ph/9809357\nIOPsciencePreprint  \n\n[52]\nHeyer M H, Williams J P and Brunt C M 2006 ApJ 643 956-964 Preprint arXiv:astro-ph/051144l\nIOPsciencePreprint  \n\n[53]\nBrunt C M, Heyer M H and Mac Low M 2009 A\u0026A 504 883-890 Preprint0910.0398\nCrossrefPreprint  \n\n[54]\nLarson R B 1981 MNRAS 194 809-826\nCrossref  \n\n[55]\nHeyer M H and Brunt C M 2004 ApJ 615 L45-L48 Preprint arXiv:astro-ph/0409420\nIOPsciencePreprint  \n\n[56]\nRoman-Duval J, Federrath C, Brunt C, Heyer M, Jackson J and Klessen R S 2011 ApJ 740 120 Preprint1107.4569\nIOPsciencePreprint  \n\n[57]\nKritsuk A G, Norman M L, Padoan P and Wagner R 2007 ApJ 665 416-431 Preprintastro-ph/07043851\nIOPsciencePreprint  \n\n[58]\nSchmidt W, Federrath C, Hupp M, Kern S and Niemeyer J C 2009 A\u0026A 494 127\nCrossref  \n\n[59]\nFederrath C and Klessen R S 2013 ApJ 763 51 Preprint1211.6433\nIOPsciencePreprint  \n\n[60]\nFederrath C 2013 MNRAS 436 1245-1257 Preprint1306.3989\nCrossrefPreprint  \n\n[61]\nEswaran V and Pope S B 1988 Computers and Fluids 16 257-278\nCrossref  \n\n[62]\nSchmidt W, Hillebrandt W and Niemeyer J C 2006 Computers and Fluids 35 353-371\nCrossref  \n\n[63]\nFederrath C, Rathborne J M, Longmore S N, Kruijssen J M D, Bally J, Contreras Y, Crocker R M, Garay G, Jackson J M, Testi L and Walsh A J 2016 ApJ In press (arXiv:1609.05911) (Preprint1609.05911\nPreprint  \n\n[64]\nFederrath C, Klessen R S and Schmidt W 2008 ApJ 688 L79-L82\nIOPscience  \n\n[65]\nMolina F Z, Glover S C O, Federrath C and Klessen R S 2012 MNRAS 423 2680-2689\nCrossref  \n\n[66]\nKonstandin L, Federrath C, Klessen R S and Schmidt W 2012 JFM 692 183-206 Preprint1111.2748\nCrossrefPreprint  \n\n[67]\nNolan C A, Federrath C and Sutherland R S 2015 MNRAS 451 1380-1389 Preprint1504.04370\nCrossrefPreprint  \n\n[68]\nFederrath C and Banerjee S 2015 MNRAS 448 3297-3313 Preprint1412.2756\nCrossrefPreprint  \n\n[69]\nPadoan P, Jones B J T and Nordlund A P 1997 ApJ 474 730 Preprint arXiv:astro-ph/960306l\nIOPsciencePreprint  \n\n[70]\nBrunt C M 2010 A\u0026A 513 A67 Preprint1002.1239\nCrossrefPreprint  \n\n[71]\nPrice D J, Federrath C and Brunt C M 2011 ApJ 727 L21 Preprint1010.3754\nIOPsciencePreprint  \n\n[72]\nGinsburg A, Federrath C and Darling J 2013 ApJ 779 50 Preprint1310.0809\nIOPsciencePreprint  \n\n[73]\nKainulainen J, Federrath C and Henning T 2013 A\u0026A 553 L8\nCrossref  \n\n[74]\nFederrath C, Banerjee R, Clark P C and Klessen R S 2010 ApJ 713 269-290 Preprint1001.4456\nIOPsciencePreprint  \n\n[75]\nTruelove J K, Klein R I, McKee C F, Holliman J H II, Howell L H and Greenough J A 1997 ApJ 489 L179\nIOPscience  \n\n[76]\nFederrath C, Sur S, Schleicher D R G, Banerjee R and Klessen R S 2011 ApJ 731 62\nIOPscience  \n\n[77]\nSur S, Schleicher D R G, Banerjee R, Federrath C and Klessen R S 2010 ApJ 721 L134-L138\nIOPscience  \n\n[78]\nRicker P M 2008 ApJ 176 293-300 Preprint0710.4397\nIOPsciencePreprint  \n\n[79]\nSutherland R S and Dopita M A 1993 ApJ 88 253-327\nCrossref  \n\n[80]\nGlover SCO, Federrath C, Mac Low M and Klessen R S 2010 MNRAS 404 2-29 Preprint0907.4081\nPreprint  \n\n[81]\nGrassi T, Bovino S, Schleicher D R G, Prieto J, Seifried D, Simoncini E and Gianturco F A 2014 MNRAS 439 2386-2419 Preprint1311.1070\nCrossrefPreprint  \n\n[82]\nMasunaga H and Inutsuka S i 2000 ApJ 531 350-365\nIOPscience  \n\n[83]\nWolfire M G, Hollenbach D, McKee C F, Tielens A G G M and Bakes E L O 1995 ApJ 443 152-168\nCrossref  \n\n[84]\nOmukai K, Tsuribe T, Schneider R and Ferrara A 2005 ApJ 626 627-643 Preprint arXiv:astro-ph/0503010\nIOPsciencePreprint  \n\n[85]\nPavlovski G, Smith M D and Mac Low M M 2006 MNRAS 368 943-958 Preprint arXiv:astro-ph/0504504\nCrossrefPreprint  \n\n[86]\nGlover S C O and Mac Low M M 2007 ApJ 169 239-268 Preprint arXiv:astro-ph/0605120\nIOPsciencePreprint  \n\n[87]\nGlover S C O and Mac Low M M 2007 ApJ 659 1317-1337 Preprint arXiv:astro-ph/060512l\nIOPsciencePreprint  \n\n[88]\nHill T, Motte F, Didelon P, Bontemps S, Minier V, Hennemann M, Schneider N, André P, Men’shchikov A, Anderson L D, Arzoumanian D, Bernard J P, di Francesco J, Elia D, Giannini T, Griffin M J, Könyves V, Kirk J, Marston A P, Martin P G, Molinari S, Nguyen Luong Q, Peretto N, Pezzuto S, Roussel H, Sauvage M, Sousbie T, Testi L, Ward-Thompson D, White G J, Wilson C D and Zavagno A 2011 A\u0026A 533 A94 Preprint1108.0941\nCrossrefPreprint  \n\n[89]\nHennemann M, Motte F, Schneider N, Didelon P, Hill T, Arzoumanian D, Bontemps S, Csengeri T, André P, Konyves V, Louvet F, Marston A, Men’shchikov A, Minier V, Nguyen Luong Q, Palmeirim P, Peretto N, Sauvage M, Zavagno A, Anderson L D, Bernard J P, Di Francesco J, Elia D, Li J Z, Martin P G, Molinari S, Pezzuto S, Russeil D, Rygl K L J, Schisano E, Spinoglio L, Sousbie T, Ward-Thompson D and White G J 2012 A\u0026A 543 L3 Preprint1206.1243\nCrossrefPreprint  \n\n[90]\nGlover S C O and Clark P C 2012 MNRAS 426 377-388 Preprint1203.4251\nCrossrefPreprint  \n\n[91]\nLarson R B 1969 MNRAS 145 271\nCrossref  \n\n[92]\nYorke H W, Bodenheimer P and Laughlin G 1993 ApJ 411 274-284\nCrossref  \n\n[93]\nOffner S S R, Klein R I, McKee C F and Krumholz M R 2009 ApJ 703 131-149 Preprint0904.2004\nIOPsciencePreprint  \n\n[94]\nPeters T, Banerjee R, Klessen R S, Mac Low M, Galván-Madrid R and Keto E R 2010 ApJ 711 1017-1028 Preprint1001.2470\nIOPsciencePreprint  \n\n[95]\nNakano T, Hasegawa T and Norman C 1995 ApJ 450 183\nCrossref  \n\n[96]\nNakano T, Hasegawa T, Morino J I and Yamashita T 2000 ApJ 534 976-983\nIOPscience  \n\n[97]\nTan J C and McKee C F 2004 ApJ 603 383-400 Preprintastro-ph/0307414\nIOPsciencePreprint  \n\n[98]\nPalla F and Stahler S W 1991 ApJ 375 288-299\nCrossref  \n\n[99]\nHosokawa T and Omukai K 2009 ApJ 691 823-846 Preprint0806.4122\nIOPsciencePreprint  \n\n[100]\nGuszejnov D, Krumholz M R and Hopkins P F 2016 MNRAS 458 673-680 Preprint1510.05040\nCrossrefPreprint  \n\n[101]\nFederrath C, Klessen R S and Schmidt W 2009 ApJ 692 364-374\nIOPscience  \n\n[102]\nFalgarone E, Puget J L and Perault M 1992 A\u0026A 257 715-730\n  \n\n[103]\nKauffmann J, Pillai T and Goldsmith P F 2013 ApJ 779 185 Preprint1308.5679\nIOPsciencePreprint  \n\n[104]\nHernandez A K and Tan J C 2015 ApJ 809 154 Preprint1502.00183\nIOPsciencePreprint  \n\n[105]\nFederrath C 2016 Journal of Plasma Physics In press (arXiv:1610.08132) (Preprint1610.08132\nPreprint  \n\n[106]\nFalgarone E, Troland T H, Crutcher R M and Paubert G 2008 A\u0026A 487 247-252\nCrossref  \n\n[107]\nCrutcher R M, Wandelt B, Heiles C, Falgarone E and Troland T H 2010 ApJ 725 466-479\nIOPscience  \n\n[108]\nCrutcher R M 2012 ARAA 50 29-63\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Christoph Federrath et al 2017 J. Phys.: Conf. Ser. 837 012007","other_numbering_system":null,"funders":[{"agency":"Australian Research Council","grant_number":"DP150104329"},{"agency":"Australian Research Council","grant_number":"DP170100603"},{"agency":"Australian Government","grant_number":""},{"agency":"Government of Western Australia","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":["TAPIR"]}