{"title":"System level parameterizations, constraints and synthesis","uri":"","abstract":"We introduce the system level approach to controller synthesis, which is composed of three elements: System Level Parameterizations (SLPs), System Level Constraints (SLCs) and System Level Synthesis (SLS) problems. SLPs provide a novel parameterization of all internally stabilizing controllers and the system responses that they achieve. These can be combined with SLCs to provide parameterizations of constrained stabilizing controllers. We provide a catalog of useful SLCs, and show that by using SLPs with SLCs, we can parameterize the largest known class of constrained stabilizing controllers that admit a convex characterization. Finally, we formulate the SLS problem, and show that it defines the broadest known class of constrained optimal control problems that can be solved using convex programming. We end by using the system level approach to computationally explore tradeoffs in controller performance, architecture cost, robustness and synthesis/implementation complexity.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252949","docid":252949,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1264905","fileid":1264905,"datasetid":"document","objectid":252949,"filename":"system_level_acc17.pdf","mime_type":"application/pdf","hash":"8065673f2ed2b471ca6a4620dffd9d60","hash_type":"MD5","filesize":2766865,"mtime":"2017-05-31 17:50:14","url":"http://authors.library.caltech.edu/77854/1/system_level_acc17.pdf"}],"eprintid":77854,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"system_level_acc17.pdf","content":"submitted"}],"note":"© IEEE 2017. \n\nThanks to funding from AFOSR and NSF and gifts from Huawei and Google.","id":77854,"rev_number":9,"userid":6,"eprint_dir":"disk0/00/07/78/54","datestamp":"2017-05-31 17:50:28","lastmod":"2017-05-31 20:59:31","status_changed":"2017-05-31 17:50:28","type":"book_section","metadata_visibility":"show","creators":[{"given":"Yuh-Shyang","family":"Wang","id":"Wang-Yuh-Shyang","orcid":""},{"given":"Nikolai","family":"Matni","id":"Matni-N","orcid":""},{"given":"John C.","family":"Doyle","id":"Doyle-J-C","orcid":""}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"Optimal control, Distributed control, Control system architecture","date":"2017-05","date_type":"inpress","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170531-104451494","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170531-104451494","related_url":null,"referencetext":["[1] D. C. Youla, H. A. Jabr, and J. J. B. Jr., “Modern wiener-hopf design\nof optimal controllers-part ii: The multivariable case,” Aut. Control,\nIEEE Trans. on, vol. 21, no. 3, pp. 319–338, 1976.\n[2] J. C. Doyle, K. Glover, P. P. Khargonekar, and B. A. Francis, “Statespace\nsolutions to standard H2 and H1 control problems,” IEEE\nTrans. on Aut. Control, vol. 34, no. 8, pp. 831–847, Aug 1989.\n[3] Y.-C. Ho and K.-C. Chu, “Team decision theory and information\nstructures in optimal control problems–part i,” Aut. Control, IEEE\nTrans. on, vol. 17, no. 1, pp. 15–22, 1972.\n[4] A. Mahajan, N. Martins, M. Rotkowitz, and S. Yuksel, “Information\nstructures in optimal decentralized control,” in Decision and Control,\n2012 IEEE 51st Annual Conf. on, 2012, pp. 1291–1306.\n[5] M. Rotkowitz and S. Lall, “A characterization of convex problems in\ndecentralized control,” Aut. Control, IEEE Trans. on, vol. 51, no. 2,\npp. 274–286, 2006.\n[6] B. Bamieh and P. G. Voulgaris, “A convex characterization of distributed\ncontrol problems in spatially invariant systems with communication\nconstraints,” Systems \u0026 Control Letters, vol. 54, no. 6, pp.\n575–583, 2005.\n[7] A. Nayyar, A. Mahajan, and D. Teneketzis, “Decentralized stochastic\ncontrol with partial history sharing: A common information approach,”\nIEEE Trans. on Aut. Control, vol. 58, no. 7, pp. 1644–1658, July 2013.\n[8] H. S. Witsenhausen, “A counterexample in stochastic optimum control,”\nSIAM Journal of Control, vol. 6, no. 1, 1968.\n[9] G. E. Dullerud and R. D’Andrea, “Distributed control of heterogeneous\nsystems,” Aut. Control, IEEE Trans. on, vol. 49, no. 12, pp.\n2113–2128, 2004.\n[10] M. Rotkowitz, R. Cogill, and S. Lall, “Convexity of optimal control\nover networks with delays and arbitrary topology,” Int. J. Syst.,\nControl Commun., vol. 2, no. 1/2/3, pp. 30–54, Jan. 2010. [Online].\nAvailable: http://dx.doi.org/10.1504/IJSCC.2010.031157\n[11] L. Lessard and S. Lall, “Convexity of decentralized controller\nsynthesis,” IEEE Trans. on Aut. Control, To appear, 2016. [Online].\nAvailable: http://arxiv.org/pdf/1305.5859v2.pdf\n[12] ——, “Optimal controller synthesis for the decentralized two-player\nproblem with output feedback,” in 2012 IEEE American Control Conf.,\nJune 2012.\n[13] P. Shah and P. A. Parrilo, “H2-optimal decentralized control over\nposets: A state space solution for state-feedback,” in Decision and\nControl, 2010 49th IEEE Conf. on, 2010.\n[14] A. Lamperski and J. C. Doyle, “Output feedback H2 model matching\nfor decentralized systems with delays,” in 2013 IEEE American\nControl Conf., June 2013.\n[15] C. W. Scherer, “Structured H1-optimal control for nested interconnections:\nA state-space solution,” Systems and Control Letters, vol. 62,\npp. 1105–1113, 2013.\n[16] N. Matni, “Distributed control subject to delays satisfying an H1\nnorm bound,” in 2014 53rd IEEE Conf. on Decision and Control,\n2014. [Online]. Available: http://arxiv.org/pdf/1402.1559.pdf\n[17] Y.-S. Wang, N. Matni, and J. C. Doyle, “A system level approach to\ncontroller synthesis,” IEEE Trans. on Aut. Control, submitted, 2016.\n[Online]. Available: https://arxiv.org/abs/1610.04815\n[18] ——, “Separable and localized system level synthesis for large-scale\nsystems,” IEEE Trans. on Aut. Control, submitted, 2017. [Online].\nAvailable: https://arxiv.org/abs/1701.05880\n[19] Y.-S. Wang, “A system level approach to optimal controller design for\nlarge-scale distributed systems,” Ph.D. dissertation, California Institute\nof Technology, 2016.\n[20] L. Lessard and S. Lall, “Quadratic invariance is necessary and suf-\nficient for convexity,” in Proceedings of the 2011 American Control\nConf., June 2011, pp. 5360–5362.\n[21] S¸. Sabau and N. C. Martins, “Youla-like parametrizations subject to ˘\nQI subspace constraints,” Aut. Control, IEEE Trans. on, vol. 59, no. 6,\npp. 1411–1422, 2014.\n[22] Y.-S. Wang, N. Matni, and J. C. Doyle, “Localized LQR optimal\ncontrol,” in 2014 53rd IEEE Conf. on Decision and Control, 2014.\n[23] K. Zhou, J. C. Doyle, and K. Glover, Robust and optimal control.\nPrentice Hall New Jersey, 1996.\n[24] A. Lamperski and J. C. Doyle, “The H2 control problem for quadratically\ninvariant systems with delays,” Aut. Control, IEEE Trans. on,\nvol. 60, no. 7, pp. 1945–1950, 2015.\n[25] Y.-S. Wang and N. Matni, “Localized LQG optimal control for largescale\nsystems,” in 2016 IEEE American Control Conf., 2016.\n[26] Y.-S. Wang, N. Matni, and J. C. Doyle, “Localized LQR control with\nactuator regularization,” in 2016 IEEE American Control Conf., 2016.\n[27] N. Matni and V. Chandrasekaran, “Regularization for design,” IEEE\nTrans. on Aut. Control, vol. PP, no. 99, pp. 1–1, 2016."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Air Force Office of Scientific Research (AFOSR)","grant_number":""},{"agency":"NSF","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"Kristin Buxton","local_group":null}