{"title":"The Astrophysics of Visible-light Orbital Phase Curves in the Space Age","uri":"","abstract":"The field of visible-light continuous time series photometry is now at its golden age, manifested by the continuum of past (CoRoT, Kepler), present (K2), and future (TESS, PLATO) space-based surveys delivering high precision data with a long baseline for a large number of stars. The availability of the high-quality data has enabled astrophysical studies not possible before, including, for example, detailed asteroseismic investigations and the study of the exoplanet census including small planets. This has also allowed to study the minute photometric variability following the orbital motion in stellar binaries and star-planet systems which is the subject of this review. We focus on systems with a main sequence primary and a low-mass secondary, from a small star to a massive planet. The orbital modulations are induced by a combination of gravitational and atmospheric processes, including the beaming effect, tidal ellipsoidal distortion, reflected light, and thermal emission. Therefore, the phase curve shape contains information about the companion's mass and atmospheric characteristics, making phase curves a useful astrophysical tool. For example, phase curves can be used to detect and measure the mass of short-period low-mass companions orbiting hot fast-rotating stars out of reach of other detection methods. Another interesting application of phase curves is using the orbital phase modulations to look for non-transiting systems, which comprise the majority of stellar binary and star-planet systems. We discuss the science done with phase curves, the first results obtained so far, and the current difficulties and open questions related to this young and evolving subfield.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252944","docid":252944,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1264873","fileid":1264873,"datasetid":"document","objectid":252944,"filename":"Shporer_2017_PASP_129_072001.pdf","mime_type":"application/pdf","hash":"57523f5b2c1190987cc9a2975e4b927e","hash_type":"MD5","filesize":1736878,"mtime":"2017-05-31 17:35:11","url":"http://authors.library.caltech.edu/77850/1/Shporer_2017_PASP_129_072001.pdf"}],"eprintid":77850,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"Shporer_2017_PASP_129_072001.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252945","docid":252945,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1264875","fileid":1264875,"datasetid":"document","objectid":252945,"filename":"1703.00496.pdf","mime_type":"application/pdf","hash":"b681c5a8b26dd48828ef8c738881541a","hash_type":"MD5","filesize":4329897,"mtime":"2017-05-31 17:35:18","url":"http://authors.library.caltech.edu/77850/2/1703.00496.pdf"}],"eprintid":77850,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1703.00496.pdf","content":"submitted"}],"note":"© 2017 The Astronomical Society of the Pacific. \n\nReceived 2017 February 17; accepted 2017 April 19; published 2017 May 30. \n\nI am grateful to the anonymous referee for the thorough reading of the manuscript and useful comments that helped improve it. While preparing this manuscript, I have benefitted from discussions and feedback from numerous colleagues, including Jim Fuller, Renyu Hu, Heather Knutson, Daniel Koll, Yossi Schwartzvald, Lev Tal-Or, and Ian Wong. I warmly thank Steven Bloemen, Simchon Faigler, and Josh Winn for providing comments on earlier versions of the manuscript. This work was performed in part at the Jet Propulsion Laboratory, under contract with the California Institute of Technology (Caltech) funded by NASA through the Sagan Fellowship Program executed by the NASA Exoplanet Science Institute. This research has made use of NASA's Astrophysics Data System Service.","id":77850,"rev_number":10,"userid":18,"eprint_dir":"disk0/00/07/78/50","datestamp":"2017-05-31 18:14:34","lastmod":"2017-05-31 18:14:34","status_changed":"2017-05-31 18:14:34","type":"article","metadata_visibility":"show","creators":[{"given":"Avi","family":"Shporer","id":"Shporer-A","orcid":"0000-0002-1836-3120"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"binaries: general – planetary systems – techniques: photometric","date":"2017-07","date_type":"published","publication":"Publications of the Astronomical Society of the Pacific","volume":"129","number":"977","pagerange":"Art. No. 072001","id_number":"CaltechAUTHORS:20170531-103507276","refereed":true,"issn":"0004-6280","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170531-103507276","related_url":[{"url":"https://doi.org/10.1088/1538-3873/aa7112","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.1088/1538-3873/aa7112/meta","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1703.00496","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Abt H. A., Levato H. and Grosso M. 2002 ApJ 573 359\nIOPscienceADS  \n\n\nAdams E. R., Ciardi D. R., Dupree A. K. et al 2012 AJ 144 42\nIOPscienceADS  \n\n\nAhlers J. P., Barnes J. W. and Barnes R. 2015 ApJ 814 67\nIOPscienceADS  \n\n\nAkerlof C., Balsano R., Barthelmy S. et al 1999 Natur 398 400\nCrossrefADS  \n\n\nAkeson R. L., Chen X., Ciardi D. et al 2013 PASP 125 989\nIOPscienceADS  \n\n\nAlcock C., Allsman R. A., Alves D. R. et al 2000 ApJ 542 281\nIOPscienceADS  \n\n\nAlonso R., Brown T. M., Torres G. et al 2004 ApJL 613 L153\nIOPscienceADS  \n\n\nAngerhausen D., DeLarme E. and Morse J. A. 2015 PASP 127 1113\nIOPscienceADS  \n\n\nArmitage P. J. and Bonnell I. A. 2002 MNRAS 330 L11\nCrossrefADS  \n\n\nAubourg E., Bareyre P., Bréhin S. et al 1993 Natur 365 623\nCrossrefADS  \n\n\nAuvergne M., Bodin P., Boisnard L. et al 2009 A\u0026A 506 411\nCrossrefADS  \n\n\nBakos G. Á, Hartman J. D., Torres G. et al 2012 AJ 144 19\nIOPscienceADS  \n\n\nBakos G. Á, Kovács G., Torres G. et al 2007 ApJ 670 826\nIOPscienceADS  \n\n\nBakos G., Noyes R. W., Kovács G. et al 2004 PASP 116 266\nIOPscienceADS  \n\n\nBalona L. A. 2014 MNRAS 443 1946\nCrossrefADS  \n\n\nBalona L. A., Daszyńska-Daszkiewicz J. and Pamyatnykh A. A. 2015 MNRAS 452 3073\nCrossrefADS  \n\n\nBalona L. A. and Dziembowski W. A. 2011 MNRAS 417 591\nCrossrefADS  \n\n\nBalona L. A., Guzik J. A., Uytterhoeven K. et al 2011 MNRAS 415 3531\nCrossrefADS  \n\n\nBaranec C., Ziegler C., Law N. M. et al 2016 AJ 152 18\nIOPscienceADS  \n\n\nBarclay T., Huber D., Rowe J. F. et al 2012 ApJ 761 53\nIOPscienceADS  \n\n\nBarnes J. W. 2009 ApJ 705 683\nIOPscienceADS  \n\n\nBarnes J. W., Linscott E. and Shporer A. 2011 ApJS 197 10\nIOPscienceADS  \n\n\nBatalha N. M., Borucki W. J., Bryson S. T. et al 2011 ApJ 729 27\nIOPscienceADS  \n\n\nBate M. R. 2009 MNRAS 392 590\nCrossrefADS  \n\n\nBayliss D., Hojjatpanah S., Santerne A. et al 2017 AJ 153 15\nIOPscienceADS  \n\n\nBeatty T. G., Madhusudhan N., Tsiaras A. et al 2016 ApJ submitted (arXiv:1612.06409)\nPreprint  \n\n\nBecker J. C., Johnson J. A., Vanderburg A. and Morton T. D. 2015 ApJS 217 29\nIOPscienceADS  \n\n\nBeichman C., Benneke B., Knutson H. et al 2014 PASP 126 1134\nIOPscienceADS  \n\n\nBloemen S., Marsh T. R., Degroote P. et al 2012 MNRAS 422 2600\nCrossrefADS  \n\n\nBloemen S., Marsh T. R., Østensen R. H. et al 2011 MNRAS 410 1787\nCrossrefADS  \n\n\nBorucki W. J. 2016 RPPh 79 036901\nIOPscienceADS  \n\n\nBorucki W. J., Caldwell D., Koch D. G. et al 2001 PASP 113 439\nIOPscienceADS  \n\n\nBorucki W. J., Koch D. G., Basri G. et al 2011 ApJ 736 19\nIOPscienceADS  \n\n\nBouchy F., Bonomo A. S., Santerne A. et al 2011 A\u0026A 533 A83\nCrossrefADS  \n\n\nBradley P. A., Guzik J. A., Miles L. F. et al 2015 AJ 149 68\nIOPscienceADS  \n\n\nBravo J. P., Roque S., Estrela R., Leão I. C. and De Medeiros J. R. 2014 A\u0026A 568 A34\nCrossrefADS  \n\n\nBrown T. M., Baliber N., Bianco F. B. et al 2013 PASP 125 1031\nIOPscienceADS  \n\n\nBrown T. M., Latham D. W., Everett M. E. and Esquerdo G. A. 2011 AJ 142 112\nIOPscienceADS  \n\n\nBryson S. T., Jenkins J. M., Gilliland R. L. et al 2013 PASP 125 889\nIOPscienceADS  \n\n\nBurkart J., Quataert E., Arras P. and Weinberg N. N. 2012 MNRAS 421 983\nCrossrefADS  \n\n\nBurke C. J., Christiansen J. L., Mullally F. et al 2015 ApJ 809 8\nIOPscienceADS  \n\n\nButler R. P., Marcy G. W., Williams E., Hauser H. and Shirts P. 1997 ApJL 474 L115\nIOPscienceADS  \n\n\nCarter J. A., Rappaport S. and Fabrycky D. 2011 ApJ 728 139\nIOPscienceADS  \n\n\nChaplin W. J., Basu S., Huber D. et al 2014 ApJS 210 1\nIOPscienceADS  \n\n\nChaplin W. J., Kjeldsen H., Christensen-Dalsgaard J. et al 2011 Sci 332 213\nCrossrefADS  \n\n\nChaplin W. J. and Miglio A. 2013 ARA\u0026A 51 353\nCrossrefADS  \n\n\nCharpinet S., Fontaine G., Brassard P. et al 2011 Natur 480 496\nCrossrefADS  \n\n\nCho J. Y.-K., Menou K., Hansen B. M. S. and Seager S. 2003 ApJL 587 L117\nIOPscienceADS  \n\n\nClaret A. and Bloemen S. 2011 A\u0026A 529 A75\nCrossrefADS  \n\n\nCoughlin J. L., Mullally F., Thompson S. E. et al 2016 ApJS 224 12\nIOPscienceADS  \n\n\nCowan N. B. and Agol E. 2011 ApJ 729 54\nIOPscienceADS  \n\n\nCowan N. B., Agol E. and Charbonneau D. 2007 MNRAS 379 641\nCrossrefADS  \n\n\nCowan N. B., Greene T., Angerhausen D. et al 2015 PASP 127 311\nIOPscienceADS  \n\n\nCowan N. B., Machalek P., Croll B. et al 2012 ApJ 747 82\nIOPscienceADS  \n\n\nCowley A. P. 1992 ARA\u0026A 30 287\nCrossrefADS  \n\n\nCrossfield I. J. M., Hansen B. M. S., Harrington J. et al 2010 ApJ 723 1436\nIOPscienceADS  \n\n\nDavies G. R. and Miglio A. 2016 AN 337 774\nCrossrefADS  \n\n\nDeleuil M., Deeg H. J., Alonso R. et al 2008 A\u0026A 491 889\nCrossrefADS  \n\n\nDemory B.-O., de Wit J., Lewis N. et al 2013 ApJL 776 L25\nIOPscienceADS  \n\n\nDeroo P., Swain M. R. and Green R. O. 2012 Proc. SPIE 8442 844241\nCrossref  \n\n\nDupret M.-A., Grigahcène A., Garrido R., Gabriel M. and Scuflaire R. 2004 A\u0026A 414 L17\nCrossrefADS  \n\n\nDuquennoy A. and Mayor M. 1991 A\u0026A 248 485\nADS  \n\n\nEhrenreich D., Lagrange A.-M., Bouchy F. et al 2011 A\u0026A 525 A85\nCrossrefADS  \n\n\nEsteves L. J., De Mooij E. J. W. and Jayawardhana R. 2013 ApJ 772 51\nIOPscienceADS  \n\n\nEsteves L. J., De Mooij E. J. W. and Jayawardhana R. 2015 ApJ 804 150\nIOPscienceADS  \n\n\nEverett M. E., Barclay T., Ciardi D. R. et al 2015 AJ 149 55\nIOPscienceADS  \n\n\nFaigler S. and Mazeh T. 2011 MNRAS 415 3921\nCrossrefADS  \n\n\nFaigler S. and Mazeh T. 2015 ApJ 800 73\nIOPscienceADS  \n\n\nFaigler S., Mazeh T., Quinn S. N., Latham D. W. and Tal-Or L. 2012 ApJ 746 185\nIOPscienceADS  \n\n\nFaigler S., Tal-Or L., Mazeh T., Latham D. W. and Buchhave L. A. 2013 ApJ 771 26\nIOPscienceADS  \n\n\nFekel F. C. 1997 PASP 109 514\nIOPscienceADS  \n\n\nFortney J. J., Cooper C. S., Showman A. P., Marley M. S. and Freedman R. S. 2006 ApJ 652 746\nIOPscienceADS  \n\n\nFuller J. and Lai D. 2012 MNRAS 420 3126\nCrossrefADS  \n\n\nFurlan E., Ciardi D. R., Everett M. E. et al 2017 AJ 153 71\nIOPscienceADS  \n\n\nGaia Collaboration, Prusti T., de Bruijne J. H. J. et al 2016 A\u0026A 595 A1\nCrossrefADS  \n\n\nGarcia Munoz A. and Isaak K. G. 2015 PNAS 112 13461\nCrossrefADS  \n\n\nGardner J. P., Mather J. C., Clampin M. et al 2006 SSRv 123 485\nCrossrefADS  \n\n\nGaudi B. S. 2012 ARA\u0026A 50 411\nCrossrefADS  \n\n\nGaudi B. S. and Winn J. N. 2007 ApJ 655 550\nIOPscienceADS  \n\n\nGeier S., Nesslinger S., Heber U. et al 2007 A\u0026A 464 299\nCrossrefADS  \n\n\nGelino D. M., Harrison T. E. and Orosz J. A. 2001 AJ 122 2668\nIOPscienceADS  \n\n\nGelino D. M. and Kane S. R. 2014 ApJ 787 105\nIOPscienceADS  \n\n\nGilliland R. L., Brown T. M., Christensen-Dalsgaard J. et al 2010 PASP 122 131\nIOPscienceADS  \n\n\nGray D. F. 1982 ApJ 261 259\nCrossrefADS  \n\n\nGrether D. and Lineweaver C. H. 2006 ApJ 640 1051\nIOPscienceADS  \n\n\nGrigahcène A., Antoci V., Balona L. et al 2010 ApJL 713 L192\nIOPscienceADS  \n\n\nGroot P. J. 2012 ApJ 745 55\nIOPscienceADS  \n\n\nGuzik J. A., Kaye A. B., Bradley P. A., Cox A. N. and Neuforge C. 2000 ApJL 542 L57\nIOPscienceADS  \n\n\nHartman J. D., Bakos G. Á., Noyes R. W. et al 2011 AJ 141 166\nIOPscienceADS  \n\n\nHekker S., Kallinger T., Baudin F. et al 2009 A\u0026A 506 465\nCrossrefADS  \n\n\nHeng K. and Showman A. P. 2015 AREPS 43 509\nCrossrefADS  \n\n\nHills J. G. and Dale T. M. 1974 A\u0026A 30 135\nADS  \n\n\nHippke M. 2015 ApJ 806 51\nIOPscienceADS  \n\n\nHippke M. and Angerhausen D. 2015 ApJ 811 1\nIOPscienceADS  \n\n\nHu R., Demory B.-O., Seager S., Lewis N. and Showman A. P. 2015 ApJ 802 51\nIOPscienceADS  \n\n\nIrwin J., Berta Z. K., Burke C. J. et al 2011 ApJ 727 56\nIOPscienceADS  \n\n\nJackson B. K., Lewis N. K., Barnes J. W. et al 2012 ApJ 751 112\nIOPscienceADS  \n\n\nJenkins J. M. and Doyle L. R. 2003 ApJ 595 429\nIOPscienceADS  \n\n\nJohnson M. C., Cochran W. D., Albrecht S. et al 2014 ApJ 790 30\nIOPscienceADS  \n\n\nJumper P. H. and Fisher R. T. 2013 ApJ 769 9\nIOPscienceADS  \n\n\nKahraman Aliçavuş F., Niemczura E., De Cat P. et al 2016 MNRAS 458 2307\nCrossrefADS  \n\n\nKane S. R. and Gelino D. M. 2013 ApJ 762 129\nIOPscienceADS  \n\n\nKnutson H. A., Charbonneau D., Allen L. E. et al 2007 Natur 447 183\nCrossrefADS  \n\n\nKnutson H. A., Charbonneau D., Allen L. E., Burrows A. and Megeath S. T. 2008 ApJ 673 526\nIOPscienceADS  \n\n\nKnutson H. A., Charbonneau D., Cowan N. B. et al 2009 ApJ 703 769\nIOPscienceADS  \n\n\nKnutson H. A., Lewis N., Fortney J. J. et al 2012 ApJ 754 22\nIOPscienceADS  \n\n\nKoch D. G., Borucki W. J., Basri G. et al 2010 ApJL 713 L79\nIOPscienceADS  \n\n\nKoll D. D. B. and Abbot D. S. 2016 ApJ 825 99\nIOPscienceADS  \n\n\nKomacek T. D. and Showman A. P. 2016 ApJ 821 16\nIOPscienceADS  \n\n\nKomacek T. D., Showman A. P. and Tan X. 2017 ApJ 835 198\nIOPscienceADS  \n\n\nKopal Z. 1959 Close Binary Stars (London: Chapman \u0026 Hall)\nADS  \n\n\nKrick J. E., Ingalls J., Carey S. et al 2016 ApJ 824 27\nIOPscienceADS  \n\n\nKrzesinski J. 2015 A\u0026A 581 A7\nCrossrefADS  \n\n\nKumar P., Ao C. O. and Quataert E. J. 1995 ApJ 449 294\nCrossrefADS  \n\n\nKurtz D. W., Hambleton K. M., Shibahashi H., Murphy S. J. and Prša A. 2015 MNRAS 446 1223\nCrossrefADS  \n\n\nLatham D. W., Rowe J. F., Quinn S. N. et al 2011 ApJL 732 L24\nIOPscienceADS  \n\n\nLaw N. M., Morton T., Baranec C. et al 2014 ApJ 791 35\nIOPscienceADS  \n\n\nLéger A., Rouan D., Schneider J. et al 2009 A\u0026A 506 287\nCrossrefADS  \n\n\nLewis I. J., Cannon R. D., Taylor K. et al 2002 MNRAS 333 279\nCrossrefADS  \n\n\nLewis N. K., Knutson H. A., Showman A. P. et al 2013 ApJ 766 95\nIOPscienceADS  \n\n\nLoeb A. and Gaudi B. S. 2003 ApJL 588 L117\nIOPscienceADS  \n\n\nMa B. and Ge J. 2014 MNRAS 439 2781\nCrossrefADS  \n\n\nMasuda K. 2015 ApJ 805 28\nIOPscienceADS  \n\n\nMaxted P. F. L., Anderson D. R., Doyle A. P. et al 2013 MNRAS 428 2645\nCrossrefADS  \n\n\nMaxted P. F. L., Marsh T. R. and North R. C. 2000 MNRAS 317 L41\nCrossrefADS  \n\n\nMayor M. and Queloz D. 1995 Natur 378 355\nCrossrefADS  \n\n\nMazeh T. 2008 EAS Pub. Ser. 29, Tidal Effects in Stars, Planets and Disks ed M.-J. Goupil and J.-P. Zahn 1\n  \n\n\nMazeh T. and Faigler S. 2010 A\u0026A 521 L59\nCrossrefADS  \n\n\nMazeh T., Goldberg D., Duquennoy A. and Mayor M. 1992 ApJ 401 265\nCrossrefADS  \n\n\nMazeh T., Nachmani G., Sokol G., Faigler S. and Zucker S. 2012 A\u0026A 541 A56\nCrossrefADS  \n\n\nMcClintock J. E. and Remillard R. A. 2006 Black Hole Binaries ed W. H. G. Lewin and M. van der Klis (Cambridge: Cambridge Univ. Press) 157\n  \n\n\nMcCullough P. R., Stys J. E., Valenti J. A. et al 2005 PASP 117 783\nIOPscienceADS  \n\n\nMcQuillan A., Mazeh T. and Aigrain S. 2014 ApJS 211 24\nIOPscienceADS  \n\n\nMislis D. and Hodgkin S. 2012 MNRAS 422 1512\nCrossrefADS  \n\n\nMorris S. L. 1985 ApJ 295 143\nCrossrefADS  \n\n\nMorris S. L. and Naftilan S. A. 1993 ApJ 419 344\nCrossrefADS  \n\n\nMoses J. I., Madhusudhan N., Visscher C. and Freedman R. S. 2013 ApJ 763 25\nIOPscienceADS  \n\n\nMurphy S. J., Bedding T. R. and Shibahashi H. 2016a ApJL 827 L17\nIOPscienceADS  \n\n\nMurphy S. J., Bedding T. R., Shibahashi H., Kurtz D. W. and Kjeldsen H. 2014 MNRAS 441 2515\nCrossrefADS  \n\n\nMurphy S. J. and Shibahashi H. 2015 MNRAS 450 4475\nCrossrefADS  \n\n\nMurphy S. J., Shibahashi H. and Bedding T. R. 2016b MNRAS 461 4215\nCrossrefADS  \n\n\nOreshenko M., Heng K. and Demory B.-O. 2016 MNRAS 457 3420\nCrossrefADS  \n\n\nOrosz J. A., McClintock J. E., Narayan R. et al 2007 Natur 449 872\nCrossrefADS  \n\n\nPaczyński B. 1997 Variables Stars and the Astrophysical Returns of the Microlensing Surveys ed R. Ferlet, J.-P. Maillard and B. Raban (Paris: Editions Frontières) 357\nADS  \n\n\nPaczyński B. 2000 PASP 112 1281\nIOPscienceADS  \n\n\nParmentier V., Fortney J. J., Showman A. P., Morley C. and Marley M. S. 2016 ApJ 828 22\nIOPscienceADS  \n\n\nPepper J., Pogge R. W., DePoy D. L. et al 2007 PASP 119 923\nIOPscienceADS  \n\n\nPerez-Becker D. and Showman A. P. 2013 ApJ 776 134\nIOPscienceADS  \n\n\nPerryman M., Hartman J., Bakos G. Á. and Lindegren L. 2014 ApJ 797 14\nIOPscienceADS  \n\n\nPerryman M. A. C., de Boer K. S., Gilmore G. et al 2001 A\u0026A 369 339\nCrossrefADS  \n\n\nPetigura E. A., Howard A. W. and Marcy G. W. 2013 PNAS 110 19273\nCrossrefADS  \n\n\nPfahl E., Arras P. and Paxton B. 2008 ApJ 679 783\nIOPscienceADS  \n\n\nPlacek B., Knuth K. H. and Angerhausen D. 2014 ApJ 795 112\nIOPscienceADS  \n\n\nPlacek B., Knuth K. H. and Angerhausen D. 2016 PASP 128 074503\nIOPscienceADS  \n\n\nPojmanski G. 1997 AcA 47 467\nADS  \n\n\nPollacco D. L., Skillen I., Collier Cameron A. et al 2006 PASP 118 1407\nIOPscienceADS  \n\n\nPrša A., Conroy K. E., Horvat M. et al 2016 ApJS 227 29\nIOPscienceADS  \n\n\nRaghavan D., McAlister H. A., Henry T. J. et al 2010 ApJS 190 1\nIOPscienceADS  \n\n\nRanalli P., Hobbs D. and Lindegren L. 2017 A\u0026A submitted (arXiv:1704.02493)\nPreprint  \n\n\nRappaport S., Nelson L., Levine A. et al 2015 ApJ 803 82\nIOPscienceADS  \n\n\nRauer H., Catala C., Aerts C. et al 2014 ExA 38 249\nCrossrefADS  \n\n\nRichmond M., Treffers R. R. and Filippenko A. V. 1993 PASP 105 1164\nIOPscienceADS  \n\n\nRicker G. R., Winn J. N., Vanderspek R. et al 2014 Proc. SPIE 9143 914320\nCrossref  \n\n\nRowe J. F., Borucki W. J., Koch D. et al 2010 ApJL 713 L150\nIOPscienceADS  \n\n\nSanterne A., Moutou C., Barros S. C. C. et al 2012 A\u0026A 544 L12\nCrossrefADS  \n\n\nSchwartz J. C. and Cowan N. B. 2015 MNRAS 449 4192\nCrossrefADS  \n\n\nShakura N. I. and Postnov K. A. 1987 A\u0026A 183 L21\nADS  \n\n\nSharma S., Stello D., Bland-Hawthorn J., Huber D. and Bedding T. R. 2016 ApJ 822 15\nIOPscienceADS  \n\n\nSheets H. A. and Deming D. 2014 ApJ 794 133\nIOPscienceADS  \n\n\nShibahashi H. and Kurtz D. W. 2012 MNRAS 422 738\nCrossrefADS  \n\n\nShowman A. P. and Guillot T. 2002 A\u0026A 385 166\nCrossrefADS  \n\n\nShporer A., Brown T., Mazeh T. and Zucker S. 2012 NewA 17 309\nCrossrefADS  \n\n\nShporer A., Fuller J., Isaacson H. et al 2016a ApJ 829 34\nIOPscienceADS  \n\n\nShporer A., Hartman J., Mazeh T. and Pietsch W. 2007 A\u0026A 462 1091\nCrossrefADS  \n\n\nShporer A. and Hu R. 2015 AJ 150 112\nIOPscienceADS  \n\n\nShporer A., Jenkins J. M., Rowe J. F. et al 2011 AJ 142 195\nIOPscienceADS  \n\n\nShporer A., Kaplan D. L., Steinfadt J. D. R. et al 2010 ApJL 725 L200\nIOPscienceADS  \n\n\nShporer A. and Mazeh T. 2006 MNRAS 370 1429\nCrossrefADS  \n\n\nShporer A., O’Rourke J. G., Knutson H. A. et al 2014 ApJ 788 92\nIOPscienceADS  \n\n\nShporer A., Stassun K., Faigler S. et al 2016b American Astronomical Society Meeting Abstracts #227\n  \n\n\nSilvotti R., Schuh S., Janulis R. et al 2007 Natur 449 189\nCrossrefADS  \n\n\nSiverd R. J., Brown T. M., Hygelund J. et al 2016 Proc. SPIE 9908 99086X\nCrossrefADS  \n\n\nSnellen I. A. G., de Mooij E. J. W. and Albrecht S. 2009 Natur 459 543\nCrossrefADS  \n\n\nSozzetti A., Casertano S., Lattanzi M. G. and Spagna A. 2001 A\u0026A 373 L21\nCrossrefADS  \n\n\nSozzetti A., Giacobbe P., Lattanzi M. G. et al 2014 MNRAS 437 497\nCrossrefADS  \n\n\nSpergel D., Gehrels N., Baltay C. et al 2015 arXiv:1503.03757\nPreprint\n\n\nStevenson K. B., Désert J.-M., Line M. R. et al 2014 Sci 346 838\nCrossrefADS  \n\n\nSullivan P. W., Winn J. N., Berta-Thompson Z. K. et al 2015 ApJ 809 77\nIOPscienceADS  \n\n\nSzabó G. M., Szabó R., Benkő J. M. et al 2011 ApJL 736 L4\nIOPscienceADS  \n\n\nTal-Or L., Faigler S. and Mazeh T. 2015 A\u0026A 580 A21\nCrossrefADS  \n\n\nThompson S. E., Everett M., Mullally F. et al 2012 ApJ 753 86\nIOPscienceADS  \n\n\nTinetti G., Drossart P., Eccleston P. et al 2015 ExA 40 329\nCrossrefADS  \n\n\nTinetti G., Drossart P., Eccleston P. et al 2016 Proc. SPIE 9904 99041X\nCrossrefADS  \n\n\nTwicken J. D., Jenkins J. M., Seader S. E. et al 2016 AJ 152 158\nIOPscienceADS  \n\n\nUdalski A., Szymanski M., Kaluzny J., Kubiak M. and Mateo M. 1992 AcA 42 253\nADS  \n\n\nVan Eylen V., Kjeldsen H., Christensen-Dalsgaard J. and Aerts C. 2012 AN 333 1088\nCrossrefADS  \n\n\nvan Kerkwijk M. H., Rappaport S. A., Breton R. P. et al 2010 ApJ 715 51\nIOPscienceADS  \n\n\nvon Paris P., Gratier P., Bordé P. and Selsis F. 2016 A\u0026A 587 A149\nCrossrefADS  \n\n\nWeiss L. M., Marcy G. W., Isaacson H. T. et al 2015 KITP Conference: Physics of Exoplanets: From Earth-sized to Mini-Neptunes, ed E. Ford et al P7\n  \n\n\nWinn J. N. 2010 arXiv:1001.2010\nPreprint\n\n\nWinn J. N. and Fabrycky D. C. 2015 ARA\u0026A 53 409\nCrossrefADS  \n\n\nWolff S. and Simon T. 1997 PASP 109 759\nIOPscienceADS  \n\n\nWong I., Knutson H. A., Kataria T. et al 2016 ApJ 823 122\nIOPscienceADS  \n\n\nWong I., Knutson H. A., Lewis N. K. et al 2015 ApJ 811 122\nIOPscienceADS  \n\n\nZellem R. T., Lewis N. K., Knutson H. A. et al 2014 ApJ 790 53\nIOPscienceADS  \n\n\nZucker S., Mazeh T. and Alexander T. 2007 ApJ 670 1326\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Avi Shporer 2017 PASP 129 072001","other_numbering_system":null,"funders":[{"agency":"NASA/JPL/Caltech","grant_number":""},{"agency":"NASA Sagan Fellowship","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}