{"title":"Pregnancy-induced gene expression changes in vivo among women with rheumatoid arthritis: a pilot study","uri":"","abstract":"Background: Little is known about gene expression changes induced by pregnancy in women with rheumatoid arthritis (RA) and healthy women because the few studies previously conducted did not have pre-pregnancy samples available as baseline. We have established a cohort of women with RA and healthy women followed prospectively from a pre-pregnancy baseline. In this study, we tested the hypothesis that pregnancy-induced changes in gene expression among women with RA who improve during pregnancy (pregDAS_(improved)) overlap substantially with changes observed among healthy women and differ from changes observed among women with RA who worsen during pregnancy (pregDAS_(worse)). \n\nMethods: Global gene expression profiles were generated by RNA sequencing (RNA-seq) from 11 women with RA and 5 healthy women before pregnancy (T0) and at the third trimester (T3). Among the women with RA, eight showed an improvement in disease activity by T3, whereas three worsened. Differential expression analysis was used to identify genes demonstrating significant changes in expression within each of the RA and healthy groups (T3 vs T0), as well as between the groups at each time point. Gene set enrichment was assessed in terms of Gene Ontology processes and protein networks. \n\nResults: A total of 1296 genes were differentially expressed between T3 and T0 among the 8 pregDAS_(improved) women, with 161 genes showing at least two-fold change (FC) in expression by T3. The majority (108 of 161 genes) were also differentially expressed among healthy women (q\u003c0.05, FC≥2). Additionally, a small cluster of genes demonstrated contrasting changes in expression between the pregDAS_(improved) and pregDAS_(worse) groups, all of which were inducible by type I interferon (IFN). These IFN-inducible genes were over-expressed at T3 compared to the T0 baseline among the pregDAS_(improved) women. \n\nConclusions: In our pilot RNA-seq dataset, increased pregnancy-induced expression of type I IFN-inducible genes was observed among women with RA who improved during pregnancy, but not among women who worsened. These findings warrant further investigation into expression of these genes in RA pregnancy and their potential role in modulation of disease activity. These results are nevertheless preliminary and should be interpreted with caution until replicated in a larger sample.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252956","docid":252956,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265001","fileid":1265001,"datasetid":"document","objectid":252956,"filename":"art%3A10.1186%2Fs13075-017-1312-2.pdf","mime_type":"application/pdf","hash":"4c3fe702c2345db1ec9113a92c19fe1b","hash_type":"MD5","filesize":684247,"mtime":"2017-05-31 20:14:50","url":"http://authors.library.caltech.edu/77860/1/art%253A10.1186%252Fs13075-017-1312-2.pdf"}],"eprintid":77860,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"art%3A10.1186%2Fs13075-017-1312-2.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252957","docid":252957,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265005","fileid":1265005,"datasetid":"document","objectid":252957,"filename":"13075_2017_1312_MOESM1_ESM.pdf","mime_type":"application/pdf","hash":"857b3df9cb6698398c2e612d5a144ad1","hash_type":"MD5","filesize":156792,"mtime":"2017-05-31 20:20:59","url":"http://authors.library.caltech.edu/77860/2/13075_2017_1312_MOESM1_ESM.pdf"}],"eprintid":77860,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"13075_2017_1312_MOESM1_ESM.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/252958","docid":252958,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265008","fileid":1265008,"datasetid":"document","objectid":252958,"filename":"13075_2017_1312_MOESM2_ESM.pdf","mime_type":"application/pdf","hash":"1d036001780b386b7495012afcade2d6","hash_type":"MD5","filesize":5723,"mtime":"2017-05-31 20:21:27","url":"http://authors.library.caltech.edu/77860/3/13075_2017_1312_MOESM2_ESM.pdf"}],"eprintid":77860,"pos":3,"placement":3,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"13075_2017_1312_MOESM2_ESM.pdf","content":"supplemental"}],"note":"© 2017 The Author(s). This article is distributed under the terms of the Creative Commons Attribution 4.0 International License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium, provided you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. The Creative Commons Public Domain Dedication waiver (http://creativecommons.org/publicdomain/zero/1.0/) applies to the data made available in this article, unless otherwise stated. \n\nReceived: 16 January 2017; Accepted: 2 May 2017; Published: 25 May 2017. \n\nWe are immensely grateful to the study subjects for their participation in the study. We thank Mr. Kurt Stig Jensen at the Juliane Marie Center for his support. The Rheumatology departments at the following hospitals in Denmark facilitated collection of data and samples: Rigshospitalet (Glostrup), Odense Universitetshospital, Kong Christian X’s Gigthospital (Gråsten), Aarhus University Hospital NBG, and Regionshospitalet Viborg. We thank all members of our project team for making this work possible: Anne-Grethe Rasmussen, Charlotte Schön Frengler, Dorte Heide, Randi Petersen, Tove Thorup Rasmussen, Lone Thomasen, Britta Hvidberg Nielsen, Teresa Rozenfeldt, Kirsten Junker, Lis Kastberg Schubert, Lis Lund, Jette Barlach, Helle Bendtsen, Helle Andersen, and Marjo Westerdahl for their contribution to data and sample collection; and Rikke Godtkjær Andersen, Mie Rams Rasmussen, Pia Pedersen, Stine Birkelund, Louise Mielke, and Andreas Smed for management of data and samples. We also greatly appreciate the valuable assistance provided by Majbritt Norman Nielsen and DANBIO personnel. \n\nThis work was supported in part by funds from the National Institute of Arthritis, Musculoskeletal and Skin Diseases (NIAMS), USA (grant R21 AR057931); Gigtforeningen, Denmark (grant R87-A1477-B512); and the Juliane Marie Center, Rigshospitalet (Denmark). These funders did not have any role in conducting this study or in the interpretation and reporting of results. \n\nAvailability of data and materials: The data are governed by Danish privacy laws. The authors are legally forbidden from publicly sharing data under the terms of their agreement with the Danish Data Protection Agency. Data are available upon request from the corresponding author, after approval is granted by the Danish Data Protection Agency. \n\nAuthors’ contributions: DEG analyzed the data, interpreted the results, and contributed to manuscript writing. MKS was responsible for acquisition of the data. LP and EP contributed to the analysis and interpretation of the data. JLN, HK, and JO contributed to the conception and design of the study. HK was also responsible for data acquisition. MLH, VZ, and BO contributed to the data acquisition. DJ was involved in the conception and design of the experiments, in the analysis and interpretation of the data, and in writing the manuscript. All authors contributed to critically revising the manuscript for important intellectual content. All authors read and approved the final manuscript. ﻿﻿﻿HK passed away before the submission of the final version of the manuscript; DJ accepts responsibility for the integrity and validity of the data collected and analyzed. \n\nThe authors declare that they have no competing interests. \n\nConsent for publication: Not applicable. \n\nEthics approval and consent to participate: This study was approved by the ethics committee for Region Hovedstaden (Denmark), the Danish Data Protection Agency, and the Children’s Hospital Oakland Research Institute Institutional Review Board. All subjects provided written informed consent prior to enrollment.","id":77860,"rev_number":11,"userid":18,"eprint_dir":"disk0/00/07/78/60","datestamp":"2017-05-31 22:10:25","lastmod":"2017-05-31 22:10:25","status_changed":"2017-05-31 22:10:25","type":"article","metadata_visibility":"show","creators":[{"given":"Dana E.","family":"Goin","id":"Goin-D-E","orcid":""},{"given":"Mette Kiel","family":"Smed","id":"Smed-M-K","orcid":""},{"given":"Lior","family":"Pachter","id":"Pachter-L","orcid":""},{"given":"Elizabeth","family":"Purdom","id":"Purdom-E","orcid":""},{"given":"J. Lee","family":"Nelson","id":"Nelson-J-L","orcid":""},{"given":"Hanne","family":"Kjærgaard","id":"Kjærgaard-H","orcid":""},{"given":"Jørn","family":"Olsen","id":"Olsen-J","orcid":""},{"given":"Merete Lund","family":"Hetland","id":"Hetland-M-L","orcid":""},{"given":"Vibeke","family":"Zoffmann","id":"Zoffmann-V","orcid":""},{"given":"Bent","family":"Ottesen","id":"Ottesen-B","orcid":""},{"given":"Damini","family":"Jawaheer","id":"Jawaheer-D","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-25","date_type":"published","publication":"Arthritis Research and Therapy","volume":"19","number":"1","pagerange":"Art. No. 104","id_number":"CaltechAUTHORS:20170531-131446160","refereed":true,"issn":"1478-6362","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170531-131446160","related_url":[{"url":"http://dx.doi.org/10.1186/s13075-017-1312-2","type":"doi","description":"Article"},{"url":"http://arthritis-research.biomedcentral.com/articles/10.1186/s13075-017-1312-2","type":"pub","description":"Article"},{"url":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5445464/","type":"pmc","description":"Article"}],"referencetext":["1.Cross M, Smith E, Hoy D, Carmona L, Wolfe F, Vos T, et al. The global burden of rheumatoid arthritis: estimates from the global burden of disease 2010 study. Ann Rheum Dis. 2014;73(7):1316–22.\nView ArticlePubMedGoogle Scholar\n\n2.Hench PS. The ameliorating effect of pregnancy on chronic atrophic (infectious rheumatoid) arthritis, fibrositis, and intermittent hydrarthrosis. Mayo Clin Proc. 1938;13:161–7.\nGoogle Scholar\n\n3.Nelson JL, Ostensen M. Pregnancy and rheumatoid arthritis. Rheum Dis Clin North Am. 1997;23(1):195–212.\nView ArticlePubMedGoogle Scholar\n\n4.de Man YA, Dolhain RJ, van de Geijn FE, Willemsen SP, Hazes JM. Disease activity of rheumatoid arthritis during pregnancy: results from a nationwide prospective study. Arthritis Rheum. 2008;59(9):1241–8.\nView ArticlePubMedGoogle Scholar\n\n5.Barrett JH, Brennan P, Fiddler M, Silman AJ. Does rheumatoid arthritis remit during pregnancy and relapse postpartum? Results from a nationwide study in the United Kingdom performed prospectively from late pregnancy. Arthritis Rheum. 1999;42(6):1219–27.\nView ArticlePubMedGoogle Scholar\n\n6.Nelson JL, Hughes KA, Smith AG, Nisperos BB, Branchaud AM, Hansen JA. Maternal-fetal disparity in HLA class II alloantigens and the pregnancy-induced amelioration of rheumatoid arthritis. N Engl J Med. 1993;329(7):466–71.\nView ArticlePubMedGoogle Scholar\n\n7.Yan Z, Lambert NC, Ostensen M, Adams KM, Guthrie KA, Nelson JL. Prospective study of fetal DNA in serum and disease activity during pregnancy in women with inflammatory arthritis. Arthritis Rheum. 2006;54(7):2069–73.\nView ArticlePubMedGoogle Scholar\n\n8.Adams Waldorf KM, Nelson JL. Autoimmune disease during pregnancy and the microchimerism legacy of pregnancy. Immunol Invest. 2008;37(5):631–44.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n9.Haupl T, Ostensen M, Grutzkau A, Burmester GR, Villiger PM. Interaction between rheumatoid arthritis and pregnancy: correlation of molecular data with clinical disease activity measures. Rheumatology (Oxford). 2008;47 Suppl 3:iii19–22.\nGoogle Scholar\n\n10.Haupl T, Ostensen M, Grutzkau A, Radbruch A, Burmester GR, Villiger PM. Reactivation of rheumatoid arthritis after pregnancy: increased phagocyte and recurring lymphocyte gene activity. Arthritis Rheum. 2008;58(10):2981–92.\nView ArticlePubMedGoogle Scholar\n\n11.Weix J, Forger F, Haupl T, Surbek D, Ostensen M, Villiger PM. Influence of pregnancy on the adipocytokine and peroxisome proliferator-activated receptor pathways in peripheral blood mononuclear cells from healthy donors and rheumatoid arthritis patients. Arthritis Rheum. 2012;64(7):2095–103.\nView ArticlePubMedGoogle Scholar\n\n12.Weix J, Haupl T, Raio L, Villiger PM, Forger F. The physiologic increase in expression of some type I IFN-inducible genes during pregnancy is not associated with improved disease activity in pregnant patients with rheumatoid arthritis. Transl Res. 2013;161(6):505–12.\nView ArticlePubMedGoogle Scholar\n\n13.Mittal A, Pachter L, Nelson JL, Kjaergaard H, Smed MK, Gildengorin VL, et al. Pregnancy-induced changes in systemic gene expression among healthy women and women with rheumatoid arthritis. PLoS One. 2015;10(12):e0145204.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n14.Arnett FC, Edworthy SM, Bloch DA, McShane DJ, Fries JF, Cooper NS, et al. The American Rheumatism Association 1987 revised criteria for the classification of rheumatoid arthritis. Arthritis Rheum. 1988;31(3):315–24.\nView ArticlePubMedGoogle Scholar\n\n15.Home of the Disease activity score and DAS28. http://www.das-score.nl/.\n\n16.van Gestel AM, Anderson JJ, van Riel PL, Boers M, Haagsma CJ, Rich B, et al. ACR and EULAR improvement criteria have comparable validity in rheumatoid arthritis trials. J Rheumatol. 1999;26(3):705–11.\nPubMedGoogle Scholar\n\n17.Bray NL, Pimentel H, Melsted P, Pachter L. Near-optimal probabilistic RNA-seq quantification. Nat Biotechnol. 2016;34(5):525–7.\nView ArticlePubMedGoogle Scholar\n\n18.Robinson MD, McCarthy DJ, Smyth GK. edgeR: a Bioconductor package for differential expression analysis of digital gene expression data. Bioinformatics. 2010;26(1):139–40.\nView ArticlePubMedGoogle Scholar\n\n19.Robinson MD, Oshlack A. A scaling normalization method for differential expression analysis of RNA-seq data. Genome Biol. 2010;11(3):R25.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n20.Zhang B, Kirov S, Snoddy J. WebGestalt: an integrated system for exploring gene sets in various biological contexts. Nucleic Acids Res. 2005;33 Suppl 2:W741–8.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n21.von Mering C, Jensen LJ, Snel B, Hooper SD, Krupp M, Foglierini M, et al. STRING: known and predicted protein-protein associations, integrated and transferred across organisms. Nucleic Acids Res. 2005;33(Database issue):D433–7.\nView ArticleGoogle Scholar\n\n22.Jensen LJ, Kuhn M, Stark M, Chaffron S, Creevey C, Muller J, et al. STRING 8—a global view on proteins and their functional interactions in 630 organisms. Nucleic Acids Res. 2009;37(Database issue):D412–6.\nView ArticlePubMedGoogle Scholar\n\n23.Flammer JR, Dobrovolna J, Kennedy MA, Chinenov Y, Glass CK, Ivashkiv LB, et al. The type I interferon signaling pathway is a target for glucocorticoid inhibition. Mol Cell Biol. 2010;30(19):4564–74.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n24.de Jong TD, Vosslamber S, Blits M, Wolbink G, Nurmohamed MT, van der Laken CJ, et al. Effect of prednisone on type I interferon signature in rheumatoid arthritis: consequences for response prediction to rituximab. Arthritis Res Ther. 2015;17:78.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n25.Jiang K, Sun X, Chen Y, Shen Y, Jarvis JN. RNA sequencing from human neutrophils reveals distinct transcriptional differences associated with chronic inflammatory states. BMC Med Genomics. 2015;8:55.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n26.Sacks GP, Studena K, Sargent K, Redman CW. Normal pregnancy and preeclampsia both produce inflammatory changes in peripheral blood leukocytes akin to those of sepsis. Am J Obstet Gynecol. 1998;179(1):80–6.\nView ArticlePubMedGoogle Scholar\n\n27.Wang Y, Gu Y, Philibert L, Lucas MJ. Neutrophil activation induced by placental factors in normal and pre-eclamptic pregnancies in vitro. Placenta. 2001;22(6):560–5.\nView ArticlePubMedGoogle Scholar\n\n28.Luppi P, Haluszczak C, Trucco M, Deloia JA. Normal pregnancy is associated with peripheral leukocyte activation. Am J Reprod Immunol. 2002;47(2):72–81.\nView ArticlePubMedGoogle Scholar\n\n29.Cacciapaglia F, Buzzulini F, Arcarese L, Ferraro E, Afeltra A. The use of an interferon-gamma release assay as a biomarker of response to anti-TNF-alpha treatment. Drug Dev Res. 2014;75 Suppl 1:S50–3.\n\n30.Wright HL, Thomas HB, Moots RJ, Edwards SW. Interferon gene expression signature in rheumatoid arthritis neutrophils correlates with a good response to TNFi therapy. Rheumatology (Oxford). 2015;54(1):188–93.\nView ArticleGoogle Scholar\n\n31.Bennett L, Palucka AK, Arce E, Cantrell V, Borvak J, Banchereau J, et al. Interferon and granulopoiesis signatures in systemic lupus erythematosus blood. J Exp Med. 2003;197(6):711–23.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n32.Kalliolias GD, Ivashkiv LB. Overview of the biology of type I interferons. Arthritis Res Ther. 2010;12 Suppl 1:S1.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n33.Buttmann M, Rieckmann P. Interferon-beta1b in multiple sclerosis. Expert Rev Neurother. 2007;7(3):227–39.\nView ArticlePubMedGoogle Scholar\n\n34.Aalbers CJ, Bevaart L, Loiler S, de Cortie K, Wright JF, Mingozzi F, et al. Preclinical potency and biodistribution studies of an AAV5 vector expressing human interferon-β (ART-I02) for local treatment of patients with rheumatoid arthritis. PLoS One. 2015;10(6):e0130612.\nView ArticlePubMedPubMed CentralGoogle Scholar\n\n35.Crow MK. Type I interferon in organ-targeted autoimmune and inflammatory diseases. Arthritis Res Ther. 2010;12 Suppl 1:S5.\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":"R21 AR057931"},{"agency":"Gigtforeningen","grant_number":"R87-A1477-B512"},{"agency":"Juliane Marie Center, Rigshospitalet","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}