{"title":"Acyclic diene metathesis polymerization: History, methods and applications","uri":"","abstract":"Acyclic Diene Metathesis (ADMET) polymerization was established decades ago and has since developed into a robust and reliable technique. A wide range of different, new materials exhibiting unique properties has been produced via ADMET polymerization since its development. This versatile technique allows, through the right combination of monomer design and choice of catalyst, the synthesis of various functional polymers in addition to a precise control over primary structure. Systematic studies on precise ADMET polymers have greatly contributed to a better understanding of how branch identity and its distribution along the polymer backbone affect the thermal/electronic properties, crystallization, molecular dynamics and morphology of different materials. This article presents an extensive review of how ADMET started, the mechanism that underlies the structural features of ADMET polymers and the different strategies and techniques that have been developed over the years to overcome common synthetic challenges. Monomer synthesis methods are also discussed in detail, providing an important overview of the limitations and advantages of using ADMET as a polymerization technique. Many examples are given of functional ADMET polymers that have been developed by research groups all over the world.","documents":null,"note":"© 2016 Elsevier B.V. \n\nReceived 31 May 2016, Revised 28 August 2016, Accepted 26 October 2016, Available online 13 December 2016.","id":77874,"rev_number":5,"userid":18,"eprint_dir":"disk0/00/07/78/74","datestamp":"2017-06-01 14:56:21","lastmod":"2017-06-01 14:56:21","status_changed":"2017-06-01 14:56:21","type":"article","metadata_visibility":"show","creators":[{"given":"Lucas","family":"Caire da Silva","id":"Caire-da-Silva-L","orcid":""},{"given":"Giovanni","family":"Rojas","id":"Rojas-G","orcid":""},{"given":"Michael D.","family":"Schulz","id":"Schulz-M-D","orcid":""},{"given":"Kenneth B.","family":"Wagener","id":"Wagener-K-B","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Acyclic diene metathesis; Step-growth polymerization; Olefin metathesis; Precision polymers; Functional polymers\n","date":"2017-06","date_type":"published","publication":"Progress in Polymer Science","volume":"69","number":"","pagerange":"79-107","id_number":"CaltechAUTHORS:20170601-073241685","refereed":true,"issn":"0079-6700","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170601-073241685","related_url":[{"url":"https://doi.org/10.1016/j.progpolymsci.2016.12.001","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0079670016301113","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Lucas Caire da Silva, Giovanni Rojas, Michael D. Schulz, Kenneth B. Wagener, Acyclic diene metathesis polymerization: History, methods and applications, Progress in Polymer Science, Volume 69, June 2017, Pages 79-107, ISSN 0079-6700, https://doi.org/10.1016/j.progpolymsci.2016.12.001.\n(http://www.sciencedirect.com/science/article/pii/S0079670016301113)","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}