{"title":"The origin and degassing history of the Earth's atmosphere revealed by Archean xenon","uri":"","abstract":"Xenon (Xe) is an exceptional tracer for investigating the origin and fate of volatile elements on Earth. The initial isotopic composition of atmospheric Xe remains unknown, as do the mechanisms involved in its depletion and isotopic fractionation compared with other reservoirs in the solar system. Here we present high precision analyses of noble gases trapped in fluid inclusions of Archean quartz (Barberton, South Africa) that reveal the isotopic composition of the paleo-atmosphere at ≈3.3 Ga. The Archean atmospheric Xe is mass-dependently fractionated by 12.9±2.4 ‰ u^(−1) (± 2σ, s.d.) relative to the modern atmosphere. The lower than today ^(129)Xe excess requires a degassing rate of radiogenic Xe from the mantle higher than at present. The primordial Xe component delivered to the Earth's atmosphere is distinct from Solar or Chondritic Xe but similar to a theoretical component called U-Xe. Comets may have brought this component to the Earth's atmosphere during the last stages of terrestrial accretion.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252980","docid":252980,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265153","fileid":1265153,"datasetid":"document","objectid":252980,"filename":"ncomms15455.pdf","mime_type":"application/pdf","hash":"dbe2a7e80c69ebd16bad52077b7f75f0","hash_type":"MD5","filesize":860237,"mtime":"2017-06-01 14:41:18","url":"http://authors.library.caltech.edu/77876/1/ncomms15455.pdf"}],"eprintid":77876,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"ncomms15455.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/252981","docid":252981,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265158","fileid":1265158,"datasetid":"document","objectid":252981,"filename":"ncomms15455-s1.pdf","mime_type":"application/pdf","hash":"73204020fcba0ff6e7ca1e86e65837f5","hash_type":"MD5","filesize":1292322,"mtime":"2017-06-01 14:44:19","url":"http://authors.library.caltech.edu/77876/2/ncomms15455-s1.pdf"}],"eprintid":77876,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"ncomms15455-s1.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/252982","docid":252982,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265160","fileid":1265160,"datasetid":"document","objectid":252982,"filename":"ncomms15455-s2.pdf","mime_type":"application/pdf","hash":"924876f3ef8b95789b434e08056db88d","hash_type":"MD5","filesize":447110,"mtime":"2017-06-01 14:44:37","url":"http://authors.library.caltech.edu/77876/3/ncomms15455-s2.pdf"}],"eprintid":77876,"pos":3,"placement":3,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"ncomms15455-s2.pdf","content":"supplemental"}],"note":"© 2017 The Author(s). This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/. \n\nReceived: 20 June 2016; Accepted: 30 March 2017; Published online: 18 May 2017. \n\nN. Arndt and A. Hofmann are gratefully acknowledged for providing samples. L. Zimmermann is thanked for technical mentorship and assistance. Y. Marrocchi, M. Kuga, L.C.P. Martin and R. Belissont are thanked for insightful discussions. This project was funded by the European Research Council under the European Community's Seventh Framework Program (FP7/2007-2013 grant agreement no. 267255 to B.M.) and by the French Ministère de l'Enseignement Supérieur et la Recherche (PhD funding to G.A.). R.B. acknowledges funding from UK NERC grant NE/M000427/1. This is CRPG contribution #2504. \n\nAuthor Contributions: G.A. and B.M. collected the samples. G.A. and R.B. performed the experiments. G.A., R.B. and B.M. analysed the data and wrote the paper. \n\nThe authors declare no competing financial interests.","id":77876,"rev_number":13,"userid":18,"eprint_dir":"disk0/00/07/78/76","datestamp":"2017-06-01 14:55:48","lastmod":"2017-06-01 14:55:48","status_changed":"2017-06-01 14:55:48","type":"article","metadata_visibility":"show","creators":[{"given":"Guillaume","family":"Avice","id":"Avice-G","orcid":""},{"given":"Bernard","family":"Marty","id":"Marty-B","orcid":""},{"given":"Ray","family":"Burgess","id":"Burgess-R","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-18","date_type":"published","publication":"Nature Communications","volume":"8","number":"","pagerange":"Art. No. 15455","id_number":"CaltechAUTHORS:20170601-074113368","refereed":true,"issn":"2041-1723","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170601-074113368","related_url":[{"url":"http://dx.doi.org/10.1038/ncomms15455","type":"doi","description":"Article"},{"url":"http://www.nature.com/articles/ncomms15455","type":"pub","description":"Article"}],"referencetext":["1.\nMorbidelli, A., Chambers, J. \u0026 Lunine, J. I. Source regions and time scales for the delivery of water to Earth. Meteorit. Planet. Sci. 35, 1309–1320 (2000).\n+ Show context\nISI\nCAS\nArticle\n\n\n2.\nO’Brien, D. P., Walsh, K. J., Morbidelli, A. \u0026 Raymond, S. N. Water delivery and giant impacts in the ‘Grand Tack’ scenario. Icarus 239, 74–84 (2014).\n+ Show context\nCAS\nArticle\n\n\n3.\nAltwegg, K. et al. 67P/Churyumov-Gerasimenko, a Jupiter family comet with a high D/H ratio. Science 347, 1261952 (2015).\n+ Show context\nCAS\nPubMed\nArticle\n\n\n4.\nBalsiger, H. et al. Detection of argon in the coma of comet 67P/Churyumov-Gerasimenko. Sci. Adv. 1, e1500377 (2015).\n+ Show context\n\n5.\nMarty, B. et al. Origins of volatile elements (H,C,N, noble gases) on Earth and Mars in light of recent results from the ROSETTA cometary mission. Earth Planet. Sci. Lett. 441, 91–102 (2016).\n+ Show context\n\n6.\nYokochi, R. \u0026 Marty, B. A determination of the neon isotopic composition of the deep mantle. Earth Planet. Sci. Lett. 225, 77–88 (2004).\n+ Show context\nCAS\nArticle\n\n\n7.\nHolland, G., Cassidy, M. \u0026 Ballentine, C. J. Meteorite Kr in Earth's mantle suggests a late accretionary source for the atmosphere. Science 326, 1522–1525 (2009).\n+ Show context\nCAS\nPubMed\nArticle\n\n\n8.\nCaracausi, A., Avice, G., Burnard, P. G., Füri, E. \u0026 Marty, B. Chondritic xenon in the Earth’s mantle. Nature 533, 82–85 (2016).\n+ Show context\nCAS\nPubMed\nArticle\n\n\n9.\nPepin, R. O. \u0026 Porcelli, D. Origin of noble gases in the terrestrial planets. Rev. Mineral Geochem. 47, 191–246 (2002).\n+ Show context\nISI\nCAS\nArticle\n\n\n10.\nMarty, B. The origins and concentrations of water, carbon, nitrogen and noble gases on Earth. Earth Planet. Sci. Lett. 313-314, 56–66 (2012).\n+ Show context\nCAS\nArticle\n\n\n11.\nOtt, U. Planetary and pre-solar noble gases in meteorites. Chem. Erde. Geochem. 74, 519–544 (2014).\n+ Show context\n\n12.\nOzima, M. \u0026 Podosek, F. A. Noble Gas Geochemistry Cambridge University Press (2002).\n+ Show context\n\n13.\nPepin, R. O. On the origin and early evolution of terrestrial planet atmospheres and meteoritic volatiles. Icarus 92, 2–79 (1991).\n+ Show context\nISI\nCAS\nArticle\n\n\n14.\nTakaoka, N. An interpretation of general anomalies of xenon and the isotopic composition of primitive xenon. Mass Spectrom. 20, 287–302 (1972).\n+ Show context\n\n15.\nMeshik, A. P., Pravdivtseva, O. V. \u0026 Hohenberg, C. M. New evidence for chemical fractionation of radioactive xenon precursors in fission chains. Phys. Rev. C 93, 044614–044619 (2016).\n+ Show context\n\n16.\nMeshik, A. P., Kehm, K. \u0026 Hohenberg, C. M. Anomalous xenon in zone 13 Okelobondo. Geochim. Cosmochim. Acta 64, 1651–1661 (2000).\n+ Show context\n\n17.\nSrinivasan, B. Barites: anomalous xenon from spallation and neutron-induced reactions. Earth Planet. Sci. Lett. 31, 129–141 (1976).\n+ Show context\nCAS\nArticle\n\n\n18.\nPujol, M., Marty, B., Burnard, P. \u0026 Philippot, P. Xenon in Archean barite: Weak decay of 130Ba, mass-dependent isotopic fractionation and implication for barite formation. Geochim. Cosmochim. Acta 73, 6834–6846 (2009).\n+ Show context\nCAS\nArticle\n\n\n19.\nPujol, M., Marty, B. \u0026 Burgess, R. Chondritic-like xenon trapped in Archean rocks: A possible signature of the ancient atmosphere. Earth Planet. Sci. Lett. 308, 298–306 (2011).\n+ Show context\nCAS\nArticle\n\n\n20.\nPujol, M., Marty, B., Burgess, R., Turner, G. \u0026 Philippot, P. Argon isotopic composition of Archaean atmosphere probes early Earth geodynamics. Nature 498, 87–90 (2013).\n+ Show context\nPubMed\nArticle\n\n\n21.\nKuga, M., Marty, B., Marrocchi, Y. \u0026 Tissandier, L. Synthesis of refractory organic matter in the ionized gas phase of the solar nebula. Proc. Natl Acad. Sci. 112, 7129–7134 (2015).\n+ Show context\n\n22.\nHébrard, E. \u0026 Marty, B. Coupled noble gas-hydrocarbon evolution of the early Earth atmosphere upon solar UV irradiation. Earth Planet. Sci. Lett. 385, 40–48 (2014).\n+ Show context\nCAS\nArticle\n\n\n23.\nAvice, G. \u0026 Marty, B. The iodine-plutonium-xenon age of the Moon-Earth system revisited. Phil. Trans. R. Soc. A 372, 1–16 (2014).\n+ Show context\n\n24.\nFurnes, H., de Wit, M. \u0026 Robins, B. A review of new interpretations of the tectonostratigraphy, geochemistry and evolution of the Onverwacht Suite, Barberton Greenstone Belt, South Africa. Gondwana Res. 23, 403–428 (2013).\n+ Show context\n\n25.\nHofmann, A. \u0026 Harris, C. Silica alteration zones in the Barberton greenstone belt: a window into subseafloor processes 3.5–3.3 Ga ago. Chem. Geol. 257, 221–239 (2008).\n+ Show context\nCAS\nArticle\n\n\n26.\nKelley, S. Excess argon in K–Ar and Ar–Ar geochronology. Chem. Geol. 188, 1–22 (2002).\n+ Show context\nCAS\nArticle\n\n\n27.\nde Vries, S. T., Nijman, W. \u0026 Armstrong, R. A. Growth-fault structure and stratigraphic architecture of the Buck Ridge volcano-sedimentary complex, upper Hooggenoeg Formation, Barberton Greenstone Belt, South Africa. Precambrian Res. 149, 77–98 (2006).\n+ Show context\n\n28.\nLee, J.-Y. et al. A redetermination of the isotopic abundances of atmospheric Ar. Geochim. Cosmochim. Acta 70, 4507–4512 (2006).\n+ Show context\nCAS\nArticle\n\n\n29.\nStuart, F. M., Mark, D. F., Gandanger, P. \u0026 McConville, P. Earth-atmosphere evolution based on new determination of Devonian atmosphere Ar isotopic composition. Earth Planet. Sci. Lett. 446, 21–26 (2016).\n+ Show context\n\n30.\nRagettli, R. A., Hebeda, E. H., Signer, P. \u0026 Wieler, R. Uranium-xenon chronology: precise determination of λsf* 136Ysf for spontaneous fission of 238 U. Earth Planet. Sci. Lett. 128, 653–670 (1994).\n+ Show context\n\n31.\nLudwig, K. R. ISOPLOT; a plotting and regression program for radiogenic-isotope data; version 2.53. USGS Open-File Report 91–445 (U.S. Geological Survey, 1991).\n+ Show context\n\n32.\nHolland, G. et al. Deep fracture fluids isolated in the crust since the Precambrian era. Nature 497, 357–360 (2013).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n33.\nMeshik, A., Hohenberg, C., Pravdivtseva, O. \u0026 Burnett, D. Heavy noble gases in solar wind delivered by Genesis mission. Geochim. Cosmochim. Acta 127, 326–347 (2014).\n+ Show context\nArticle\n\n\n34.\nMarrocchi, Y., Avice, G. \u0026 Estrade, N. Multiple carriers of Q noble gases in primitive meteorites. Geophys. Res. Lett. 42, 1–7 (2015).\n+ Show context\nCAS\nArticle\n\n\n35.\nPorcelli, D. \u0026 Ballentine, C. J. Models for distribution of terrestrial noble gases and evolution of the atmosphere. Rev. Mineral. Geochem. 47, 411–480 (2002).\n+ Show context\nISI\nCAS\nArticle\n\n\n36.\nBianchi, D. et al. Low helium flux from the mantle inferred from simulations of oceanic helium isotope data. Earth Planet. Sci. Lett. 297, 379–386 (2010).\n+ Show context\nISI\nCAS\nArticle\n\n\n37.\nMoreira, M., Kunz, J. \u0026 Allègre, C. Rare gas systematics in popping rock: isotopic and elemental compositions in the upper mantle. Science 279, 1178–1181 (1998).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n38.\nHolland, G. \u0026 Ballentine, C. J. Seawater subduction controls the heavy noble gas composition of the mantle. Nature 441, 186–191 (2006).\n+ Show context\nCAS\nPubMed\nArticle\n\n\n39.\nMukhopadhyay, S. Early differentiation and volatile accretion recorded in deep-mantle neon and xenon. Nature 486, 101–104 (2012).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n40.\nTrieloff, M. \u0026 Kunz, J. Isotope systematics of noble gases in the Earth's mantle: possible sources of primordial isotopes and implications for mantle structure. Phys. Earth Planet. Inter. 148, 13–38 (2005).\n+ Show context\nISI\nCAS\nArticle\n\n\n41.\nSchlitzer, R. Quantifying He fluxes from the mantle using multi-tracer data assimilation. Phil. Trans. R. Soc. A 374, 20150288 (2016).\n+ Show context\n\n42.\nvan Thienen, P., Vlaar, N. J. \u0026 van den Berg, A. P. Assessment of the cooling capacity of plate tectonics and flood volcanism in the evolution of Earth, Mars and Venus. Phys. Earth Planet. Inter. 150, 287–315 (2005).\n+ Show context\nArticle\n\n\n43.\nGonnermann, H. M. \u0026 Mukhopadhyay, S. Preserving noble gases in a convecting mantle. Nature 459, 560–563 (2009).\n+ Show context\nISI\nCAS\nPubMed\nArticle\n\n\n44.\nAsafov, E. V. et al. Komatiites reveal a hydrous Archaean deep-mantle reservoir. Nature 531, 628–632 (2016).\n+ Show context\nCAS\nPubMed\nArticle\n\n\n45.\nKorenaga, J. Urey ratio and the structure and evolution of Earth's mantle. Rev. Geophys. 46, RG2007–RG2032 (2008).\n+ Show context\nCAS\nArticle\n\n\n46.\nLevison, H. F., Duncan, M. J., Brasser, R. \u0026 Kaufmann, D. E. Capture of the Sun's Oort cloud from stars in its birth cluster. Science 329, 187–190 (2010).\n+ Show context\nCAS\nPubMed\nArticle\n\n\n47.\nParai, R. \u0026 Mukhopadhyay, S. The evolution of MORB and plume mantle volatile budgets: constraints from fission Xe isotopes in Southwest Indian Ridge basalts. Geochem. Geophys. Geosyst. 16, 1–17 (2015).\n+ Show context\n\n48.\nKelley, S. K-Ar and Ar-Ar Dating. Rev. Mineral. Geochem. 47, 785–818 (2002).\n+ Show context\n\n49.\nSchwarz, W. H. \u0026 Trieloff, M. Intercalibration of 40Ar–39Ar age standards NL-25, HB3gr hornblende, GA1550, SB-3, HD-B1 biotite and BMus/2 muscovite. Chem. Geol. 242, 218–231 (2007).\n+ Show context\n\n50.\nSteiger, R. H. \u0026 Jäger, E. Subcommission on geochronology: convention on the use of decay constants in geo-and cosmochronology. Earth Planet. Sci. Lett. 36, 359–362 (1977).\n+ Show context\nISI\nCAS\nArticle\n\n\n51.\nTurner, G. 40Ar–39Ar age and cosmic ray irradiation history of the Apollo 15 anorthosite, 15415. Earth Planet. Sci. Lett. 14, 169–175 (1972).\n+ Show context\nCAS\nArticle\n\n\n52.\nKelley, S., Turner, G., Butterfield, A. W. \u0026 Shepherd, T. J. The source and significance of argon isotopes in fluid inclusions from areas of mineralization. Earth Planet. Sci. Lett. 79, 303–318 (1986).\n+ Show context\nCAS\nArticle\n\n\n53.\nRoddick, J. C. High precision intercalibration of 40Ar–39Ar standards. Geochim. Cosmochim. Acta 47, 887–898 (1983).\n+ Show context\nISI\nCAS\nArticle\n\n\n54.\nRuzié-Hamilton, L. et al. Determination of halogen abundances in terrestrial and extraterrestrial samples by the analysis of noble gases produced by neutron irradiation. Chem. Geol. 437, 77–87 (2016).\n+ Show context\n\n55.\nMarrocchi, Y. \u0026 Marty, B. Experimental determination of the xenon isotopic fractionation during adsorption. Geophys. Res. Lett. 40, 4165–4170 (2013).\n+ Show context\n\n56.\nPorcelli, D. \u0026 Ballentine, C. J. An overview of noble gas geochemistry and cosmochemistry. Rev. Mineral. Geochem. 47, 1–19 (2002).\n+ Show context\n\n57.\nHonda, M., McDougall, I., Patterson, D. B. \u0026 Doulgeris, A. Possible solar noble-gas component in Hawaiian basalts. Nature 349, 149–151 (1991).\n\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Avice, G. et al. The origin and degassing history of the\nEarth’s atmosphere revealed by Archean xenon. Nat. Commun. 8, 15455 doi: 10.1038/ncomms15455 (2017)","other_numbering_system":null,"funders":[{"agency":"European Research Council (ERC)","grant_number":"267255"},{"agency":"Ministère de l'Enseignement Supérieur et la Recherche","grant_number":""},{"agency":"Natural Environment Research Council (NERC) ","grant_number":"NE/M000427/1"}],"collection":"CaltechAUTHORS","reviewer":"GP","local_group":null}