{"title":"High Efficiency UV/Optical/NIR Detectors for Large Aperture Telescopes and UV Explorer Missions: Development of and Field Observations with Delta-doped Arrays","uri":"","abstract":"A number of exciting concepts are under development for Flagship, Probe class, Explorer class, and Suborbital class NASA missions in the ultraviolet/optical spectral ranges. These missions will depend on high performance silicon detector arrays being delivered affordably and in high numbers. In a focused effort we have advanced delta-doping technology to high throughput and high yield wafer-scale processing, encompassing a multitude of state-of-the-art silicon-based detector formats and designs. As part of this technology advancement and in preparation for upcoming missions, we have embarked on a number of field observations, instrument integrations, and independent evaluations of delta-doped arrays. In this paper, we present recent data and innovations from the Advanced Detectors and Systems program at JPL, including two-dimensional doping technology; our end-to-end post-fabrication processing of high performance UV/Optical/NIR arrays; and advanced coatings for detectors and optical elements. Additionally, we present examples of past, in-progress, and planned observations and deployments of delta-doped arrays.","documents":[{"id":"http://authors.library.caltech.edu/id/document/252995","docid":252995,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265252","fileid":1265252,"datasetid":"document","objectid":252995,"filename":"1612.04734.pdf","mime_type":"application/pdf","hash":"88f0ceec45b9f600d3159975de3214ad","hash_type":"MD5","filesize":2954796,"mtime":"2017-06-01 15:54:05","url":"http://authors.library.caltech.edu/77885/1/1612.04734.pdf"}],"eprintid":77885,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1612.04734.pdf","content":"submitted"}],"note":"Submitted on 14 Dec 2016 (v1), last revised 12 Jan 2017 (this version, v2)) \n\nThe research was carried out in part at the Jet Propulsion Laboratory, California Institute of Technology, under a contract with the National Aeronautics and Space Administration. The authors gratefully acknowledge the support from NASA-SAT, NASA-APRA, JPL’ RTD program, the Keck Institute for Space Studies, and many years of other support from NASA and JPL and other agencies. E.T.K acknowledges the support by Nancy Grace Roman Fellowship, the Millikan Prize in Experimental Physics, and the NSF Fellowship. The authors would like to acknowledge generous and excellent collaborative support from e2v including A. Reinheimer, P. Jerram, P. Pool, P. Jorden, and P. Fochi on the 2-D doped EMCCDs. The authors gratefully acknowledge the collaborative work with LBNL’s S. Holland, C. Bebek, N. Roe and their team that has led to the demonstration and development of 2D-doped, p-channel CCDs; as well as Bruno Milliard and Robert Grange of LAM for the FIREBall-2 spectrograph data. We acknowledge M. McClish of RMD for detector QE data and wafer processing. S.R. Kulkarni, R. Smith, and J. Milburn of Caltech Optical Observatories and Palomar Observatory for WaSP delta-doped array first-light images.","id":77885,"rev_number":10,"userid":772,"eprint_dir":"disk0/00/07/78/85","datestamp":"2017-06-01 20:58:01","lastmod":"2017-06-01 20:58:01","status_changed":"2017-06-01 20:58:01","type":"monograph","metadata_visibility":"show","creators":[{"given":"Shouleh","family":"Nikzad","id":"Nikzad-S","orcid":""},{"given":"April D.","family":"Jewell","id":"Jewell-A-D","orcid":""},{"given":"Michael E.","family":"Hoenk","id":"Hoenk-M-E","orcid":""},{"given":"Todd","family":"Jones","id":"Jones-T-J","orcid":""},{"given":"John","family":"Hennessy","id":"Hennessy-J-L","orcid":""},{"given":"Tim","family":"Goodsall","id":"Goodsall-Tim-M","orcid":""},{"given":"Alexander","family":"Carver","id":"Carver-A","orcid":""},{"given":"Charles","family":"Shapiro","id":"Shapiro-C","orcid":""},{"given":"Samuel R.","family":"Cheng","id":"Cheng-Samuel-R","orcid":""},{"given":"Erika","family":"Hamden","id":"Hamden-E-T","orcid":""},{"given":"Gillian","family":"Kyne","id":"Kyne-G","orcid":""},{"given":"D. Christopher","family":"Martin","id":"Martin-D-C","orcid":""},{"given":"David","family":"Schiminovich","id":"Schiminovich-D","orcid":""},{"given":"Paul","family":"Scowen","id":"Scowen-P-A","orcid":""},{"given":"Kevin","family":"France","id":"France-K","orcid":""},{"given":"Stephan","family":"McCandliss","id":"McCandliss-S","orcid":""},{"given":"Roxana E.","family":"Lupu","id":"Lupu-R-E","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"Detectors, delta doping, superlattice doping, UV, 2D doping, ALD, coatings, deployment, quantum efficiency, solar-blind silicon, silicon","date":"2017-01-12","date_type":"submitted","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170601-085352803","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170601-085352803","related_url":[{"url":"https://arxiv.org/abs/1612.04734","type":"arxiv","description":"Discussion paper"}],"referencetext":["1. R. D. Blandford et al., New Worlds, New Horizons in Astronomy and Astrophysics, The National Academies Press, Washington, DC (2010).\n2. M. E. Hoenk et al., “Epitaxial Growth of p+ Silicon on a Backside-thinned CCD for Enhanced UV Response,” in Proc. SPIE 1656, High-Resolution Sensors and Hybrid Systems 1656(1992), M. M. Blouke et al., Eds., pp. 488–496, San Jose, CA, USA (1992) [doi:10.1117/12.135951].\n3. J. M. Jenkins et al., “High Precision Photometry with Back-Illuminated CCDs,” in ASP Conference Series 119, Planets Beyond the Solar System and the Next Generation of Space, D. Sodarblum, Ed., pp. 277–280 (1997).\n4. M. J. S. Belton et al., “The Galileo Solid-State Imaging Experiment,” Space Sci. Rev. 60, 413–455 (1992).\n5. J. R. Janesick, Scientific Charge-Coupled Devices, SPIE Press, Bellingham (2001).\n6. P. J. W. Noble, “Self-scanned silicon image detector arrays,” IEEE Trans. Electron Devices 15(4), 202–209 (1968) [doi:10.1109/T-ED.1968.16167].\n7. E. R. Fossum, “Active Pixel Sensors: Are CCD’s Dinosaurs?,” in SPIE Proceedings 1900, M. M. Blouke, Ed., pp. 2–14 (1993).\n8. E. R. Fossum, “CMOS image sensors: electronic camera-on-a-chip,” IEEE Trans. Electron Devices 44(10), 1689–1698 (1997) [doi:10.1109/16.628824].\n9. S. E. Holland et al., “Fabrication of back-illuminated, fully depleted charge-coupled devices,” Nucl. Instruments Methods Phys. Res. Sect. A 579(2), 653–657 (2007) [doi:10.1016/j.nima.2007.05.265].\n10. E. Charbon et al., “SPAD-Based Sensors,” in TOF Range-Imaging Cameras, F. Remondino and D. Stoppa, Eds., pp. 11–38, Springer, Heidelberg (2013).\n11. C. Veerappan, Y. Maruyama, and E. Charbon, “Silicon Integrated Electrical Micro-lens for CMOS SPADs Based on Avalanche Propagation Phenomenon,” in International Image Sensor Workshop, Snowbird, UT, USA (2013).\n12. C. Niclass et al., “A 128 x 128 Single-Photon Image Sensor With Column-Level 10-Bit Time-to-Digital Converter Array,” IEEE J. Solid-State Circuits 43(12), 2977–2989 (2008) [doi:10.1109/JSSC.2008.2006445].\n13. M. E. Hoenk et al., “Delta-doped Back-illuminated CMOS Imaging Arrays: Progress and Prospects,” in Proc. SPIE 7419, Infrared Systems and Photoelectronic Technology IV 7419, E. L. Dereniak et al., Eds., p. 0T:15, San Diego, CA, USA (2009) [doi:10.1117/12.832326].\n14. M. M. Blouke et al., “Ultraviolet downconverting phosphor for use with silicon CCD imagers.,” Appl. Opt. 19(19), 3318–3321 (1980) [doi:10.1364/AO.19.003318].\n15. J. T. Trauger, “Sensors for the Hubble Space Telescope wide field and planetary cameras (1 and 2),” CCDs Astron. Proc. Conf. Tucson, AZ, Sept. 6-8, 1989, 217–230, Astronomical Society of the Pacific, San Francisco (1990).\n16. P. F. Morrissey, S. R. McCandliss, and P. D. Feldman, “Vacuum-ultraviolet quantum efficiency of a thinned, backside-illuminated charge-coupled device,” Appl. Opt. 34(22), 4640 (1995) [doi:10.1364/AO.34.004640].\n17. T. J. Jones et al., “Thinned Charge Coupled Devices with Flat Focal Planes for UV Imaging,” in Proc. SPIE 3965, Sensors and Camera Systems for Scientific, Industrial and Digital Photgraphy Applications 3965, M. M. Blouke et al., Eds., pp. 148–156, San Jose, CA, USA (2000).\n18. Q.-Y. Tong, G. G. (Jr. . Fountain, and P. M. Enquist, “Method for low temperature bonding and bonded structure,” 6902897, US (2005).\n19. S. Nikzad et al., “Single Photon Counting UV Solar-Blind Detectors Using Silicon and III-Nitride Materials,” Sensors 16(6), 927 (2016) [doi:10.3390/s16060927].\n20. “Advanced Imager Technology: High Sensitivity Imaging,” \u003chttps://www.ll.mit.edu/mission/electronics/ait/hisensitivityimage.html\u003e (accessed 1 December 2016).\n21. J.-M. Defise, J. D. Moses, and F. Clette, “In-orbit performances of the EIT instrument on board SOHO and intercalibration with the EIT Calroc Sounding Rocket program,” in Proc. SPIE 3442, Missions to the Sun II 3442, C. M. Korendyke, Ed., pp. 126–139, San Diego, CA, USA (1998) [doi:10.1117/12.330249].\n22. M. E. Hoenk et al., “Superlattice-doped silicon detectors: progress and prospects,” Proc. SPIE 9154, High Energy, Opt. Infrared Detect. Astron. VI 9154, A. D. Holland and J. Beletic, Eds., 13:13, Montreal, CA (2014) [doi:10.1117/12.2057678].\n23. S. Nikzad et al., “Ultrastable and uniform EUV and UV detectors,” in Proc. SPIE 4139, Instrumentation for UV/EUV Astronomy and Solar Missions 4139, S. Fineschi et al., Eds., pp. 250–258, San Diego, CA, USA (2000) [doi:10.1117/12.410541].\n24. M. E. Hoenk et al., “Growth of a delta-doped silicon layer by molecular beam epitaxy on a charge-coupled device for reflection-limited ultraviolet quantum efficiency,” Appl. Phys. Lett. 61(9), 1084–1086 (1992) [doi:10.1063/1.107675].\n25. M. E. Hoenk et al., “The DUV Stability of Superlattice-doped CMOS Detector Arrays,” in International Image Sensor Workshop, Snowbird, UT, USA (2013).\n26. M. E. Hoenk, “Surface Passivation by Quantum Exclusion Using Multiple Layers,” 8,395,243, United States (2013).\n27. J. Blacksberg et al., “Enhanced quantum efficiency of high-purity silicon imaging detectors by ultralow temperature surface modification using Sb doping,” Appl. Phys. Lett. 87(25), 254101 (2005) [doi:10.1063/1.2149181].\n28. J. Blacksberg, M. E. Hoenk, and S. Nikzad, “Ultra-low-temperature homoepitaxial growth of Sb-doped silicon,” J. Cryst. Growth 285(4), 473–480 (2005) [doi:10.1016/j.jcrysgro.2005.09.005].\n29. R. C. Jaeger, Introduction to Microelectronic Fabrication, V, Addison-Wesley Publishing Company, New York (1993).\n30. R. L. Headrick et al., “Si(100)-(2×1)boron reconstruction: Self-limiting monolayer doping,” Appl. Phys. Lett. 57(26), 2779 (1990) [doi:10.1063/1.103785].\n31. M. Lesser, “Antireflection Coatings for Silicon Charge-Coupled Devices,” Opt. Eng. 26(9), 269911 (1987) [doi:10.1117/12.7974170].\n32. E. T. Hamden et al., “Ultraviolet antireflection coatings for use in silicon detector design,” Appl. Opt. 50(21), 4180–4188 (2011) [doi:10.1364/AO.50.004180].\n33. S. M. George, “Atomic layer deposition: an overview.,” Chem. Rev. 110(1), 111–131 (2010) [doi:10.1021/cr900056b].\n34. J. Hennessy et al., “Metal-Dielectric Filters for Solar-Blind Silicon Ultraviolet Detectors,” Appl. Opt. 54(11), 3507–3512 (2015) [doi:10.1364/AO.54.003507].\n35. M. Putkonen et al., “Thermal and plasma enhanced atomic layer deposition of SiO2 using commercial silicon precursors,” Thin Solid Films 558, 93–98, Elsevier B.V. (2014) [doi:10.1016/j.tsf.2014.02.087].\n36. J. Hennessy et al., “Performance and prospects of far ultraviolet aluminum mirrors protected by atomic layer deposition,” J. Astron. Telesc. Instruments, Syst. 2(4), 41206 (2016) [doi:10.1117/1.JATIS.2.4.041206].\n37. “TFCalc: Thin Film Design Software for Windows,” Version 3.5 (2009).\n38. Edward D. Palik, Ed., Handbook of Optical Constants of Solids, Elsevier Inc. (1997).\n39. S. Nikzad et al., “High performance silicon imaging arrays for cosmology, planetary sciences, \u0026 other applications,” in 2014 IEEE International Electron Devices Meeting, p. 10.7.1-10.7.4, San Francisco (2014) [doi:10.1109/IEDM.2014.7047027].\n40. V. S. Argabright et al., “The Kepler photometer focal plane array,” in Proc. SPIE 7010, Space Telescopes and Instrumentation 2008: Optical, Infrared, and Millimeter, J. M. Oschmann, Jr., M. W. M. de Graauw, and H. A. MacEwen, Eds., p. 70102L, Marseille, FR (2008) [doi:10.1117/12.789913].\n41. J. H. J. de Bruijne, “Science performance of Gaia, ESA’s space-astrometry mission,” Astrophys. Space Sci. 341(1), 31–41 (2012) [doi:10.1007/s10509-012-1019-4].\n42. J. M. Owens and E. L. Riddle, “BIG SCIENCE ON A SMALL BUDGET: A University Sounding Rocket,” in 11th Annual AIAA/Utah State University Conference on Small Satellites, pp. 1–15, Logan, UT (1997).\n43. S. R. McCandliss et al., “Long-slit imaging dual-order spectrograph: LIDOS,” in Proc. SPIE 4854, Future EUV/UV and Visible Space Astrophysics Missions and Instrumentation, J. C. Blades and O. H. W. Siegmund, Eds., p. 385 (2003) [doi:10.1117/12.459772].\n44. R. E. Lupu et al., “Calibration and flight performance of the long-slit imaging dual order spectrograph,” in Proc. SPIE 7011, Space Telescopes and Instrumentation 2008: Ultraviolet to Gamma Ray, 7011, M. J. L. Turner and K. A. Flanagan, Eds., p. 3I:12, Marseille, FR (2008) [doi:10.1117/12.786435].\n45. K. France et al., “Rocket and Far Ultraviolet Spectroscopic Explorer Observations of IC 405: Differential Extinction and Fluorescent Molecular Hydrogen,” Astrophys. J. 616(1), 257–265 (2004) [doi:10.1086/424813].\n46. K. France and S. R. McCandliss, “Molecular Hydrogen in Orion as Observed by the Far Ultraviolet Spectroscopic Explorer,” Astrophys. J. 629(2), L97–L100 (2005) [doi:10.1086/462404].\n47. S. Nikzad et al., “Direct detection of 0.1–20 keV electrons with delta doped, fully depleted, high purity silicon p-i-n diode arrays,” Appl. Phys. Lett. 89(18), 182114 (2006) [doi:10.1063/1.2360904].\n48. K. France et al., “Development of the Colorado High-resolution Echelle Stellar Spectrograph (CHESS),” in Proc. SPIE 8443, Space Telescopes and Instrumentation 2012: Ultraviolet to Gamma Ray, T. Takahashi, S. S. Murray, and J.-W. A. den Herder, Eds., p. 844305 (2012) [doi:10.1117/12.925668].\n49. K. Hoadley et al., “The assembly, calibration, and preliminary results from the Colorado high-resolution Echelle stellar spectrograph (CHESS),” in Proc. SPIE 9144, Space Telescopes and Instrumentation 2014: Ultraviolet to Gamma Ray, T. Takahashi, J.-W. A. den Herder, and M. Bautz, Eds., p. 914406 (2014) [doi:10.1117/12.2055661].\n50. K. France, B. Fleming, and K. Hoadley, “CHISL: the combined high-resolution and imaging spectrograph for the LUVOIR surveyor,” 18 July 2016, 990506 [doi:10.1117/12.2231080].\n51. S. Redfield, “The Local Interstellar Medium” (2006).\n52. K. Hoadley et al., “The re-flight of the Colorado high-resolution Echelle stellar spectrograph (CHESS): improvements, calibrations, and post-flight results,” in Proc. SPIE 9905, Space Telescopes and Instrumentation 2016: Ultraviolet to Gamma Ray, J.-W. A. den Herder, T. Takahashi, and M. Bautz, Eds., p. 99052V (2016) [doi:10.1117/12.2232242].\n53. S. E. Tuttle et al., “FIREBALL: the first ultraviolet fiber fed spectrograph,” in Proc. SPIE 7732, Space Telescopes and Instrumentation 2010: Ultraviolet to Gamma Ray 7732, M. Arnaud, S. S. Murray, and T. Takahashi, Eds., p. 27:15, San Diego (2010) [doi:10.1117/12.857877].\n54. B. Milliard et al., “FIREBALL: the Faint Intergalactic medium Redshifted Emission Balloon: overview and first science flight results,” in Proc. SPIE 7732, Space Telescopes and Instrumentation 2010: Ultraviolet to Gamma Ray 7732, M. Arnaud, S. S. Murray, and T. Takahashi, Eds., p. 05:13, San Diego, CA, USA (2010) [doi:10.1117/12.857850].\n55. A. D. Jewell et al., “Detector Performance for the FIREBall-2 UV Experiment,” in Proc. SPIE 9601: UV, X-Ray, and Gamma-Ray Space Instrumentation for Astronomy XIX 9601, O. Siegmund et al., Eds., p. 0N:8, San Diego, CA, USA (2015).\n56. E. T. Hamden et al., “Noise and dark performance for FIREBall-2 EMCCD delta-doped CCD detector,” in Proc. SPIE 9601: UV, X-Ray, and Gamma-Ray Space Instrumentation for Astronomy XIX, O. H. Siegmund et al., Eds., p. 0O:10, San Diego (2015).\n57. G. Kyne et al., “The faint intergalactic-medium red-shifted emission balloon: future UV observations with EMCCDs,” in Proc. SPIE 9915, High Energy, Optical, and Infrared Detectors for Astronomy VII 9915, A. D. Holland and J. Beletic, Eds., p. 07:10 (2016) [doi:10.1117/12.2232879].\n58. J. Blacksberg et al., “Near-100% Quantum Efficiency of Delta Doped Large-Format UV-NIR Silicon Imagers,” IEEE Trans. Electron Devices 55(12), 3402–3406 (2008) [doi:10.1109/TED.2008.2006779].\n59. A. D. Jewell et al., “Wide band antireflection coatings deposited by atomic layer deposition,” in Proc. SPIE 8820, Nanoepitaxy: Materials and Devices 8820, N. P. Kobayashi et al., Eds., p. 0Z:9, San Diego, CA, USA (2013) [doi:10.1117/12.2025198].\n60. F. Greer et al., “Atomically precise surface engineering of silicon CCDs for enhanced UV quantum efficiency,” J. Vac. Sci. Technol. A 31(1), 01A103:9 (2013) [doi:10.1116/1.4750372].\n61. M. Matuszewski et al., “The Cosmic Web Imager: An integral field spectrograph for the Hale Telescope at Palomar Observatory: Instrument design and first results,” in Proc. SPIE 7735, Ground-based and Airborne Instrumentation for Astronomy III 7735, I. S. McLean, S. K. Ramsay, and H. Takami, Eds., p. 0P–12, San Diego (2010) [doi:10.1117/12.856644].\n62. P. Morrissey et al., “The Keck Cosmic Web Imager: A capable new integral field spectrograph for the W. M. Keck Observatory,” in Proc. SPIE 8446, Ground-based and Airborne Instrumentation for Astronomy IV 8446, I. S. McLean, S. K. Ramsay, and H. Takami, Eds., p. 13:14, Amsterdam, NL (2012) [doi:10.1117/12.924729].\n63. D. Hitlin et al., “An APD for the Detection of the Fast Scintillation Component of BaF2,” IEEE Trans. Nucl. Sci. 63(2), 513–515 (2016) [doi:10.1109/TNS.2016.2527651].\n64. D. G. Hitlin et al., “An APD for the efficient detection of the fast scintillation component of BaF2,” Nucl. Instruments Methods Phys. Res. Sect. A 824, 119–122 (2016) [doi:10.1016/j.nima.2015.11.074].\n65. E. T. Hamden et al., “Charge-coupled devices detectors with high quantum efficiency at UV wavelengths,” J. Astron. Telesc. Instruments, Syst. 2(3), 36003 (2016) [doi:10.1117/1.JATIS.2.3.036003].\n66. S. Nikzad et al., “Delta doped Electron Multiplies CCD with Absolute Quantum Efficiency over 50% in the near to far Ultraviolet Range for Single Photon Counting Applications,” Appl. Opt. 51(3), 365–369 (2012).\n67. P. Jelinsky et al., “Performance results of the GALEX cross delay line detectors,” in Proc. SPIE 4854, Future EUV/UV and Visible Space Astrophysics Missions and Instrumentation 4854, J. C. Blades and O. H. W. Siegmund, Eds., pp. 233–240, Waikoloa, HI, USA (2003) [doi:10.1117/12.460013].\n68. P. Morrissey, “A GALEX instrument overview and lessons learned,” Proc. SPIE 6266, Sp. Telesc. Instrum. II Ultrav. to Gamma Ray 6266, M. J. L. Turner and G. Hasinger, Eds., 0Y1-15 (2006) [doi:10.1117/12.671839].\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"NASA/JPL/Caltech","grant_number":""},{"agency":"JPL Research and Technology Development Fund","grant_number":""},{"agency":"Keck Institute for Space Studies (KISS)","grant_number":""},{"agency":"Nancy Grace Roman Fellowship","grant_number":""},{"agency":"Millikan Prize in Experimental Physics","grant_number":""},{"agency":"NSF Graduate Research Fellowship","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":["Space Astrophysics Laboratory","Keck Institute for Space Studies"]}