{"title":"Quantum de Finetti Theorems Under Local Measurements with Applications","uri":"","abstract":"Quantum de Finetti theorems are a useful tool in the study of correlations in quantum multipartite states. In this paper we prove two new quantum de Finetti theorems, both showing that under tests formed by local measurements in each of the subsystems one can get an exponential improvement in the error dependence on the dimension of the subsystems. We also obtain similar results for non-signaling probability distributions. We give several applications of the results to quantum complexity theory, polynomial optimization, and quantum information theory. The proofs of the new quantum de Finetti theorems are based on information theory, in particular on the chain rule of mutual information. The results constitute improvements and generalizations of a recent de Finetti theorem due to Brandão, Christandl and Yard.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253020","docid":253020,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265521","fileid":1265521,"datasetid":"document","objectid":253020,"filename":"art%3A10.1007%2Fs00220-017-2880-3.pdf","mime_type":"application/pdf","hash":"de1bedd40eaea69c2d11cad15c5b2c40","hash_type":"MD5","filesize":843122,"mtime":"2017-06-01 22:16:00","url":"http://authors.library.caltech.edu/77900/1/art%253A10.1007%252Fs00220-017-2880-3.pdf"}],"eprintid":77900,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"art%3A10.1007%2Fs00220-017-2880-3.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/253022","docid":253022,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265530","fileid":1265530,"datasetid":"document","objectid":253022,"filename":"1210.6367.pdf","mime_type":"application/pdf","hash":"6b7ef213a4737b34855d0561fb9d7e0c","hash_type":"MD5","filesize":478799,"mtime":"2017-06-01 22:18:49","url":"http://authors.library.caltech.edu/77900/2/1210.6367.pdf"}],"eprintid":77900,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1210.6367.pdf","content":"submitted"}],"note":"© 2017 Springer-Verlag Berlin Heidelberg. \n\nReceived: 21 July 2014. Accepted: 4 March 2017. Published online: 19 April 2017. \n\nCommunicated by M. M. Wolf. \n\nWe are grateful to Kevin Milner, Thomas Vidick and Mark Wilde for many helpful comments on an early version of the paper, to Ashley Montanaro for explaining to us the remark at the end of Sect. 5.2, to Scott Aaronson for telling us about [3] in 2010, to Graeme Smith and Ke Li for catching a bug in an earlier version of Corollary 14 and especially to Boaz Barak, Jon Kelner and David Steurer for sharing with us an early version of [11]. We also benefited from interesting discussions with Matthias Christandl and Stephanie Wehner. Much of this work was done while FGSLB was working at the Institute for Theoretical Physics in ETH Zürich and AWH was working in the Department of Computer Science at the University of Washington. FGSLB acknowledges support from EPSRC through an Early Career Fellowship, the Polish  Ministry of Science and Higher Education Grant No. IdP2011 000361, the Swiss National Science Foundation, via the National Centre of Competence in Research QSIT, the German Science Foundation (Grant CH 843/2-1), the Swiss National Science Foundation (Grants PP00P2_128455, 20CH21_138799 (CHIST-ERA project CQC)), the Swiss National Center of Competence in Research “Quantum Science and Technology (QSIT)”, and the Swiss State Secretariat for Education and Research supporting COST action MP1006. AWH was funded by NSF Grants 0916400, 0829937, 0803478, 1111382, 1452616 and 1629809, and ARO contract W911NF-12-1-0486.","id":77900,"rev_number":13,"userid":772,"eprint_dir":"disk0/00/07/79/00","datestamp":"2017-06-01 23:13:10","lastmod":"2017-06-01 23:13:10","status_changed":"2017-06-01 23:13:10","type":"article","metadata_visibility":"show","creators":[{"given":"Fernando G. S. L.","family":"Brandão","id":"Brandão-F-G-S-L","orcid":""},{"given":"Aram W.","family":"Harrow","id":"Harrow-A-W","orcid":"0000-0003-3220-7682  Works (3) \tSort"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-07","date_type":"published","publication":"Communications in Mathematical Physics","volume":"353","number":"2","pagerange":"469-506","id_number":"CaltechAUTHORS:20170601-151508738","refereed":true,"issn":"0010-3616","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170601-151508738","related_url":[{"url":"http://dx.doi.org/10.1007/s00220-017-2880-3","type":"doi","description":"Article"},{"url":"https://link.springer.com/article/10.1007/s00220-017-2880-3","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1210.6367","type":"arxiv","description":"Discussion Paper"},{"url":"http://rdcu.be/taYL","type":"pub","description":"Free ReadCube access"}],"referencetext":["1. Aaronson, S. : The learnability of quantum states. Proc. R. Soc. A 463, 2088\narXiv:quant-ph/0608142 (2007)\n2. Aaronson, S., Beigi, S., Drucker, A., Fefferman, B., Shor, P.: The power of unentanglement. Theory\nComput. 5(1), 1–42. arXiv:0804.0802 (2009)\n3. Aaronson, S., Impagliazzo, R., Moshkovitz, D.: Am with multiple merlins. In: Proceedings of the 2014\nIEEE 29th Conference on Computational Complexity, CCC ’14, pp. 44–55. arXiv:1401.6848 (2014)\n4. Arora, S., Barak, B.:ComputationalComplexity:AModern Approach.Cambridge University Press, Cambridge\n(2009)\n5. Arora, S., Barak, B., Steurer, D.: Subexponential algorithms for unique games and related problems. In:\nFOCS, pp. 563–572 (2010)\n6. Arora, S., Lund, C., Motwani, R., Sudan, M., Szegedy, M.: Proof verification and the hardness of approximation\nproblems. J. ACM 45(3), 501–555 (1998)\n7. Arora, S., Safra, S.: Probabilistic checking of proofs: a new characterization of NP. J. ACM 45(1), 70–\n122 (1998)\n8. Aspect, A., Dalibard, J., Roger, G.: Experimental test of Bell’s inequalities using time- varying analyzers.\nPhys. Rev. Lett. 49, 1804–1807 (1982)\n9. Babai, L., Fortnow, L., Lund, C.: Non-deterministic exponential time has two-prover interactive protocols.\nComput. Complex. 1, 3–40 (1991)\n10. Barak B., Brandão, F.G., Harrow, A.W., Kelner, J., Steurer, D., Zhou, Y.: Hypercontractivity, sum-ofsquares\nproofs, and their applications. In: STOC ’12, STOC ’12, pp. 307–326. arXiv:1205.4484 (2012)\n11. Barak, B., Kelner, J., Steurer, D.: Rounding sum-of-squares relaxations. In: STOC. arXiv:1312.6652\n(2014)\n12. Barrett, J., Leifer, M.: The de Finetti theorem for test spaces. New J. Phys. 11, 033024.\narXiv:0712.2265 (2009)\n13. Beigi, S., Shor, P.: Approximating the set of separable states using the positive partial transpose test. J.\nMath. Phys. 51, 042202. arXiv:0904.2705 (2010)\n14. Bell, J.: On the Einstein–Podolsky–Rosen paradox. Physics 1, 195 (1964)\n15. Bellare, M., Feige, U., Kilian, J.: On the role of shared randomness in two prover proof systems. In:\nISTCS ’95, pp. 199–208 (1995)\n16. Bennett, C., Bernstein, E., Brassard, G., Vazirani, U.: The strengths and weaknesses of quantum computation.\nSIAM J. Comput. 26, 1510–1523. arXiv:quant-ph/9701001 (1997)\n17. Bennett, C.H., DiVincenzo, D.P., Smolin, J.A., Wootters, W.K.: Mixed-state entanglement and quantum\nerror correction. Phys. Rev. A 52, 3824–3851. arXiv:quant-ph/9604024 (1996)\n18. Blier, H., Tapp, A.: All languages inNP have very short quantum proofs. In: First InternationalConference\non Quantum, Nano, and Micro Technologies, pp. 34–37. IEEE Computer Society, Los Alamitos, CA,\nUSA. arXiv:0709.0738 (2009)\n19. Brandão, F.: Entanglement theory and the quantum simulation of many-body physics. Ph.D. thesis,\nImperial College London arXiv:0810.0026 (2008)\n20. Brandão, F.G., Christandl, M., Yard, J.: A quasipolynomial-time algorithm for the quantum separability\nproblem. In: Proceedings of the 43rd Annual ACM Symposium on Theory of Computing, STOC ’11, pp.\n343–352. arXiv:1011.2751 (2011)\n21. Brandão, F.G., Plenio, M.B.: A generalization of quantum Stein’s lemma. Commun. Math.\nPhys. 295, 791. arXiv:0904.0281 (2010)\n22. Brandão, F.G.S.L., Christandl, M.: Detection of multiparticle entanglement: quantifying the search for\nsymmetric extensions. Phys. Rev. Lett. 109, 160502. arXiv:1105.5720 (2012)\n23. Brandão, F.G.S.L., Harrow, A.W.: Product-state approximations to quantum ground states. In: Proceedings\nof the 45th Annual ACM Symposium on Theory of Computing, STOC ’13, pp. 871–880.\narXiv:1310.0017 (2013)\n24. Brandão, F.G.S.L., Christandl, M., Yard, J.: Faithful squashed entanglement. Commun. Math.\nPhys. 306(3), 805–830. arXiv:1010.1750 (2011)\n25. Buhrman, H., Regev, O., Scarpa, G., de Wolf, R.: Near-optimal and explicit Bell inequality violations.\nIn: CCC ’11, pp. 157–166 arXiv:1012.5043 (2011)\n26. Cai, J.-Y., Condon, A., Lipton, R.: Playing games of incomplete information. In: STACS ’90, vol. 415,\npp. 58–69 (1990)\n27. Caves, C.M., Fuchs, C.A., Schack, R.: Unknown quantum states: the quantum de Finetti representation. J.\nMath. Phys. 43(9), 4537–4559. arXiv:quant-ph/0104088 (2002)\n28. Chen, J., Drucker, A.: Short multi-prover quantum proofs for SAT without entangled measurements.\narXiv:1011.0716 (2010)\n29. Christandl, M., Koenig, R., Renner, R.: Post-selection technique for quantum channels with applications\nto quantum cryptography. Phys. Rev. Lett. 102, 020504. arXiv:0809.3019 (2009)\n30. Christandl,M., König, R.,Mitchison, G., Renner, R.: One-and-a-half quantum de Finetti theorems. Commun.\nMath. Phys. 273, 473–498. arXiv:quant-ph/0602130 (2007)\n31. Christandl, M., Toner, B.: Finite de Finetti theorem for conditional probability distributions describing\nphysical theories. J. Math. Phys. 50(4), 042104. arXiv:0712.0916 (2009)\n32. Cleve, R., Gavinsky, D., Jain, R.: Entanglement-resistant two-prover interactive proof systems and nonadaptive\nPIRs. Quantum Inf. Comput. 9(7), 648–656. arXiv:0707.1729 (2009)\n33. Cleve R., Hoyer P., Toner B., Watrous J.: Consequences and limits of nonlocal strategies. In CCC ’04,\npp. 236–249. arXiv:quant-ph/0404076 (2004)\n34. Cobos, F., Kühn, T., Peetre, J.: Remarks on symmetries of trilinear forms. Rev. R. Acad. Cienc. Exact.\nFis. Nat. (Esp) 94(4), 441–449 (2000)\n35. D’Angelo, J.P., Putinar, M.: Polynomial optimization on odd-dimensional spheres. In: Putinar, M., Sullivant,\nS. (eds.) Emerging Applications of Algebraic Geometry, Volume 149 of The IMA Volumes in\nMathematics and Its Applications, pp. 1–15. Springer, New York (2009)\n36. Klerk, E.de : The complexity of optimizing over a simplex, hypercube or sphere: a short survey. Cent.\nEur. J. Oper. Res. 16(2), 111–125 (2008)\n37. Diaconis, P., Freedman, D.: Finite exchangeable sequences. Ann. Probab. 8, 745–764 (1980)\n38. Doherty, A.C., Parrilo, P.A., Spedalieri, F.M.: Complete family of separability criteria. Phys. Rev.\nA 69, 022308. arXiv:quant-ph/0308032 (2004)\n39. Doherty, A.C., Wehner, S.: Convergence of SDP hierarchies for polynomial optimization on the hypersphere.\narXiv:1210.5048 (2012)\n40. Fannes, M., Lewis, J.T., Verbeure, A.: Symmetric states of composite systems. Lett. Math. Phys. 15, 255–\n260 (1988)\n41. Harrow, A.W., Montanaro, A.: An efficient test for product states, with applications to quantum Merlin-\nArthur games. In: FOCS ’10, pp. 633–642. arXiv:1001.0017 (2010)\n42. Harrow, A.W., Montanaro, A.: Testing product states, quantum Merlin-Arthur games and tensor optimization.\nJ. ACM 60(1), 3–1343. arXiv:1001.0017 (2013)\n43. Hayden, P., Winter, A.: Weak decoupling duality and quantum identification. IEEE Trans. Inf. Theory\n58(7), 4914–4929. arXiv:1003.4994 (2012)\n44. Hudson, R.L.,Moody, G.R.: Locally normal symmetric states and an analogue of de Finetti’s theorem. Z.\nWahrschein. Verw. Geb. 33, 343–351 (1976)\n45. Impagliazzo, R., Paturi, R.: On the complexity of k-SAT. J. Comput. Syst. Sci. 62(2), 367–375 (2001)\n46. Impagliazzo, R., Paturi, R., Zane, F.: Which problems have strongly exponential complexity? In:\nFOCS’98, pp. 653–662. IEEE (1998)\n47. Ioannou, L.: Computational complexity of the quantum separability problem. Quantum Inf. Comput.\n7(4), 335 (2007)\n48. Ito, T.: Polynomial-space approximation of no-signaling provers. In: ICALP’10, pp. 140–151.\narXiv:0908.2363 (2010)\n49. Ito, T., Kobayashi, H., Matsumoto, K.: Oracularization and two-prover one-round interactive proofs\nagainst nonlocal strategies. In: CCC ’09, pp. 217–228. arXiv:0810.0693 (2009)\n50. Ito, T., Kobayashi, H., Preda, D., Sun, X., Yao, A.C.C.: Generalized tsirelson inequalities, commutingoperator\nprovers, and multi-prover interactive proof systems. In: CCC ’08, pp. 187–198. arXiv:0712.2163\n(2008)\n51. Ito, T., Vidick, T.: A multi-prover interactive proof for NEXP sound against entangled provers. In FOCS\n’12. arXiv:1207.0550 (2012)\n52. Kearns, M., Vazirani, U.: An Introduction to Computational Learning Theory. MIT Press, Cambridge\n(1994)\n53. Kempe, J., Kobayashi, H., Matsumoto, K., Toner, B., Vidick, T.: Entangled games are hard to approximate.\nSIAM J. Comput. 40(3), 848–877. arXiv:0704.2903 (2011)\n54. Kempe, J., Regev, O., Toner, B.: Unique games with entangled provers are easy. SIAM J. Comput.\n39(7), 3207–3229. arXiv:0710.0655 (2010)\n55. Khot, S., Safra, M.: A two prover one round game with strong soundness. In: FOCS ’11, pp. 648–657\n(2011)\n56. Kitaev, A.Y., Shen, A.H., Vyalyi, M.N.: Classical and Quantum Computation, Volume 47 of Graduate\nStudies in Mathematics. AMS, Providence (2002)\n57. Kobayashi, H., Matsumoto, K.: Quantum multi-prover interactive proof systems with limited prior entanglement.\nJ. Comput. Syst. Sci. 66(3), 429–450. arXiv:cs/0102013 (2003)\n58. Kobayashi, H., Matsumoto, K., Yamakami, T.: Quantum Merlin-Arthur proof systems: are multiple\nMerlins more helpful to Arthur? In: ISAAC, vol. 2906, pp. 189–198. arXiv:quant-ph/0306051 (2003)\n59. Koenig, R., Renner, R.: A de Finetti representation for finite symmetric quantum states. J. Math.\nPhys. 46(12), 122108. arXiv:quant-ph/0410229 (2005)\n60. Lancien, C., Winter, A.: Distinguishing multi-partite states by local measurements. Commun. Math.\nPhys. 323(2), 555–573. arXiv:1206.2884 (2013)\n61. Lasserre, J.B.: Global optimization with polynomials and the problem of moments. SIAM J.\nOpt. 11(3), 796–817 (2001)\n62. Laurent, M.: Sums of squares, moment matrices and optimization over polynomials. Emerg. Appl. Algebraic\nGeom. 149, 157–270 (2009)\n63. Li, K., Smith, G.: Quantum de finetti theorem under fully-one-way adaptive measurements. Phys. Rev.\nLett. 114, 160503. arXiv:1408.6829 (2015)\n64. Li, K., Winter, A.: Relative entropy and squashed entanglement. Commun. Math. Phys. 326(1), 63–\n80. arXiv:1210.3181 (2014)\n65. Marriott, C., Watrous, J.: Quantum Arthur-Merlin games. Comput. Complex. 14(2), 122–152.\narXiv:cs/0506068 (2005)\n66. Masanes, L., Acin, A., Gisin, N.: General properties of nonsignaling theories. Phys. Rev.\nA 73, 012112. arXiv:quant-ph/0508016 (2006)\n67. Matthews, W., Wehner, S., Winter, A.: Distinguishability of quantum states under restricted families\nof measurements with an application to quantum data hiding. Commun. Math. Phys. 291(3), 813–843.\narXiv:0810.2327 (2009)\n68. Navascues, M., Owari, M., Plenio, M.B.: The power of symmetric extensions for entanglement detection.\nPhys. Rev. A 80, 052306. arXiv:0906.2731 (2009)\n69. Nielsen, M.A., Chuang, I.L.: Quantum Computation and Quantum Information. Cambridge University\nPress, New York (2000)\n70. O’Donnell, R., Zhou, Y.: Approximability and proof complexity. In: SODA ’13, pp. 1537–1556.\narXiv:1211.1958 (2013)\n71. Parrilo, P.A.: Structured semidefinite programs and semialgebraic geometry methods in robustness and\noptimization. Ph.D. thesis, MIT (2000)\n72. Piani, M. : Relative entropy of entanglement and restricted measurements. Phys. Rev.\nLett. 103, 160504. arXiv:0904.2705 (2009)\n73. Powers, V., Reznick, B.: A new bound for Pólya’s theorem with applications to polynomials positive on\npolyhedra. J. Pure Appl. Algebra 164(1–2), 221–229 (2001)\n74. Raggio, G.A., Werner, R.F.: Quantum statistical mechanics of general mean field systems. Helv. Phys.\nActa 62, 980–1003 (1989)\n75. Raghavendra, P., Tan, N.: Approximating CSPs with global cardinality constraints using SDP hierarchies.\nIn: SODA ’12, pp. 373–387. arXiv:1110.1064 (2012)\n76. Renner, R.: Security of quantum key distribution. Ph.D. thesis, ETHZ, Zurich. arXiv:quant-ph/0512258\n(2005)\n77. Renner, R.: Symmetry implies independence. Nat. Phys. 3, 645–649. arXiv:quant-ph/0703069 (2007)\n78. Sion, M.: On general minimax theorems. Pac. J. Math. 8(1), 171–176 (1958)\n79. Størmer, E.: Symmetric states of infinite tensor products of C*-algebras. J. Funct. Anal. 3, 48 (1969)\n80. Terhal, B.M., Doherty, A.C., Schwab, D.: Symmetric extensions of quantum states and local hidden\nvariable theories. Phys. Rev. Lett. 90, 157903. arXiv:quant-ph/0210053 (2003)\n81. Vidick, T.: Three-player entangled XOR games are NP-hard to approximate. SIAM J. Comput.\n45(3), 1007–1063. arXiv:1302.1242 (2016)\n82. Werner, R.F.: An application of Bell’s inequalities to a quantum state extension problem. Lett. Math.\nPhys. 17, 359 (1989)\n83. Wilde, M.M.: Quantum Information Theory. Cambridge University Press, Cambridge. (2013)\narXiv:1106.1445\n84. Yang, D.: A simple proof of monogamy of entanglement. Phys. Lett. A 360(2), 249–250.\narXiv:quant-ph/0604168 (2006)\n85. Yang, D., Horodecki, K.,Horodecki, M.,Horodecki, P.,Oppenheim, J., Song,W.: Squashed entanglement\nfor multipartite states and entanglement measures based on the mixed convex roof. IEEE Trans. Inf.\nTheory 55(7), 3375–3387. arXiv:0704.2236 (2009)"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Brandão, F.G.S.L. \u0026 Harrow, A.W. Commun. Math. Phys. (2017) 353: 469. doi:10.1007/s00220-017-2880-3","other_numbering_system":null,"funders":[{"agency":"Engineering and Physical Sciences Research Council (EPSRC)","grant_number":""},{"agency":"Ministry of Science and Higher Education (Poland)","grant_number":"IdP2011 000361"},{"agency":"Deutsche Forschungsgemeinschaft (DFG)","grant_number":"CH 843/2-1"},{"agency":"Swiss National Science Foundation (SNSF)","grant_number":"PP00P2_128455"},{"agency":"Swiss National Science Foundation (SNSF)","grant_number":"20CH21_138799"},{"agency":"Swiss National Science Foundation (SNSF)","grant_number":"CHIST-ERA project CQC"},{"agency":"Swiss State Secretariat for Education and Research","grant_number":"MP1006"},{"agency":"NSF","grant_number":"CCF-0916400"},{"agency":"NSF","grant_number":"CCF-0829937"},{"agency":"NSF","grant_number":"PHY-0803478"},{"agency":"NSF","grant_number":"CCF-1111382"},{"agency":"NSF","grant_number":"CCF-1452616"},{"agency":"NSF","grant_number":"CCF-1629809"},{"agency":"Army Research Office (ARO)","grant_number":"W911NF-12-1-0486"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}