{"title":"Scrambling and thermalization in a diffusive quantum many-body system","uri":"","abstract":"Out-of-time ordered (OTO) correlation functions describe scrambling of information in correlated quantum matter. They are of particular interest in incoherent quantum systems lacking well defined quasi-particles. Thus far, it is largely elusive how OTO correlators spread in incoherent systems with diffusive transport governed by a few globally conserved quantities. Here, we study the dynamical response of such a system using high-performance matrix-product-operator techniques. Specifically, we consider the non-integrable, one-dimensional Bose–Hubbard model in the incoherent high-temperature regime. Our system exhibits diffusive dynamics in time-ordered correlators of globally conserved quantities, whereas OTO correlators display a ballistic, light-cone spreading of quantum information. The slowest process in the global thermalization of the system is thus diffusive, yet information spreading is not inhibited by such slow dynamics. We furthermore develop an experimentally feasible protocol to overcome some challenges faced by existing proposals and to probe time-ordered and OTO correlation functions. Our study opens new avenues for both the theoretical and experimental exploration of thermalization and information scrambling dynamics.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253053","docid":253053,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265753","fileid":1265753,"datasetid":"document","objectid":253053,"filename":"Bohrdt_2017_New_J._Phys._19_063001.pdf","mime_type":"application/pdf","hash":"8ee786b967ff9999df92f1bcdb784269","hash_type":"MD5","filesize":1885493,"mtime":"2017-06-02 16:13:26","url":"http://authors.library.caltech.edu/77909/1/Bohrdt_2017_New_J._Phys._19_063001.pdf"}],"eprintid":77909,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"Bohrdt_2017_New_J._Phys._19_063001.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/253054","docid":253054,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265755","fileid":1265755,"datasetid":"document","objectid":253054,"filename":"1612.02434.pdf","mime_type":"application/pdf","hash":"1e736ed5d0dd5565c39c488992a2c3e5","hash_type":"MD5","filesize":1059152,"mtime":"2017-06-02 16:13:34","url":"http://authors.library.caltech.edu/77909/2/1612.02434.pdf"}],"eprintid":77909,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1612.02434.pdf","content":"submitted"}],"note":"© 2017 IOP Publishing Ltd and Deutsche Physikalische Gesellschaft. Original content from this work may be used under the terms of the Creative Commons Attribution 3.0 licence. Any further distribution of this work must maintain attribution to the author(s) and the title of the work, journal citation and DOI. \n\nReceived 7 March 2017; Accepted 8 May 2017; Published 2 June 2017. \n\nWe thank T Barthel, X Chen, S Gopalakrishnan, H-C Jiang, A Kitaev, and S Sachdev for useful discussions. We acknowledge support from the Technical University of Munich—Institute for Advanced Study, funded by the German Excellence Initiative and the European Union FP7 under grant agreement 291763 (AB, MK), the DFG grant No. KN 1254/1-1 (AB, MK), the Studienstiftung des deutschen Volkes (AB), and the Alexander von Humboldt foundation via a Feodor Lynen fellowship as well as support from the US Department of Energy, Office of Basic Energy Sciences, Division of Materials Sciences and Engineering, under Contract No. DE-AC02-76SF00515 (CM).","id":77909,"rev_number":10,"userid":18,"eprint_dir":"disk0/00/07/79/09","datestamp":"2017-06-02 18:24:23","lastmod":"2017-06-02 18:24:23","status_changed":"2017-06-02 18:24:23","type":"article","metadata_visibility":"show","creators":[{"given":"A.","family":"Bohrdt","id":"Bohrdt-A","orcid":""},{"given":"C. B.","family":"Mendl","id":"Mendl-C-B","orcid":"0000-0002-6386-0230"},{"given":"M.","family":"Endres","id":"Endres-M","orcid":""},{"given":"M.","family":"Knap","id":"Knap-M","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-06","date_type":"published","publication":"New Journal of Physics","volume":"19","number":"6","pagerange":"Art. No. 063001","id_number":"CaltechAUTHORS:20170602-091316600","refereed":true,"issn":"1367-2630","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170602-091316600","related_url":[{"url":"https://doi.org/10.1088/1367-2630/aa719b","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.1088/1367-2630/aa719b/meta","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1612.02434","type":"arxiv","description":"Discussion Paper"}],"referencetext":["[1]\nFetter A L and Walecka J D 1971 Quantum Theory of Many-Particle Systems (New York: McGraw-Hill)\n  \n\n[2]\nSachdev S 2011 Quantum Phase Transitions 2nd edn (Cambridge: Cambridge University Press)\nCrossref  \n\n[3]\nPunk M, Chowdhury D and Sachdev S 2014 Topological excitations and the dynamic structure factor of spin liquids on the kagome lattice Nat. Phys. 10 289–93\nCrossref  \n\n[4]\nMorampudi S C, Turner A M, Pollmann F and Wilczek F 2016 Statistics of fractionalized excitations through threshold spectroscopy arXiv:1608.05700\nPreprint  \n\n[5]\nLarkin A I and Ovchinnikov Y N 1969 Quasiclassical method in the theory of superconductivity JETP Lett. 28 1200 (http://www.jetp.ac.ru/cgi-bin/e/index/e/28/6/p1200?a=list)\n  \n\n[6]\nShenker S H and Stanford D 2014 Black holes and the butterfly effect J. High Energy Phys. 2014 67\nCrossref  \n\n[7]\nKitaev A Y 2015 A simple model of quantum holography, KITP Program on Entanglement in Strongly-Correlated Quantum Matter (http://online.kitp.ucsb.edu/online/entangled15/kitaev/)\n\n[8]\nRoberts D A, Stanford D and Susskind L 2015 Localized shocks J. High Energy Phys. 2015 51\nCrossref  \n\n[9]\nMaldacena J, Shenker S H and Stanford D 2016 A bound on chaos J. High Energy Phys. 2016 106\nCrossref  \n\n[10]\nHosur P, Qi X-L, Roberts D A and Yoshida B 2016 Chaos in quantum channels J. High Energy Phys. 2016 4\nCrossref  \n\n[11]\nSachdev S and Ye J 1993 Gapless spin-fluid ground state in a random quantum Heisenberg magnet Phys. Rev. Lett. 70 3339–42\nCrossref  \n\n[12]\nBanerjee S and Altman E 2017 Solvable model for a dynamical quantum phase transition from fast to slow scrambling Phys. Rev. B 95 134302\nCrossref  \n\n[13]\nPatel A A and Sachdev S 2016 Quantum chaos on a critical Fermi surface Proc. Natl Acad. Sci. USA 114 1844–9\nCrossref  \n\n[14]\nStanford D 2016 Many-body chaos at weak coupling J. High Energy Phys. 2016 9\nCrossref  \n\n[15]\nAleiner I L, Faoro L and Ioffe L B 2016 Microscopic model of quantum butterfly effect: out-of-time-order correlators and traveling combustion waves Ann. Phys. 375 378–406\nCrossref  \n\n[16]\nMezei M and Stanford D 2017 On entanglement spreading in chaotic systems J. High Energy Phys. 2017 65\nCrossref  \n\n[17]\nKnap M, Kantian A, Giamarchi T, Bloch I, Lukin M D and Demler E 2013 Probing real-space and time-resolved correlation functions with many-body ramsey interferometry Phys. Rev. Lett. 111 147205\nCrossref  \n\n[18]\nSerbyn M, Knap M, Gopalakrishnan S, Papi Z, Yao N Y, Laumann C R, Abanin D A, Lukin M D and Demler E A 2014 Interferometric probes of many-body localization Phys. Rev. Lett. 113 147204\nCrossref  \n\n[19]\nIslam R, Ma R, Preiss P M, Tai M E, Lukin A, Rispoli M and Greiner M 2015 Measuring entanglement entropy in a quantum many-body system Nature 528 77–83\nCrossref  \n\n[20]\nKaufman A M, Tai M E, Lukin A, Rispoli M, Schittko R, Preiss P M and Greiner M 2016 Quantum thermalization through entanglement in an isolated many-body system Science 353 794–800\nCrossref  \n\n[21]\nSwingle B, Bentsen G, Schleier-Smith M and Hayden P 2016 Measuring the scrambling of quantum information Phys. Rev. A 94 040302\nCrossref  \n\n[22]\nZhu G, Hafezi M and Grover T 2016 Measurement of many-body chaos using a quantum clock Phys. Rev. A 94 062329\nCrossref  \n\n[23]\nYao N Y, Grusdt F, Swingle B, Lukin M D, Stamper-Kurn D M, Moore J E and Demler E A 2016 Interferometric approach to probing fast scrambling arXiv:1607.01801\nPreprint  \n\n[24]\nShen H, Zhang P, Fan R and Zhai H 2016 Out-of-time-order correlation at a quantum phase transition arXiv:1608.02438\nPreprint  \n\n[25]\nTsuji N, Werner P and Ueda M 2017 Exact out-of-time-ordered correlation functions for an interacting lattice fermion model Phys. Rev. A 95 011601\nCrossref  \n\n[26]\nRoberts D A and Swingle B 2016 Lieb-robinson bound and the butterfly effect in quantum field theories Phys. Rev. Lett. 117 091602\nCrossref  \n\n[27]\nHalpern N Y 2016 Jarzynski-like equality for the out-of-time-ordered correlator Phys. Rev. A 95 012120\nCrossref  \n\n[28]\nCampisi M and Goold J 2016 Thermodynamics of quantum information scrambling arXiv:1609.05848\nPreprint  \n\n[29]\nGiamarchi T 2004 Quantum Physics in One Dimension (Oxford: Oxford University Press)\n  \n\n[30]\nDeutsch J M 1991 Quantum statistical mechanics in a closed system Phys. Rev. A 43 2046–9\nCrossref  \n\n[31]\nSrednicki M 1994 Chaos and quantum thermalization Phys. Rev. E 50 888–901\nCrossref  \n\n[32]\nRigol M, Dunjko V and Olshanii M 2008 Thermalization and its mechanism for generic isolated quantum systems Nature 452 854–8\nCrossref  \n\n[33]\nDóra B and Moessner R 2016 Out-of-time-ordered density correlators in Luttinger liquids arXiv:1612.00614 (cond-mat.str-el)\nPreprint  \n\n[34]\nKim H and Huse D A 2013 Ballistic spreading of entanglement in a diffusive nonintegrable system Phys. Rev. Lett. 111 127205\nCrossref  \n\n[35]\nKukuljan I, Grozdanov S and Prosen T 2017 Weak quantum chaos arXiv:1701.09147 (cond-mat.stat-mech)\nPreprint  \n\n[36]\nChaikin P M and Lubensky T C 2000 Principles of Condensed Matter Physics (Cambridge, NY: Cambridge University Press)\n  \n\n[37]\nLux J, Müller J, Mitra A and Rosch A 2014 Hydrodynamic long-time tails after a quantum quench Phys. Rev. A 89 053608\nCrossref  \n\n[38]\nBlake M 2016 Universal charge diffusion and the butterfly effect in holographic theories Phys. Rev. Lett. 117 091601\nCrossref  \n\n[39]\nHartnoll S A 2015 Theory of universal incoherent metallic transport Nat. Phys. 11 54–61\nCrossref  \n\n[40]\nSwingle B and Chowdhury D 2016 Slow scrambling in disordered quantum systems Phys. Rev. B 95 060201\nCrossref  \n\n[41]\nLucas A and Steinberg J 2016 Charge diffusion and the butterfly effect in striped holographic matter J. High Energy Phys. 2016 143\nCrossref  \n\n[42]\nAlves C M and Jaksch D 2004 Multipartite entanglement detection in bosons Phys. Rev. Lett. 93 110501\nCrossref  \n\n[43]\nDaley A J, Pichler H, Schachenmayer J and Zoller P 2012 Measuring entanglement growth in quench dynamics of bosons in an optical lattice Phys. Rev. Lett. 109 020505\nCrossref  \n\n[44]\nPichler H, Bonnes L, Daley A J, Läuchli A M and Zoller P 2013 Thermal versus entanglement entropy: a measurement protocol for fermionic atoms with a quantum gas microscope New J. Phys. 15 063003\nIOPscience  \n\n[45]\nWhite S R and Feiguin A E 2004 Real-time evolution using the density matrix renormalization group Phys. Rev. Lett. 93 076401\nCrossref  \n\n[46]\nVerstraete F, García-Ripoll J J and Cirac J I 2004 Matrix product density operators: simulation of finite-temperature and dissipative systems Phys. Rev. Lett. 93 207204\nCrossref  \n\n[47]\nVerstraete F, Murg V and Cirac J I 2008 Matrix product states, projected entangled pair states, and variational renormalization group methods for quantum spin systems Adv. Phys. 57 143–224\nCrossref  \n\n[48]\nSchollwöck U 2011 The density-matrix renormalization group in the age of matrix product states Ann. Phys. 326 96–192\nCrossref  \n\n[49]\nBarthel T 2013 Precise evaluation of thermal response functions by optimized density matrix renormalization group schemes New J. Phys. 15 073010\nIOPscience  \n\n[50]\nKarrasch C, Bardarson J H and Moore J E 2013 Reducing the numerical effort of finite-temperature density matrix renormalization group transport calculations New J. Phys. 15 083031\nIOPscience  \n\n[51]\nBlanes S and Moan P C 2002 Practical symplectic partitioned Runge-Kutta and Runge–Kutta–Nyström methods J. Comput. Appl. Math. 142 313–30\nCrossref  \n\n[52]\nBraun S, Ronzheimer J P, Schreiber M, Hodgman S S, Rom T, Bloch I and Schneider U 2013 Negative absolute temperature for motional degrees of freedom Science 339 52–5\nCrossref  \n\n[53]\nLignier H, Sias C, Ciampini D, Singh Y, Zenesini A, Morsch O and Arimondo E 2007 Dynamical control of matter-wave tunneling in periodic potentials Phys. Rev. Lett. 99 220403\nCrossref  \n\n[54]\nJames D F V, Kwiat P G, Munro W J and White A G 2001 Measurement of qubits Phys. Rev. A 64 052312\nCrossref  \n\n[55]\nClément D, Fabbri N, Fallani L, Fort C and Inguscio M 2009 Exploring correlated 1D Bose gases from the superfluid to the Mott-insulator state by inelastic light scattering Phys. Rev. Lett. 102 155301\nCrossref  \n\n[56]\nErnst P T, Gotze S, Krauser J S, Pyka K, Luhmann D-S, Pfannkuche D and Sengstock K 2010 Probing superfluids in optical lattices by momentum-resolved Bragg spectroscopy Nat. Phys. 6 56–61\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"A Bohrdt et al 2017 New J. Phys. 19 063001","other_numbering_system":null,"funders":[{"agency":"European Research Council (ERC)","grant_number":"291763"},{"agency":"Deutsche Forschungsgemeinschaft (DFG)","grant_number":"KN 1254/1-1"},{"agency":"Studienstiftung des deutschen Volkes","grant_number":""},{"agency":"Alexander von Humboldt Foundation","grant_number":""},{"agency":"Department of Energy (DOE)","grant_number":"DE-AC02-76SF00515"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}