{"title":"Self-Powered and Bio-Inspired Dynamic Systems: Research and Education","uri":"","abstract":"Animals are products of nature and have evolved over millions of years to perform better in their activities. Engineering research and development can benefit greatly by looking into nature and finding engineering solutions by learning from animals’ evolution and biological systems. Another relevant factor in the present context is highlighted by the statement of the Nobel laureate Richard Smalley: “Energy is the single most important problem facing humanity today.” This paper focuses on how the research and education in the area of Dynamic Systems can be geared towards these two considerations. In particular, recent advances in self-powered dynamic systems and bio-inspired dynamic systems are highlighted. Self-powered dynamic systems benefit by capturing wasted energy in a dynamic system and converting it into useful energy in the mode of a regenerative system, possibly in conjunction with renewable energies. Examples of solar-powered vehicles, regenerative vibration control, and energy harvesting are presented in the paper. Particularly, development of solar-powered quadrotor, octocopter, and tricopter airships are presented, a self-powered vibration control of a mass-spring system using electromagnetic actuators/generators, and piezoelectric flutter energy harvesting using bi-stable material are discussed. As examples of bioinspired dynamic systems, flapping wing flying robots, vertical axis wind turbines inspired by fish schooling, propulsion inspired by jellyfish, and Psi Intelligent Control are given. In particular, various design and developments of bird-inspired and insect-inspired flapping wings with the piezoelectric and electromagnetic actuation mechanisms, a scaled vertical axis wind turbine farm consist of 4 turbines and the corresponding wind tunnel testing, jellyfish-inspired pulsing jet and experimenting the increase in efficiency of energy consumption, and a multi-agent/robotic based predictive control scheme inspired by Psi precognition (event or state not yet experienced). Examples of student projects and research carried out at Brunel University and the experimental rigs built (in all the mentioned areas) are discussed, as an integrated research and educational activity. For the analysis and understanding of the behavior of self-powered and bio-inspired systems, Optimal Uncertainty Quantification (OUQ) is used. OUQ establishes a unified analysis framework in obtaining optimized solutions of the dynamic systems responses, which takes into account uncertainties and incomplete information in the simulation of these systems.","documents":null,"note":"© 2016 ASME. \n\nPaper No. IMECE2016-65276.","id":77906,"rev_number":7,"userid":18,"eprint_dir":"disk0/00/07/79/06","datestamp":"2017-06-02 18:28:35","lastmod":"2017-06-02 18:28:35","status_changed":"2017-06-02 18:28:35","type":"book_section","metadata_visibility":"show","creators":[{"given":"Farbod","family":"Khoshnoud","id":"Khoshnoud-F","orcid":""},{"given":"Ibrahim I.","family":"Esat","id":"Esat-I-I","orcid":""},{"given":"Richard H. C.","family":"Bonser","id":"Bonser-R-H-C","orcid":""},{"given":"Clarence W.","family":"de Silva","id":"de-Silva-C-W","orcid":""},{"given":"Michael M.","family":"McKerns","id":"McKerns-M-M","orcid":""},{"given":"Houman","family":"Owhadi","id":"Owhadi-H","orcid":"0000-0002-5677-1600"}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"2016-11","date_type":"published","publication":"","volume":"4A","number":"","pagerange":"Art. No. V04AT05A046","id_number":"CaltechAUTHORS:20170602-084400992","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170602-084400992","related_url":[{"url":"http://dx.doi.org/10.1115/IMECE2016-65276","type":"doi","description":"Article"},{"url":"http://proceedings.asmedigitalcollection.asme.org/proceeding.aspx?articleid=2602138","type":"pub","description":"Article"}],"referencetext":null,"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Khoshnoud F, Esat II, Bonser RC, de Silva CW, McKerns MM, Owhadi H. Self-Powered and Bio-Inspired Dynamic Systems: Research and Education. ASME. ASME International Mechanical Engineering Congress and Exposition, Volume 4A: Dynamics, Vibration, and Control ():V04AT05A046. doi:10.1115/IMECE2016-65276","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}