{"title":"On the exactness of soft theorems","uri":"","abstract":"Soft behaviours of S-matrix for massless theories reflect the underlying\nsymmetry principle that enforces its masslessness. As an expansion in soft\nmomenta, sub-leading soft theorems can arise either due to (I) unique structure\nof the fundamental vertex or (II) presence of enhanced broken-symmetries. While\nthe former is expected to be modified by infrared or ultraviolet divergences,\nthe latter should remain exact to all orders in perturbation theory. Using\ncurrent algebra, we clarify such distinction for spontaneously broken (super)\nPoincare and (super) conformal symmetry. We compute the UV divergences of DBI,\nconformal DBI, and A-V theory to verify the exactness of type (II) soft\ntheorems, while type (I) are shown to be broken and the soft-modifying\nhigher-dimensional operators are identified. As further evidence for the\nexactness of type (II) soft theorems, we consider the alpha' expansion of both\nsuper and bosonic open strings amplitudes, and verify the validity of the\ntranslation symmetry breaking soft-theorems up to O(alpha'^{6}). Thus the\nmassless S-matrix of string theory \"knows\" about the presence of D-branes.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253081","docid":253081,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265934","fileid":1265934,"datasetid":"document","objectid":253081,"filename":"1705.10078.pdf","mime_type":"application/pdf","hash":"f67f38dfb6a06e25d9eeffdba5d0bb39","hash_type":"MD5","filesize":920685,"mtime":"2017-06-02 18:21:09","url":"http://authors.library.caltech.edu/77918/1/1705.10078.pdf"}],"eprintid":77918,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1705.10078.pdf","content":"submitted"}],"note":"We thank Massimo Bianchi, and Renata Kallosh for helpful discussion. Y-t Huang and\nZhizhong Li are supported by MOST under the grant No. 103-2112-M-002-025-MY3 and\nthe support from National Center for Theoretical Science (NCTS), Taiwan. The work of\nALG is supported by CUniverse research promotion project by Chulalongkorn University\n(grant reference CUAASC). The work of CW is supported in part by a DOE Early Career\nAward under Grant No. DE-SC0010255.","id":77918,"rev_number":9,"userid":999,"eprint_dir":"disk0/00/07/79/18","datestamp":"2017-06-02 18:23:05","lastmod":"2017-06-02 18:24:39","status_changed":"2017-06-02 18:23:05","type":"monograph","metadata_visibility":"show","creators":[{"given":"Andrea L.","family":"Guerrieri","id":"Guerrieri-A-L","orcid":""},{"given":"Yu-tin ","family":"Huang","id":"Huang-Yu-tin","orcid":""},{"given":"Zhizhong","family":"Li","id":"Li-Zhizhong","orcid":""},{"given":"Congkao","family":"Wen","id":"Wen-Congkao","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2017-05-29","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170602-111742281","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170602-111742281","related_url":[{"url":"http://arxiv.org/abs/1705.10078","type":"arxiv","description":"Discussion Paper"}],"referencetext":["S. Weinberg, Infrared photons and gravitons, Phys. Rev. 140 (1965) B516–B524.\n[2] S. L. Adler, Consistency conditions on the strong interactions implied by a partially\nconserved axial vector current, Phys. Rev. 137 (1965) B1022–B1033.\n[3] F. Low, Bremsstrahlung of very low-energy quanta in elementary particle collisions,\nPhys.Rev. 110 (1958) 974–977.\n15From now on we will suppress the notation for integration regions, knowing that we always have\n0 ≤ z2 ≤ z3 ≤ z5 ≤ 1.\n– 32 –\n[4] T. Burnett and N. M. Kroll, Extension of the low soft photon theorem, Phys.Rev.Lett. 20\n(1968) 86.\n[5] M. Gell-Mann and M. L. Goldberger, Scattering of low-energy photons by particles of spin\n1/2, Phys. Rev. 96 (1954) 1433–1438.\n[6] D. J. Gross and R. Jackiw, Low-Energy Theorem for Graviton Scattering, Phys.Rev. 166\n(1968) 1287–1292.\n[7] Z. Bern, S. Davies, P. Di Vecchia and J. Nohle, Low-Energy Behavior of Gluons and\nGravitons from Gauge Invariance, 1406.6987.\n[8] I. Low, Double Soft Theorems and Shift Symmetry in Nonlinear Sigma Models, Phys. Rev.\nD93 (2016) 045032, [1512.01232].\n[9] C. Cheung, K. Kampf, J. Novotny, C.-H. Shen and J. Trnka, On-Shell Recursion Relations\nfor Effective Field Theories, Phys. Rev. Lett. 116 (2016) 041601, [1509.03309].\n[10] H. Luo and C. Wen, Recursion relations from soft theorems, JHEP 03 (2016) 088,\n[1512.06801].\n[11] N. Arkani-Hamed, L. Rodina and J. Trnka, Locality and Unitarity from Singularities and\nGauge Invariance, 1612.02797.\n[12] L. Rodina, Uniqueness from locality and BCFW shifts, 1612.03885.\n[13] L. Rodina, Uniqueness from gauge invariance and the Adler zero, 1612.06342.\n[14] M. Bianchi, A. L. Guerrieri, Y.-t. Huang, C.-J. Lee and C. Wen, Exploring soft constraints\non effective actions, JHEP 10 (2016) 036, [1605.08697].\n[15] C. Cheung, K. Kampf, J. Novotny, C.-H. Shen and J. Trnka, A Periodic Table of Effective\nField Theories, JHEP 02 (2017) 020, [1611.03137].\n[16] W.-M. Chen, Y.-t. Huang and C. Wen, Exact coefficients for higher dimensional operators\nwith sixteen supersymmetries, JHEP 09 (2015) 098, [1505.07093].\n[17] I. Low and A. V. Manohar, Spontaneously broken space-time symmetries and Goldstone’s\ntheorem, Phys. Rev. Lett. 88 (2002) 101602, [hep-th/0110285].\n[18] P. Di Vecchia, R. Marotta, M. Mojaza and J. Nohle, New soft theorems for the gravity\ndilaton and the Nambu-Goldstone dilaton at subsubleading order, Phys. Rev. D93 (2016)\n085015, [1512.03316].\n[19] S. He, Y.-t. Huang and C. Wen, Loop Corrections to Soft Theorems in Gauge Theories and\nGravity, JHEP 12 (2014) 115, [1405.1410].\n[20] M. Bianchi, S. He, Y.-t. Huang and C. Wen, More on Soft Theorems: Trees, Loops and\nStrings, Phys. Rev. D92 (2015) 065022, [1406.5155].\n[21] H. Elvang, C. R. T. Jones and S. G. Naculich, Soft Photon and Graviton Theorems in\nEffective Field Theory, 1611.07534.\n[22] F. Cachazo, S. He and E. Y. Yuan, New Double Soft Emission Theorems, 1503.04816.\n[23] N. Arkani-Hamed, F. Cachazo and J. Kaplan, What is the Simplest Quantum Field Theory?,\nJHEP 1009 (2010) 016, [0808.1446].\n[24] H. Elvang and M. Kiermaier, Stringy KLT relations, global symmetries, and E7(7) violation,\nJHEP 10 (2010) 108, [1007.4813].\n– 33 –\n[25] N. Beisert, H. Elvang, D. Z. Freedman, M. Kiermaier, A. Morales and S. Stieberger, E7(7)\nconstraints on counterterms in N=8 supergravity, Phys. Lett. B694 (2011) 265–271,\n[1009.1643].\n[26] D. V. Volkov and V. P. Akulov, Possible universal neutrino interaction, JETP Lett. 16\n(1972) 438–440.\n[27] D. V. Volkov and V. P. Akulov, Is the Neutrino a Goldstone Particle?, Phys. Lett. 46B\n(1973) 109–110.\n[28] P. Di Vecchia, R. Marotta and M. Mojaza, Double-soft behavior of the dilaton of\nspontaneously broken conformal invariance, 1705.06175.\n[29] R. H. Boels and W. Wormsbecher, Spontaneously broken conformal invariance in\nobservables, 1507.08162.\n[30] Y.-t. Huang and C. Wen, Soft theorems from anomalous symmetries, JHEP 12 (2015) 143,\n[1509.07840].\n[31] M. Bianchi, J. F. Morales and C. Wen, Instanton corrections to the effective action of N = 4\nSYM, JHEP 11 (2015) 006, [1508.00554].\n[32] S. M. Kuzenko and S. A. McCarthy, On the component structure of N=1 supersymmetric\nnonlinear electrodynamics, JHEP 05 (2005) 012, [hep-th/0501172].\n[33] B. de Wit and D. Z. Freedman, Phenomenology of Goldstone Neutrinos, Phys. Rev. Lett. 35\n(1975) 827.\n[34] W.-M. Chen, Y.-t. Huang and C. Wen, New Fermionic Soft Theorems for Supergravity\nAmplitudes, Phys. Rev. Lett. 115 (2015) 021603, [1412.1809].\n[35] R. Kallosh, Nonlinear (Super)Symmetries and Amplitudes, JHEP 03 (2017) 038,\n[1609.09123].\n[36] R. Kallosh, A. Karlsson and D. Murli, Origin of Soft Limits from Nonlinear Supersymmetry\nin Volkov-Akulov Theory, JHEP 03 (2017) 081, [1609.09127].\n[37] Z. Komargodski and N. Seiberg, From Linear SUSY to Constrained Superfields, JHEP 09\n(2009) 066, [0907.2441].\n[38] S. M. Kuzenko and S. J. Tyler, Relating the Komargodski-Seiberg and Akulov-Volkov actions:\nExact nonlinear field redefinition, Phys. Lett. B698 (2011) 319–322, [1009.3298].\n[39] Y.-t. Huang, O. Schlotterer and C. Wen, Universality in string interactions, JHEP 09 (2016)\n155, [1602.01674].\n[40] C. R. Mafra, O. Schlotterer and S. Stieberger, Complete N-Point Superstring Disk Amplitude\nI. Pure Spinor Computation, Nucl. Phys. B873 (2013) 419–460, [1106.2645].\n[41] O. Schlotterer and S. Stieberger, Motivic Multiple Zeta Values and Superstring Amplitudes,\nJ. Phys. A46 (2013) 475401, [1205.1516].\n[42] J. Broedel, O. Schlotterer and S. Stieberger, http://mzv.mpp.mpg.de, .\n[43] J. Broedel, O. Schlotterer and S. Stieberger, Polylogarithms, Multiple Zeta Values and\nSuperstring Amplitudes, Fortsch. Phys. 61 (2013) 812–870, [1304.7267].\n[44] C. Cheung, C.-H. Shen and C. Wen, Unifying Relations for Scattering Amplitudes,\n1705.03025.\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":[{"name":"CALT-TH","id":"2017-022"}],"funders":[{"agency":"Ministry of Science and Technology (Taipei)","grant_number":"103-2112-M-002-025-MY3"},{"agency":"National Center for Theoretical Sciences (Taiwan)","grant_number":""},{"agency":"Department of Energy (DOE)","grant_number":"DE-SC0010255"},{"agency":"Chulalongkorn University","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":["Walter Burke Institute for Theoretical Physics"]}