{"title":"Redox stratification of an ancient lake in Gale crater, Mars","uri":"","abstract":"In 2012, NASA’s Curiosity rover landed on Mars to assess its potential as a habitat for past life and investigate the paleoclimate record preserved by sedimentary rocks inside the ~150-kilometer-diameter Gale impact crater. Geological reconstructions from Curiosity rover data have revealed an ancient, habitable lake environment fed by rivers draining into the crater. We synthesize geochemical and mineralogical data from lake-bed mudstones collected during the first 1300 martian solar days of rover operations in Gale. We present evidence for lake redox stratification, established by depth-dependent variations in atmospheric oxidant and dissolved-solute concentrations. Paleoclimate proxy data indicate that a transition from colder to warmer climate conditions is preserved in the stratigraphy. Finally, a late phase of geochemical modification by saline fluids is recognized.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253071","docid":253071,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265832","fileid":1265832,"datasetid":"document","objectid":253071,"filename":"eaah6849.full.pdf","mime_type":"application/pdf","hash":"acfead89101dbe031f1432d345e204e5","hash_type":"MD5","filesize":1092814,"mtime":"2017-06-02 17:16:03","url":"http://authors.library.caltech.edu/77915/1/eaah6849.full.pdf"}],"eprintid":77915,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"eaah6849.full.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/253073","docid":253073,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1265876","fileid":1265876,"datasetid":"document","objectid":253073,"filename":"aah6849_Hurowitz_SM.pdf","mime_type":"application/pdf","hash":"e0eca90a2fa66787ff7114d9f5b5d8c6","hash_type":"MD5","filesize":1849555,"mtime":"2017-06-02 17:45:10","url":"http://authors.library.caltech.edu/77915/2/aah6849_Hurowitz_SM.pdf"}],"eprintid":77915,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"aah6849_Hurowitz_SM.pdf","content":"supplemental"}],"note":"© 2017 American Association for the Advancement of Science. \n\nReceived 31 July 2016; accepted 19 April 2017. \n\nWe are indebted to the MSL project’s engineering and management teams for their efforts in making the mission effective and enhancing science operations. We are also grateful to those MSL team members who participated in tactical and strategic operations, without whom the data presented here could not have been collected. J.A.H. acknowledges support from a subcontract from the NASA Jet Propulsion Laboratory, California Institute of Technology. J.P.G. acknowledges the support of the NASA Astrobiology Institute. A.G.F. was supported by the Project “icyMARS,” European Research Council Starting Grant no. 307496. J.F. acknowledges the support from the Villum Foundation. R.G. and M.E.S. acknowledge support from the Canadian Space Agency, which is responsible for funding the APXS instrument and its operations. Data presented in this paper are archived in the Planetary Data System at http://pds-geosciences.wustl.edu/missions/msl/index.htm. Three anonymous reviewers are acknowledged for their contributions.","id":77915,"rev_number":18,"userid":18,"eprint_dir":"disk0/00/07/79/15","datestamp":"2017-06-02 17:57:24","lastmod":"2017-06-02 17:58:22","status_changed":"2017-06-02 17:57:24","type":"article","metadata_visibility":"show","creators":[{"given":"J. A.","family":"Hurowitz","id":"Hurowitz-J-A","orcid":""},{"given":"J. P.","family":"Grotzinger","id":"Grotzinger-J-P","orcid":"0000-0001-9324-1257"},{"given":"W. W.","family":"Fischer","id":"Fischer-W-W","orcid":"0000-0002-8836-3054"},{"given":"S. M.","family":"McLennan","id":"McLennan-S-M","orcid":""},{"given":"R. E.","family":"Milliken","id":"Milliken-R-E","orcid":""},{"given":"N.","family":"Stein","id":"Stein-N-T","orcid":""},{"given":"A. R.","family":"Vasavada","id":"Vasavada-A-R","orcid":"0000-0003-2665-286X"},{"given":"D. F.","family":"Blake","id":"Blake-D-F","orcid":""},{"given":"E.","family":"Dehouck","id":"Dehouck-E","orcid":""},{"given":"J. L.","family":"Eigenbrode","id":"Eigenbrode-J-L","orcid":"0000-0003-3089-1986"},{"given":"A. G.","family":"Fairén","id":"Fairén-A-G","orcid":""},{"given":"J.","family":"Frydenvang","id":"Frydenvang-J","orcid":"0000-0001-9294-1227"},{"given":"R.","family":"Gellert","id":"Gellert-R","orcid":""},{"given":"J. A.","family":"Grant","id":"Grant-J-A","orcid":""},{"given":"S.","family":"Gupta","id":"Gupta-S","orcid":""},{"given":"K. E.","family":"Herkenhoff","id":"Herkenhoff-K-E","orcid":""},{"given":"D. W.","family":"Ming","id":"Ming-Douglas-W","orcid":""},{"given":"E. B.","family":"Rampe","id":"Rampe-E-B","orcid":""},{"given":"M. E.","family":"Schmidt","id":"Schmidt-M-E","orcid":""},{"given":"K. L.","family":"Siebach","id":"Siebach-K-L","orcid":"0000-0002-6628-6297"},{"given":"K.","family":"Stack-Morgan","id":"Stack-Morgan-K","orcid":""},{"given":"D. Y.","family":"Sumner","id":"Sumner-D-Y","orcid":""},{"given":"R. C.","family":"Wiens","id":"Wiens-R-C","orcid":"0000-0002-3409-7344"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-06-02","date_type":"published","publication":"Science","volume":"356","number":"6341","pagerange":"Art. No. eaah6849","id_number":"CaltechAUTHORS:20170602-101559108","refereed":true,"issn":"0036-8075","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170602-101559108","related_url":[{"url":"http://dx.doi.org/10.1126/science.aah6849","type":"doi","description":"Article"},{"url":"http://science.sciencemag.org/content/356/6341/eaah6849","type":"pub","description":"Article"},{"url":"http://www.sciencemag.org/content/356/6341/eaah6849/suppl/DC1","type":"pub","description":"Supplementary Materials"}],"referencetext":["↵ H. W. Nesbitt, G. M. Young, Early Proterozoic climates and plate motions inferred from major element chemistry of lutites. Nature 299, 715–717 (1982). doi:10.1038/299715a0Caltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵S. R. Taylor, S. M. McLennan, The Continental Crust: Its Composition and Evolution. A. Hallam, Ed. (Blackwell Scientific Publications, Oxford, 1985).\n↵ C. Klein, Some Precambrian banded iron-formations (BIFs) from around the world: Their age, geologic setting, mineralogy, metamorphism, geochemistry, and origin. Am. Mineral. 90, 1473–1499 (2005). doi:10.2138/am.2005.1871Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ C. Fedo, H. W. Nesbitt, G. Young, Unraveling the effects of potassium metasomatism in sedimentary rocks and paleosols, with implications for paleoweathering conditions and provenance. Geology 23, 921–924 (1995). doi:10.1130/0091-7613(1995)023\u003c0921:UTEOPM\u003e2.3.CO;2Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ W. W. Fischer, A. H. Knoll, An iron shuttle for deepwater silica in Late Archean and early Paleoproterozoic iron formation. Geol. Soc. Am. Bull. 121, 222–235 (2009).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ R. Anderson, J. I. Bell, Geologic mapping and characterization of Gale Crater and implications for its potential as a Mars Science Laboratory landing site. Mars 5, 76–128 (2010).\nJ. P. Grotzinger, J. Crisp, A. R. Vasavada, R. C. Anderson, C. J. Baker, R. Barry, D. F. Blake, P. Conrad, K. S. Edgett, B. Ferdowski, R. Gellert, J. B. Gilbert, M. Golombek, J. Gómez-Elvira, D. M. Hassler, L. Jandura, M. Litvak, P. Mahaffy, J. Maki, M. Meyer, M. C. Malin, I. Mitrofanov, J. J. Simmonds, D. Vaniman, R. V. Welch, R. C. Wiens, Mars Science Laboratory Mission and science investigation. Space Sci. Rev. 170, 5–56 (2012). doi:10.1007/s11214-012-9892-2Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\n↵ R. E. Milliken, J. P. Grotzinger, B. J. Thomson, Paleoclimate of Mars as captured by the stratigraphic record in Gale Crater. Geophys. Res. Lett. 37, L04201 (2010). doi:10.1029/2009GL041870Caltech ConnectCrossRefGoogle Scholar\n↵ B. J. Thomson, N. T. Bridges, R. Milliken, A. Baldridge, S. J. Hook, J. K. Crowley, G. M. Marion, C. R. de Souza Filho, A. J. Brown, C. M. Weitz, Constraints on the origin and evolution of the layered mound in Gale Crater, Mars using Mars Reconnaissance Orbiter data. Icarus 214, 413–432 (2011). doi:10.1016/j.icarus.2011.05.002Caltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵ J. P. Grotzinger, S. Gupta, M. C. Malin, D. M. Rubin, J. Schieber, K. Siebach, D. Y. Sumner, K. M. Stack, A. R. Vasavada, R. E. Arvidson, F. Calef 3rd, L. Edgar, W. F. Fischer, J. A. Grant, J. Griffes, L. C. Kah, M. P. Lamb, K. W. Lewis, N. Mangold, M. E. Minitti, M. Palucis, M. Rice, R. M. E. Williams, R. A. Yingst, D. Blake, D. Blaney, P. Conrad, J. Crisp, W. E. Dietrich, G. Dromart, K. S. Edgett, R. C. Ewing, R. Gellert, J. A. Hurowitz, G. Kocurek, P. Mahaffy, M. J. McBride, S. M. McLennan, M. Mischna, D. Ming, R. Milliken, H. Newsom, D. Oehler, T. J. Parker, D. Vaniman, R. C. Wiens, S. A. Wilson, Deposition, exhumation, and paleoclimate of an ancient lake deposit, Gale crater, Mars. Science 350, aac7575 (2015). doi:10.1126/science.aac7575pmid:26450214Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ J. P. Grotzinger, D. Y. Sumner, L. C. Kah, K. Stack, S. Gupta, L. Edgar, D. Rubin, K. Lewis, J. Schieber, N. Mangold, R. Milliken, P. G. Conrad, D. DesMarais, J. Farmer, K. Siebach, F. Calef 3rd, J. Hurowitz, S. M. McLennan, D. Ming, D. Vaniman, J. Crisp, A. Vasavada, K. S. Edgett, M. Malin, D. Blake, R. Gellert, P. Mahaffy, R. C. Wiens, S. Maurice, J. A. Grant, S. Wilson, R. C. Anderson, L. Beegle, R. Arvidson, B. Hallet, R. S. Sletten, M. Rice, J. Bell 3rd, J. Griffes, B. Ehlmann, R. B. Anderson, T. F. Bristow, W. E. Dietrich, G. Dromart, J. Eigenbrode, A. Fraeman, C. Hardgrove, K. Herkenhoff, L. Jandura, G. Kocurek, S. Lee, L. A. Leshin, R. Leveille, D. Limonadi, J. Maki, S. McCloskey, M. Meyer, M. Minitti, H. Newsom, D. Oehler, A. Okon, M. Palucis, T. Parker, S. Rowland, M. Schmidt, S. Squyres, A. Steele, E. Stolper, R. Summons, A. Treiman, R. Williams, A. Yingst, MSL Science Team, A habitable fluvio-lacustrine environment at Yellowknife Bay, Gale crater, Mars. Science 343, 1242777 (2014). doi:10.1126/science.1242777pmid:24324272Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ L. Le Deit, E. Hauber, F. Fueten, M. Pondrelli, A. P. Rossi, R. Jaumann, Sequence of infilling events in Gale Crater, Mars: Results from morphology, stratigraphy, and mineralogy. J. Geophys. Res. 118, 2439–2473 (2013). doi:10.1002/2012JE004322Caltech ConnectCrossRefGoogle Scholar\n↵ M. C. Palucis, W. E. Dietrich, A. G. Hayes, R. M. E. Williams, S. Gupta, N. Mangold, H. Newsom, C. Hardgrove, F. Calef III, D. Y. Sumner, The origin and evolution of the Peace Vallis fan system that drains to the Curiosity landing area, Gale Crater, Mars. J. Geophys. Res. 119, 705–728 (2014). doi:10.1002/2013JE004583Caltech ConnectCrossRefGoogle Scholar\n↵ J. A. Grant, S. A. Wilson, N. Mangold, F. Calef III, J. P. Grotzinger, The timing of alluvial activity in Gale crater, Mars. Geophys. Res. Lett. 41, 1142–1148 (2014). doi:10.1002/2013GL058909Caltech ConnectCrossRefGoogle Scholar\n↵ T. Szabó, G. Domokos, J. P. Grotzinger, D. J. Jerolmack, Reconstructing the transport history of pebbles on Mars. Nat. Commun. 6, 8366 (2015). doi:10.1038/ncomms9366pmid:26460507Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ R. M. E. Williams, J. P. Grotzinger, W. E. Dietrich, S. Gupta, D. Y. Sumner, R. C. Wiens, N. Mangold, M. C. Malin, K. S. Edgett, S. Maurice, O. Forni, O. Gasnault, A. Ollila, H. E. Newsom, G. Dromart, M. C. Palucis, R. A. Yingst, R. B. Anderson, K. E. Herkenhoff, S. Le Mouélic, W. Goetz, M. B. Madsen, A. Koefoed, J. K. Jensen, J. C. Bridges, S. P. Schwenzer, K. W. Lewis, K. M. Stack, D. Rubin, L. C. Kah, J. F. Bell III, J. D. Farmer, R. Sullivan, T. Van Beek, D. L. Blaney, O. Pariser, R. G. Deen, MSL Science Team, Martian fluvial conglomerates at Gale crater. Science 340, 1068–1072 (2013). doi:10.1126/science.1237317pmid:23723230Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ M. Nachon, S. M. Clegg, N. Mangold, S. Schröder, L. C. Kah, G. Dromart, A. Ollila, J. R. Johnson, D. Z. Oehler, J. C. Bridges, S. Le Mouélic, O. Forni, R. C. Wiens, R. B. Anderson, D. L. Blaney, J. F. Bell III, B. Clark, A. Cousin, M. D. Dyar, B. Ehlmann, C. Fabre, O. Gasnault, J. Grotzinger, J. Lasue, E. Lewin, R. Léveillé, S. McLennan, S. Maurice, P.-Y. Meslin, W. Rapin, M. Rice, S. W. Squyres, K. Stack, D. Y. Sumner, D. Vaniman, D. Wellington, Calcium sulfate veins characterized by ChemCam/Curiosity at Gale crater, Mars. J. Geophys. Res. 119, 1991–2016 (2014). doi:10.1002/2013JE004588Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\n↵ D. T. Vaniman, D. L. Bish, D. W. Ming, T. F. Bristow, R. V. Morris, D. F. Blake, S. J. Chipera, S. M. Morrison, A. H. Treiman, E. B. Rampe, M. Rice, C. N. Achilles, J. P. Grotzinger, S. M. McLennan, J. Williams, J. F. Bell III, H. E. Newsom, R. T. Downs, S. Maurice, P. Sarrazin, A. S. Yen, J. M. Morookian, J. D. Farmer, K. Stack, R. E. Milliken, B. L. Ehlmann, D. Y. Sumner, G. Berger, J. A. Crisp, J. A. Hurowitz, R. Anderson, D. J. Des Marais, E. M. Stolper, K. S. Edgett, S. Gupta, N. Spanovich, MSL Science Team, Mineralogy of a mudstone at Yellowknife Bay, Gale crater, Mars. Science 343, 1243480 (2014). doi:10.1126/science.1243480pmid:24324271Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ R. J. Léveillé, J. Bridges, R. C. Wiens, N. Mangold, A. Cousin, N. Lanza, O. Forni, A. Ollila, J. Grotzinger, S. Clegg, K. Siebach, G. Berger, B. Clark, C. Fabre, R. Anderson, O. Gasnault, D. Blaney, L. Deflores, L. Leshin, S. Maurice, H. Newsom, Chemistry of fracture-filling raised ridges in Yellowknife Bay, Gale Crater: Window into past aqueous activity and habitability on Mars. J. Geophys. Res. 119, 2398–2415 (2014). doi:10.1002/2014JE004620Caltech ConnectCrossRefGoogle Scholar\n↵ K. L. Siebach, J. P. Grotzinger, L. C. Kah, K. M. Stack, M. Malin, R. Léveillé, D. Y. Sumner, Subaqueous shrinkage cracks in the Sheepbed mudstone: Implications for early fluid diagenesis, Gale crater, Mars. J. Geophys. Res. 119, 1597–1613 (2014). doi:10.1002/2014JE004623Caltech ConnectCrossRefGoogle Scholar\n↵ K. M. Stack, J. P. Grotzinger, L. C. Kah, M. E. Schmidt, N. Mangold, K. S. Edgett, D. Y. Sumner, K. L. Siebach, M. Nachon, R. Lee, D. L. Blaney, L. P. Deflores, L. A. Edgar, A. G. Fairén, L. A. Leshin, S. Maurice, D. Z. Oehler, M. S. Rice, R. C. Wiens, Diagenetic origin of nodules in the Sheepbed member, Yellowknife Bay formation, Gale crater, Mars. J. Geophys. Res. 119, 1637–1664 (2014). doi:10.1002/2014JE004617Caltech ConnectCrossRefGoogle Scholar\n↵ D. Blake, D. Vaniman, C. Achilles, R. Anderson, D. Bish, T. Bristow, C. Chen, S. Chipera, J. Crisp, D. Des Marais, R. T. Downs, J. Farmer, S. Feldman, M. Fonda, M. Gailhanou, H. Ma, D. W. Ming, R. V. Morris, P. Sarrazin, E. Stolper, A. Treiman, A. Yen, Characterization and calibration of the CheMin mineralogical instrument on Mars Science Laboratory. Space Sci. Rev. 170, 341–399 (2012). doi:10.1007/s11214-012-9905-1Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\n↵ R. Gellert, R. Rieder, J. Brückner, B. C. Clark, G. Dreibus, G. Klingelhöfer, G. Lugmair, D. W. Ming, H. Wänke, A. Yen, J. Zipfel, S. W. Squyres, The Alpha Particle X-Ray Spectrometer (APXS): Results from Gusev Crater and calibration report. J. Geophys. Res. 111, E02S05 (2006). doi:10.1029/2005JE002555Caltech ConnectCrossRefGoogle Scholar\n↵H. Bahlburg, N. Dobrzinski, in Geological Record of Neoproterozoic Glaciations, E. Arnaud, G. P. Halverson, G. Shields-Zhou, Eds. (Geological Society of London, 2011), vol. 36, pp. 81–92.\n↵H. W. Nesbitt, in Geochemistry of Sediments and Sedimentary Rocks: Evolutionary Considerations to Mineral Deposit-Forming Environments, D. Lentz, Ed. (Geological Association of Canada, St. John’s, 2002), vol. GEOText 4, pp. 39–51.\n↵S. R. Taylor, S. M. McLennan, Planetary Crusts: Their Composition, Origin and Evolution (Cambridge Univ. Press, 2009).\n↵ S. M. McLennan, R. B. Anderson, J. F. Bell 3rd, J. C. Bridges, F. Calef 3rd, J. L. Campbell, B. C. Clark, S. Clegg, P. Conrad, A. Cousin, D. J. Des Marais, G. Dromart, M. D. Dyar, L. A. Edgar, B. L. Ehlmann, C. Fabre, O. Forni, O. Gasnault, R. Gellert, S. Gordon, J. A. Grant, J. P. Grotzinger, S. Gupta, K. E. Herkenhoff, J. A. Hurowitz, P. L. King, S. Le Mouélic, L. A. Leshin, R. Léveillé, K. W. Lewis, N. Mangold, S. Maurice, D. W. Ming, R. V. Morris, M. Nachon, H. E. Newsom, A. M. Ollila, G. M. Perrett, M. S. Rice, M. E. Schmidt, S. P. Schwenzer, K. Stack, E. M. Stolper, D. Y. Sumner, A. H. Treiman, S. VanBommel, D. T. Vaniman, A. Vasavada, R. C. Wiens, R. A. Yingst, MSL Science Team, Elemental geochemistry of sedimentary rocks at Yellowknife Bay, Gale crater, Mars. Science 343, 1244734 (2014). doi:10.1126/science.1244734;pmid:24324274Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ H. W. Nesbitt, G. M. Young, Prediction of some weathering trends of plutonic and volcanic rocks based on thermodynamic and kinetic considerations. Geochim. Cosmochim. Acta 48, 1523–1534 (1984). doi:10.1016/0016-7037(84)90408-3Caltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵ S. M. McLennan, Sedimentary silica on Mars. Geology 31, 315–318 (2003). doi:10.1130/0091-7613(2003)031\u003c0315:SSOM\u003e2.0.CO;2Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ H. W. Nesbitt, R. E. Wilson, Recent chemical weathering of basalts. Am. J. Sci. 292, 740–777 (1992). doi:10.2475/ajs.292.10.740Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ R. V. Morris, D. T. Vaniman, D. F. Blake, R. Gellert, S. J. Chipera, E. B. Rampe, D. W. Ming, S. M. Morrison, R. T. Downs, A. H. Treiman, A. S. Yen, J. P. Grotzinger, C. N. Achilles, T. F. Bristow, J. A. Crisp, D. J. Des Marais, J. D. Farmer, K. V. Fendrich, J. Frydenvang, T. G. Graff, J.-M. Morookian, E. M. Stolper, S. P. Schwenzer, Silicic volcanism on Mars evidenced by tridymite in high-SiO2 sedimentary rock at Gale crater. Proc. Natl. Acad. Sci. U.S.A. 113, 7071–7076 (2016). doi:10.1073/pnas.1607098113pmid:27298370Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ N. Mangold, L. M. Thompson, O. Forni, A. J. Williams, C. Fabre, L. Le Deit, R. C. Wiens, R. Williams, R. B. Anderson, D. L. Blaney, F. Calef, A. Cousin, S. M. Clegg, G. Dromart, W. E. Dietrich, K. S. Edgett, M. R. Fisk, O. Gasnault, R. Gellert, J. P. Grotzinger, L. Kah, S. Le Mouélic, S. M. McLennan, S. Maurice, P.-Y. Meslin, H. E. Newsom, M. C. Palucis, W. Rapin, V. Sautter, K. L. Siebach, K. Stack, D. Sumner, A. Yingst, Composition of conglomerates analyzed by the Curiosity rover: Implications for Gale Crater crust and sediment sources. J. Geophys. Res. 121, 353–387 (2016). doi:10.1002/2015JE004977Caltech ConnectCrossRefGoogle Scholar\nK. L. Siebach, M. B. Baker, J. P. Grotzinger, S. M. McLennan, R. Gellert, L. M. Thompson, J. A. Hurowitz, Sorting out compositional trends in sedimentary rocks of the Bradbury group (Aeolis Palus), Gale crater, Mars. J. Geophys. Res. 122, 295–328 (2017). doi:10.1002/2016JE005195Caltech ConnectCrossRefGoogle Scholar\nA. H. Treiman, D. L. Bish, D. T. Vaniman, S. J. Chipera, D. F. Blake, D. W. Ming, R. V. Morris, T. F. Bristow, S. M. Morrison, M. B. Baker, E. B. Rampe, R. T. Downs, J. Filiberto, A. F. Glazner, R. Gellert, L. M. Thompson, M. E. Schmidt, L. Le Deit, R. C. Wiens, A. C. McAdam, C. N. Achilles, K. S. Edgett, J. D. Farmer, K. V. Fendrich, J. P. Grotzinger, S. Gupta, J. M. Morookian, M. E. Newcombe, M. S. Rice, J. G. Spray, E. M. Stolper, D. Y. Sumner, A. R. Vasavada, A. S. Yen, Mineralogy, provenance, and diagenesis of a potassic basaltic sandstone on Mars: CheMin X-ray diffraction of the Windjana sample (Kimberley area, Gale Crater). J. Geophys. Res. Planets 121, 75–106 (2016). doi:10.1002/2015JE004932pmid:27134806Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ V. Sautter, M. J. Toplis, R. C. Wiens, A. Cousin, C. Fabre, O. Gasnault, S. Maurice, O. Forni, J. Lasue, A. Ollila, J. C. Bridges, N. Mangold, S. Le Mouélic, M. Fisk, P.-Y. Meslin, P. Beck, P. Pinet, L. Le Deit, W. Rapin, E. M. Stolper, H. Newsom, D. Dyar, N. Lanza, D. Vaniman, S. Clegg, J. J. Wray, In situ evidence for continental crust on early Mars. Nat. Geosci. 8, 605–609 (2015). doi:10.1038/ngeo2474Caltech ConnectCrossRefGeoRefGoogle Scholar\n↵ R. W. Le Maitre, The chemical variability of some common igneous rocks. J. Petrol. 17, 589–598 (1976). doi:10.1093/petrology/17.4.589Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ J. W. Tonkin, L. S. Balistrieri, J. W. Murray, Modeling sorption of divalent metal cations on hydrous manganese oxide using the diffuse double layer model. Appl. Geochem. 19, 29–53 (2004). doi:10.1016/S0883-2927(03)00115-XCaltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵ N. L. Lanza, R. C. Wiens, R. E. Arvidson, B. C. Clark, W. W. Fischer, R. Gellert, J. P. Grotzinger, J. A. Hurowitz, S. M. McLennan, R. V. Morris, M. S. Rice, J. F. Bell III, J. A. Berger, D. L. Blaney, N. T. Bridges, F. Calef III, J. L. Campbell, S. M. Clegg, A. Cousin, K. S. Edgett, C. Fabre, M. R. Fisk, O. Forni, J. Frydenvang, K. R. Hardy, C. Hardgrove, J. R. Johnson, J. Lasue, S. Le Mouélic, M. C. Malin, N. Mangold, J. Martìn-Torres, S. Maurice, M. J. McBride, D. W. Ming, H. E. Newsom, A. M. Ollila, V. Sautter, S. Schröder, L. M. Thompson, A. H. Treiman, S. VanBommel, D. T. Vaniman, M.-P. Zorzano, Oxidation of manganese in an ancient aquifer, Kimberley formation, Gale crater, Mars. Geophys. Res. Lett. 43, 7398–7407 (2016). doi:10.1002/2016GL069109Caltech ConnectCrossRefGoogle Scholar\n↵ J. A. Berger, M. E. Schmidt, R. Gellert, J. L. Campbell, P. L. King, R. L. Flemming, D. W. Ming, B. C. Clark, I. Pradler, S. J. V. VanBommel, M. E. Minitti, A. G. Fairén, N. I. Boyd, L. M. Thompson, G. M. Perrett, B. E. Elliott, E. Desouza, A global Mars dust composition refined by the Alpha-Particle X-ray Spectrometer in Gale Crater. Geophys. Res. Lett. 43, 67–75 (2016). doi:10.1002/2015GL066675Caltech ConnectCrossRefGoogle Scholar\n↵ S. J. VanBommel, R. Gellert, J. A. Berger, J. L. Campbell, L. M. Thompson, K. S. Edgett, M. J. McBride, M. E. Minitti, I. Pradler, N. I. Boyd, Deconvolution of distinct lithology chemistry through oversampling with the Mars Science Laboratory Alpha Particle X-Ray Spectrometer. XRay Spectrom. 45, 155–161 (2016). doi:10.1002/xrs.2681Caltech ConnectCrossRefGoogle Scholar\n↵ E. B. Rampe, et al., Mineralogy of an ancient lacustrine mudstone succession from the Murray formation, Gale crater, Mars. Earth Planet. Sci. Lett. 10.1016/j.epsl.2017.04.021 (2017).doi:10.1016/j.epsl.2017.04.021Caltech ConnectCrossRefGoogle Scholar\n↵ A. H. Treiman, R. V. Morris, D. G. Agresti, T. G. Graff, C. N. Achilles, E. B. Rampe, T. F. Bristow, D. W. Ming, D. F. Blake, D. T. Vaniman, D. L. Bish, S. J. Chipera, S. M. Morrison, R. T. Downs, Ferrian saponite from the Santa Monica Mountains (California, USA, Earth): Characterization as an analog for clay minerals on Mars with application to Yellowknife Bay in Gale Crater. Am. Mineral. 99, 2234–2250 (2014). doi:10.2138/am-2014-4763Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ E. Dehouck, S. M. McLennan, P. Y. Meslin, A. Cousin, Constraints on abundance, composition, and nature of X-ray amorphous components of soils and rocks at Gale crater, Mars. J. Geophys. Res. 119, 2640–2657 (2014). doi:10.1002/2014JE004716Caltech ConnectCrossRefGoogle Scholar\n↵ H. Blatt, Provenance studies and mudrocks. J. Sediment. Petrol. 55, 69–75 (1985).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ D. B. Shaw, C. E. Weaver, The mineralogical composition of shales. J. Sediment. Res. 35, 213–222 (1965).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ J. Veizer, S. Jansen, Basement and sedimentary recycling and continental evolution. J. Geol. 87, 341–370 (1979). doi:10.1086/628425Caltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵ T. F. Bristow, D. L. Bish, D. T. Vaniman, R. V. Morris, D. F. Blake, J. P. Grotzinger, E. B. Rampe, J. A. Crisp, C. N. Achilles, D. W. Ming, B. L. Ehlmann, P. L. King, J. C. Bridges, J. L. Eigenbrode, D. Y. Sumner, S. J. Chipera, J. M. Moorokian, A. H. Treiman, S. M. Morrison, R. T. Downs, J. D. Farmer, D. D. Marais, P. Sarrazin, M. M. Floyd, M. A. Mischna, A. C. McAdam, The origin and implications of clay minerals from Yellowknife Bay, Gale crater, Mars. Am. Mineral. 100, 824–836 (2015). doi:10.2138/am-2015-5077CCBYNCNDCaltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ G. Schikorr, On the reactions between iron, its hydroxides and water. Z. Elektrochem. 35, 65–70 (1929).Caltech ConnectGoogle Scholar\n↵ G. N. Schrauzer, T. D. Guth, Hydrogen evolving systems. 1. The formation of molecular hydrogen from aqueous suspensions of iron(II) hydroxide and reactions with reducible substrates, including molecular nitrogen. J. Am. Chem. Soc. 98, 3508–3513 (1976). doi:10.1021/ja00428a019Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\n↵ A. Stefánsson, S. Amórsson, A. E. Sveinbjörnsdóttir, Redox reactions and potentials in natural waters at disequilibrium. Chem. Geol. 221, 289–311 (2005). doi:10.1016/j.chemgeo.2005.06.003Caltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵ B. L. Ehlmann, J. Buz, Mineralogy and fluvial history of the watersheds of Gale, Knobel, and Sharp craters: A regional context for the Mars Science Laboratory Curiosity’s exploration. Geophys. Res. Lett. 42, 264–273 (2015). doi:10.1002/2014GL062553Caltech ConnectCrossRefGeoRefGoogle Scholar\n↵C. N. Alpers, J. L. Jambor, D. K. Nordstrom, Eds., Sulfate Minerals: Crystallography, Geochemistry, and Environmental Significance (Mineralogical Society of America and The Geochemical Society, Washington, DC, 2000), vol. 40, p. 606.\n↵ R. G. Burns, D. S. Fisher, Rates of oxidative weathering on the surface of Mars. J. Geophys. Res. 98, 3365–3372 (1993). doi:10.1029/92JE02055Caltech ConnectCrossRefGoogle Scholar\n↵ L. J. McHenry, V. Chevrier, C. Schroder, Jarosite in a Pleistocene East African saline-alkaline paleolacustrine deposit: Implications for Mars aqueous geochemistry. J. Geophys. Res. 116, E04002 (2011). doi:10.1029/2010JE003680Caltech ConnectCrossRefGoogle Scholar\n↵ D. T. Vaniman, S. J. Chipera, D. L. Bish, Pedogenesis of siliceous calcretes at Yucca Mountain, Nevada. Geoderma 63, 1–17 (1994). doi:10.1016/0016-7061(94)90106-6Caltech ConnectCrossRefGeoRefGoogle Scholar\n↵P. M. Dove, in Chemical Weathering Rates of Silicate Minerals, A. F. White, S. L. Brantley, Eds. (Mineralogical Society of America, Chantilly, VA, 1995), vol. 31, pp. 235–290.\n↵ W. Stumm, B. Sulzberger, The cycling iron in natural environments: Considerations based on laboratory studies of heterogeneous redox processes. Geochim. Cosmochim. Acta 56, 3233–3257 (1992). doi:10.1016/0016-7037(92)90301-XCaltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵ P. F. Hoffman, A. J. Kaufman, G. P. Halverson, D. P. Schrag, A neoproterozoic snowball earth. Science 281, 1342–1346 (1998). doi:10.1126/science.281.5381.1342pmid:9721097Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ G. P. Halverson, F. Poitrasson, P. F. Hoffman, A. Nédélec, J.-M. Montel, J. Kirby, Fe isotope and trace element geochemistry of the Neoproterozoic syn-glacial Rapitan iron formation. Earth Planet. Sci. Lett. 309, 100–112 (2011). doi:10.1016/j.epsl.2011.06.021Caltech ConnectCrossRefGeoRefGoogle Scholar\n↵N. J. Beukes, C. Klein, in The Proterozoic Biosphere: A Multidisciplinary Study, J. W. Schopf, C. Klein, Eds. (Cambridge Univ. Press, 1990), pp. 147–151.\n↵ G. M. Cox, G. P. Halverson, W. G. Minarik, D. P. Le Heron, F. A. Macdonald, E. J. Bellefroid, J. V. Strauss, Neoproterozoic iron formation: An evaluation of its temporal, environmental and tectonic significance. Chem. Geol. 362, 232–249 (2013). doi:10.1016/j.chemgeo.2013.08.002Caltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵ G. M. Marion, R. E. Farren, Mineral solubilities in the Na-K-Mg-Ca-Cl-SO4-H2O system: A re-evaluation of the sulfate chemistry in the Spencer-Moller-Weare model. Geochim. Cosmochim. Acta 63, 1305–1318 (1999). doi:10.1016/S0016-7037(99)00102-7Caltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵ A. M. Baldridge, S. J. Hook, J. K. Crowley, G. M. Marion, J. S. Kargel, J. L. Michalski, B. J. Thomson, C. R. de Souza Filho, N. T. Bridges, A. J. Brown, Contemporaneous deposition of phyllosilicates and sulfates: Using Australian acidic saline lake deposits to describe geochemical variability on Mars. Geophys. Res. Lett. 36, L19201 (2009). doi:10.1029/2009GL040069Caltech ConnectCrossRefGoogle Scholar\nK. C. Benison, B. B. Bowen, Acid saline lake systems give clues about past environments and the search for life on Mars. Icarus 183, 225–229 (2006). doi:10.1016/j.icarus.2006.02.018Caltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵ J. M. McArthur, J. V. Turner, W. B. Lyons, A. O. Osborn, M. F. Thirlwall, Hydrochemistry on the Yilgarn Block, western Australia: Ferrolysis and mineralization in acidic brines. Geochim. Cosmochim. Acta 55, 1273–1288 (1991). doi:10.1016/0016-7037(91)90306-PCaltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵K. M. Bohacs, A. R. Carroll, J. E. Neal, P. J. Mankiewicz, in Lake Basins Through Space and Time, E. H. Gierlowski, K. R. Kelts, Eds. (American Association of Petroleum Geologists, Tulsa, OK, 2000), vol. 46, pp. 3–34.\nR. V. Demicco, L. A. Hardie, Eds., Sedimentary Structures and Early Diagenetic Features of Shallow Marine Carbonate Deposits (Society for Sedimentary Geology, Tulsa, OK, 1994), vol. 1.\nJ. Grotzinger, J. Bell, K. Herkenhoff, J. Johnson, A. Knoll, E. McCartney, S. McLennan, J. Metz, J. Moore, S. Squyres, R. Sullivan, O. Ahronson, R. Arvidson, B. Joliff, M. Golombek, K. Lewis, T. Parker, J. Soderblom, Sedimentary textures formed by aqueous processes, Erebus crater, Meridiani Planum, Mars. Geology 34, 1085–1088 (2006). doi:10.1130/G22985A.1Caltech ConnectAbstract/FREE Full TextGoogle Scholar\nB. C. Schreiber, M. El Tabakh, Deposition and early alteration of evaporites. Sedimentology 47, 215–238 (2000). doi:10.1046/j.1365-3091.2000.00002.xCaltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵B. W. Logan, The Macleod Evaporite Basin, Western Australia: Holocene Environments, Sediments, and Geological Evolution, Memoir No. 44 (American Association of Petroleum Geologists, Tulsa, OK, 1987).\n↵ J. E. Adams, M. L. Rhodes, Dolomitization by seepage refluxion. Am. Assoc. Pet. Geol. Bull. 44, 1912–1920 (1960).Caltech ConnectAbstractGoogle Scholar\nA. B. Al-Helal, F. F. Whitaker, Y. T. Xiao, Reactive transport modeling of brine reflux: Dolomitization, anhydrite precipitation, and porosity evolution. J. Sediment. Res. 82, 196–215 (2012). doi:10.2110/jsr.2012.14Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ G. D. Jones, P. L. Smart, F. F. Whitaker, B. J. Rostron, H. G. Machel, Numerical modeling of reflux dolomitization in the Grosmont platform complex (Upper Devonian), Western Canada sedimentary basin. Am. Assoc. Pet. Geol. Bull. 87, 1273–1298 (2003).Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵P. E. Potter, J. B. Maynard, W. A. Pryor, Sedimentology of Shale: Study Guide and Reference Source (Springer, 1980).\n↵ W. Stumm, G. F. Lee, Oxygenation of ferrous iron. Ind. Eng. Chem. 53, 143–146 (1961). doi:10.1021/ie50614a030Caltech ConnectCrossRefGoogle Scholar\n↵ R. D. Wordsworth, L. Kerber, R. T. Pierrehumbert, F. Forget, J. W. Head, Comparison of “warm and wet” and “cold and icy” scenarios for early Mars in a 3-D climate model. J. Geophys. Res. 120, 1201–1219 (2015). doi:10.1002/2015JE004787Caltech ConnectCrossRefGoogle Scholar\n↵ M. H. Carr, J. W. Head III, Geologic history of Mars. Earth Planet. Sci. Lett. 294, 185–203 (2010). doi:10.1016/j.epsl.2009.06.042Caltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\n↵ J. Laskar, A. C. M. Correia, M. Gastineau, F. Joutel, B. Levrard, P. Robutel, Long term evolution and chaotic diffusion of the insolation quantities of Mars. Icarus 170, 343–364 (2004). doi:10.1016/j.icarus.2004.04.005Caltech ConnectCrossRefGoogle Scholar\n↵ J. P. Bibring, Y. Langevin, J. F. Mustard, F. Poulet, R. Arvidson, A. Gendrin, B. Gondet, N. Mangold, P. Pinet, F. Forget, M. Berthé, J.-P. Bibring, A. Gendrin, C. Gomez, B. Gondet, D. Jouglet, F. Poulet, A. Soufflot, M. Vincendon, M. Combes, P. Drossart, T. Encrenaz, T. Fouchet, R. Merchiorri, G. Belluci, F. Altieri, V. Formisano, F. Capaccioni, P. Cerroni, A. Coradini, S. Fonti, O. Korablev, V. Kottsov, N. Ignatiev, V. Moroz, D. Titov, L. Zasova, D. Loiseau, N. Mangold, P. Pinet, S. Douté, B. Schmitt, C. Sotin, E. Hauber, H. Hoffmann, R. Jaumann, U. Keller, R. Arvidson, J. F. Mustard, T. Duxbury, F. Forget, G. Neukum, Global mineralogical and aqueous mars history derived from OMEGA/Mars Express data. Science 312, 400–404 (2006). doi:10.1126/science.1122659pmid:16627738Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ C. Freissinet, D. P. Glavin, P. R. Mahaffy, K. E. Miller, J. L. Eigenbrode, R. E. Summons, A. E. Brunner, A. Buch, C. Szopa, P. D. Archer Jr., H. B. Franz, S. K. Atreya, W. B. Brinckerhoff, M. Cabane, P. Coll, P. G. Conrad, D. J. Des Marais, J. P. Dworkin, A. G. Fairén, P. François, J. P. Grotzinger, S. Kashyap, I. L. Ten Kate, L. A. Leshin, C. A. Malespin, M. G. Martin, F. J. Martin-Torres, A. C. McAdam, D. W. Ming, R. Navarro-González, A. A. Pavlov, B. D. Prats, S. W. Squyres, A. Steele, J. C. Stern, D. Y. Sumner, B. Sutter, M.-P. Zorzano, Organic molecules in the Sheepbed Mudstone, Gale Crater, Mars. J. Geophys. Res. Planets 120, 495–514 (2015). doi:10.1002/2014JE004737pmid:26690960Caltech ConnectCrossRefPubMedGoogle Scholar\n↵ K. E. Miller, J. L. Eigenbrode, C. Freissinet, D. P. Glavin, B. Kotrc, P. Francois, R. E. Summons, Potential precursor compounds for chlorohydrocarbons detected in Gale Crater, Mars, by the SAM instrument suite on the Curiosity Rover. J. Geophys. Res. 121, 296–308 (2016). doi:10.1002/2015JE004939Caltech ConnectCrossRefGoogle Scholar\n↵ J. C. Stern, B. Sutter, C. Freissinet, R. Navarro-González, C. P. McKay, P. D. Archer Jr., A. Buch, A. E. Brunner, P. Coll, J. L. Eigenbrode, A. G. Fairen, H. B. Franz, D. P. Glavin, S. Kashyap, A. C. McAdam, D. W. Ming, A. Steele, C. Szopa, J. J. Wray, F. J. Martín-Torres, M.-P. Zorzano, P. G. Conrad, P. R. Mahaffy, MSL Science Team, Evidence for indigenous nitrogen in sedimentary and aeolian deposits from the Curiosity rover investigations at Gale crater, Mars. Proc. Natl. Acad. Sci. U.S.A. 112, 4245–4250 (2015). doi:10.1073/pnas.1420932112pmid:25831544Caltech ConnectAbstract/FREE Full TextGoogle Scholar\n↵ R. Gellert, Mars Science Laboratory Alpha Particle X-Ray Spectrometer RDR data V1.0, MSL-M-APXS-4/5-RDR-V1.0 (NASA Planetary Data System, 2013).\n↵ J. L. Campbell, G. M. Perrett, R. Gellert, S. M. Andrushenko, N. I. Boyd, J. A. Maxwell, P. L. King, C. D. M. Schofield, Calibration of the Mars Science Laboratory Alpha Particle X-ray Spectrometer. Space Sci. Rev. 170, 319–340 (2012). doi:10.1007/s11214-012-9873-5Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\n↵ D. Vaniman, Mars Science Laboratory Chemistry and Mineralogy RDR data V1.0, MSL-M-CHEMIN-5-RDR-V1.0 (NASA Planetary Data System, 2012).\n↵ D. E. Smith, M. T. Zuber, H. V. Frey, J. B. Garvin, J. W. Head, D. O. Muhleman, G. H. Pettengill, R. J. Phillips, S. C. Solomon, H. J. Zwally, W. B. Banerdt, T. C. Duxbury, M. P. Golombek, F. G. Lemoine, G. A. Neumann, D. D. Rowlands, O. Aharonson, P. G. Ford, A. B. Ivanov, C. L. Johnson, P. J. McGovern, J. B. Abshire, R. S. Afzal, X. Sun, Mars Orbiter Laser Altimeter: Experiment summary after the first year of global mapping of Mars. J. Geophys. Res. 106, 23689–23722 (2001). doi:10.1029/2000JE001364Caltech ConnectCrossRefGoogle Scholar\n↵ S. M. Chemtob, B. L. Jolliff, G. R. Rossman, J. M. Eiler, R. E. Arvidson, Silica coatings in the Ka’u Desert, Hawaii, a Mars analog terrain: A micromorphological, spectral, chemical, and isotopic study. J. Geophys. Res. 115, E04001 (2010). doi:10.1029/2009JE003473Caltech ConnectCrossRefGoogle Scholar\nR. V. Morris, G. Klingelhöfer, C. Schröder, I. Fleischer, D. W. Ming, A. S. Yen, R. Gellert, R. E. Arvidson, D. S. Rodionov, L. S. Crumpler, B. C. Clark, B. A. Cohen, T. J. McCoy, D. W. Mittlefehldt, M. E. Schmidt, P. A. de Souza Jr., S. W. Squyres, Iron mineralogy and aqueous alteration from Husband Hill through Home Plate at Gusev Crater, Mars: Results from the Mossbauer instrument on the Spirit Mars Exploration Rover. J. Geophys. Res. 113, E12S42 (2008). doi:10.1029/2008JE003201Caltech ConnectCrossRefGoogle Scholar\nG. Pe-Piper, A. Karim, D. J. W. Piper, Authigenesis of titania minerals and the mobility of Ti: New evidence from pro-deltaic sandstones, Cretaceous Scotian basin, Canada. J. Sediment. Res. 81, 762–773 (2011). doi:10.2110/jsr.2011.63Caltech ConnectAbstract/FREE Full TextGoogle Scholar\nS. E. Ziemniak, E. P. Opalka, Titanium(IV) oxide phase-stability in alkaline sodium-phosphate solutions at elevated temperatures. Chem. Mater. 5, 690–694 (1993). doi:10.1021/cm00029a019Caltech ConnectCrossRefWeb of ScienceGoogle Scholar\nK. G. Knauss, M. J. Dibley, W. L. Bourcier, H. F. Shaw, Ti(IV) hydrolysis constants derived from rutile solubility measurements made from 100 to 300°C. Appl. Geochem. 16, 1115–1128 (2001). doi:10.1016/S0883-2927(00)00081-0Caltech ConnectCrossRefGeoRefWeb of ScienceGoogle Scholar\nJ. F. Rapp, S. Klemme, I. B. Butler, S. L. Harley, Extremely high solubility of rutile in chloride and fluoride-bearing metamorphic fluids: An experimental investigation. Geology 38, 323–326 (2010). doi:10.1130/G30753.1Caltech ConnectAbstract/FREE Full TextGoogle Scholar\nO. Forni, M. Gaft, M. J. Toplis, S. M. Clegg, S. Maurice, R. C. Wiens, N. Mangold, O. Gasnault, V. Sautter, S. Le Mouélic, P.-Y. Meslin, M. Nachon, R. E. McInroy, A. M. Ollila, A. Cousin, J. C. Bridges, N. L. Lanza, M. D. Dyar, First detection of fluorine on Mars: Implications for Gale Crater’s geochemistry. Geophys. Res. Lett. 42, 1020–1028 (2015). doi:10.1002/2014GL062742Caltech ConnectCrossRefGeoRefGoogle Scholar\nR. W. Ricker, F. A. Hummel, Reactions in the system TiO2-SiO2; Revision of the phase diagram. J. Am. Ceram. Soc. 34, 271–279 (1951). doi:10.1111/j.1151-2916.1951.tb09129.xCaltech ConnectCrossRefGoogle Scholar\nH. Schneider, A. Majdic, Titanium incorporation in tridymite. Neues Jahrb. Mineral. 418–426 (1985). doi:10.1111/j.1151-2916.1951.tb09129.x\nH. Schneider, Chemical-composition of tridymite and cristobalite from volcanic and meteoritic rocks. Neues Jahrb. Mineral. 433–444 (1986).doi:10.1111/j.1151-2916.1951.tb09129.x\nB. Mason, Lunar tridymite and cristobalite. Am. Mineral. 57, 1530–1535 (1972).Caltech ConnectGeoRefWeb of ScienceGoogle Scholar\nM. Sato, Tridymite crystals in opaline silica from Kusatsu, Gumma Prefecture. Mineral. J. 3, 296–305 (1962). doi:10.2465/minerj1953.3.296Caltech ConnectCrossRefGoogle Scholar\n↵ K. S. Edgett, R. A. Yingst, M. A. Ravine, M. A. Caplinger, J. N. Maki, F. T. Ghaemi, J. A. Schaffner, J. F. Bell, L. J. Edwards, K. E. Herkenhoff, E. Heydari, L. C. Kah, M. T. Lemmon, M. E. Minitti, T. S. Olson, T. J. Parker, S. K. Rowland, J. Schieber, R. J. Sullivan, D. Y. Sumner, P. C. Thomas, E. H. Jensen, J. J. Simmonds, A. J. Sengstacken, R. G. Willson, W. Goetz, Curiosity’s Mars Hand Lens Imager (MAHLI) Investigation. Space Sci. Rev. 170, 259–317 (2012). doi:10.1007/s11214-012-9910-4"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Redox stratification of an ancient lake in Gale crater, Mars\nBy J. A. Hurowitz, J. P. Grotzinger, W. W. Fischer, S. M. McLennan, R. E. Milliken, N. Stein, A. R. Vasavada, D. F. Blake, E. Dehouck, J. L. Eigenbrode, A. G. Fairén, J. Frydenvang, R. Gellert, J. A. Grant, S. Gupta, K. E. Herkenhoff, D. W. Ming, E. B. Rampe, M. E. Schmidt, K. L. Siebach, K. Stack-Morgan, D. Y. Sumner, R. C. Wiens\nScience  02 Jun 2017: Vol. 356, Issue 6341, eaah6849\nDOI: 10.1126/science.aah6849","other_numbering_system":null,"funders":[{"agency":"NASA/JPL/Caltech","grant_number":""},{"agency":"European Research Council (ERC)","grant_number":"307496"},{"agency":"Villum Foundation","grant_number":""},{"agency":"Canadian Space Agency (CSA)","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}