{"title":"Neural network representation of tensor network and chiral states","uri":"","abstract":"We study the representational power of a Boltzmann machine (a type of neural network) in quantum many-body systems. We prove that any (local) tensor network state has a (local) neural network representation. The construction is almost optimal in the sense that the number of parameters in the neural network representation is almost linear in the number of nonzero parameters in the tensor network representation. Despite the difficulty of representing (gapped) chiral topological states with local tensor networks, we construct a quasi-local neural network representation for a chiral p-wave superconductor. This demonstrates the power of Boltzmann machines.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253146","docid":253146,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1266555","fileid":1266555,"datasetid":"document","objectid":253146,"filename":"1701.06246.pdf","mime_type":"application/pdf","hash":"8996d268db0dbcbd91c1dfe296c2bcac","hash_type":"MD5","filesize":156320,"mtime":"2017-06-05 15:47:41","url":"http://authors.library.caltech.edu/77938/1/1701.06246.pdf"}],"eprintid":77938,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1701.06246.pdf","content":"submitted"}],"note":"The authors would like to thank Xie Chen for collaboration in the early stages of this project. Y.H. acknowledges funding provided by the Institute for Quantum Information and Matter, an NSF Physics Frontiers Center (NSF Grant PHY-1125565) with support of the Gordon and Betty Moore Foundation (GBMF-2644). J.E.M. is supported by NSF DMR-1507141 and a Simons Investigatorship.\n\nPart of this work was presented on November 27, 2014 (Thanksgiving day!) at the Perimeter Institute for Theoretical Physics. Very recently, we became aware of some related papers [7, 9, 11], which studied the relationship between neural and tensor network states using different approaches. In particular, Theorem 2 and Corollary 3 are stronger than Theorem 3 in Ref. [11].","id":77938,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/79/38","datestamp":"2017-06-05 21:33:13","lastmod":"2017-06-05 21:33:13","status_changed":"2017-06-05 21:33:13","type":"monograph","metadata_visibility":"show","creators":[{"given":"Yichen","family":"Huang","id":"Huang-Yichen","orcid":""},{"given":"Joel E.","family":"Moore","id":"Moore-J-E","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2017-01-23","date_type":"submitted","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170605-084735797","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170605-084735797","related_url":[{"url":"https://arxiv.org/abs/1701.06246","type":"arxiv","description":"Discussion Paper"}],"referencetext":["[1] D. H. Ackley, G. E. Hinton, and T. J. Sejnowski. A learning algorithm for Boltzmann machines.\nCognitive Science, 9(1):147 – 169, 1985.\n[2] M. H. Amin, E. Andriyash, J. Rolfe, B. Kulchytskyy, and R. Melko. Quantum Boltzmann\nmachine. arXiv:1601.02036, 2016.\n[3] I. Arad, A. Kitaev, Z. Landau, and U. Vazirani. An area law and sub-exponential algorithm\nfor 1d systems. arXiv:1301.1162, 2013.\n[4] B. B´eri and N. R. Cooper. Local tensor network for strongly correlated projective states.\nPhysical Review Letters, 106(15):156401, 2011.\n[5] A. Bernevig and T. Neupert. Topological superconductors and category theory.\narXiv:1506.05805, 2015.\n[6] G. Carleo and M. Troyer. Solving the quantum many-body problem with artificial neural\nnetworks. arXiv:1606.02318, 2016.\n[7] J. Chen, S. Cheng, H. Xie, L. Wang, and T. Xiang. On the equivalence of restricted Boltzmann\nmachines and tensor network states. arXiv:1701.04831, 2017.\n[8] D.-L. Deng, X. Li, and S. Das Sarma. Exact machine learning topological states.\narXiv:1609.09060, 2016.\n[9] D.-L. Deng, X. Li, and S. Das Sarma. Quantum entanglement in neural network states.\narXiv:1701.04844, 2017.\n[10] J. Dubail and N. Read. Tensor network trial states for chiral topological phases in two dimen-\nsions and a no-go theorem in any dimension. Physical Review B, 92(20):205307, 2015.\n[11] X. Gao and L.-M. Duan. Efficient representation of quantum many-body states with deep\nneural networks. arXiv:1701.05039, 2017.\n[12] S. Gharibian, Y. Huang, Z. Landau, and S. W. Shin. Quantum hamiltonian complexity.\nFoundations and Trends in Theoretical Computer Science, 10(3):159–282, 2015.\n[13] Z.-C. Gu, F. Verstraete, and X.-G. Wen. Grassmann tensor network states and its renormal-\nization for strongly correlated fermionic and bosonic states. arXiv:1004.2563, 2010.\n[14] M. B. Hastings. An area law for one-dimensional quantum systems. Journal of Statistical\nMechanics: Theory and Experiment, 2007(08):P08024.\n[15] M. B. Hastings. Locality in quantum systems. In J. Frohlich, M. Salmhofer, W. De Roeck,\nV. Mastropietro, and L. F. Cugliandolo, editors, Quantum Theory from Small to Large Scales,\nvolume 95 of Lecture Notes of the Les Houches Summer School, chapter 3, pages 171–212.\nOxford University Press, Oxford, UK, 2012.\n[16] Y. Huang. Classical simulation of quantum many-body systems. PhD thesis, University of\nCalifornia, Berkeley, 2015.\n[17] N. Le Roux and Y. Bengio. Representational power of restricted Boltzmann machines and\ndeep belief networks. Neural Computation, 20(6):1631–1649, 2008.\n[18] G.Montufar and N. Ay. Refinements of universal approximation results for deep belief networks\nand restricted boltzmann machines. Neural Computation, 23(5), 2011.\n[19] D. Perez-Garcia, F. Verstraete, M. M. Wolf, and J. I. Cirac. Matrix product state representa-\ntions. Quantum Information and Computation, 7(5-6):401–430, 2007.\n[20] N. Read and D. Green. Paired states of fermions in two dimensions with breaking of parity\nand time-reversal symmetries and the fractional quantum Hall effect. Physical Review B,\n61(15):10267–10297, 2000.\n[21] P. Smolensky. Information processing in dynamical systems: Foundations of harmony theory.\nIn D. E. Rumelhart, J. L. McClelland, and PDP Research Group, editors, Parallel Distributed\nProcessing: Explorations in the Microstructure of Cognition, Volume 1: Foundations, chap-\nter 6, pages 194–281. MIT Press, Cambridge, MA, USA, 1986.\n[22] L. N. Trefethen. Finite Difference and Spectral Methods for Ordinary\nand Partial Differential Equations. unpublished text, 1996, available at\nhttp://people.maths.ox.ac.uk/trefethen/pdetext.html.\n[23] F. Verstraete and J. I. Cirac. Matrix product states represent ground states faithfully. Physical\nReview B, 73(9):094423, 2006.\n[24] T. B. Wahl, H.-H. Tu, N. Schuch, and J. I. Cirac. Projected entangled-pair states can describe\nchiral topological states. Physical Review Letters, 111(23):236805, 2013."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Institute for Quantum Information and Matter (IQIM)","grant_number":""},{"agency":"NSF","grant_number":"PHY-1125565"},{"agency":"Gordon and Betty Moore Foundation","grant_number":"GBMF-2644"},{"agency":"NSF","grant_number":"DMR-1507141"},{"agency":"Simons Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"Joy Painter","local_group":["IQIM","Institute for Quantum Information and Matter"]}