{"title":"Eutectic dynamics and control of gold-encapped gallium arsenide nanowires imaged by 4D electron microscopy","uri":"","abstract":"A eutectic reaction is a special chemical/physical reaction involving multiple phases, solid or liquid, to form a joint lattice structure with a unique atomic ratio between the components. Visualization of phase reaction of composite nanomaterials with high spatial and temporal resolution provides a key understanding of alloy growth with important industrial applications. However, it has been a rather challenging task. Here we report the direct imaging and control of the phase reaction dynamics of a single, as-grown free-standing gallium arsenide nanowire encapped with a gold nanoparticle, free from environmental confinement or disturbance, using four-dimensional electron microscopy. A laser heating pulse initiates the eutectic reaction at a temperature much lower than the melting points of the composite materials, followed by a precisely time-delayed electron pulse to visualize the transient states of nucleation, growth and solidification of the complex. Combined with theoretical modeling, useful thermodynamic parameters of the newly formed alloy phases and their crystal structures could be determined. This technique of dynamical control and 4D imaging of phase reaction processes on the nanometer-ultrafast time scale open new venues for engineering various reactions in a wide variety of other systems.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253145","docid":253145,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1266547","fileid":1266547,"datasetid":"document","objectid":253145,"filename":"1701.05310.pdf","mime_type":"application/pdf","hash":"54520da1979a04677b7316166c5f4609","hash_type":"MD5","filesize":4645036,"mtime":"2017-06-05 15:40:15","url":"http://authors.library.caltech.edu/77937/1/1701.05310.pdf"}],"eprintid":77937,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1701.05310.pdf","content":"submitted"}],"note":"We acknowledge the financial support from the Air Force Office of Scientific Research (Grant No. FA9550-11-1-0055S) in the Gordon and Betty Moore Foundation for Physical Biology Center for Ultrafast Science and Technology at California Institute of Technology. The Australian authors thank the Australian Research Council for the financial support and the Australian National Fabrication Facility for\naccess to the epitaxial facilities used in this work.\n\nAuthor contributions:\nB.C. and A.H.Z. conceived the experiment, B.C. and X.W.F. designed and conducted the experiment, J.T. performed theoretical modeling and data analysis, M.L., H.H.T. and C.J. grew the samples, all authors analyzed the data and wrote the paper.","id":77937,"rev_number":9,"userid":18,"eprint_dir":"disk0/00/07/79/37","datestamp":"2017-06-05 21:31:34","lastmod":"2017-06-05 21:31:34","status_changed":"2017-06-05 21:31:34","type":"monograph","metadata_visibility":"show","creators":[{"given":"Bin","family":"Chen","id":"Chen-Bin","orcid":""},{"given":"Xuewen","family":"Fu","id":"Fu-Xuewen","orcid":""},{"given":"Jau","family":"Tang","id":"Tang-Jau","orcid":""},{"given":"Mykhaylo","family":"Lysevych","id":"Lysevych-M","orcid":""},{"given":"Hark Hoe","family":"Tan","id":"Tan-Hark-Hoe","orcid":""},{"given":"Chennupati","family":"Jagadish","id":"Jagadish-C","orcid":""},{"given":"Ahmed H.","family":"Zewail","id":"Zewail-A-H","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2017-01-19","date_type":"submitted","publication":"","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170605-084009912","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170605-084009912","related_url":[{"url":"https://arxiv.org/abs/1701.05310","type":"arxiv","description":"Discussion Paper"}],"referencetext":["1. Nadella, R., Eskin, D. G., Du, Q. \u0026 Katgerman, L. Macrosegration in direct-chill casting of aluminium\nalloys. Prog. Mater. Sci 53, 421-480 (2008).\n2. Woodall, J. M. III-V compounds and alloys: An update. Science 208, 908-915 (1980).\n3. del Alamo, J. A. Nanometre-scale electronics with III-V compound semiconductors. Nature 479, 317-\n323 (2011).\n4. Wolffenbuttel, R. F. \u0026 Wise, K. D. Low-temperature silicon wafer-to-wafer bonding using gold at\neutectic temperature. Sens. Actuators A 43, 223-229 (1994).\n5. Kim, B. J., Tersoff, J., Kodambaka, S., Reuter, M. C., Stach, E. A. \u0026 Ross, F. M. Kinetics of individual\nnucleation events observed in nanoscale vapor-liquid-solid growth. Science 322, 1070-1073 (2008).\n6. Schülli, T. U., Daudin, R., Renaud, G., Vaysset, A., Geaymond, O. \u0026 Pasturel, A. Substrate-enhanced\nsupercooling in AuSi eutectic droplets. Nature 464, 1174-1177 (2010).\n7. Shpyrko, O. G., Streitel, R., Balagurusamy, V. S. K., Grigoriev, A. Y., Deutsch, M., Ocko, B. M.,\nMeron, M., Lin, B. \u0026 Pershan, P. S. Surface crystallization in a liquid AuSi alloy. Science 313, 77-80\n(2006).\n8. LLorca, J. \u0026 Orera, V. M. Directionally solidified eutectic ceramic oxides. Prog. Mater. Sci. 51, 711-\n809 (2006).\n9. Rosa, C. D., Park, C., Thomas, E. L. \u0026 Lotz, B. Microdomain patterns from directional eutectic\nsolidification and epitaxy. Nature 405, 433-437 (2000).\n10. Kodambaka, S., Tersoff, J., Reuter, M. C. \u0026 Ross, F. M. Germanium nanowires growth below the\neutectic temperature. Science 316, 729-732 (2007).\n11. Holmberg, V. C., Panthani, M. G. \u0026 Korgel, B. A. Phase transitions, melting dynamics, and solidstate\ndiffusion in a nano test tube. Science 326, 405-407 (2009).\n12. Shahani, A. J., Xiao, X. H. \u0026 Voorhees, P. W. The mechanism of eutectic growth in highly anisotropic\nmaterials. Nat. Commun. 7, 12953 (2016).\n13. Barwick, B., Flannigan, D. J. \u0026 Zewail, A. H. Photo-induced near-field electron microscopy. Nature\n462, 902-906 (2009).\n14. Zewail, A. H. Four-dimensional electron microscopy. Science 328, 187-193 (2010).\n15. van der Veen, M. R., Kwon, O. H., Tissot, A., Hauser, A. \u0026 Zewail, A. H. Single-nanoparticle phase\ntransitions visualized by four-dimensional electron microscopy. Nat. Chem. 5, 395-402 (2013).\n16. Baskin, J. S., Liu, H. H. \u0026 Zewail, A. H. 4D multiple-cathode ultrafast electron microscopy. Proc.\nNatl. Acad. Sci. USA 111, 10479-10484 (2014).\n17. Lorenz, U. J. \u0026 Zewail, A. H. Observing liquid flow in nanotubes by 4D electron microscopy. Science\n344, 1496-1500 (2014).\n18. Lobastov, V. A., Srinivasan, R. \u0026 Zewail, A. H. Four-dimensional ultrafast electron microscopy. Proc.\nNatl. Acad. Sci. USA 102, 7069-7073 (2005).\n19. Barwick, B., Park, H. S., Kwon, O. H., Baskin, J. S. \u0026 Zewail, A. H. 4D imaging of transient structures\nand morphologies in ultrafast electron microscopy. Science 322, 1227-1231 (2008).\n20. Park, S. T., Flannigan, D. J. \u0026 Zewail, A. H. Irreversible chemical reactions visualized in space and\ntime with 4D electron microscopy. J. Am. Chem. Soc. 133, 1730-1733 (2011).\n21. Chen, B., Wang, J., Gao, Q., Chen, Y. J., Liao, X. Z., Lu, C. S., Tan, H. H., Mai, Y. W., Zou, J.,\nRinger, S. P., Gao, H. \u0026 Jagadish, C. Strengthening brittle semiconductor nanowires through stacking\nfaults: Insights from in situ mechanical testing. Nano Lett. 13, 4369-4373 (2013).\n22. Joyce, H. J., Gao, Q., Tan, H. H., Jagadish, C., Kim, Y., Zou, J., Smith, L. M., Jackson, H. E., Yarrison-\nRice, J. M., Parkinson, P. \u0026 Johnston, M. B. III-V semiconductor nanowires for optoelectronic device\napplications. Prog. Quant. Electron. 35, 23-75 (2011).\n23. Wang, J., Liu, Y. J., Liu, L. B., Zhou, H. Y. \u0026 Jin, Z. P. Thermodynamic assessment of the Au-Ga\nbinary system. CALPHAD 35, 242-248 (2011).\n24. Blakemore, J. S. Semiconducting and other major properties of gallium arsenide. J. Appl. Phys. 53,\nR123-181 (1982).\n25. Kuanr, A. V., Bansal, S. K. \u0026 Srivastava, G. P. Laser induced damage in GaAs at 1.06 μm wavelength:\nsurface effects. Opt. Laser Technol. 28, 25-34 (1996).\n26. Patuwathavithane, C. S., Williams, J. R., Tin, C. C., Barnes, P. A. \u0026 Bozack, M. J. An RBS analysis\nof the low temperature mass transport of Au in GaAs. Nucl. Instrum. Methods Phys. Res. B56/57, 753-\n756 (1991).\n27. Fisher, D. J. Diffusion in GaAs and Other III-V Semiconductors: 10 Years of Research (Trans Tech\nPublications, Switzerland, 1998).\n28. Gupta, R. P., Khokle, W. S., Wuerfl, J. \u0026 Hartnagel, H. L. Diffusion of gallium in thin gold films on\nGaAs. Thin Solid Films 151, L121-L125 (1987).\n29. Persson, A. I., Larsson, M. W., Stenström, S., Ohlsson, B. J., Samuelson, L. \u0026 Wallenberg, L. R.\nSolid-phase diffusion mechanism for GaAs nanowire growth. Nat. Mater. 3, 677-681 (2004).\n30. Jin, R., Cao, Y. W., Mirkin, C. A., Kelly, K. L., Schatz, G. C. \u0026 Zheng, J. G. Photoinduced conversion\nof siliver nanospheres to nanoprisms. Science 294, 1901-1903 (2001).\n31. Jain, P. K., Huang, X., EI-Sayed, I. H. \u0026 EL-Sayed, M. A. Noble metals on the nanoscale: optical and\nphotothermal properties and some applications in imaging, sensing, biology, and medicine. Acc.\nChem. Res. 41, 1578-1586 (2008).\n32. Byers, C. P., Zhang, H., Swearer, D. F., Yorulmaz, M., Hoener, B. S., Huang, D., Hoggard, A., Chang,\nW. S., Mulvaney, P., Ringe, E., Halas, N. J., Nordlander, P., Link, S. \u0026 Landes, C. F. From tunable\ncore-shell nanoparticles to plasmonic drawbridges: Active control of nanoparticle optical properties.\nSci. Adv. 1, e1500988 (2015).\n33. Joyce, H. J., Gao, Q., Tan, H. H., Jagadish, C., Kim, Y., Zhang, X., Guo, Y. \u0026 Zou, J. Twin-free\nuniform epitaxial GaAs nanowires grown by a two-temperature process. Nano Lett. 7, 921-926 (2007).\n34. Joyce, H. J., Wong-Leung, J., Gao, Q., Tan, H. H. \u0026 Jagadish, C. Phase perfection in zinc blende and\nwurtzite III-V nanowires using basic growth parameters. Nano Lett. 10, 908-915 (2010)."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Air Force Office of Scientific Research (AFOSR)","grant_number":"FA9550-11-1-0055S"},{"agency":"Australian Research Council ","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"Joy Painter","local_group":null}