{"title":"Selective impairment of goal-directed decision-making following lesions to the human ventromedial prefrontal cortex","uri":"","abstract":"Neuroimaging studies suggest that the human ventromedial prefrontal cortex is a key region for goal-directed behaviour. However, it remains unclear whether the ventromedial prefrontal cortex is necessary for such behaviour. Here we used a canonical test from the animal literature designed to distinguish goal-directed from habit-based choice: namely, outcome devaluation. Patients with focal damage to the ventromedial prefrontal cortex showed deficits in goal-directed choice by persistently selecting actions for a food outcome that had been devalued through selective satiation. By contrast, the same patients had entirely intact acquisition of instrumental contingencies, demonstrating preserved habitual control, and also gave normal ratings of the hedonic value of the devalued food. These findings for the first time demonstrate a necessary and selective role for the human ventromedial prefrontal cortex in goal-directed choice, reconciling prior neuroimaging results in humans with lesion studies in animals, and providing a mechanistic explanation of the real-life deficits in decision-making that have been documented in patients with damage to this structure.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253157","docid":253157,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1266616","fileid":1266616,"datasetid":"document","objectid":253157,"filename":"awx105.pdf","mime_type":"application/pdf","hash":"9a41b6b5e407200e70bf3045a525fc2d","hash_type":"MD5","filesize":1459480,"mtime":"2017-06-05 16:56:13","url":"http://authors.library.caltech.edu/77945/1/awx105.pdf"}],"eprintid":77945,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"awx105.pdf","content":"published"}],"note":"© The Author (2017). Published by Oxford University Press on behalf of the Guarantors of Brain. \n\nReceived: 16 December 2016; Revision Received: 27 February 2017; Accepted: 15 March 2017; Published: 24 May 2017. \n\nWe would like to thank Nash Witkin, Raul Samrah, Victoria Spring, Chris Kovach, and Anthony Gómez for their contributions to this project. \n\nFunding: Supported in part by a McDonnell Foundation Collaborative Action Award [#220020387], the Kiwanis Foundation, a NIH Predoctoral Training Award [T32 GM108540], and a Conte Center from NIMH (1 P50 MH094258-04A1).","id":77945,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/79/45","datestamp":"2017-06-06 19:08:27","lastmod":"2017-06-06 19:08:27","status_changed":"2017-06-06 19:08:27","type":"article","metadata_visibility":"show","creators":[{"given":"Justin","family":"Reber","id":"Reber-J","orcid":""},{"given":"Justin S.","family":"Feinstein","id":"Feinstein-J-S","orcid":""},{"given":"John P.","family":"O’Doherty","id":"O’Doherty-J-P","orcid":""},{"given":"Mimi","family":"Liljeholm","id":"Liljeholm-M","orcid":""},{"given":"Ralph","family":"Adolphs","id":"Adolphs-R","orcid":"0000-0002-8053-9692"},{"given":"Daniel","family":"Tranel","id":"Tranel-D","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Keywords: vmPFC, devaluation, reward, instrumental, decision-making","date":"2017-06","date_type":"published","publication":"Brain","volume":"140","number":"6","pagerange":"1743-1756","id_number":"CaltechAUTHORS:20170605-095608207","refereed":true,"issn":"0006-8950","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170605-095608207","related_url":[{"url":"https://doi.org/10.1093/brain/awx105","type":"doi","description":"Article"},{"url":"https://academic.oup.com/brain/article-lookup/doi/10.1093/brain/awx105","type":"pub","description":"Article"}],"referencetext":["\n\n\nAdams CD, Dickinson A. Instrumental responding following reinforcer devaluation. Q J Exp Psychol  1981; 33: 109–21.\nGoogle ScholarCrossRef\n\n open URL link  \n\n\n\nBalleine BW, Dickinson A. Goal-directed instrumental action: contingency and incentive learning and their cortical substrates. Neuropharmacology  1998; 37: 407–19.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nBalleine BW, Ostlund SB. Still at the choice‐point: action selection and initiation in instrumental conditioning. Ann N Y Acad Sci  2007; 1104: 147–71.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nBaxter MG, Parker A, Lindner CC, Izquierdo AD, Murray EA. Control of response selection by reinforcer value requires interaction of amygdala and orbital prefrontal cortex. J Neurosci  2000; 20: 4311–19.\nGoogle ScholarPubMed \n\n\n\n\nBechara A, Tranel D, Damasio H. Characterization of the decision-making deficit of patients with ventromedial prefrontal cortex lesions. Brain  2000; 123: 2189–202.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nBechara A, Damasio AR, Damasio H, Anderson SW. Insensitivity to future consequences following damage to human prefrontal cortex. Cognition  1994; 50: 7–15.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nClithero JA, Rangel A. Informatic parcellation of the network involved in the computation of subjective value. Soc Cogn Affect Neurosci  2013; 9: 1289–302.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nCorbit LH, Balleine BW. The role of prelimbic cortex in instrumental conditioning. Behav Brain Res  2003; 146: 145–57.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nCritchley HD, Rolls ET. Hunger and satiety modify the responses of olfactory and visual neurons in the primate orbitofrontal cortex. J Neurophysiol  1996; 75: 1673–86.\nGoogle ScholarPubMed \n\n\n\n\nDaw ND, Niv Y, Dayan P. Uncertainty-based competition between prefrontal and dorsolateral striatal systems for behavioral control. Nat Neurosci  2005; 8: 1704–11.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nde Wit S, Corlett PR, Aitken MR, Dickinson A, Fletcher PC. Differential engagement of the ventromedial prefrontal cortex by goal-directed and habitual behavior toward food pictures in humans. J Neurosci  2009; 29: 11330–8.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nde Wit S, Dickinson A. Associative theories of goal-directed behaviour: a case for animal–human translational models. Psychol Res  2009; 73: 463–76.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nDickinson A. Actions and habits: the development of a behavioural autonomy. Philos Trans R Soc Lond B Biol Sci  1985; 308: 67–78.\nGoogle ScholarCrossRef\n\n open URL link  \n\n\n\nDickinson A, Nicholas D, Adams CD. The effect of the instrumental training contingency on susceptibility to reinforcer devaluation. Q J Exp Psychol  1983; 35: 35–51.\nGoogle ScholarCrossRef\n\n open URL link  \n\n\n\nDoya K, Samejima K, Katagiri K, Kawato M. Multiple model-based reinforcement learning. Neural Comput  2002; 14: 1347–69.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nFellows LK, Farah MJ. Different underlying impairments in decision-making following ventromedial and dorsolateral frontal lobe damage in humans. Cereb Cortex  2005; 15: 58–63.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nFrank R, Damasio H, Grabowski TJ. Brainvox: an interactive, multimodal visualization and analysis system for neuroanatomical imaging. Neuroimage  1997; 5: 13–30.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nGarner DM, Olmsted MP, Bohr Y, Garfinkel PE. The eating attitudes test: psychometric features and clinical correlates. Psychol Med  1982; 12: 871–8.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nGottfried JA, O’Doherty JA, Dolan RJ. Encoding predictive reward value in human amygdala and orbitofrontal cortex. Science  2003; 301: 1104–7.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nHampton AN, Bossaerts P, O’Doherty JP. The role of the ventromedial prefrontal cortex in abstract state-based inference during decision making in humans. J Neurosci  2006; 26: 8360–7.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nHornak J, O’Doherty J, Bramham J, Rolls ET, Morris RG, Bullock PRet al. Reward-related reversal learning after surgical excisions in orbito-frontal or dorsolateral prefrontal cortex in humans. J Cogn Neurosci  2004; 16: 463–78.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nJang AI, Costa VD, Rudebeck PH, Chudasama Y, Murray EA, Averbeck BB. The role of frontal cortical and medial-temporal lobe brain areas in learning a bayesian prior belief on reversals. J Neurosci  2015; 35: 11751–60.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nKable JW, Glimcher PW. The neurobiology of decision: consensus and controversy. Neuron  2009; 63: 733–45.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nKahneman D. Thinking, fast and slow . New York: Macmillan; 2011.\n\n\n\n\nKeifer E, Tranel D. A neuropsychological investigation of the Delis-Kaplan executive function system. J Clin Exp Neuropsychol  2013; 35: 1048–59.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nKringelbach ML, O’Doherty J, Rolls ET, Andrews C. Activation of the human orbitofrontal cortex to a liquid food stimulus is correlated with its subjective pleasantness. Cereb Cortex  2003; 13: 1064–71.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nKringelbach ML, Rolls ET. The functional neuroanatomy of the human orbitofrontal cortex: evidence from neuroimaging and neuropsychology. Prog Neurobiol  2004; 72: 341–72.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nLuria AR. Higher cortical functions in man . Oxford: Basic Books; 1966.\n\n\n\n\nMcNamee D, Liljeholm M, Zika O, O’Doherty JP. Characterizing the associative content of brain structures involved in habitual and goal-directed actions in humans: a multivariate FMRI study. J Neurosci  2015; 35: 3764–71.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nMiller EK, Cohen JD. An integrative theory of prefrontal cortex function. Annu Rev Neurosci  2001; 24: 167–202.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nMilner B. Effects of different brain lesions on card sorting: the role of the frontal lobes. Arch Neurol  1963; 9: 90–100.\nGoogle ScholarCrossRef\n\n open URL link  \n\n\n\nNorman DA, Shallice T. Attention to action: willed and automatic control of behavior. In: Davidson RJ, Schwartz GE, Shapiro D, editors. Consciousness and self-regulation . New York: Springer US; 1986: 1–18.\n\n\n\n\nO’Doherty J, Rolls ET, Francis S, Bowtell R, McGlone F, Kobal Get al. Sensory-specific satiety-related olfactory activation of the human orbitofrontal cortex. Neuroreport  2000; 11: 893–7.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nOwen AM. Cognitive planning in humans: neuropsychological, neuroanatomical and neuropharmacological perspectives. Prog Neurobiol  1997; 53: 431–50.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nPlassmann H, O’Doherty J, Rangel A. Orbitofrontal cortex encodes willingness to pay in everyday economic transactions. J Neurosci  2007; 27: 9984–8.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nRangel A, Camerer C, Montague PR. A framework for studying the neurobiology of value-based decision making. Nat Rev Neurosci  2008; 9: 545–56.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nRhodes SE, Murray EA. Differential effects of amygdala, orbital prefrontal cortex, and prelimbic cortex lesions on goal-directed behavior in rhesus macaques. J Neurosci  2013; 33: 3380–9.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nRolls ET, Hornak J, Wade D, McGrath J. Emotion-related learning in patients with social and emotional changes associated with frontal lobe damage. J Neurol Neurosurg Psychiatry  1994; 57: 1518–24.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nRolls ET, Kringelbach ML, De Araujo IE. Different representations of pleasant and unpleasant odours in the human brain. Eur J Neurosci  2003; 18: 695–703.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nRudebeck P, Murray EA. Dissociable effects of subtotal lesions within the macaque orbital prefrontal cortex on reward-guided behavior. J Neurosci  2011; 31: 10569–78.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nRudebeck PH, Saunders RC, Prescott AT, Chau LS, Murray EA. Prefrontal mechanisms of behavioral flexibility, emotion regulation and value updating. Nat Neurosci  2013; 16: 1140–5.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nRushworth MF, Noonan MP, Boorman ED, Walton ME, Behrens TE. Frontal cortex and reward-guided learning and decision-making. Neuron  2011; 70: 1054–69.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nSchneider W, Shiffrin RM. Controlled and automatic human information processing: I. Detection, search, and attention. Psychol Rev  1977; 84: 1–66.\n\n\n\n\nSmall DM, Zatorre RJ, Dagher A, Evans AC, Jones-Gotman M. Changes in brain activity related to eating chocolate: from pleasure to aversion. Brain  2001; 124 ( Pt 9): 1720–33.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nValentin VV, Dickinson A, O’Doherty JP. Determining the neural substrates of goal-directed learning in the human brain. J Neurosci  2007; 27: 4019–26.\nGoogle ScholarCrossRef\n\n open URL link PubMed \n\n\n\nWallis JD, Anderson KC, Miller EK. Single neurons in prefrontal cortex encode abstract rules. Nature  2001; 411: 953–6."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Justin Reber, Justin S. Feinstein, John P. O’Doherty, Mimi Liljeholm, Ralph Adolphs, Daniel Tranel; Selective impairment of goal-directed decision-making following lesions to the human ventromedial prefrontal cortex. Brain 2017; 140 (6): 1743-1756. doi: 10.1093/brain/awx105","other_numbering_system":null,"funders":[{"agency":"James S. McDonnell Foundation","grant_number":"220020387"},{"agency":"Kiwanis Foundation","grant_number":""},{"agency":"NIH Predoctoral Fellowship","grant_number":"T32 GM108540"},{"agency":"NIH","grant_number":"1 P50 MH094258-04A1"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}