{"title":"On the Quasi-unconditional Stability of BDF-ADI Solvers for the Compressible Navier-Stokes Equations and Related Linear Problems","uri":"","abstract":"The companion paper “Higher-order in time quasi-unconditionally stable ADI solvers for the compressible Navier-Stokes equations in 2D and 3D curvilinear domains,” which is referred to as Part I in what follows, introduces ADI (alternating direction implicit) solvers of higher orders of temporal accuracy (orders s = 2 to 6) for the compressible Navier-Stokes equations in two- and three-dimensional space. The proposed methodology employs the backward differentiation formulae (BDF) together with a quasilinear-like formulation, high-order extrapolation for nonlinear components, and the Douglas-Gunn splitting. A variety of numerical results presented in Part I demonstrate in practice the theoretical convergence rates enjoyed by these algorithms, as well as their excellent accuracy and stability properties for a wide range of Reynolds numbers. In particular, the proposed schemes enjoy a certain property of “quasi-unconditional stability”: for small enough (problem-dependent) fixed values of the timestep Δt, these algorithms are stable for arbitrarily fine spatial discretizations. The present contribution presents a mathematical basis for the observed performance of these algorithms. Short of providing stability theorems for the full Navier-Stokes BDF-ADI solvers, this paper puts forth a number of stability proofs for BDF-ADI schemes as well as some related unsplit BDF schemes for a variety of related linear model problems in one, two, and three spatial dimensions. These include proofs of quasi-unconditional stability for unsplit BDF schemes of orders 2 ≤ s ≤ 6, and even a proof of a form of unconditional stability for two-dimensional BDF-ADI schemes of order 2 for both convection and diffusion problems. Additionally, a set of numerical tests presented in this paper for the compressible Navier-Stokes equation indicate that quasi-unconditional stability carries over to the fully nonlinear context.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253158","docid":253158,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1266622","fileid":1266622,"datasetid":"document","objectid":253158,"filename":"15m1042279.pdf","mime_type":"application/pdf","hash":"0c2d769a03b9bc5f3a2dda0dac850d2c","hash_type":"MD5","filesize":1207976,"mtime":"2017-06-05 17:01:56","url":"http://authors.library.caltech.edu/77946/1/15m1042279.pdf"}],"eprintid":77946,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"15m1042279.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/253159","docid":253159,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1266624","fileid":1266624,"datasetid":"document","objectid":253159,"filename":"1509.09213.pdf","mime_type":"application/pdf","hash":"3f514d820a2747f572085733eac7f8e8","hash_type":"MD5","filesize":1003180,"mtime":"2017-06-05 17:02:03","url":"http://authors.library.caltech.edu/77946/2/1509.09213.pdf"}],"eprintid":77946,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1509.09213.pdf","content":"submitted"}],"note":"© 2017 Society for Industrial and Applied Mathematics.\n\nReceived by the editors October 2, 2015; accepted for publication (in revised form) December 21, 2016; published electronically April 18, 2017. \n\nThe work of the first author was supported by AFOSR, NSF and an NSSEFF Vannevar Bush Fellowship under contracts FA9550-15-1-0043, DMS-1411876 and N00014-16-1-2808.","id":77946,"rev_number":10,"userid":18,"eprint_dir":"disk0/00/07/79/46","datestamp":"2017-06-06 18:35:00","lastmod":"2017-06-06 18:35:00","status_changed":"2017-06-06 18:35:00","type":"article","metadata_visibility":"show","creators":[{"given":"Oscar P.","family":"Bruno","id":"Bruno-O-P","orcid":"0000-0001-8369-3014"},{"given":"Max","family":"Cubillos","id":"Cubillos-M","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Navier-Stokes, quasi-unconditional stability, high-order, ADI, BDF, unconditional stability","date":"2017-04-18","date_type":"published","publication":"SIAM Journal on Numerical Analysis","volume":"55","number":"2","pagerange":"892-922","id_number":"CaltechAUTHORS:20170605-100151973","refereed":true,"issn":"0036-1429","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170605-100151973","related_url":[{"url":"http://dx.doi.org/10.1137/15M1042279","type":"doi","description":"Article"},{"url":"http://epubs.siam.org/doi/10.1137/15M1042279","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1509.09213","type":"arxiv","description":"Discussion Paper"}],"referencetext":["•1. R. M. Beam and R. Warming, An implicit factored scheme for the compressible Navier-Stokes equations, AIAA J., 16 (1978), pp. 393--402. [CrossRef]  OpenURL California Institute of Technology\n•2. R. M. Beam and R. Warming, Alternating direction implicit methods for parabolic equations with a mixed derivative, SIAM J. Sci. Stat. Comput., 1 (1980), pp. 131--159. [Abstract]  [ISI]  OpenURL California Institute of Technology\n•3. H. Bijl, M. H. Carpenter, V. N. Vatsa, and C. A. Kennedy, Implicit time integration schemes for the unsteady compressible Navier\\textendashStokes equations: Laminar flow, J. Comput. Phys., 179 (2002), pp. 313--329, https://doi.org/10.1006/jcph.2002.7059. [CrossRef]  [ISI]  OpenURL California Institute of Technology\n•4. O. P. Bruno and M. Cubillos, Higher-order in time “quasi-unconditionally stable” ADI solvers for the compressible Navier\\textendashStokes equations in 2D and 3D curvilinear domains, J. Comput. Phys., 307 (2016), pp. 476--495, http://www.sciencedirect.com/science/article/pii/S0021999115008281. \n•5. G. G. Dahlquist, A special stability problem for linear multistep methods, BIT Numer. Math., 3 (1963), pp. 27--43, https://doi.org/10.1007/BF01963532. [CrossRef]  OpenURL California Institute of Technology\n•6. J. Douglas Jr. and J. E. Gunn, A general formulation of alternating direction methods, Numerische Mathematik, 6 (1964), pp. 428--453, https://doi.org/10.1007/BF01386093. [CrossRef]  OpenURL California Institute of Technology\n•7. D. Forti and L. Dedè, Semi-implicit BDF time discretization of the Navier-Stokes equations with VMS\\textendashLES modeling in a high performance computing framework, Comput. Fluids, 117 (2015), pp. 168--182, https://doi.org/10.1016/j.compfluid.2015.05.011. [CrossRef]  [ISI]  OpenURL California Institute of Technology\n•8. D. Gottlieb and J. S. Hesthaven, Spectral methods for hyperbolic problems, J. Comput. Appl. Math., 128 (2001), pp. 83--131. [CrossRef]  [ISI]  OpenURL California Institute of Technology\n•9. J. S. Hesthaven, S. Gottlieb, and D. Gottlieb, Spectral Methods for Time-Dependent Problems, Cambridge Monographs on Applied and Computational Mathematics 21, Cambridge University Press, Cambridge, 2007. \n•10. S. Karaa, A hybrid Padé ADI scheme of higher-order for convection\\textendashdiffusion problems, Int. J. Numer. Methods in Fluids, 64 (2010), pp. 532--548, http://onlinelibrary.wiley.com/doi/10.1002/fld.2160/abstract. [CrossRef]  [ISI]  OpenURL California Institute of Technology\n•11. D. A. Kopriva, Implementing spectral methods for partial differential equations: Algorithms for scientists and engineers, Springer, New York, 2009. \n•12. J. D. Lambert, Numerical methods for ordinary differential systems: The initial value problem, John Wiley \u0026 Sons, New York, 1991, http://dl.acm.org/citation.cfm?id=129839. \n•13. R. LeVeque, Finite Difference Methods for Ordinary and Partial Differential Equations, Society for Industrial and Applied Mathematics, Philadelphia, 2007, http://epubs.siam.org/doi/book/10.1137/1.9780898717839. \n•14. D. W. Peaceman and H. H. Rachford, Jr., The numerical solution of parabolic and elliptic differential equations, J. Soc. Ind. Appl. Math., 3 (1955), pp. 28--41, http://www.jstor.org/stable/2098834. [Abstract]  [ISI]  OpenURL California Institute of Technology\n•15. R. D. Richtmyer and K. W. Morton, Difference Methods for Initial-Value Problems, Interscience, New York, 1967. \n•16. R. F. Warming and R. M. Beam, An extension of A-stability to alternating direction implicit methods, BIT Numer. Math., 19 (1979), pp. 395--417, https://doi.org/10.1007/BF01930993."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Air Force Office of Scientific Research (AFOSR)","grant_number":"FA9550-15-1-0043"},{"agency":"NSF","grant_number":"DMS-1411876"},{"agency":"National Security Science and Engineering Faculty Fellowship","grant_number":"N00014-16-1-2808"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}