{"title":"Sea Urchin DNA Sequence Variation and Reduced Interspecies Differences of the Less Variable DNA Sequences","uri":"","abstract":"Individual sea urchins of the species Stronglyocentrotus purpuratus differ from each other in about 4% of the nucleotide pairs of their single copy DNA sequences (Britten et al., 1978). In the past we have referred to single copy DNA sequence polymorphism (Britten et al., 1978), but for purposes of clarity we use here the term sequence variation which is defined as the percent difference in sequence between individual genomes averaged for a population and averaged over all of the single copy DNA.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253241","docid":253241,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1267013","fileid":1267013,"datasetid":"document","objectid":253241,"filename":"2407881.pdf","mime_type":"application/pdf","hash":"437dbec30d42c5adeacb755f8815300d","hash_type":"MD5","filesize":1760554,"mtime":"2017-06-06 14:12:56","url":"http://authors.library.caltech.edu/77958/1/2407881.pdf"}],"eprintid":77958,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"2407881.pdf","content":"published"}],"note":"© 1982 The Society for the Study of Evolution. \n\nManuscript Revised: 2 Nov 1981. Manuscript Received: 6 Jul 1981. \n\nCorresponding Editor: R. D. Milkman. \n\nThe authors thank Dr. Michael J. Smith of Simon Fraser University, University of British Columbia, Canada, for providing S. droebachiensis DNA and Dr. V. A. Bry- kov of the Far East Science Center, Academy of Sciences of the USSR, Vladivostok, USSR, for providing S. intermedius DNA. Dr. A. Pudovkin of the Institute of Marine Biology, Academy of Sciences of the USSR, Vladivostok, USSR, kindly furnished the S. intermedius protein polymorphism data before publication. We are also grateful to Yara Lewin for assistance in preparing the manuscript. This research was supported by NIH Grant (GM-20927). J.W.G. was supported by an ACS Postdoctoral Fellowship (PF-1494) and a N.I.H. Postdoctoral Fellowship (GM06865-01). T.J.H. was supported by N.I.H. Postdoctoral Fellowships (GM06575; GM07401).","id":77958,"rev_number":10,"userid":772,"eprint_dir":"disk0/00/07/79/58","datestamp":"2017-06-06 18:24:21","lastmod":"2017-06-06 18:24:21","status_changed":"2017-06-06 18:24:21","type":"article","metadata_visibility":"show","creators":[{"given":"J. W.","family":"Grula","id":"Grula-J-W","orcid":""},{"given":"T. J.","family":"Hall","id":"Hall-T-J","orcid":""},{"given":"J. A.","family":"Hunt","id":"Hunt-J-A","orcid":""},{"given":"T. D.","family":"Giugni","id":"Giugni-T-D","orcid":""},{"given":"G. J.","family":"Graham","id":"Graham-G-J","orcid":""},{"given":"E. H.","family":"Davidson","id":"Davidson-E-H","orcid":""},{"given":"R. J.","family":"Britten","id":"Britten-R-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"1982-07","date_type":"published","publication":"Evolution","volume":"36","number":"4","pagerange":"665-676","id_number":"CaltechAUTHORS:20170606-071232789","refereed":true,"issn":"0014-3820 ","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170606-071232789","related_url":[{"url":"http://dx.doi.org/10.1111/j.1558-5646.1982.tb05434.x","type":"doi","description":"Article"},{"url":"http://onlinelibrary.wiley.com/doi/10.1111/j.1558-5646.1982.tb05434.x/abstract","type":"pub","description":"Article"},{"url":"http://www.jstor.org/stable/2407881","type":"jstor","description":"Article"}],"referencetext":["ANDO, T. 1966. A nuclease specific for heat-dena- tured DNA isolated from a product of Aspergillus oryzae. Biochim. Biophys. Acta 114:158. BRITTEN, R. J. 1982. Genomic alterations in evolu- tion, p. 41-46. In J. T. Bonner (ed.), Evolution and Development. Spring-Verlag, Berlin. BRITTEN, R. J., A. CETTA, AND E. H. DAVIDSON. 1978. The single copy DNA sequence polymor- phism of the sea urchin Strongylocentrotus pur- puratus. Cell 15:1175-1186. BRITTEN, R. J., D. E. GRAHAM, AND B. R. NEU- FELD. 1974. Analysis of repeating DNA se- quences by reassociation, p. 363-406. In L. Grossman and K. Moldave (eds.), Methods of Enzymology, 29E. Academic Press, N.Y. COYNE, J. A., A. A. FELTON, AND R. C. LEWON- TIN. 1978. Extent of genetic variation at a highly polymorphic esterase locus in Drosophila pseu- doobscura. Proc. Nat. Acad. Sci. USA 75:5090- 5093. EFSTRATIADIS, A., J. W. POSAKONY, T. MANIATIS, R. M. LAWN, C. O'CONNELL, R. A. SPRITZ, J. K. DE RIEL, B. G. FORGET, S. M. WEISSMAN, J. L. SLIGHTOM, A. E. BLECHL, 0. SMITHIES, F. E. BARALLE, C. C. SHOULDERS, AND N. J. PROUDFOOT. 1980. The structure and evolution of the human ,8-globin gene family. Cell 21:653- 668. HALL, T. J., J. W. GRULA, E. H. DAVIDSON, AND R. J. BRITTEN. 1980. Evolution of sea urchin non-repetitive DNA. J. Molec. Evol. 16:95-110. HUTTON, J. R., AND J. G. WETMUR. 1973. Effect of chemical modification on the rate of renatur- ation of deoxyribonucleic acid. Deaminated and glyoxalated deoxyribonucleic acid. Biochemistry 12:558-563. MANIATIS, T., A. JEFFREY, AND D. G. KLEID. 1975. Nucleotide sequence of the rightward op- erator of phage. Proc. Nat. Acad. Sci. USA 72:1184-1188. MURRAY, M. G., AND W. F. THOMPSON. 1977. Sin- gle-strand DNA fragment length determination by alkaline agarose electrophoresis: applications for DNA renaturation studies. Carnegie Inst. Wash. Year Book 76:259-262. PERLER, F., A. EFSTRATIADIS, P. LoMEDICO, W. GILBERT, R. KOLODNER, AND J. DODGSON. 1980. The evolution of genes: the chicken preproinsulin gene. Cell 20:550-566. SELANDER, R. K. 1976. Genic variation in natural populations, p. 21-46. In F. J. Ayala (ed.), Mo- lecular Evolution. Sinauer Associates, Inc., Sun- derland. VOGT, V. M. 1973. Purification and further prop- erties of single-strand-specific nuclease from As- pergillus oryzae. Eur. J. Biochem. 33:192-200."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Grula, J. W., Hall, T. J., Hunt, J. A., Giugni, T. D., Graham, G. J., Davidson, E. H. and Britten, R. J. (1982), SEA URCHIN DNA SEQUENCE VARIATION AND REDUCED INTERSPECIES DIFFERENCES OF THE LESS VARIABLE DNA SEQUENCES. Evolution, 36: 665–676. doi: 10.1111/j.1558-5646.1982.tb05434.x","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":"GM-20927"},{"agency":"American Cancer Society","grant_number":"PF-1494"},{"agency":"NIH Postdoctoral Fellowship","grant_number":"GM06865-01"},{"agency":"NIH Postdoctoral Fellowship","grant_number":"GM06575"},{"agency":"NIH Postdoctoral Fellowship","grant_number":"GM07401"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}