{"title":"Considerations in multidimensional filter bank design","uri":"","abstract":"Onedimensional (1D) and multidimensional (MD) analysis/synthesis  filter  banks have attracted much attention recently.  While 1D filer banks have been well studied and various design approaches have been  successfully developed, many problems in the MD case remain unsolved. In this paper, we exploit a number of issues in MD filter bank design, including: the choice of permissible passband supports, the cyclic property of decimation matrices that is required for filter bank design using transformations, etc. We also propose a  class of useful tree-structure filter banks, which apply to the commonly-used hexagonal decimation.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253291","docid":253291,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1267477","fileid":1267477,"datasetid":"document","objectid":253291,"filename":"00393803.pdf","mime_type":"application/pdf","hash":"902e4f4d8e7bf53356905d22c92d888c","hash_type":"MD5","filesize":385921,"mtime":"2017-06-06 22:46:10","url":"http://authors.library.caltech.edu/77978/1/00393803.pdf"}],"eprintid":77978,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"00393803.pdf","content":"published"}],"note":"© 1993 IEEE. \n\nWork supported in parts by the NSF grant MIP 8919196, and by matching  funds from Tektronix, Inc., and Rockwell International.","id":77978,"rev_number":8,"userid":207,"eprint_dir":"disk0/00/07/79/78","datestamp":"2017-06-07 16:32:06","lastmod":"2017-06-07 16:32:06","status_changed":"2017-06-07 16:32:06","type":"book_section","metadata_visibility":"show","creators":[{"given":"Tsuhan","family":"Chen","id":"Chen-Tsuhan","orcid":""},{"given":"P. P.","family":"Vaidyanathan","id":"Vaidyanathan-P-P","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"1993-05","date_type":"published","publication":"","volume":"1","number":"","pagerange":"643-646","id_number":"CaltechAUTHORS:20170606-153356272","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170606-153356272","related_url":[{"url":"https://doi.org/10.1109/ISCAS.1993.393803","type":"doi","description":"Article"},{"url":"http://ieeexplore.ieee.org/document/393803/","type":"pub","description":"Article"}],"referencetext":[" 1. M. J. T. Smith T. P. Barnwell \"A new filter-bank theory for time-frequency representation\" \u003cem\u003eIEEE Trans. on ASSP\u003c/em\u003e pp. 314-327 March 1987.\n\n2. M. Vetterli \"A theory of multirate filter banks\" \u003cem\u003eIEEE Trans. on ASSP\u003c/em\u003e pp. 356-372 March 1987.\n\n3. P. P. Vaidyanathan \"Theory and design of M-channel maximally decimated quadrature mirror filters with arbitrary M having the perfect-reconstruction property\" \u003cem\u003eIEEE Trans. on ASSP\u003c/em\u003e pp. 476-492 April 1987.\n\n4. R. Ansari C.-L. Lau \"Two-dimensional IIR filters for exact reconstruction in tree structured sub-band decomposition\" \u003cem\u003eElectronics Letters\u003c/em\u003e vol. 23 no. 12 pp. 633-634 June 1987.\n\n5. E. Viscito J. P. Allebach \"Design of perfect reconstruction multi-dimensional filter banks using cascaded Smith form matrices\" \u003cem\u003eIEEE ISCAS\u003c/em\u003e pp. 831-834 1988-June.\n\n6. G. Karlsson M. Vetterli \"Theory of two-dimensional multirate filter banks\" \u003cem\u003eIEEE Trans. on ASSP\u003c/em\u003e pp. 925-937 June 1990.\n\n7. E. Viscito J. P. Allebach \"The analysis and design of multidimensional FIR perfect reconstruction filter banks for arbitrary sampling lattices\" \u003cem\u003eIEEE Trans. on CAS\u003c/em\u003e vol. 38 no. 1 pp. 29-41 January 1991.\n\n8. P. P. Vaidyanathan \"New results in multidimensional multirate systems\" \u003cem\u003eΡroc. IEEE Int. Symp. on Circuits and Systems\u003c/em\u003e pp. 468-471 1991-June.\n\n9. J. Kovačević M. Vetterli \"Nonseparable multidimensional perfect reconstruction filter banks and wavelet bases for R\u003csuperscript\u003en\u003c/superscript\u003e\" \u003cem\u003eIEEE Trans. on Information Theory\u003c/em\u003e vol. 38 no. 2 pp. 533-555 March 1992.\n\n10. I. A. Shah A. A. C. Kalker \"Generalized theory of multidimensional M-band filter bank design\" \u003cem\u003eProc. of the sixth EUSIPCO\u003c/em\u003e pp. 969-972 1992-August.\n\n11. T. Chen P. P. Vaidyanathan \"Multidimensional multirate filters and filter banks derived from one dimensional filters\" \u003cem\u003eIEEE Trans. on SP\u003c/em\u003e May 1993.\n\n12. P. P. Vaidyanathan Multirate Systems and Filter Banks NJ Englewood Cliffs:Prentice-Hall 1993.\n\n13. K. Swaminathan P. P. Vaidyanathan \"Theory and design of uniform DFT parallel quadrature mirror filter banks\" \u003cem\u003eIEEE Trans. on Circuits and Systems\u003c/em\u003e vol. 33 pp. 1170-1191 December 1986.\n\n14. M. Renfors T. Sararnäki \"Recursive Nth-band digital filters—Part I: design and properties\" \u003cem\u003eIEEE Trans. on CAS\u003c/em\u003e vol. 34 no. 1 pp. 24-39 January 1987.\n\n15. S. K. Mitra C. D. Creusere H. Babic \"A novel implementation of perfect reconstruction QMF banks using IIR filters for infinite length signals\" \u003cem\u003eIEEE ISCAS\u003c/em\u003e pp. 2312-2315 1992-May.\n\n16. H. J. S. Smith \"On systems of linear indeterminate equations and congruences\" \u003cem\u003ePhilos. Trans. Royal Society London\u003c/em\u003e vol. 151 pp. 293-326 1861.\n\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"T. Chen and P. P. Vaidyanathan, \"Considerations in multidimensional filter bank design,\" 1993 IEEE International Symposium on Circuits and Systems, Chicago, IL, 1993, pp. 643-646 vol.1.\ndoi: 10.1109/ISCAS.1993.393803","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"MIP-8919196"},{"agency":"Tektronix","grant_number":""},{"agency":"Rockwell International","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}