{"title":"The Origin of [C II] 157 μm Emission in a Five-component Interstellar Medium: The Case of NGC 3184 and NGC 628","uri":"","abstract":"With its relatively low ionization potential, C+ can be found throughout the interstellar medium (ISM) and provides one of the main cooling channels of the ISM via the [C II] 157 μm emission. While the strength of the [C II] line correlates with the star formation rate, the contributions of the various gas phases to the [C II] emission on galactic scales are not well established. In this study we establish an empirical multi-component model of the ISM, including dense H II regions, dense photon dissociation regions (PDRs), the warm ionized medium (WIM), low density and G_0 surfaces of molecular clouds (SfMCs), and the cold neutral medium (CNM). We test our model on ten luminous regions within the two nearby galaxies NGC 3184 and NGC 628 on angular scales of 500–600 pc. Both galaxies are part of the Herschel key program KINGFISH, and are complemented by a large set of ancillary ground- and space-based data. The five modeled phases together reproduce the observed [C II] emission quite well, overpredicting the total flux slightly (about 45%) averaged over all regions. We find that dense PDRs are the dominating component, contributing 68% of the [C II] flux on average, followed by the WIM and the SfMCs, with mean contributions of about half of the contribution from dense PDRs, each. CNM and dense H II regions are only minor contributors with less than 5% each. These estimates are averaged over the selected regions, but the relative contributions of the various phases to the [C II] flux vary significantly between these regions.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253284","docid":253284,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1267397","fileid":1267397,"datasetid":"document","objectid":253284,"filename":"Abdullah_2017_ApJ_842_4.pdf","mime_type":"application/pdf","hash":"2ee9aa5a16fbfd9ce7670ed4cd76634c","hash_type":"MD5","filesize":2026092,"mtime":"2017-06-06 21:10:10","url":"http://authors.library.caltech.edu/77972/1/Abdullah_2017_ApJ_842_4.pdf"}],"eprintid":77972,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"Abdullah_2017_ApJ_842_4.pdf","content":"published"}],"note":"© 2017 The American Astronomical Society. Original content from this work may be used under the terms of the Creative Commons Attribution 3.0 licence. Any further distribution of this work must maintain attribution to the author(s) and the title of the work, journal citation and DOI. \n\nReceived 2016 July 8; revised 2017 April 3; accepted 2017 April 24; published 2017 June 6. \n\nWe thank Fabian Rosales-Ortega, who provided unpublished PINGS data on NGC 3184 and helpful explanations on the reduction steps performed on NGC 3184. B.G. gratefully acknowledges the support of the Australian Research Council as the recipient of a Future Fellowship (FT140101202). PACS has been developed by a consortium of institutes led by MPE (Germany) and including UVIE (Austria); KU Leuven, CSL, IMEC (Belgium); CEA, LAM (France); MPIA (Germany); INAF-IFSI/OAA/OAP/OAT, LENS, SISSA (Italy); IAC (Spain). This development has been supported by the funding agencies BMVIT (Austria), ESA-PRODEX (Belgium), CEA/CNES (France), DLR (Germany), ASI/INAF (Italy), and CICYT/MCYT (Spain).","id":77972,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/79/72","datestamp":"2017-06-06 22:12:46","lastmod":"2017-06-06 22:12:46","status_changed":"2017-06-06 22:12:46","type":"article","metadata_visibility":"show","creators":[{"given":"A.","family":"Abdullah","id":"Abdullah-A","orcid":""},{"given":"B. R.","family":"Brandl","id":"Brandl-B-R","orcid":""},{"given":"B.","family":"Groves","id":"Groves-B","orcid":""},{"given":"M.","family":"Wolfire","id":"Wolfire-M-G","orcid":""},{"given":"D.","family":"Calzetti","id":"Calzetti-D","orcid":""},{"given":"K. ","family":"Croxall","id":"Croxall-K-V","orcid":""},{"given":"I.","family":"De Looze","id":"De-Looze-I","orcid":""},{"given":"R. C.","family":"Kennicutt","id":"Kennicutt-R-C","orcid":""},{"given":"K. M.","family":"Sandstrom","id":"Sandstrom-K-M","orcid":""},{"given":"L.","family":"Armus","id":"Armus-L","orcid":""},{"given":"D. A.","family":"Dale","id":"Dale-D-A","orcid":""},{"given":"M.","family":"Galametz","id":"Galametz-M","orcid":""},{"given":"R.","family":"Herrera-Camus","id":"Herrera-Camus-R","orcid":""},{"given":"L. K.","family":"Hunt","id":"Hunt-L-K","orcid":""},{"given":"J. D.","family":"Smith","id":"Smith-J-D","orcid":""},{"given":"A. G. G. M.","family":"Tielens","id":"Tielens-A-G-G-M","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"galaxies: ISM","date":"2017-06-10","date_type":"published","publication":"Astrophysical Journal","volume":"842","number":"1","pagerange":"Art. No. 4","id_number":"CaltechAUTHORS:20170606-141003857","refereed":true,"issn":"1538-4357","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170606-141003857","related_url":[{"url":"https://doi.org/10.3847/1538-4357/aa6fa9","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-4357/aa6fa9/meta","type":"pub","description":"Article"}],"referencetext":["Abel N. P., Ferland G. J., Shaw G. and van Hoof P. A. M. 2005 ApJS 161 65\nIOPscienceADS  \n\n\nAniano G., Draine B. T., Calzetti D. et al 2012 ApJ 756 138\nIOPscienceADS  \n\n\nAniano G., Draine B. T., Gordon K. D. and Sandstrom K. 2011 PASP 123 1218\nIOPscienceADS  \n\n\nAppleton P. N., Guillard P., Boulanger F. et al 2013 ApJ 777 66\nIOPscienceADS  \n\n\nBattisti A. J. and Heyer M. H. 2014 ApJ 780 173\nIOPscienceADS  \n\n\nBeirão P., Armus L., Helou G. et al 2012 ApJ 751 144\nIOPscienceADS  \n\n\nBennett C. L., Fixsen D. J., Hinshaw G. et al 1994 ApJ 434 587\nCrossrefADS  \n\n\nBerg D. A., Skillman E. D., Croxall K. V. et al 2015 ApJ 806 16\nIOPscienceADS  \n\n\nBock J. J., Hristov V. V., Kawada M. et al 1993 ApJL 410 L115\nCrossrefADS  \n\n\nBoselli A., Gavazzi G., Lequeux J. and Pierini D. 2002 A\u0026A 385 454\nCrossrefADS  \n\n\nBraine J., Combes F., Casoli F. et al 1993 A\u0026AS 97 887\nADS  \n\n\nBrauher J. R., Dale D. A. and Helou G. 2008 ApJS 178 280\nIOPscienceADS  \n\n\nBurton M. G., Hollenbach D. J. and Tielens A. G. G. 1992 ApJ 399 563\nCrossrefADS  \n\n\nCarral P., Hollenbach D. J., Lord S. D. et al 1994 ApJ 423 223\nCrossrefADS  \n\n\nChevance M., Madden S. C., Lebouteiller V. et al 2016 A\u0026A 590 A36\nCrossrefADS  \n\n\nCormier D., Lebouteiller V., Madden S. C. et al 2012 A\u0026A 548 A20\nCrossrefADS  \n\n\nCrawford M. K., Genzel R., Townes C. H. and Watson D. M. 1985 ApJ 291 755\nCrossrefADS  \n\n\nCroxall K. V., Smith J. D., Brandl B. R. et al 2013 ApJ 777 96\nIOPscienceADS  \n\n\nCroxall K. V., Smith J. D., Wolfire M. G. et al 2012 ApJ 747 81\nIOPscienceADS  \n\n\nDale D. A., Aniano G., Engelbracht C. W. et al 2012 ApJ 745 95\nIOPscienceADS  \n\n\nDale D. A., Gil de Paz A., Gordon K. D. et al 2007 ApJ 655 863\nIOPscienceADS  \n\n\nde Looze I., Baes M., Bendo G. J., Cortese L. and Fritz J. 2011 MNRAS 416 2712\nCrossrefADS  \n\n\nDe Looze I., Fritz J., Baes M. et al 2014 A\u0026A 571 A69\nCrossrefADS  \n\n\nDíaz-Santos T., Armus L., Charmandaris V. et al 2013 ApJ 774 68\nIOPscienceADS  \n\n\nDopita M. A., Kewley L. J., Heisler C. A. and Sutherland R. S. 2000 ApJ 542 224\nIOPscienceADS  \n\n\nDoran E. I., Crowther P. A., de Koter A. et al 2013 A\u0026A 558 A134\nCrossrefADS  \n\n\nDraine B. 2010 Physics of the Interstellar and Intergalactic Medium (Princeton, NJ: Princeton Univ. Press)\n  \n\n\nDraine B. T., Aniano G., Krause O. et al 2014 ApJ 780 172\nIOPscienceADS  \n\n\nDraine B. T. and Li A. 2007 ApJ 657 810\nIOPscienceADS  \n\n\nFahrion K., Cormier D., Bigiel F. et al 2017 A\u0026A 599 A9\nCrossrefADS  \n\n\nFazio G. G., Ashby M. L. N., Barmby P. et al 2004 ApJS 154 39\nIOPscienceADS  \n\n\nFitzpatrick E. L. 1999 PASP 111 63\nIOPscienceADS  \n\n\nGil de Paz A., Boissier S., Madore B. F. et al 2007 ApJS 173 185\nIOPscienceADS  \n\n\nGoldsmith P. F., Yildiz U. A., Langer W. D. and Pineda J. L. 2015 ApJ 814 133\nIOPscienceADS  \n\n\nGrier C. J., Mathur S., Ghosh H. and Ferrarese L. 2011 ApJ 731 60\nIOPscienceADS  \n\n\nGriffin M. J., Abergel A., Abreu A. et al 2010 A\u0026A 518 L3\nCrossrefADS  \n\n\nGroves B., Krause O., Sandstrom K. et al 2012 MNRAS 426 892\nCrossrefADS  \n\n\nHabart E., Abergel A., Boulanger F. et al 2011 A\u0026A 527 A122\nCrossrefADS  \n\n\nHabing H. J. 1968 BAN 19 421\nADS  \n\n\nHaffner L. M., Dettmar R.-J., Beckman J. E. et al 2009 RvMP 81 969\nCrossrefADS  \n\n\nHeiles C. 1994 ApJ 436 720\nCrossrefADS  \n\n\nHeiles C. and Troland T. H. 2003 ApJ 586 1067\nIOPscienceADS  \n\n\nHeiner J. S., Allen R. J. and van der Kruit P. C. 2011 MNRAS 416 2\nCrossrefADS  \n\n\nHeiner J. S., Sánchez-Gallego J. R., Rousseau-Nepton L. and Knapen J. H. 2013 MNRAS 428 3355\nCrossrefADS  \n\n\nHelou G., Malhotra S., Hollenbach D. J., Dale D. A. and Contursi A. 2001 ApJL 548 L73\nIOPscienceADS  \n\n\nHerrera-Camus R., Bolatto A., Smith J. D. et al 2016 ApJ 826 175\nCrossrefADS  \n\n\nHerrera-Camus R., Bolatto A. D., Wolfire M. G. et al 2015 ApJ 800 1\nIOPscienceADS  \n\n\nHills R. E. and Beasley A. J. 2008 Proc. SPIE 7012 70120N\nCrossrefADS  \n\n\nHollenbach D. J., Takahashi T. and Tielens A. G. G. M. 1991 ApJ 377 192\nCrossrefADS  \n\n\nHollenbach D. J. and Tielens A. G. G. M. 1997 ARA\u0026A 35 179\nCrossrefADS  \n\n\nHouck J. R., Roellig T. L., van Cleve J. et al 2004 ApJS 154 18\nIOPscienceADS  \n\n\nIngalls J. G., Bania T. M., Boulanger F. et al 2011 ApJ 743 174\nIOPscienceADS  \n\n\nIngalls J. G., Reach W. T. and Bania T. M. 2002 ApJ 579 289\nIOPscienceADS  \n\n\nJenkins E. B. and Tripp T. M. 2011 ApJ 734 65\nIOPscienceADS  \n\n\nKapala M. J., Sandstrom K., Groves B. et al 2015 ApJ 798 24\nIOPscienceADS  \n\n\nKaufman M. J., Wolfire M. G. and Hollenbach D. J. 2006 ApJ 644 283\nIOPscienceADS  \n\n\nKelz A., Verheijen M. A. W., Roth M. M. et al 2006 PASP 118 129\nIOPscienceADS  \n\n\nKennicutt R. C., Calzetti D., Aniano G. et al 2011 PASP 123 1347\nIOPscienceADS  \n\n\nKennicutt R. C. Jr. 1984 ApJ 287 116\nCrossrefADS  \n\n\nKennicutt R. C. Jr., Armus L., Bendo G. et al 2003 PASP 115 928\nIOPscienceADS  \n\n\nKennicutt R. C. Jr., Hao C.-N., Calzetti D. et al 2009 ApJ 703 1672\nIOPscienceADS  \n\n\nKennicutt R. C. Jr., Keel W. C. and Blaha C. A. 1989 AJ 97 1022\nCrossrefADS  \n\n\nKewley L. J., Dopita M. A., Sutherland R. S., Heisler C. A. and Trevena J. 2001 ApJ 556 121\nIOPscienceADS  \n\n\nKraemer K. E., Jackson J. M. and Lane A. P. 1998 ApJ 503 785\nIOPscienceADS  \n\n\nKramer C., Mookerjea B., Bayet E. et al 2005 A\u0026A 441 961\nCrossrefADS  \n\n\nLebouteiller V., Cormier D., Madden S. C. et al 2012 A\u0026A 548 A91\nCrossrefADS  \n\n\nLebouteiller V., Heap S., Hubeny I. and Kunth D. 2013 A\u0026A 553 A16\nCrossrefADS  \n\n\nLeitherer C., Schaerer D., Goldader J. D. et al 1999 ApJS 123 3\nIOPscienceADS  \n\n\nLeroy A. K., Bigiel F., de Blok W. J. G. et al 2012 AJ 144 3\nIOPscienceADS  \n\n\nLeroy A. K., Walter F., Bigiel F. et al 2009 AJ 137 4670\nIOPscienceADS  \n\n\nLeurini S., Wyrowski F., Wiesemeyer H. et al 2015 A\u0026A 584 A70\nCrossrefADS  \n\n\nLuhman M. L., Satyapal S., Fischer J. et al 1998 ApJL 504 L11\nIOPscienceADS  \n\n\nLuhman M. L., Satyapal S., Fischer J. et al 2003 ApJ 594 758\nIOPscienceADS  \n\n\nMadden S. C., Geis N., Genzel R. et al 1993 ApJ 407 579\nCrossrefADS  \n\n\nMadden S. C., Poglitsch A., Geis N., Stacey G. J. and Townes C. H. 1997 ApJ 483 200\nIOPscienceADS  \n\n\nMadden S. C., Rémy-Ruyer A., Galametz M. et al 2013 PASP 125 600\nIOPscienceADS  \n\n\nMalhotra S., Kaufman M. J., Hollenbach D. et al 2001 ApJ 561 766\nIOPscienceADS  \n\n\nMartin D. C., Seibert M., Buat V. et al 2005 ApJL 619 L59\nIOPscienceADS  \n\n\nMathis J. S., Mezger P. G. and Panagia N. 1983 A\u0026A 128 212\nADS  \n\n\nMatsuhara H., Tanaka M., Yonekura Y. et al 1997 ApJ 490 744\nIOPscienceADS  \n\n\nMizutani M., Onaka T. and Shibai H. 2004 A\u0026A 423 579\nCrossrefADS  \n\n\nMonnet G. 1971 A\u0026A 12 379\nADS  \n\n\nMookerjea B., Kramer C., Buchbender C. et al 2011 A\u0026A 532 A152\nCrossrefADS  \n\n\nMoustakas J., Kennicutt R. C. Jr., Tremonti C. A. et al 2010 ApJS 190 233\nIOPscienceADS  \n\n\nNakagawa T., Doi Y., Yui Y. Y. et al 1995 ApJL 455 L35\nIOPscienceADS  \n\n\nOberst T. E., Parshley S. C., Stacey G. J. et al 2006 ApJL 652 L125\nIOPscienceADS  \n\n\nO’Dell C. R., Ferland G. J., Porter R. L. and van Hoof P. A. M. 2011 ApJ 733 9\nIOPscienceADS  \n\n\nOrr M. E., Pineda J. L. and Goldsmith P. F. 2014 ApJ 795 26\nIOPscienceADS  \n\n\nOssenkopf V., Koumpia E., Okada Y. et al 2015 A\u0026A 580 A83\nCrossrefADS  \n\n\nOsterbrock D. and Ferland G. 2006 Astrophysics of Gaseous Nebulae and Active Galactic Nuclei (Mill Valley, CA: Univ. Science Books)\nADS  \n\n\nOtt S. 2010 ASP Conf. Ser. 434, Astronomical Data Analysis Software and Systems XIX ed Y. Mizumoto, K.-I. Morita and M. Ohishi (San Francisco, CA: ASP) 139\nADS  \n\n\nParmar P. S., Lacy J. H. and Achtermann J. M. 1991 ApJL 372 L25\nCrossrefADS  \n\n\nPierini D., Leech K. J., Tuffs R. J. and Volk H. J. 1999 MNRAS 303 L29\nCrossrefADS  \n\n\nPilbratt G. L., Riedinger J. R., Passvogel T. et al 2010 A\u0026A 518 L1\nCrossrefADS  \n\n\nPineda J. L., Langer W. D. and Goldsmith P. F. 2014 A\u0026A 570 A121\nCrossrefADS  \n\n\nPineda J. L., Langer W. D., Velusamy T. and Goldsmith P. F. 2013 A\u0026A 554 A103\nCrossrefADS  \n\n\nPoglitsch A., Waelkens C., Geis N. et al 2010 A\u0026A 518 L2\nCrossrefADS  \n\n\nPound M. W. and Wolfire M. G. 2008 ASP Conf. Ser. 394, Astronomical Data Analysis Software and Systems XVII ed R. W. Argyle, P. S. Bunclark and J. R. Lewis (San Francisco, CA: ASP) 654\nADS  \n\n\nReynolds R. J. 1991 ApJL 372 L17\nCrossrefADS  \n\n\nReynolds R. J., Chaudhary V., Madsen G. J. and Haffner L. M. 2005 AJ 129 927\nIOPscienceADS  \n\n\nRodriguez-Fernandez N. J., Braine J., Brouillet N. and Combes F. 2006 A\u0026A 453 77\nCrossrefADS  \n\n\nRöllig M., Simon R., Güsten R. et al 2016 A\u0026A 591 A33\nCrossrefADS  \n\n\nRosales-Ortega F. F., Kennicutt R. C., Sánchez S. F. et al 2010 MNRAS 405 735\nCrossrefADS  \n\n\nRoussel H. 2013 PASP 125 1126\nCrossrefADS  \n\n\nRoussel H., Helou G., Hollenbach D. J. et al 2007 ApJ 669 959\nIOPscienceADS  \n\n\nRubin R. H. 1984 ApJ 287 653\nCrossrefADS  \n\n\nSalpeter E. E. 1955 ApJ 121 161\nCrossrefADS  \n\n\nSánchez S. F., Rosales-Ortega F. F., Kennicutt R. C. et al 2011 MNRAS 410 313\nCrossrefADS  \n\n\nSargsyan L., Lebouteiller V., Weedman D. et al 2012 ApJ 755 171\nIOPscienceADS  \n\n\nSargsyan L., Samsonyan A., Lebouteiller V. et al 2014 ApJ 790 15\nIOPscienceADS  \n\n\nSembach K. R., Howk J. C., Ryans R. S. I. and Keenan F. P. 2000 ApJ 528 310\nIOPscienceADS  \n\n\nSheffer Y. and Wolfire M. G. 2013 ApJL 774 L14\nIOPscienceADS  \n\n\nSheffer Y., Wolfire M. G., Hollenbach D. J., Kaufman M. J. and Cordier M. 2011 ApJ 741 45\nIOPscienceADS  \n\n\nShibai H., Okuda H., Nakagawa T. et al 1991 ApJ 374 522\nCrossrefADS  \n\n\nShields G. A. 1990 ARA\u0026A 28 525\nCrossrefADS  \n\n\nSmith J. D. T., Armus L., Dale D. A. et al 2007a PASP 119 1133\nIOPscienceADS  \n\n\nSmith J. D. T., Croxall K., Draine B. et al 2017 ApJ 834 5\nIOPscienceADS  \n\n\nSmith J. D. T., Draine B. T., Dale D. A. et al 2007b ApJ 656 770\nIOPscienceADS  \n\n\nStacey G. J., Geis N., Genzel R. et al 1991 ApJ 373 423\nCrossrefADS  \n\n\nStacey G. J., Hailey-Dunsheath S., Ferkinhoff C. et al 2010 ApJ 724 957\nIOPscienceADS  \n\n\nStacey G. J., Jaffe D. T., Geis N. et al 1993 ApJ 404 219\nCrossrefADS  \n\n\nStacey G. J., Viscuso P. J., Fuller C. E. and Kurtz N. T. 1985 ApJ 289 803\nCrossrefADS  \n\n\nSturm E., Poglitsch A., Contursi A. et al 2011 EAS Publications Ser. 52 55\nCrossrefADS  \n\n\nTielens A. 2010 The Physics and Chemistry of the Interstellar Medium (Cambridge: Cambridge Univ. Press)\nADS  \n\n\nTielens A. G. G. M. and Hollenbach D. 1985 ApJ 291 722\nCrossrefADS  \n\n\nTielens A. G. G. M., Hony S., van Kerckhoven C. and Peeters E. 1999 The Universe as Seen by ISO ed P. Cox and M. Kessler (Noordwijk: ESA) 579\nADS  \n\n\nTufte S. L., Reynolds R. J. and Haffner L. M. 1998 ASP Conf. Ser. 141, Astrophysics From Antarctica ed G. Novak and R. Landsberg (San Francisco, CA: ASP) 169\nADS  \n\n\nVasta M., Barlow M. J., Viti S., Yates J. A. and Bell T. A. 2010 MNRAS 404 1910\nCrossrefADS  \n\n\nVastel C., Spaans M., Ceccarelli C., Tielens A. G. G. M. and Caux E. 2001 A\u0026A 376 1064\nCrossrefADS  \n\n\nVelusamy T. and Langer W. D. 2014 A\u0026A 572 A45\nCrossrefADS  \n\n\nVelusamy T., Langer W. D., Pineda J. L. and Goldsmith P. F. 2012 A\u0026A 541 L10\nCrossrefADS  \n\n\nWalter F., Brinks E., de Blok W. J. G. et al 2008 AJ 136 2563\nIOPscienceADS  \n\n\nWatson D. M. and Storey J. W. V. 1980 IJIMW 1 609\nCrossrefADS  \n\n\nWerner M. W., Roellig T. L., Low F. J. et al 2004 ApJS 154 1\nIOPscienceADS  \n\n\nWiesemeyer H., Güsten R., Heyminck S. et al 2016 A\u0026A 585 A76\nCrossrefADS  \n\n\nWolfire M. G., Hollenbach D., McKee C. F., Tielens A. G. G. M. and Bakes E. L. O. 1995 ApJ 443 152\nCrossrefADS  \n\n\nWolfire M. G., McKee C. F., Hollenbach D. and Tielens A. G. G. M. 2003 ApJ 587 278\nIOPscienceADS  \n\n\nWright E. L., Mather J. C., Bennett C. L. et al 1991 ApJ 381 200\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"A. Abdullah et al 2017 ApJ 842 4","other_numbering_system":null,"funders":[{"agency":"Australian Research Council","grant_number":"FT140101202"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":["Infrared Processing and Analysis Center (IPAC)"]}