{"title":"The Luminous Blue Variable RMC 127 as Seen with ALMA and ATCA","uri":"","abstract":"We present ALMA and ATCA observations of the luminous blue variable RMC 127. The radio maps show for the first time the core of the nebula and evidence that the nebula is strongly asymmetric with a Z-pattern shape. Hints of this morphology are also visible in the archival Hubble Space Telescope Hα image, which overall resembles the radio emission. The emission mechanism in the outer nebula is optically thin free–free in the radio. At high frequencies, a component of point-source emission appears at the position of the star, up to the ALMA frequencies. The rising flux density distribution (S_ν ~ ν^(0.78±0.05)) of this object suggests thermal emission from the ionized stellar wind and indicates a departure from spherical symmetry with n_e(r) ∝ r^(-2). We examine different scenarios to explain this excess of thermal emission from the wind and show that this can arise from a bipolar outflow, supporting the suggestion by other authors that the stellar wind of RMC 127 is aspherical. We fit the data with two collimated ionized wind models, and we find that the mass-loss rate can be a factor of two or more smaller than in the spherical case. We also fit the photometry obtained by IR space telescopes and deduce that the mid- to far-IR emission must arise from extended, cool (~80 K) dust within the outer ionized nebula. Finally, we discuss two possible scenarios for the nebular morphology: the canonical single-star expanding shell geometry and a precessing jet model assuming the presence of a companion star.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253283","docid":253283,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1267389","fileid":1267389,"datasetid":"document","objectid":253283,"filename":"Agliozzo_2017_ApJ_841_130.pdf","mime_type":"application/pdf","hash":"0b15cef9c58de049d58688d8a851fb65","hash_type":"MD5","filesize":1740533,"mtime":"2017-06-06 20:23:22","url":"http://authors.library.caltech.edu/77971/1/Agliozzo_2017_ApJ_841_130.pdf"}],"eprintid":77971,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"Agliozzo_2017_ApJ_841_130.pdf","content":"published"}],"note":"© 2017 The American Astronomical Society. \n\nReceived 2016 May 25; revised 2017 May 9; accepted 2017 May 9; published 2017 June 5. \n\nWe are thankful to Yazam Momany for assistance with the VISIR data. We thank the referee for thorough feedback, which has helped to improve and clarify our presentation of this work. We acknowledge support from FONDECYT grant No. 3150463 (C.A.), FONDECYT grant No. 3140436 (R.N.), FONDECYT Regular 1141218 (F.E.B.), FONDECYT grant 1151445 (J.L.P.), CONICYT-Chile grants Basal-CATA PFB-06/2007 (F.E.B.), \"EMBIGGEN\" Anillo ACT1101 (F.E.B.), and the Ministry of Economy, Development, and Tourism's Millennium Science Initiative through grant IC120009, awarded to The Millennium Institute of Astrophysics, MAS (C.A., G.P., J.L.P., F.E.B.). We also wish to thank the staff at ESO, ALMA, and ATCA who made these observations possible. \n\nThis paper makes use of the following ALMA data: ADS/JAO.ALMA#2013.1.00450.S. ALMA is a partnership of ESO (representing its member states), NSF (USA), and NINS (Japan), together with NRC (Canada), NSC and ASIAA (Taiwan), and KASI (Republic of Korea), in cooperation with the Republic of Chile. The Joint ALMA Observatory is operated by ESO, AUI/NRAO, and NAOJ. This paper also includes data collected at the European Organisation for Astronomical Research in the southern Hemisphere under ESO programmes 095.D-0433(A) and 095.D-0433(B). The Australia Telescope Compact Array is part of the Australia Telescope National Facility which is funded by the Australian Government for operation as a National Facility managed by CSIRO. This work made use of PyAstronomy. \n\nFacilities: ATCA, ALMA, VLT.","id":77971,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/79/71","datestamp":"2017-06-06 21:11:17","lastmod":"2017-06-06 21:11:17","status_changed":"2017-06-06 21:11:17","type":"article","metadata_visibility":"show","creators":[{"given":"C.","family":"Agliozzo","id":"Agliozzo-C","orcid":""},{"given":"C.","family":"Trigilio","id":"Trigilio-C","orcid":""},{"given":"G.","family":"Pignata","id":"Pignata-G","orcid":""},{"given":"N. M.","family":"Phillips","id":"Phillips-N-M","orcid":""},{"given":"R.","family":"Nikutta","id":"Nikutta-T","orcid":""},{"given":"P.","family":"Leto","id":"Leto-P","orcid":""},{"given":"G.","family":"Umana","id":"Umana-G","orcid":""},{"given":"A.","family":"Ingallinera","id":"Ingallinera-A","orcid":""},{"given":"C.","family":"Buemi","id":"Buemi-C-S","orcid":""},{"given":"F. E.","family":"Bauer","id":"Bauer-F-E","orcid":""},{"given":"R.","family":"Paladini","id":"Paladini-R","orcid":""},{"given":"A.","family":"Noriega-Crespo","id":"Noriega-Crespo-A","orcid":""},{"given":"J. L.","family":"Prieto","id":"Prieto-J-L","orcid":""},{"given":"M.","family":"Massardi","id":"Massardi-M","orcid":""},{"given":"L.","family":"Cerrigone","id":"Cerrigone-L","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"stars: individual (RMC 127) ; stars: massive; stars: mass-loss; stars: rotation; stars: winds, outflows; submillimeter: stars","date":"2017-06-01","date_type":"published","publication":"Astrophysical Journal","volume":"841","number":"2","pagerange":"Art. No. 130","id_number":"CaltechAUTHORS:20170606-132315552","refereed":true,"issn":"1538-4357","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170606-132315552","related_url":[{"url":"https://doi.org/10.3847/1538-4357/aa72a1","type":"doi","description":"Article"},{"url":"http://iopscience.iop.org/article/10.3847/1538-4357/aa72a1/meta","type":"pub","description":"Article"}],"referencetext":["Agliozzo C., Nikutta R., Pignata G. et al 2017a MNRAS 466 213 (Paper II)\nCrossrefADS  \n\n\nAgliozzo C., Noriega-Crespo A., Umana G. et al 2014 MNRAS 440 1391\nCrossrefADS  \n\n\nAgliozzo C., Trigilio C., Buemi C. et al 2017b IAU Symp. 329, The Lives and Death-Throes of Massive Stars ed J. J. Eldridge et al (Cambridge: Cambridge Univ. Press) in press\n  \n\n\nAgliozzo C., Umana G., Trigilio C. et al 2012 MNRAS 426 181 (Paper I)\nCrossrefADS  \n\n\nBeichman C. A., Neugebauer G., Habing H. J., Clegg P. E. and Chester T. J. 1988 Infrared Astronomical Satellite (IRAS) Catalogs and Atlases, Vol. 1: Explanatory Supplement (Washington, DC: NASA)\n  \n\n\nBoffin H. M. J., Rivinius T., Mérand A. et al 2016 A\u0026A 593 A90\nCrossrefADS  \n\n\nBohannan B. and Walborn N. R. 1989 PASP 101 520\nIOPscienceADS  \n\n\nBonanos A. Z., Massa D. L., Sewilo M. et al 2009 AJ 138 1003\nIOPscienceADS  \n\n\nBuemi C. S., Trigilio C., Leto P. et al 2017 MNRAS 465 4147\nCrossrefADS  \n\n\nBuemi C. S., Umana G., Trigilio C., Leto P. and Hora J. L. 2010 ApJ 721 1404\nIOPscienceADS  \n\n\nClampin M., Nota A., Golimowski D. A., Leitherer C. and Durrance S. T. 1993 ApJL 410 L35\nCrossrefADS  \n\n\nClampin M., Schulte-Ladbeck R. E., Nota A. et al 1995 AJ 110 251\nCrossrefADS  \n\n\nCorcoran M. F., Rawley G. L., Swank J. H. and Petre R. 1995 ApJL 445 L121\nCrossrefADS  \n\n\nCutri R. M., Skrutskie M. F., van Dyk S. et al 2003 yCat 2246\nADS  \n\n\nCutri R. M., Skrutskie M. F., van Dyk S. et al 2012 yCat 2281\nADS  \n\n\nDaley-Yates S., Stevens I. R. and Crossland T. D. 2016 MNRAS 463 2735\nCrossrefADS  \n\n\nDavies B., Oudmaijer R. D. and Vink J. S. 2005 A\u0026A 439 1107\nCrossrefADS  \n\n\nDe Marco O. and Izzard R. G. 2017 PASA 34 e001\nCrossrefADS  \n\n\nDougherty S. M. 2010 in ASP Conf. Ser. 422, High Energy Phenomena in Massive Stars ed J. Martí, P. L. Luque-Escamilla and J. A. Combi (San Francisco, CA: ASP) 166\nADS  \n\n\nGodfrey L. E. H., Lovell J. E. J., Burke-Spolaor S. et al 2012 ApJ 758L 27\nIOPscienceADS  \n\n\nGroh J. H., Hillier D. J. and Damineli A. 2006 ApJL 638 L33\nIOPscienceADS  \n\n\nGvaramadze V. V., Kniazev A. Y., Bestenlehner J. M. et al 2015 MNRAS 454 219\nCrossrefADS  \n\n\nHiggs L. A., Wendker H. J. and Landecker T. L. 1994 A\u0026A 291 295\nADS  \n\n\nHumphreys R. M. and Davidson K. 1994 PASP 106 1025\nIOPscienceADS  \n\n\nHumphreys R. M., Weis K., Davidson K. and Gordon M. S. 2016 ApJ 825 64\nIOPscienceADS  \n\n\nIgnace R. 2016 MNRAS 457 4123\nCrossrefADS  \n\n\nIshihara D., Onaka T., Kataza H. et al 2010a A\u0026A 514 A1\nCrossrefADS  \n\n\nIshihara D., Onaka T., Kataza H. et al 2010b yCat 2297\n  \n\n\nKashi A. 2010 MNRAS 405 1924\nCrossrefADS  \n\n\nKobulnicky H. A., Kiminki D. C., Lundquist M. J. et al 2014 ApJS 213 34\nIOPscienceADS  \n\n\nLau R. M., Hankins M. J., Herter T. L. et al 2016 ApJ 818 117\nIOPscienceADS  \n\n\nLeitherer C., Allen R., Altner B. et al 1994 ApJ 428 292\nCrossrefADS  \n\n\nLivio M. 2000 ASP Conf. Ser. 199, Asymmetrical Planetary Nebulae II: From Origins to Microstructures ed J. H. Kastner, N. Soker and S. Rappaport (San Francisco, CA: ASP) 243\nADS  \n\n\nMcMullin J. P., Waters B., Schiebel D., Young W. and Golap K. 2007 adass XVI 376 127\nADS  \n\n\nMehner A., de Wit W. J., Groh J. H. et al 2016 A\u0026A 585 A81\nCrossrefADS  \n\n\nMehta K. T., Georganopoulos M., Perlman E. S., Padgett C. A. and Chartas G. 2009 ApJ 690 1706\nIOPscienceADS  \n\n\nMeixner M., Gordon K. D., Indebetouw R. et al 2006 AJ 132 2268\nIOPscienceADS  \n\n\nMeixner M., Panuzzo P., Roman-Duval J. et al 2013 AJ 146 62\nIOPscienceADS  \n\n\nMeyer E. T., Breiding P., Georganopoulos M. et al 2017 ApJL 835 L35\nIOPscienceADS  \n\n\nMundt R. 1985 Protostars and Planets II ed D. C. Black and M. S. Mathews (Tucson, AZ: Univ. Arizona Press) 414\nADS  \n\n\nNazé Y., Hartwell J. M., Stevens I. R. et al 2002 ApJ 580 225\nIOPscienceADS  \n\n\nNazé Y., Rauw G. and Hutsemékers D. 2012 A\u0026A 538 A47\nCrossrefADS  \n\n\nNikolic B., Graves S. F., Bolton R. C. and Richer J. S. 2012 Design and Implementation of the wvrgcal Program, ALMA Memo Series, The ALMA Project 593\n  \n\n\nNikutta R. and Agliozzo C. 2016 RHOCUBE: 3D density distributions modeling code, Astrophysics Source Code Library ascl:1611.009\n  \n\n\nNota A., Livio M., Clampin M. and Schulte-Ladbeck R. 1995 ApJ 448 788\nCrossrefADS  \n\n\nNugis T., Crowther P. A. and Willis A. J. 1998 A\u0026A 333 956\nADS  \n\n\nOchsenbein F., Bauer P. and Marcout J. 2000 A\u0026AS 143 23\nCrossrefADS  \n\n\nPanagia N. and Felli M. 1975 A\u0026A 39 1\nADS  \n\n\nReynolds S. P. 1986 ApJ 304 713\nCrossrefADS  \n\n\nSchulte-Ladbeck R. E., Leitherer C., Clayton G. C. et al 1993 ApJ 407 723\nCrossrefADS  \n\n\nSchwartz D. A., Marshall H. L., Lovell J. E. J. et al 2000 ApJ 540L 69\nIOPscienceADS  \n\n\nSmith L. J., Nota A., Pasquali A. et al 1998 ApJ 503 278\nIOPscienceADS  \n\n\nSmith N. and Owocki S. P. 2006 ApJL 645 L45\nIOPscienceADS  \n\n\nSmith N. and Stassun K. G. 2017 AJ 153 125\nIOPscienceADS  \n\n\nSmith N. and Tombleson R. 2015 MNRAS 447 598\nCrossrefADS  \n\n\nSoker N. and Livio M. 1994 ApJ 421 219\nCrossrefADS  \n\n\nStahl O. 1986 A\u0026A 164 321\nADS  \n\n\nStahl O., Wolf B., Klare G. et al 1983 A\u0026A 127 49\nADS  \n\n\nUmana G., Buemi C. S., Trigilio C. et al 2011 ApJL 739 L11\nIOPscienceADS  \n\n\nUmana G., Buemi C. S., Trigilio C. and Leto P. 2005 A\u0026A 437 L1\nCrossrefADS  \n\n\nUmana G., Ingallinera A., Trigilio C. et al 2012 MNRAS 427 2975\nCrossrefADS  \n\n\nVamvatira-Nakou C., Hutsemékers D., Royer P. et al 2015 A\u0026A 578 A108\nCrossrefADS  \n\n\nvan Aarle E., van Winckel H., Lloyd Evans T. et al 2011 A\u0026A 530 A90\nCrossrefADS  \n\n\nWalborn N. R. 1972 AJ 77 312\nCrossrefADS  \n\n\nWalborn N. R. 1977 ApJ 215 53\nCrossrefADS  \n\n\nWalborn N. R. 1982 ApJ 256 452\nCrossrefADS  \n\n\nWalborn N. R., Morrell N. I., Nazé Y. et al 2015 AJ 150 99\nIOPscienceADS  \n\n\nWalborn N. R., Stahl O., Gamen R. C. et al 2008 ApJL 683 L33\nIOPscienceADS  \n\n\nWeis K. 2003 A\u0026A 408 205\nCrossrefADS  \n\n\nWeis K. 2011 BSRSL 80 440\nADS  \n\n\nWhitney B. A., Sewilo M., Indebetouw R. et al 2008 AJ 136 18\nIOPscienceADS  \n\n\nWolf B., Stahl O., Smolinski J. and Casatella A. 1988 A\u0026AS 74 239\nADS  \n\n\nWright A. E. and Barlow M. J. 1975 MNRAS 170 41\nCrossrefADS  \n\n\nZickgraf F.-J., Wolf B., Stahl O., Leitherer C. and Klare G. 1985 A\u0026A 143 421\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"C. Agliozzo et al 2017 ApJ 841 130","other_numbering_system":null,"funders":[{"agency":"Fondo Nacional de Desarrollo Científico y Tecnológico (FONDECYT)","grant_number":"3150463"},{"agency":"Fondo Nacional de Desarrollo Científico y Tecnológico (FONDECYT)","grant_number":"3140436 "},{"agency":"Fondo Nacional de Desarrollo Científico y Tecnológico (FONDECYT)","grant_number":"1141218"},{"agency":"Fondo Nacional de Desarrollo Científico y Tecnológico (FONDECYT)","grant_number":"1151445"},{"agency":"Basal-CATA","grant_number":"PFB-06/2007"},{"agency":"Comisión Nacional de Investigación Científica y Tecnológica (CONICYT)","grant_number":"Anillo ACT1101"},{"agency":"Iniciativa Científica Milenio del Ministerio de Economía, Fomento y Turismo","grant_number":"IC120009"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":["Infrared Processing and Analysis Center (IPAC)"]}