{"title":"A Critical Assessment of Punctuated Equilibria. I. Duration of Taxa","uri":"","abstract":"The purpose of this paper is to present a reasonable paleontological basis for interpreting species durations over geologic time. The context is to evaluate the currently\nmuch discussed model of punctuated equilibria. I will take the position of a devil's advocate and explore the biases that are inherent in the model as customarily used.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253334","docid":253334,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1267791","fileid":1267791,"datasetid":"document","objectid":253334,"filename":"2408149.pdf","mime_type":"application/pdf","hash":"b7f02d827e9f1b313f237a3520d55bfe","hash_type":"MD5","filesize":2095671,"mtime":"2017-06-07 17:39:41","url":"http://authors.library.caltech.edu/77999/1/2408149.pdf"}],"eprintid":77999,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"2408149.pdf","content":"published"}],"note":"© 1982 John Wiley \u0026 Sons, Inc. \n\nReceived February 26, 1982. Revised July 15, 1982.","id":77999,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/79/99","datestamp":"2017-06-07 18:23:21","lastmod":"2017-06-07 18:23:21","status_changed":"2017-06-07 18:23:21","type":"article","metadata_visibility":"show","creators":[{"given":"Thomas J. M.","family":"Schopf","id":"Schopf-T-J-M","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"","date":"1982-11","date_type":"published","publication":"Evolution","volume":"36","number":"6","pagerange":"1144-1157","id_number":"CaltechAUTHORS:20170607-103935769","refereed":true,"issn":"0014-3820 ","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170607-103935769","related_url":[{"url":"http://dx.doi.org/10.1111/j.1558-5646.1982.tb05485.x","type":"doi","description":"Article"},{"url":"http://onlinelibrary.wiley.com/doi/10.1111/j.1558-5646.1982.tb05485.x/abstract","type":"pub","description":"Article"},{"url":"http://www.jstor.org/stable/2408149","type":"jstor","description":"Article"}],"referencetext":["ARKELL, W. J. 1956. Species and species, p. 97- 99. In P. G. Sylvester-Bradley (ed.), The Species Concept in Palaeontology. Systematics Assoc., London. BEIR III REPORT. 1980. The effects on popula- tions of exposure to low levels of ionizing radia- tion: 1980 National Academy of Sciences-Na- tional Research Council, Committee on the Biological Effects of Ionizing Radiation. Nation- al Academy Press; Washington, D.C. (See Chap- ter on genetic effects, p. 71-134.) BOOKSTEIN, F. L., P. D. GINGERICH, AND A. G. KLUGE. 1978. Hierarchical linear modeling of the tempo and mode of evolution. Paleobiology 4:120-134. CRICK, R. E. 1981. Diversity and evolutionary rates of Cambro-Ordovician nautiloids. Paleobiology 7:216-229. DzIK, J., AND J. TRAMMER. 1980. Gradual evo- lution of Conodontophorids in the Polish Trias- sic. Acta Palaeontol. Polonica 25:55-89. ELDREDGE, N., AND S. J. GOULD. 1972. Punc- tuated equilibria: an alternative to phyletic grad- ualism, p. 82-115. In T. J. M. Schopf (ed.), Models in Paleobiology. Freeman, Cooper \u0026 Co., San Francisco. GOULD, S. J. 1982. Darwinism and the expansion of evolutionary theory. Science 216:380-387. GOULD, S. J., AND N. ELDREDGE. 1977. Punc- tuated equilibria: the tempo and mode of evolu- tion reconsidered. Paleobiology 3:115-151. HALLAM, A. 1976. Stratigraphic distribution and ecology of European Jurassic bivalves. Lethaia 9:245-259.\n1978. How rare is phyletic gradualism and what is its evolutionary significance? Evidence from Jurassic bivalves. Paleobiology 4:16-25. HOFFMAN, A. 1982. Punctuated versus gradual mode of evolution: a reconsideration. Evol. Biol. In press. KOCH, C. F. 1978. Bias in the published fossil record. Paleobiology 4:367-372. LEVINTON, J. S., AND C. M. SIMON. 1980. A cri- tique of the punctuated equilibria model and im- plications' for the detection of speciation in the fossil record. Syst. Zool. 29:130-142. MALMGREN, B. A., AND J. P. KENNETT. 1981. Phyletic gradualism in a late Cenozoic planktonic foraminiferal lineage; DSDP Site 284, southwest Pacific. Paleobiology 7:230-240. MAYR, E. 1963. Animal Species and Evolution. Belknap Press, Cambridge. RAUP, D. M. 1978. Cohort analysis of generic sur- vivorship. Paleobiology 4:1-15. RAUP, D. M., AND R. E. CRICK. 1981. Evolution of single characters in the Jurassic ammonite Kosmoceras. Paleobiology 7:200-215. RAuP, D. M., S. J. GOULD, T. J. M. SCHOPF, AND D. S. SIMBERLOFF. 1973. Stochastic models of phylogeny and the evolution of diversity. J. Geol. 82:525-542. ROMER, A. S. 1966. Vertebrate Paleontology. Univ. Chicago Press, Chicago. RUEDEMANN, R. 1917. The Paleontology of ar- rested evolution. N.Y. State Mus. Bull. 196: 107-134. (Reprinted in T. J. M. Schopf [ed.], 1980. Presidential Addresses Paleontol. Soc. Arno Press, N. Y.) SCHOPF, T. J. M. 1966. Conodonts of the Trenton Group (Ordovician) in New York, Southern On- tario, and Quebec. N.Y. State Mus. Sci. Ser. Bull. No. 405, 105 p. SCHOPF, T. J. M. 1981a. Evidence from findings of molecular biology with regard to the rapidity of genomic change: implications for species du- rations, p. 135-192. In K. J. Niklas (ed.), Paleo- botany, Paleocology and Evolution (Festschrift for Harlan P. Banks). Praeger Pub., N.Y. 1981b. Punctuated equilibrium and evo- lutionary stasis. Paleobiology 7:156-166. SCHOPF, T. J. M., D. M. RAuP, S. J. GOULD, AND D. S. SIMBERLOFF. 1975. Genomic versus morphologic rates of evolution: influence of mor- phologic complexity. Paleobiology 1:63-70. SELBY, P. B. 1979. Radiation-induced dominant skeletal mutations in mice: mutation rate, char- acteristics, and usefulness in estimating genetic hazard to humans from radiation, p. 537-544. In S. Okaka, M. Imamura, T. Terashima, and H. Yamaguchi (eds.), Radiation Research Proc. 6th Intern. Cong. Radiation Research, May 13-19, 1979. Tokyo, Toppan Printing Co., Tokyo. SELBY, P. B., AND P. R. SELBY. 1978. Gamma- ray induced dominant mutations that cause skel- etal abnormalities in mice. Mut. Res. 51:199-236. SEPKOSKI, J. J., JR. 1975. Stratigraphic biases in the analysis of taxonomic survivorship. Paleo- biology 1:343-355. STANLEY, S. M. 1979. Macroevolution: Pattern and Process. W. H. Freeman and Co.; San Francisco. VAUGHAN, T. W. 1924. Criteria and status of cor- relation and classification of Tertiary deposits. Geol. Soc. Amer. Bull. 35:677-742. (Reprinted in T. J. M. Schopf [ed.], 1980. Presidential Ad- dresses Paleontol. Soc. Arno Press, N.Y.) ZITTEL, K. A. VON 1913. Text-book of Paleontol- ogy, ed. by C. R. Eastman. MacMillan \u0026 Co., London."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Schopf, T. J. M. (1982), A CRITICAL ASSESSMENT OF PUNCTUATED EQUILIBRIA I. DURATION OF TAXA. Evolution, 36: 1144–1157. doi:10.1111/j.1558-5646.1982.tb05485.x","other_numbering_system":null,"funders":null,"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}