{"title":"Mechanism of Isotactic Polypropylene Formation with C_1-Symmetric Metallocene Catalysts","uri":"","abstract":"The mechanism for isotactic polypropylene formation by the C_1-symmetric catalyst system [Me_2C(3-tert-butyl-C_5H_3)(C_(13)H_8)]ZrCl_2/MAO (MAO = methylaluminoxane, C13H8 = fluorenylidene) has been examined. Evidence supports an alternating mechanism, where both sites of the metallocene wedge are utilized for monomer insertion, rather than the previously proposed site epimerization (inversion at Zr) following each monomer insertion. As the polymerization temperature increases (0 to 60 °C) with lower concentrations of propylene, the site epimerization mechanism begins to compete, as evidenced by an increase in isotacticity. The alternating mechanism also accounts for polypropylene microstructures obtained with Me_2C(3-R-C_5H_3)(Oct)ZrCl_2/MAO, where Oct = octamethyloctahydrodibenzofluorenylidene and R = methyl, cyclohexyl, diphenylmethyl, and with Me_2C(3-tert-butyl-4-Me-C_5H_2)(Oct)ZrCl_2/MAO. For an Oct-containing catalyst system with R = 2-methyl-2-adamantyl, unprecedentedly high (for a fluorenyl-based metallocene catalyst) isotacticity ([mmmm] \u003e 99%) is obtained; the polymer prepared at 0 °C has T_m = 167 °C and M_w = 370 000.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253345","docid":253345,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1267878","fileid":1267878,"datasetid":"document","objectid":253345,"filename":"om050841k.pdf","mime_type":"application/pdf","hash":"2dca9fb3b553350d599feffc00fa4d3e","hash_type":"MD5","filesize":406596,"mtime":"2017-06-07 20:39:49","url":"http://authors.library.caltech.edu/78007/1/om050841k.pdf"}],"eprintid":78007,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"om050841k.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/253346","docid":253346,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1267884","fileid":1267884,"datasetid":"document","objectid":253346,"filename":"om050841ksi20050929_073403.pdf","mime_type":"application/pdf","hash":"898cec9df82278ffbdd9b393b6b6de06","hash_type":"MD5","filesize":76164,"mtime":"2017-06-07 20:41:58","url":"http://authors.library.caltech.edu/78007/2/om050841ksi20050929_073403.pdf"}],"eprintid":78007,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"om050841ksi20050929_073403.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/253347","docid":253347,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1267886","fileid":1267886,"datasetid":"document","objectid":253347,"filename":"om050841ksi20060131_054421.pdf","mime_type":"application/pdf","hash":"0d8b72f7f0cd6b5eec55da1633b0e3a8","hash_type":"MD5","filesize":1420576,"mtime":"2017-06-07 20:42:15","url":"http://authors.library.caltech.edu/78007/3/om050841ksi20060131_054421.pdf"}],"eprintid":78007,"pos":3,"placement":3,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"om050841ksi20060131_054421.pdf","content":"supplemental"},{"id":"http://authors.library.caltech.edu/id/document/253348","docid":253348,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1267888","fileid":1267888,"datasetid":"document","objectid":253348,"filename":"om050841ksi20050929_071833.cif","mime_type":"text/plain","hash":"f9b56d2b47025ad176614f141febbf59","hash_type":"MD5","filesize":30206,"mtime":"2017-06-07 20:43:01","url":"http://authors.library.caltech.edu/78007/4/om050841ksi20050929_071833.cif"}],"eprintid":78007,"pos":4,"placement":4,"mime_type":"text/plain","format":"chemical/x-cif","language":"en","security":"public","license":"other","main":"om050841ksi20050929_071833.cif","content":"supplemental"}],"note":"© 2006 American Chemical Society. \n\nReceived September 29, 2005. Publication Date (Web): June 16, 2006. \n\nThis work has been supported by USDOE Office of Basic Energy Sciences (Grant No. DE-FG03-85ER13431), Exxon Chemicals America, and the National Science Foundation (Grant No. CHE-0131180). A DOD National Defense Science and Engineering Fellowship awarded to S.M. is also acknowledged. The authors thank Dr. Michael Day and Mr. Lawrence Henling for obtaining the X-ray crystal structure, as well as Dr. Terry Burkhardt at ExxonMobil and Dr. Andreas Ernst at BP-Amoco for assistance in obtaining molecular weight data.","id":78007,"rev_number":14,"userid":18,"eprint_dir":"disk0/00/07/80/07","datestamp":"2017-06-07 22:36:59","lastmod":"2017-06-07 22:36:59","status_changed":"2017-06-07 22:36:59","type":"article","metadata_visibility":"show","creators":[{"given":"Stephen A.","family":"Miller","id":"Miller-S-A","orcid":""},{"given":"John E.","family":"Bercaw","id":"Bercaw-J-E","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2006-07-17","date_type":"published","publication":"Organometallics","volume":"25","number":"15","pagerange":"3576-3592","id_number":"CaltechAUTHORS:20170607-133944016","refereed":true,"issn":"0276-7333","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170607-133944016","related_url":[{"url":"http://dx.doi.org/10.1021/om050841k","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/om050841k","type":"pub","description":"Article"},{"url":"http://pubs.acs.org/doi/suppl/10.1021/om050841k","type":"pub","description":"Supporting Information"}],"referencetext":["(1) Ewen, J. A.; Jones, R. L.; Razavi, A.; Ferrara, J. D. J. Am. Chem. Soc. 1988, 110, 6255−6256.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(2) (a) Ewen, J. A.; Elder, M. J.; Jones, R. L.; Haspeslagh, L.; Atwood, J. L.; Bott, S. G.; Robinson, K. Makromol. Chem., Macromol. Symp. 1991, 48/49, 253−295.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Ewen, J. A. Eur. Pat. Appl. EP 423101, 1989.OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Ewen, J. A. Macromol. Symp. 1995, 89, 181−196.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Ewen, J. A.; Elder, M. J. In Ziegler Catalysts, Recent Scientific Innovations and Technological Improvements; Fink, G., Mülhaupt, R., Brintzinger, H.-H., Eds.; Springer:  Berlin, 1995; pp 99−109.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(3) (a) Dolle, V.; Rohrmann, J.; Winter, A.; Antberg, M.; Klein, R. Eur. Pat. Appl. EP 399347, 1991.OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Antberg, M.; Dolle, V.; Klein, R.; Rohrmann, J.; Spaleck, W.; Winter, A. In Studies in Surface Science and Catalysis (Catalytic Olefin Polymerization, Volume 56); Keii, T., Soga, K., Eds.; Kodansha:  Tokyo, 1990; pp 501−515.OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Spaleck, W.; Antberg, M.; Aulbach, M.; Bachmann, B.; Dolle, V.; Haftka, S.; Küber, F.; Rohrmann, J.; Winter, A. In Ziegler Catalysts, Recent Scientific Innovations and Technological Improvements; Fink, G., Mülhaupt, R., Brintzinger, H.-H., Eds.; Springer:  Berlin, 1995; pp 83−97.OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Spaleck, W.; Aulbach, M.; Bachmann, B.; Küber, F.; Winter, A. Macromol. Symp. 1995, 89, 237−247.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(4) (a) Razavi, A.; Atwood, J. L. J. Organomet. Chem. 1996, 520, 115−120.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Razavi, A.; Vereecke, D.; Peters, L.; Den Dauw, K.; Nafpliotis, L.; Atwood, J. L. In Ziegler Catalysts, Recent Scientific Innovations and Technological Improvements; Fink, G., Mülhaupt, R., Brintzinger, H.-H., Eds.; Springer:  Berlin, 1995; pp 111−147.OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Razavi, A.; Atwood, J. L. J. Organomet. Chem. 1995, 497, 105−111.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (d) Razavi. A.; Peters, L.; Nafpliotis, L.; Vereecke, D.; Dendauw, K.; Atwood, J. L.; Thewald, U. Macromol. Symp. 1995, 89, 345−367.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(5) (a) Cossée, P. J. Catal. 1964, 3, 80−88.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Arlman, E. J. J. Catal. 1964, 3, 89−98.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Arlman, E. J.; Cossée, P. J. Catal. 1964, 3, 99−104.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(6) For a detailed mechanistic analysis employing Cs-symmetric metallocenes, see:  Veghini, D.; Henling, L.; Burkhardt, T.; Bercaw, J. E. J. Am. Chem. Soc. 1999, 121, 564−573.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(7) For reviews of homogeneous, metallocene-mediated Ziegler−Natta olefin polymerizations, see:  (a) Brintzinger, H.-H.; Fischer, D.; Mülhaupt, R.; Rieger, B.; Waymouth, R. M. Angew. Chem., Int. Ed. Engl. 1995, 34, 1143−1170, and references therein. (b) Janiak, C. In Metallocenes:  Synthesis, Reactivity, Applications; Togni, A.; Halterman, R. L., Eds.; Wiley-VCH:  Weinheim, 1998; pp 547−623. (c) Kaminsky, W., Ed. Metalorganic Catalysts for Synthesis and Polymerization, Recent Results by Ziegler−Natta and Metallocene Investigations; Springer:  Berlin, 1999. (d) Marks, T. J.; Stevens, J. C., Eds. Top. Catal. 1999, 7, 1−208. (e) Alt, H. G.; Köppl, A. Chem. Rev. 2000, 100, 1205−1221. (f) Coates, G. W. Chem. Rev. 2000, 100, 1223−1252. (g) Resconi, L.; Cavallo, L.; Fait, A.; Piemontesi, F. Chem. Rev. 2000, 100, 1253−1345. (h) Angermund, K.; Fink, G.; Jensen, V. R.; Kleinschmidt, R. Chem. Rev. 2000, 100, 1457−1470. (i) Scheirs, J., Kaminsky, W., Eds. Metallocene-Based Polyolefins:  Preparation, Properties and Technology; John Wiley \u0026 Sons:  New York, 2000. (j) Kaminsky, W.; Scholz, V.; Werner, R. Macromol. Symp. 2000, 159, 9−17. (k) Bochmann, M. J. Organomet. Chem. 2004, 689, 3982−3998.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(8) (a) Ewen, J. A.; Elder, M. J. Eur. Pat. Appl. EP 537130, 1993.OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Kaminsky, W.; Rabe, O.; Schauwienold, A.-M.; Schupfner, G. U.; Hanss, J.; Kopf, J. J. Organomet. Chem. 1995, 497, 181−193.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(9) A comparison of mechanisms for isoselective propylene polymerization using C1-symmetric metallocene precatalysts is given by:  Busico, V.; Cipullo, R.; Talarico, G.; Segre, A. L.; Chadwick, J. C. Macromolecules 1997, 30, 4786−4790.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nThe term “site epimerization mechanism” is used in preference to other terms found in the literature. The term “epimerization” (Eliel, E. L.; Wilen, S. H. Stereochemistry of Organic Compounds; Wiley-Interscience:  New York, 1994; p 1198) refers to the inversion of a single stereocenter when two or more are present and can be correctly applied to metallocene polymerizations when the stereochemistry of the metal is inverted while the stereocenters present on the polymer chain remain unchanged. (a) “Consecutive addition”:  Farina, M.; Terragni, A. Makromol. Chem., Rapid Commun. 1993, 14, 791−798. (b) “Skipped insertion”:  ref 2a. (c) “Skipped-out insertions” and “chain migratory catalyst isomerization”:  ref 2c. (d) “Back-skip mechanism”:  ref 2d. (e) “Retention mechanism”:  Di Silvestro, G.; Sozzani, P.; Terragni, A. Macromol. Chem. Phys. 1996, 197, 3209−3228. (f) “Isomerization without monomer insertion”:  Fink, G.; Herfert, N. Preprints of the International Symposium on Advances in Olefin, Cycloolefin, and Diolefin Polymerization; Lyon, 1992; p 15. (g) “Site-to-site chain migration”:  ref 3c. (h) “Side-to-side swing” and “back swing”:  ref 4a. (i) “Chain stationary insertion mechanism”:  ref 4b. (j) “Hindered chain migratory insertion”:  Razavi, A.; Bellia, V.; De Brauwer, Y.; Hortmann, K.; Lambrecht, M.; Miserque, O.; Peters, L.; Van Belle, S. In Metalorganic Catalysts for Synthesis and Polymerization, Recent Results by Ziegler−Natta and Metallocene Investigations; Kaminsky, W., Ed.; Springer:  Berlin, 1999; pp 236−247.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(11) Hefert, N.; Fink, G. Makromol. Chem. Macromol. Symp. 1993, 66, 157−178.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(12) Yoshida, T.; Koga, N.; Morokuma, K. Organometallics 1996, 15, 766−777.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(13) (a) van der Leek, Y.; Angermund, K.; Reffke, M.; Kleinschmidt, R.; Goretzki, R.; Fink, G. Chem. Eur. J. 1997, 3, 585−591.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Angermund, K.; Fink, G.; Jensen, V. R.; Kleinschmidt, R. Macromol. Rapid Commun. 2000, 21, 91−97.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(14) Corradini, P.; Cavallo, L.; Guerra, G. In Metallocene-Based Polyolefins; Scheirs, J., Kaminsky, W., Eds.; John Wiley \u0026 Sons:  New York, 2000; pp 3−36.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(15) Straightforward examples of propylene insertion into sterically encumbered sites do exist for C2-symmetric metallocenes:  (a) Resconi, L.; Piemontesi, F.; Camurati, I.; Sudmeijer, O.; Nifant'ev, I. E.; Ivchenko, P. V.; Kuz'mina, L. G. J. Am. Chem. Soc. 1998, 120, 2308−2321. (b) Resconi, L.; Balboni, D.; Baruzzi, G.; Fiori, C.; Guidotti, S.; Mercandelli, P.; Sironi, A. Organometallics 2000, 19, 420−429. This paper is concerned with the competitive insertion at open and encumbered sites when both are present in the same catalyst.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(16) Perturbations introduced by a chain epimerization mechanism are expected to be minimal and are neglected in the initial treatment presented here. (a) Busico, V.; Cipullo, R. J. Am. Chem. Soc. 1994, 116, 9329−9330. (b) Resconi, L.; Fait, A.; Piemontesi, F.; Colonnesi, M.; Rychlicki, H.; Zeigler, R. Macromolecules 1995, 28, 6667−6676. (c) Janiak, C. In Metallocenes:  Synthesis, Reactivity, Applications; Togni, A., Halterman, R. L., Eds.; Wiley-VCH:  Weinheim, 1998; p 596.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(17) (a) Farina, M. Top. Stereochem. 1987, 17, 1−111.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Ewen, J. A. J. Am. Chem. Soc. 1984, 106, 6355−6364.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(18) Related models have been developed. (a) Reference 17a. (b) Farina, M.; Di Silvestro, G.; Sozzani, P. Macromolecules 1993, 26, 946−950. (c) Farina, M.; Terragni, A. Makromol. Chem., Rapid Commun. 1993, 14, 791−798. (d) Farina, M.; Di Silvestro, G.; Terragni, A. Macromol. Chem. Phys. 1995, 196, 353−367. (e) Di Silvestro, G.; Sozzani, P.; Terragni, A. Macromol. Chem. Phys. 1996, 197, 3209−3228. (f) Reference 13a.[ACS Full Text ACS Full Text]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(19) A stochastic matrix method has been developed for C1-symmetric metallocene catalysts:  (a) Busico, V.; Cipullo, R.; Monaco, G.; Vacatello, M. Macromolecules 1997, 30, 6251−6263. (b) Busico, V.; Cipullo, R. Prog. Polym. Sci. 2001, 26, 443−533. (c) Reference 7g. However, the models in the Supporting Information section avoid matrix methods and are readily applied with common software programs such as Microsoft Excel.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nThe least-squares minimization was performed for the eight measured intensities (mmrm, rrmr, and mrmr were combined) according to RMS error = ((∑(Iobs − Icalc)2)/8)0.5. Cautionary note:  Comparisons of RMS errors and the resultant interpretations are always subject to the limitations inherent in the statistical model. To the extent that stereochemical behavior deviates from these idealized models, incorrect conclusions are increasingly possible. Additionally, errors as high 1−3% are typical for pentad distributions measured by 13C NMR for the polymers reported here.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(21) This includes polypropylenes made with metallocenes 3, 4, 6, 9, 13, 14, and 16.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(22) (a) Ewen, J. A.; Jones, R. L.; Elder, M. J. In Metalorganic Catalysts for Synthesis and Polymerization, Recent Results by Ziegler−Natta and Metallocene Investigations; Kaminsky, W., Ed.; Springer:  Berlin, 1999; pp 150−169.OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Kleinschmidt, R.; Reffke, M.; Fink, G. Macromol. Rapid Commun. 1999, 20, 284−288.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (c) Increasing isotacticity with decreasing monomer concentration has also been identified in heterogeneous propylene polymerization systems (ref 9).OpenURL CALIFORNIA INST OF TECHNOLOGY\n(23) (a) Guilhemat, R.; Pereyre, M.; Petraud, M. Bull. Soc. Chim. Fr. 1980, 2, 334−344.OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Gverdtsiteli, D. D.; Revazishvili, N. S.; Tsitsishvili, V. G.; Kikoladze, V. S. Soobshch. Akad. Nauk. Gruz. SSR 1989, 133 (1), 77−80; Chem. Abstr. 1989, 111, 214206.[CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(24) For reports of the Oct ligand see:  (a) Miller, S. A.; Bercaw, J. E. U.S. Patent 6,469,188, 2002. (b) Miller, S. A.; Bercaw, J. E. U.S. Patent 6,693,153, 2004. (c) Miller, S. A.; Bercaw, J. E. Organometallics 2004, 23, 1777−1789. (d) Irwin, L. J.; Reibenspies, J. H.; Miller, S. A. J. Am. Chem. Soc. 2004, 126, 16716−16717. (e) Irwin, L. J.; Miller, S. A. J. Am. Chem. Soc. 2005, 127, 9972−9973. (f) Irwin, L. J.; Reibenspies, J. H.; Miller, S. A. Polyhedron 2005, 24, 1314−1324.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(25) Crystals of 10 were grown from benzene/n-heptane and were triclinic P1̄, a = 9.286(3) Å, b = 17.711(6) Å, c = 17.903(6) Å, α = 61.037(14)°, β = 81.471(14)°, γ = 78.713(15)°, V = 2521.2(13) Å3, Z = 4, T = 98 K. Cambridge Crystallographic Data Center (CCDC, 12 Union Road, Cambridge CB2 1EZ, UK) deposition number 137698.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(26) The least-squares minimization was performed for the nine measured intensities according to RMS error = ((∑(Iobs − Icalc)2)/9)0.5.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(27) The statistical analyses for the remaining polymers are found in the Supporting Information.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(28) (a) Miller, S. A.; Bercaw, J. E. Organometallics 2002, 21, 934−945.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY (b) Miller, S. A. Macromolecules 2004, 37, 3983−3995.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(29) Patsidis, K.; Alt, H. G.; Milius, W.; Palackal, S. J. J. Organomet. Chem. 1996, 509, 63−71.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\nMiller, S. A. Ph.D. Thesis, California Institute of Technology, 2000, Chapter 2.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(31) Yano, A.; Kaneko, T.; Sato, M.; Akimoto, A. Macromol. Chem. Phys. 1999, 200, 2127−2135.[CrossRef], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(32) For previous examples of metallocenes bearing the 2-methyl-2-adamantyl substituent, see:  Abrams, M. B.; Yoder, J. C.; Loeber, C.; Day, M. W.; Bercaw, J. E. Organometallics 1999, 18, 1389−1401.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(33) 15/MAO is essentially inactive for ethylene polymerization as well (activity = 12 gP/(gZr·h) at 20 °C). To test the suggestion that this metallocene simply deactivates by aryl C−H activation, Me2C(3-(2-(CH2SiMe3)-2-adamantyl)-C5H3)(C13H8)ZrCl2 (17) was prepared and tested for its MAO-cocatalyzed propylene polymerization behavior.The small amount of amorphous polypropylene (activity = 460 gP/(gZr·h) at 20 °C) that was obtained is attributed to impurities present in the metallocene (likely Me2C(3-(2-adamantyl)-C5H3)(C13H8)ZrCl2 based on the synthetic procedure), and the lack of any isotactic polypropylene suggests that the aliphatic cyclopentadienyl substituent 2-(CH2SiMe3)-2-adamantyl effectively inhibits polymerization as well.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(34) In addition to low monomer concentration and high polymerization temperatures, the addition of methylene chloride has been observed to increase the relative rate of the site epimerization process for 1/MAO:  Fink, G.; Herfert, N.; Montag, P. In Ziegler Catalysts, Recent Scientific Innovations and Technological Improvements; Fink, G., Mülhaupt, R., Brintzinger, H.-H., Eds.; Springer:  Berlin, 1995; pp 159−179.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(35) Ewen, J. A.; Elder, M. J.; Jones, R. L.; Rheingold, A. L.; Liable-Sands, L. M.; Sommer, R. D. J. Am. Chem. Soc. 2001, 123, 4763−4773.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(36) Burger, B. J.; Bercaw, J. E. In Experimental Organometallic Chemistry:  A Practicum in Synthesis and Characterization, Vol. 357; Wayda, A. L., Darensbourg, M. Y., Eds.; American Chemical Society:  Washington D.C., 1987; pp 79−98.OpenURL CALIFORNIA INST OF TECHNOLOGY\n(37) Stone, K. J.; Little, R. D. J. Org. Chem. 1984, 49, 1849−1853.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(38) Alper, H.; Laycock, D. E. Synthesis 1980, 10, 799.[CrossRef]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(39) Okuda, J.; Schattenmann, F. J.; Wocadlo, S.; Massa, W. Organometallics 1995, 14, 789−795.[ACS Full Text ACS Full Text], [CAS]OpenURL CALIFORNIA INST OF TECHNOLOGY\n(a) Busico, V.; Cipullo, R.; Corradini, P.; Landriani, L.; Vacatello, M.; Segre, A. L. Macromolecules 1995, 28, 1887−1892."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Mechanism of Isotactic Polypropylene Formation with C1-Symmetric Metallocene Catalysts\nStephen A. Miller and John E. Bercaw\nOrganometallics 2006 25 (15), 3576-3592\nDOI: 10.1021/om050841k","other_numbering_system":null,"funders":[{"agency":"Department of Energy (DOE)","grant_number":"DE-FG03-85ER13431"},{"agency":"Exxon Chemicals America","grant_number":""},{"agency":"NSF","grant_number":"CHE-0131180"},{"agency":"National Defense Science and Engineering Graduate (NDSEG) Fellowship","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}