{"title":"Tetranuclear Manganese Models of the OEC Displaying Hydrogen Bonding Interactions: Application to Electrocatalytic Water Oxidation to Hydrogen Peroxide","uri":"","abstract":"Toward the development of structural and functional models of the oxygen evolving complex (OEC) of photosystem II (PSII), we report the synthesis of site-differentiated tetranuclear manganese complexes featuring three six-coordinate and one five-coordinate Mn centers. To incorporate biologically relevant second coordination sphere interactions, substituents capable of hydrogen bonding are included as pyrazolates with phenylamino groups. Complexes with terminal anionic ligands, OH− or Cl−, bound to the lower coordinate metal center are supported through the hydrogen-bonding network in a fashion reminiscent to the enzymatic active site. The hydroxide complex was found to to be a competent electrocatalyst for O-O bond formation, a key transformation pertinent to the OEC. In an acetonitrile-water mixture, at neutral pH, electrochemical water oxidation to hydrogen peroxide was observed, albeit with low (15%) Faradaic yield, likely due to competing reactions with organics. In agreement, 9,10-dihydroanthracene is electrochemically oxidized in the presence of this cluster both via H-atom abstraction and oxygena-tion at ~50% combined Faradaic yield.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253395","docid":253395,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268229","fileid":1268229,"datasetid":"document","objectid":253395,"filename":"jacs%2E7b03044.pdf","mime_type":"application/pdf","hash":"39f58751019737cd44b5890aa2b518c2","hash_type":"MD5","filesize":1268161,"mtime":"2017-06-08 22:22:25","url":"http://authors.library.caltech.edu/78037/1/jacs%252E7b03044.pdf"}],"eprintid":78037,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"jacs%2E7b03044.pdf","content":"accepted"}],"note":"© 2017 American Chemical Society. \n\nReceived 27 March 2017. Published online 6 June 2017. \n\nThis research was supported by the NIH (R01-GM102687A). We\nthank L. M. Henling for assistance with crystallography, J.C. Tran for assistance with the characterization of the 4-tBuC_6H_4NHPzH, and B. M. Hunter for helpful discussion on H_2O_2 detection.","id":78037,"rev_number":6,"userid":772,"eprint_dir":"disk0/00/07/80/37","datestamp":"2017-06-08 23:49:57","lastmod":"2017-06-08 23:49:57","status_changed":"2017-06-08 23:49:57","type":"article","metadata_visibility":"show","creators":[{"given":"Zhiji","family":"Han","id":"Han-Zhiji","orcid":""},{"given":"Kyle T.","family":"Horak","id":"Horak-K-T","orcid":""},{"given":"Heui Beom","family":"Lee","id":"Lee-Heui-Beom","orcid":""},{"given":"Theodor","family":"Agapie","id":"Agapie-T","orcid":"0000-0002-9692-7614"}],"ispublished":"inpress","subjects":null,"full_text_status":"public","keywords":"","date":"2017-06-06","date_type":"inpress","publication":"Journal of the American Chemical Society","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170608-152145891","refereed":true,"issn":"0002-7863","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170608-152145891","related_url":[{"url":"http://dx.doi.org/10.1021/jacs.7b03044","type":"doi","description":"Article"},{"url":"http://pubs.acs.org/doi/abs/10.1021/jacs.7b03044","type":"pub","description":"Article"}],"referencetext":["1. (a) Lewis, N. S.; Nocera, D. G., Proc. Natl. Acad. Sci. U.S.A. 2006,\n103, 15729-15735; (b) Gray, H. B., Nat. Chem. 2009, 1, 7-7.\n2. (a) Yano, J.; Yachandra, V., Chem. Rev. 2014, 114, 4175-4205; (b)\nBlakemore, J. D.; Crabtree, R. H.; Brudvig, G. W., Chem. Rev. 2015,\n115, 12974-13005; (c) Vinyard, D. J.; Ananyev, G. M.; Dismukes, G.\nC., Annu. Rev. Biochem. 2013, 82, 577-606; (d) Kärkäs, M. D.;\nÅkermark, B., Dalton Trans. 2016, 45, 14421-14461.\n3. (a) Ferreira, K. N.; Iverson, T. M.; Maghlaoui, K.; Barber, J.; Iwata,\nS., Science 2004, 303, 1831-1838; (b) Umena, Y.; Kawakami, K.;\nShen, J. R.; Kamiya, N., Nature 2011, 473, 55-65; (c) Suga, M.; Akita,\nF.; Hirata, K.; Ueno, G.; Murakami, H.; Nakajima, Y.; Shimizu, T.;\nYamashita, K.; Yamamoto, M.; Ago, H.; Shen, J. R., Nature 2015, 517,\n99-103; (d) Young, I. D.; Ibrahim, M.; Chatterjee, R.; Gul, S.; Fuller, F.\nD.; Koroidov, S.; Brewster, A. S.; Tran, R.; Alonso-Mori, R.; Kroll, T.;\nal., e., Nature 2016, 540, 453-457.\n4. Cox, N.; Retegan, M.; Neese, F.; Pantazis, D. A.; Boussac, A.; Lubitz,\nW., Science 2014, 345, 804-808.\n5. Tsui, E. Y.; Kanady, J. S.; Agapie, T., Inorg. Chem. 2013, 52, 13833-\n13848.\n6. (a) Zhang, C. X.; Chen, C. H.; Dong, H. X.; Shen, J. R.; Dau, H.;\nZhao, J. Q., Science 2015, 348, 690-693; (b) Kanady, J. S.; Lin, P. H.;\nCarsch, K. M.; Nielsen, R. J.; Takase, M. K.; Goddard, W. A.; Agapie,\nT., J. Am. Chem. Soc. 2014, 136, 14373-14376; (c) Mukherjee, S.;\nStull, J. A.; Yano, J.; Stamatatos, T. C.; Pringouri, K.; Stich, T. A.;\nAbboud, K. A.; Britt, R. D.; Yachandra, V. K.; Christou, G., Proc. Natl.\nAcad. Sci. U.S.A. 2012, 109, 2257-2262; (d) Kanady, J. S.; Tsui, E. Y.;\nDay, M. W.; Agapie, T., Science 2011, 333, 733-736.\n7. (a) Limburg, J.; Vrettos, J. S.; Liable-Sands, L. M.; Rheingold, A. L.;\nCrabtree, R. H.; Brudvig, G. W., Science 1999, 283, 1524-1527; (b)\nNaruta, Y.; Sasayama, M.; Sasaki, T., Angew. Chem. Int. Ed. 1994, 33,\n1839-1841; (c) Karlsson, E. A.; Lee, B. L.; Åkermark, T.; Johnston, E.\nV.; Kärkäs, M. D.; Sun, J. L.; Hansson, O.; Bäckvall, J.; Åkermark, B.,\nAngew. Chem. Int. Ed. 2011, 50, 11715-11718; (d) Najafpour, M. M.;\nRenger, G.; Holynska, M.; Moghaddam, A. N.; Aro, E. M.; Carpentier,\nR.; Nishihara, H.; Eaton-Rye, J. J.; Shen, J. R.; Allakhverdiev, S. I.,\nChem. Rev. 2016, 116, 2886-2936; (e) Poulsen, A. K.; Rompel, A.;\nMcKenzie, C. J., Angew. Chem. Int. Ed. 2005, 44, 6916-6920; (f)\nBeckmann, K.; Uchtenhagen, H.; Berggren, G.; Anderlund, M. F.;\nThapper, A.; Messinger, J.; Styring, S.; Kurz, P., Energ. Environ. Sci.\n2008, 1, 668-676; (g) Ruettinger, W.; Yagi, M.; Wolf, K.; Bernasek, S.;\nDismukes, G. C., J. Am. Chem. Soc. 2000, 122, 10353-10357; (h)\nBrimblecombe, R.; Kolling, D. R. J.; Bond, A. M.; Dismukes, G. C.;\nSwiegers, G. F.; Spiccia, L., Inorg. Chem. 2009, 48, 7269-7279; (i)\nDismukes, G. C.; Brimblecombe, R.; Felton, G. A. N.; Pryadun, R. S.;\nSheats, J. E.; Spiccia, L.; Swiegers, G. F., Acc. Chem. Res. 2009, 42,\n1935-1943.\n8. (a) Evangelisti, F.; More, R.; Hodel, F.; Luber, S.; Patzke, G. R., J.\nAm. Chem. Soc. 2015, 137, 11076-11084; (b) Yin, Q. S.; Tan, J. M.;\nBesson, C.; Geletii, Y. V.; Musaev, D. G.; Kuznetsov, A. E.; Luo, Z.;\nHardcastle, K. I.; Hill, C. L., Science 2010, 328, 342-345; (c) Stracke,\nJ. J.; Finke, R. G., J. Am. Chem. Soc. 2011, 133, 14872-14875; (d)\nBrimblecombe, R.; Swiegers, G. F.; Dismukes, G. C.; Spiccia, L.,\nAngew. Chem. Int. Ed. 2008, 47, 7335-7338; (e) Hocking, R. K.;\nBrimblecombe, R.; Chang, L. Y.; Singh, A.; Cheah, M. H.; Glover, C.;\nCasey, W. H.; Spiccia, L., Nat. Chem. 2011, 3, 461-466; (f) McCool,\nN. S.; Robinson, D. M.; Sheats, J. E.; Dismukes, G. C., J. Am. Chem.\nSoc. 2011, 133, 11446-11449; (g) Berardi, S.; La Ganga, G.; Natali,\nM.; Bazzan, I.; Puntoriero, F.; Sartorel, A.; Scandola, F.; Campagna, S.;\nBonchio, M., J. Am. Chem. Soc. 2012, 134, 11104-11107; (h) Smith,\nP. F.; Kaplan, C.; Sheats, J. E.; Robinson, D. M.; McCool, N. S.; Mezle,\nN.; Dismukes, G. C., Inorg. Chem. 2014, 53, 2113-2121; (i) Ullman,\nA. M.; Liu, Y.; Huynh, M.; Bediako, D. K.; Wang, H. S.; Anderson, B.\nL.; Powers, D. C.; Breen, J. J.; Abruna, H. D.; Nocera, D. G., J. Am.\nChem. Soc. 2014, 136, 17681-17688; (j) Nguyen, A. I.; Ziegler, M. S.;\nOna-Burgos, P.; Sturzbecher-Hohne, M.; Kim, W.; Bellone, D. E.;\nTilley, T. D., J. Am. Chem. Soc. 2015, 137, 12865-12872; (k) Smith,\nP. F.; Hunt, L.; Laursen, A. B.; Sagar, V.; Kaushik, S.; Calvinho, K. U.\nD.; Marotta, G.; Mosconi, E.; De Angelis, F.; Dismukes, G. C., J. Am.\nChem. Soc. 2015, 137, 15460-15468; (l) Okamura, M.; Kondo, M.;\nKuga, R.; Kurashige, Y.; Yanai, T.; Hayami, S.; Praneeth, V. K. K.;\nYoshida, M.; Yoneda, K.; Kawata, S.; Masaoka, S., Nature 2016, 530,\n465-468; (m) Cady, C. W.; Crabtree, R. H.; Brudvig, G. W., Coord.\nChem. Rev. 2008, 252, 444-455.\n9. Weinberg, D. R.; Gagliardi, C. J.; Hull, J. F.; Murphy, C. F.; Kent, C.\nA.; Westlake, B. C.; Paul, A.; Ess, D. H.; McCafferty, D. G.; Meyer, T.\nJ., Chem. Rev. 2012, 112, 4016-4093.\n10. (a) Shirin, Z.; Hammes, B. S.; Young, V. G.; Borovik, A. S., J. Am.\nChem. Soc. 2000, 122, 1836-1837; (b) MacBeth, C. E.; Gupta, R.;\nMitchell-Koch, K. R.; Young, V. G.; Lushington, G. H.; Thompson, W.\nH.; Hendrich, M. P.; Borovik, A. S., J. Am. Chem. Soc. 2004, 126,\n2556-2567; (c) Shook, R. L.; Peterson, S. M.; Greaves, J.; Moore, C.;\nRheingold, A. L.; Borovik, A. S., J. Am. Chem. Soc. 2011, 133, 5810-\n5817; (d) Borovik, A. S., Acc. Chem. Res. 2005, 38, 54-61; (e) Ford,\nC. L.; Park, Y. J.; Matson, E. M.; Gordon, Z.; Fout, A. R., Science\n2016, 354, 741-743; (f) Zong, R.; Thummel, R. P., J. Am. Chem. Soc.\n2005, 127, 12802-12803; (g) Dogutan, D. K.; McGuire, R.; Nocera,\nD. G., J. Am. Chem. Soc. 2011, 133, 9178-9180; (h) Chang, C. J.;\nChng, L. L.; Nocera, D. G., J. Am. Chem. Soc. 2003, 125, 1866-1876;\n(i) Carver, C. T.; Matson, B. D.; Mayer, J. M., J. Am. Chem. Soc.\n2012, 134, 5444-5447; (j) Rigsby, M. L.; Wasylenko, D. J.; Pegis, M.\nL.; Mayer, J. M., J. Am. Chem. Soc. 2015, 137, 4296-4299.\n11. A CSD search of small Mn clusters displaying terminal hydroxide\nligands resulted in few examples characterized by crystallography: (a)\nWieghardt, K.; Bossek, U.; Nuber, B.; Weiss, J.; Bonvoisin, J.; Corbella,\nM.; Vitols, S. E.; Girerd, J. J., J. Am. Chem. Soc. 1988, 110, 7398-\n7411; (b) Pal, S.; Armstrong, W. H., Inorg. Chem. 1992, 31, 5417-\n5423; (c) Pal, S.; Chan, M. K.; Armstrong, W. H., J. Am. Chem. Soc.\n1992, 114, 6398-6406; (d) Chen, H. Y.; Collomb, M. N.; Duboc, C.;\nBlondin, G.; Riviere, E.; Faller, J. W.; Crabtree, R. H.; Brudvig, G. W.,\nInorg. Chem. 2005, 44, 9567-9573; (e) Corbella, M.; Costa, R.; Ribas,\nJ.; Fries, P. H.; Latour, J. M.; Ohrstrom, L.; Solans, X.; Rodriguez, V.,\nInorg. Chem. 1996, 35, 1857-1865; (f) Ng, G. K. Y.; Ziller, J. W.;\nBorovik, A. S., Chem. Commun. 2012, 48, 2546-2548.\n12. Tsui, E. Y.; Kanady, J. S.; Day, M. W.; Agapie, T., Chem. Commun.\n2011, 47, 4189-4191.\n13. (a) de Ruiter, G.; Thompson, N. B.; Lionetti, D.; Agapie, T., J. Am.\nChem. Soc. 2015, 137, 14094-14106; (b) de Ruiter, G.; Thompson,\nN. B.; Takase, M. K.; Agapie, T., J. Am. Chem. Soc. 2016, 138, 1486-\n1489; (c) de Ruiter, G.; Carsch, K. M.; Gul, S.; Chatterjee, R.;\nThompson, N. B.; Takase, M. K.; Yano, J.; Agapie, T., Angew. Chem.\nInt. Ed. 2017, 56, 4772-4776. (d) Kanady, J. S.; Tran, R.; Stull, J. A.;\nLu, L.; Stich, T. A.; Day, M. W.; Yano, J.; Britt, R. D.; Agapie, T., Chem.\nSci. 2013, 4, 3986-3996.\n14. Sickerman, N. S.; Park, Y. J.; Ng, G. K. Y.; Bates, J. E.; Hilkert, M.;\nZiller, J. W.; Furche, F.; Borovik, A. S., Dalton Trans. 2012, 41, 4358-\n4364.\n15. Zhou, M. J.; Diwu, Z. J.; PanchukVoloshina, N.; Haugland, R. P.,\nAnal. Biochem. 1997, 253, 162-168.\n16. Pegis, M. L.; Roberts, J. A. S.; Wasylenko, D. J.; Mader, E. A.; Appel,\nA. M.; Mayer, J. M., Inorg. Chem. 2015, 54, 11883-11888.\n17. A MnOx catalyst has been shown to produce H2O2 only at basic\npH: Izgorodin, A.; Izgorodina, E.; MacFarlane, D. R., Energ. Environ.\nSci. 2012, 5, 9496-9501."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Tetranuclear Manganese Models of the OEC Displaying Hydrogen Bonding Interactions: Application to Electrocatalytic Water Oxidation to Hydrogen Peroxide\nZhiji Han, Kyle T. Horak, Heui Beom Lee, and Theodor Agapie\nJournal of the American Chemical Society Just Accepted Manuscript\nDOI: 10.1021/jacs.7b03044","other_numbering_system":null,"funders":[{"agency":"NIH","grant_number":"R01-GM102687A"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}