{"title":"Looking through the same lens: Shear calibration for LSST, Euclid, and WFIRST with stage 4 CMB lensing","uri":"","abstract":"The next-generation weak lensing surveys (i.e., LSST, Euclid, and WFIRST) will require exquisite control over systematic effects. In this paper, we address shear calibration and present the most realistic forecast to date for LSST/Euclid/WFIRST and CMB lensing from a stage 4 CMB experiment (“CMB S4”). We use the cosmolike code to simulate a joint analysis of all the two-point functions of galaxy density, galaxy shear, and CMB lensing convergence. We include the full Gaussian and non-Gaussian covariances and explore the resulting joint likelihood with Monte Carlo Markov chains. We constrain shear calibration biases while simultaneously varying cosmological parameters, galaxy biases, and photometric redshift uncertainties. We find that CMB lensing from CMB S4 enables the calibration of the shear biases down to 0.2%–3% in ten tomographic bins for LSST (below the \n∼\n0.5\n%\n requirements in most tomographic bins), down to 0.4%–2.4% in ten bins for Euclid, and 0.6%–3.2% in ten bins for WFIRST. For a given lensing survey, the method works best at high redshift where shear calibration is otherwise most challenging. This self-calibration is robust to Gaussian photometric redshift uncertainties and to a reasonable level of intrinsic alignment. It is also robust to changes in the beam and the effectiveness of the component separation of the CMB experiment, and slowly dependent on its depth, making it possible with third-generation CMB experiments such as AdvACT and SPT-3G, as well as the Simons Observatory.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253389","docid":253389,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268182","fileid":1268182,"datasetid":"document","objectid":253389,"filename":"PhysRevD.95.123512.pdf","mime_type":"application/pdf","hash":"74a2346fc735af7e9d8e8b45fa06670c","hash_type":"MD5","filesize":2601605,"mtime":"2017-06-08 21:18:59","url":"http://authors.library.caltech.edu/78035/1/PhysRevD.95.123512.pdf"}],"eprintid":78035,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"PhysRevD.95.123512.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/253392","docid":253392,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268216","fileid":1268216,"datasetid":"document","objectid":253392,"filename":"1607.01761.pdf","mime_type":"application/pdf","hash":"65cb9b1cd7665b9141b82cfed813049c","hash_type":"MD5","filesize":8121429,"mtime":"2017-06-08 22:01:00","url":"http://authors.library.caltech.edu/78035/2/1607.01761.pdf"}],"eprintid":78035,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1607.01761.pdf","content":"submitted"}],"note":"© 2017 American Physical Society. \n\nReceived 20 August 2016. Published 8 June 2017. \n\nWe thank Patricia Burchat, Scott Dodelson, Jo Dunkley, Simone Ferraro, Colin Hill, Gil Holder, Bhuvnesh Jain, Alexie Leauthaud, Jia Liu, Mathew Madhavacheril, Rachel Mandelbaum, Roland de Putter, Uroš Seljak, Blake Sherwin, Sukhdeep Singh, and Martin White for useful discussions about shear calibration with CMB lensing. We thank Bob Armstrong, Eric Huff, and Peter Melchior for useful discussions about shear systematics. We thank Elisa Chisari, Rachel Mandelbaum, and Sukhdeep Singh for useful discussions about intrinsic alignments. We thank Scott Dodelson, Jo Dunkley, Simone Ferraro, Bhuvnesh Jain, Rachel Mandelbaum, Peter Melchior, and Sukhdeep Singh for feedback on an earlier version of this paper. We thank the referee for useful comments. Numerical calculations in this work were carried out using computational resources supported by the Princeton Institute of Computational Science and Engineering. We thank Jim Stone and the Computational Science and Engineering Support for access to these resources and invaluable help. E. S. was supported, in part, by a Jet Propulsion Laboratory (JPL) Strategic Universities Research Partnership grant. J. R., T. E., and H. M. were supported by JPL, which is operated by Caltech under a contract from National Aeronautics and Space Administration (NASA). Part of the research described in this paper was carried out at the JPL, California Institute of Technology, under a contract with the NASA.","id":78035,"rev_number":10,"userid":772,"eprint_dir":"disk0/00/07/80/35","datestamp":"2017-06-09 16:13:02","lastmod":"2017-06-09 16:13:02","status_changed":"2017-06-09 16:13:02","type":"article","metadata_visibility":"show","creators":[{"given":"Emmanuel","family":"Schaan","id":"Schaan-E","orcid":""},{"given":"Elisabeth","family":"Krause","id":"Krause-E","orcid":""},{"given":"Tim","family":"Eifler","id":"Eifler-T","orcid":""},{"given":"Olivier","family":"Doré","id":"Doré-O","orcid":"0000-0002-5009-7563"},{"given":"Hironao","family":"Miyatake","id":"Miyatake-Hironao","orcid":""},{"given":"Jason","family":"Rhodes","id":"Rhodes-J","orcid":""},{"given":"David N.","family":"Spergel","id":"Spergel-D-N","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-06-15","date_type":"published","publication":"Physical Review D","volume":"95","number":"12","pagerange":"Art. No. 123512","id_number":"CaltechAUTHORS:20170608-141835036","refereed":true,"issn":"2470-0010","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170608-141835036","related_url":[{"url":"https://doi.org/10.1103/PhysRevD.95.123512","type":"doi","description":"Article"},{"url":"https://journals.aps.org/prd/abstract/10.1103/PhysRevD.95.123512","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1607.01761","type":"arxiv","description":"Discussion Paper"}],"referencetext":["[1] See http://www.astro‑wise.org/projects/KIDS.\n[2] See http://www.darkenergysurvey.org.\n[3] The Dark Energy Survey Collaboration, arXiv:astro-ph/\n0510346.\n[4] See http://www.naoj.org/Projects/HSC/index.html.\n[5] S. Miyazaki, Y. Komiyama, H. Nakaya, Y. Doi, H.\nFurusawa, P. Gillingham, Y. Kamata, K. Takeshi, and K.\nNariai, Proc. SPIE Int. Soc. Opt. Eng. 6269, 62690B (2006).\n[6] See http://sumire.ipmu.jp/en/2652.\n[7] M. Takada, R. Ellis, M. Chiba, J. E. Greene, H. Aihara, N.\nArimoto, K. Bundy, J. Cohen, O. Doré, G. Graves et al.,\nPubl. Astron. Soc. Jpn. 66, R1 (2014).\n[8] See http://desi.lbl.gov.\n[9] P. A. Abell, J. Allison, S. F. Anderson, J. R. Andrew, J. R. P.\nAngel, L. Armus, D. Arnett, S. J. Asztalos, T. S. Axelrod\net al. (LSST Science Collaboration), arXiv:0912.0201.\n[10] R. Laureijs, J. Amiaux, S. Arduini, J. Auguères, J.\nBrinchmann, R. Cole, M. Cropper, C. Dabin, L. Duvet,\nA. Ealet et al., arXiv:1110.3193.\n[11] D. Spergel, N. Gehrels, J. Breckinridge, M. Donahue, A.\nDressler, B. S. Gaudi, T. Greene, O. Guyon, C. Hirata, J.\nKalirai et al., arXiv:1305.5425.\n[12] D. H. Weinberg, M. J. Mortonson, D. J. Eisenstein, C.\nHirata, A. G. Riess, and E. Rozo, Phys. Rep. 530, 87\n(2013).\n[13] A. Albrecht, G. Bernstein, R. Cahn, W. L. Freedman, J.\nHewitt, W. Hu, J. Huth, M. Kamionkowski, E.W. Kolb, L.\nKnox et al., arXiv:astro-ph/0609591.\n[14] D. Huterer, M. Takada, G. Bernstein, and B. Jain, Mon.\nNot. R. Astron. Soc. 366, 101 (2006).\n[15] Z. Ma and G. Bernstein, Astrophys. J. 682, 39 (2008).\n[16] D. H. Rudd, A. R. Zentner, and A. V. Kravtsov, Astrophys.\nJ. 672, 19 (2008).\n[17] A. R. Zentner, D. H. Rudd, and W. Hu, Phys. Rev. D 77,\n043507 (2008).\n[18] T. Eifler, Mon. Not. R. Astron. Soc. 418, 536 (2011).\n[19] M. P. van Daalen, J. Schaye, C. M. Booth, and C. D.\nVecchia, Mon. Not. R. Astron. Soc. 415, 3649 (2011).\n[20] M. P. van Daalen, J. Schaye, I. G. McCarthy, C.M. Booth,\nand C. D. Vecchia, Mon. Not. R. Astron. Soc. 440, 2997\n(2014).\n[21] M. Velliscig, M. P. van Daalen, J. Schaye, I. G. McCarthy,\nM. Cacciato, A. M. C. Le Brun, and C. D. Vecchia, Mon.\nNot. R. Astron. Soc. 442, 2641 (2014).\n[22] T. Eifler, E. Krause, S. Dodelson, A. R. Zentner, A. P.\nHearin, and N. Y. Gnedin, Mon. Not. R. Astron. Soc. 454,\n2451 (2015).\n[23] K. Osato, M. Shirasaki, and N. Yoshida, Astrophys. J. 806,\n186 (2015).\n[24] W. A. Hellwing, M. Schaller, C. S. Frenk, T. Theuns, J.\nSchaye, R. G. Bower, and R. A. Crain, Mon. Not. R.\nAstron. Soc. 461, L11 (2016).\n[25] A. Kiessling, M. Cacciato, B. Joachimi, D. Kirk, T. D.\nKitching, A. Leonard, R. Mandelbaum, B. M. Schäfer, C.\nSifón, M. L. Brown, and A. Rassat, Space Sci. Rev. 193, 67\n(2015).\n[26] D. Kirk, M. L. Brown, H. Hoekstra, B. Joachimi, T. D.\nKitching, R. Mandelbaum, C. Sifón, M. Cacciato, A. Choi,\nA. Kiessling, A. Leonard, A. Rassat, and B. M. Schäfer,\nSpace Sci. Rev. 193, 139 (2015).\n[27] B. Joachimi, M. Cacciato, T. D. Kitching, A. Leonard, R.\nMandelbaum, B. M. Schäfer, C. Sifón, H. Hoekstra, A.\nKiessling, D. Kirk, and A. Rassat, Space Sci. Rev. 193, 1\n(2015).\n[28] M. A. Troxel and M. Ishak, Phys. Rep. 558, 1 (2015).\n[29] R. Massey, H. Hoekstra, T. Kitching, J. Rhodes,\nM. Cropper, J. Amiaux, D. Harvey, Y. Mellier, M.\nMeneghetti, L. Miller et al., Mon. Not. R. Astron. Soc.\n429, 661 (2013).\n[30] M. Jarvis, E. Sheldon, J. Zuntz, T. Kacprzak, S. L. Bridle,\nA. Amara, R. Armstrong, M. R. Becker, G.M. Bernstein,\nand C. Bonnett, Mon. Not. R. Astron. Soc. 460, 2245\n(2016).\n[31] I. Fenech Conti, R. Herbonnet, H. Hoekstra, J. Merten, L.\nMiller, and M. Viola, arXiv:1606.05337 [Mon. Not. R.\nAstron. Soc. (to be published)].\n[32] R. Mandelbaum, B. Rowe, R. Armstrong, D. Bard, E.\nBertin, J. Bosch, D. Boutigny, F. Courbin, W. A. Dawson,\nA. Donnarumma et al., Mon. Not. R. Astron. Soc. 450,\n2963 (2015).\n[33] M. Zaldarriaga and U. Seljak, Phys. Rev. D 59, 123507\n(1999).\n[34] W. Hu and T. Okamoto, Astrophys. J. 574, 566 (2002).\n[35] T. Okamoto and W. Hu, Phys. Rev. D 67, 083002 (2003).\n[36] A. Vallinotto, Astrophys. J. 759, 32 (2012).\n[37] A. Vallinotto, Astrophys. J. 778, 108 (2013).\n[38] S. Das, J. Errard, and D. Spergel, arXiv:1311.2338.\n[39] K. M. Smith, O. Zahn, and O. Doré, Phys. Rev. D 76,\n043510 (2007).\n[40] C. M. Hirata, S. Ho, N. Padmanabhan, U. Seljak, and N. A.\nBahcall, Phys. Rev. D 78, 043520 (2008).\n[41] S. Das, B. D. Sherwin, P. Aguirre, J.W. Appel, J. R. Bond,\nC. S. Carvalho, M. J. Devlin, J. Dunkley, R. Dünner, T.\nEssinger-Hileman et al., Phys. Rev. Lett. 107, 021301\n(2011).\n[42] S. Das, T. Louis, M. R. Nolta, G. E. Addison, E. S.\nBattistelli, J. R. Bond, E. Calabrese, D. Crichton, M. J.\nDevlin, S. Dicker et al., J. Cosmol. Astropart. Phys. 04\n(2014) 014.\n[43] M. Madhavacheril, N. Sehgal, R. Allison, N. Battaglia, J.\nR. Bond, E. Calabrese, J. Caliguiri, K. Coughlin, D.\nCrichton, R. Datta et al. (Atacama Cosmology Telescope\nCollaboration), Phys. Rev. Lett. 114, 151302 (2015).\n[44] A. van Engelen, B. D. Sherwin, N. Sehgal, G. E. Addison,\nR. Allison, N. Battaglia, F. de Bernardis, J. R. Bond, E.\nCalabrese, K. Coughlin, D. Crichton et al., Astrophys. J.\n808, 7 (2015).\n[45] A. van Engelen, R. Keisler, O. Zahn, K. A. Aird, B. A.\nBenson, L. E. Bleem, J. E. Carlstrom, C. L. Chang, H. M.\nCho, T. M. Crawford et al., Astrophys. J. 756, 142 (2012).\n[46] E. J. Baxter, R. Keisler, S. Dodelson, K. A. Aird, S.W.\nAllen, M. L. N. Ashby, M. Bautz, M. Bayliss, B. A.\nBenson, L. E. Bleem et al., Astrophys. J. 806, 247 (2015).\n[47] K. T. Story, D. Hanson, P. A. R. Ade, K. A. Aird, J. E.\nAustermann, J. A. Beall, A. N. Bender, B. A. Benson, L. E.\nBleem, J. E. Carlstrom et al., Astrophys. J. 810, 50 (2015).\n[48] P. A. R. Ade, Y. Akiba, A. E. Anthony, K. Arnold, M.\nAtlas, D. Barron, D. Boettger, J. Borrill, S. Chapman, Y.\nChinone et al. (Polarbear Collaboration), Phys. Rev. Lett.\n113, 021301 (2014).\n49] P. A. R. Ade, N. Aghanim, C. Armitage-Caplan, M.\nArnaud, M. Ashdown, F. Atrio-Barandela, J. Aumont,\nC. Baccigalupi, A. J. Banday et al. (Planck Collaboration),\nAstron. Astrophys. 571, A17 (2014).\n[50] P. A. R. Ade, N. Aghanim, M. Arnaud, M. Ashdown, J.\nAumont, C. Baccigalupi, A. J. Banday, R. B. Barreiro,\nJ. G. Bartlett et al. (Planck Collaboratino), Astron. Astrophys.\n594, A15 (2016).\n[51] P. A. R. Ade, Z. Ahmed, R.W. Aikin, K. D. Alexander, D.\nBarkats, S. J. Benton, C. A. Bischoff, J. J. Bock, R.\nBowens-Rubin, J. A. Brevik et al. (T. Keck Array and\nBICEP2 Collaborations), Astrophys. J. 833, 228 (2016).\n[52] S.W. Henderson, R. Allison, J. Austermann, T. Baildon,\nN. Battaglia, J. A. Beall, D. Becker, F. De Bernardis, J. R.\nBond, E. Calabrese et al., J. Low Temp. Phys. 184, 772\n(2016).\n[53] B. A. Benson, P. A. R. Ade, Z. Ahmed, S.W. Allen, K.\nArnold, J. E. Austermann, A. N. Bender, L. E. Bleem, J. E.\nCarlstrom, C. L. Chang et al., Proc. SPIE Int. Soc. Opt.\nEng. 9153, 91531P (2014).\n[54] K. N. Abazajian, K. Arnold, J. Austermann, B. A. Benson,\nC. Bischoff, J. Bock, J. R. Bond, J. Borrill, E. Calabrese, J.\nE. Carlstrom et al., Astropart. Phys. 63, 66 (2015).\n[55] K. N. Abazajian, K. Arnold, J. Austermann, B. A. Benson,\nC. Bischoff, J. Bock, J. R. Bond, J. Borrill, I. Buder, D. L.\nBurke et al., Astropart. Phys. 63, 55 (2015).\n[56] See https://simonsobservatory.org/index.html.\n[57] J. Liu, A. Ortiz-Vazquez, and J. C. Hill, Phys. Rev. D 93,\n103508 (2016).\n[58] E. J. Baxter, J. Clampitt, T. Giannantonio, S. Dodelson, B.\nJain, D. Huterer, L. E. Bleem, T. M. Crawford, G.\nEfstathiou, P. Fosalba et al., Mon. Not. R. Astron. Soc.\n461, 4099 (2016).\n[59] N. Hand, A. Leauthaud, S. Das, B. D. Sherwin, G. E.\nAddison, J. R. Bond, E. Calabrese, A. Charbonnier,\nM. J. Devlin, J. Dunkley et al., Phys. Rev. D 91,\n062001 (2015).\n[60] J. Liu and J. C. Hill, Phys. Rev. D 92, 063517 (2015).\n[61] D. Kirk, Y. Omori, A. Benoit-Lévy, R. Cawthon, C.\nChang, P. Larsen, A. Amara, D. Bacon, T.M. Crawford,\nS. Dodelson et al., Mon. Not. R. Astron. Soc. 459, 21\n(2016).\n[62] J. Harnois-Déraps, T. Tröster, A. Hojjati, L. van\nWaerbeke, M. Asgari, A. Choi, T. Erben, C. Heymans,\nH. Hildebrandt, T. D. Kitching et al., Mon. Not. R. Astron.\nSoc. 460, 434 (2016).\n[63] T. D. Kitching, A. F. Heavens, and S. Das, Mon. Not. R.\nAstron. Soc. 449, 2205 (2015).\n[64] H. Miyatake, M. S. Madhavacheril, N. Sehgal, A. Slosar,\nD. N. Spergel, B. Sherwin, and A. van Engelen, Phys. Rev.\nLett. 118, 161301 (2017).\n[65] S. Singh, R. Mandelbaum, and J. R. Brownstein, Mon.\nNot. R. Astron. Soc. 464, 2120 (2017).\n[66] T. Eifler, E. Krause, P. Schneider, and K. Honscheid, Mon.\nNot. R. Astron. Soc. 440, 1379 (2014).\n[67] C. M. Hirata and U. Seljak, Phys. Rev. D 67, 043001\n(2003).\n[68] C. M. Hirata and U. Seljak, Phys. Rev. D 68, 083002\n(2003).\n[69] E. Krause and T. Eifler, arXiv:1601.05779.\n[70] E. Rozo, E. S. Rykoff, A. Abate, C. Bonnett, M. Crocce, C.\nDavis, B. Hoyle, B. Leistedt, H. V. Peiris, R. H. Wechsler\net al., Mon. Not. R. Astron. Soc. 461, 1431 (2016).\n[71] C. Chang, M. Jarvis, B. Jain, S. M. Kahn, D. Kirkby, A.\nConnolly, S. Krughoff, E.-H. Peng, and J. R. Peterson,\nMon. Not. R. Astron. Soc. 434, 2121 (2013).\n[72] G. Bernstein and D. Huterer, Mon. Not. R. Astron. Soc.\n401, 1399 (2010).\n[73] Z. Ma, W. Hu, and D. Huterer, Astrophys. J. 636, 21\n(2006).\n[74] P. A. R. Ade, N. Aghanim, M. Arnaud, M. Ashdown, J.\nAumont, C. Baccigalupi, A. J. Banday, R. B. Barreiro, J.\nG. Bartlett et al. (Planck Collaboration), Astron. Astrophys.\n594, A13 (2016).\n[75] C. Heymans, L. Van Waerbeke, D. Bacon, J. Berge,\nG. Bernstein, E. Bertin, S. Bridle, M. L. Brown, D. Clowe,\nH. Dahle et al., Mon. Not. R. Astron. Soc. 368, 1323\n(2006).\n[76] A. N. Taylor and T. D. Kitching, arXiv:1605.09130.\n[77] C. M. Hirata, N. Padmanabhan, U. Seljak, D. Schlegel, and\nJ. Brinkmann, Phys. Rev. D 70, 103501 (2004).\n[78] S. Bridle and L. King, New J. Phys. 9, 444 (2007).\n[79] S. Singh, R. Mandelbaum, and S. More, Mon. Not. R.\nAstron. Soc. 450, 2195 (2015).\n[80] P. Catelan, M. Kamionkowski, and R. D. Blandford, Mon.\nNot. R. Astron. Soc. 320, L7 (2001).\n[81] C. M. Hirata, R. Mandelbaum, M. Ishak, U. Seljak, R.\nNichol, K. A. Pimbblet, N. P. Ross, and D. Wake, Mon.\nNot. R. Astron. Soc. 381, 1197 (2007).\n[82] R. Mandelbaum, C. Blake, S. Bridle, F. B. Abdalla, S.\nBrough, M. Colless, W. Couch, S. Croom, T. Davis, M. J.\nDrinkwater et al., Mon. Not. R. Astron. Soc. 410, 844\n(2011).\n[83] B. Joachimi, R. Mandelbaum, F. B. Abdalla, and S. L.\nBridle, Astron. Astrophys. 527, A26 (2011).\n[84] J. Loveday, P. Norberg, I. K. Baldry, S. P. Driver, A. M.\nHopkins, J. A. Peacock, S. P. Bamford, J. Liske, J. Bland-\nHawthorn, S. Brough et al., Mon. Not. R. Astron. Soc.\n420, 1239 (2012).\n[85] E. Krause, T. Eifler, and J. Blazek, Mon. Not. R. Astron.\nSoc. 456, 207 (2016).\n[86] B. Joachimi and S. L. Bridle, Astron. Astrophys. 523, A1\n(2010).\n[87] M. A. Troxel and M. Ishak, Phys. Rev. D 89, 063528\n(2014).\n[88] A. Hall and A. Taylor, Mon. Not. R. Astron. Soc. 443,\nL119 (2014).\n[89] Y. Li, W. Hu, and M. Takada, Phys. Rev. D 89, 083519\n(2014).\n[90] C.-T. Chiang, C. Wagner, F. Schmidt, and E. Komatsu, J.\nCosmol. Astropart. Phys. 05 (2014) 048.\n[91] Y. Li, W. Hu, and M. Takada, Phys. Rev. D 90, 103530\n(2014).\n[92] M. Takada and D. N. Spergel, Mon. Not. R. Astron. Soc.\n441, 2456 (2014).\n[93] E. Schaan, M. Takada, and D. N. Spergel, Phys. Rev. D 90,\n123523 (2014).\n[94] A. van Engelen, S. Bhattacharya, N. Sehgal, G. P.\nHolder, O. Zahn, and D. Nagai, Astrophys. J. 786, 13\n[95] S. J. Osborne, D. Hanson, and O. Doré, J. Cosmol.\nAstropart. Phys. 03 (2014) 024.\n[96] T. Eifler, P. Schneider, and J. Hartlap, Astron. Astrophys.\n502, 721 (2009).\n[97] E. Sellentin and A. F. Heavens, Mon. Not. R. Astron. Soc.\n456, L132 (2016).\n[98] M. White and N. Padmanabhan, J. Cosmol. Astropart.\nPhys. 12 (2015) 058.\n[99] J. Carron, Astron. Astrophys. 551, A88 (2013).\n[100] D. Foreman-Mackey, D.W. Hogg, D. Lang, and J.\nGoodman, Publ. Astron. Soc. Pac. 125, 306 (2013).\n[101] D. Huterer, M. Takada, G. Bernstein, and B. Jain, Mon.\nNot. R. Astron. Soc. 366, 101 (2006).\n[102] A. Hall and A. Taylor, Mon. Not. R. Astron. Soc. 443,\nL119 (2014).\n[103] N. E. Chisari, J. Dunkley, L. Miller, and R. Allison, Mon.\nNot. R. Astron. Soc. 453, 682 (2015).\n[104] M. A. Troxel and M. Ishak, Phys. Rev. D 89, 063528\n(2014).\n[105] P. Larsen and A. Challinor, Mon. Not. R. Astron. Soc. 461,\n4343 (2016).\n[106] L. Amendola, S. Appleby, D. Bacon, T. Baker, M. Baldi,\nN. Bartolo, A. Blanchard, C. Bonvin, S. Borgani, E.\nBranchini et al., Living Rev. Relativ. 16, 6 (2013).\n[107] L. Wolz, M. Kilbinger, J. Weller, and T. Giannantonio,\nJ. Cosmol. Astropart. Phys. 09 (2012) 009"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Looking through the same lens: Shear calibration for LSST, Euclid, and WFIRST with stage 4 CMB lensing\nEmmanuel Schaan, Elisabeth Krause, Tim Eifler, Olivier Doré, Hironao Miyatake, Jason Rhodes, and David N. Spergel\nPhys. Rev. D 95, 123512 – Published 8 June 2017","other_numbering_system":null,"funders":[{"agency":"JPL Strategic University Research Partnership Program","grant_number":""},{"agency":"NASA/JPL/Caltech","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}