{"title":"Next non-Gaussianity frontier: What can a measurement with \nσ (f_(NL)) ≲ 1 tell us about multifield inflation?","uri":"","abstract":"Future galaxy surveys promise to probe local primordial non-Gaussianity at unprecedented precision, σ (f_(NL)) ≲ 1. We study the implications for multifield inflation by considering spectator models, where inflation is driven by the inflaton field, but the primordial perturbations are (partially) generated by a second, spectator field. We perform a Markov chain Monte Carlo likelihood analysis using Planck data to study quantitative predictions for \nf_(NL) and other observables for a range of such spectator models. We show that models where the primordial  perturbations are dominated by the spectator field, while fine-tuned within the broader parameter space, typically predict f_(NL) of order unity. Therefore, upcoming galaxy clustering measurements will constitute a stringent test of whether or not the generation of primordial  perturbations and the accelerated expansion in the inflationary universe are due to separate phenomena.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253393","docid":253393,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268220","fileid":1268220,"datasetid":"document","objectid":253393,"filename":"PhysRevD.95.123507.pdf","mime_type":"application/pdf","hash":"69028e91be21bcac1329fdb8dadee218","hash_type":"MD5","filesize":1755205,"mtime":"2017-06-08 22:03:55","url":"http://authors.library.caltech.edu/78036/1/PhysRevD.95.123507.pdf"}],"eprintid":78036,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"PhysRevD.95.123507.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/253394","docid":253394,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268223","fileid":1268223,"datasetid":"document","objectid":253394,"filename":"1612.05248.pdf","mime_type":"application/pdf","hash":"02dc8c2304423f69796e31cc96e15e38","hash_type":"MD5","filesize":1580581,"mtime":"2017-06-08 22:07:13","url":"http://authors.library.caltech.edu/78036/2/1612.05248.pdf"}],"eprintid":78036,"pos":2,"placement":2,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1612.05248.pdf","content":"submitted"}],"note":"© 2017 American Physical Society. \n\nReceived 2 January 2017; published 8 June 2017. \n\nWe would like to thanks P. Bull and D. Green for helpful discussions. Part of the research described in this paper was carried out at the Jet Propulsion Laboratory, California Institute of Technology, under a contract with the National Aeronautics and Space Administration. This research is partially supported by NASA ROSES ATP 14-ATP14-0093 grant. RdP and O. D. acknowledge support by the Heising-Simons foundation.\n\n","id":78036,"rev_number":10,"userid":772,"eprint_dir":"disk0/00/07/80/36","datestamp":"2017-06-08 23:52:22","lastmod":"2017-06-08 23:52:22","status_changed":"2017-06-08 23:52:22","type":"article","metadata_visibility":"show","creators":[{"given":"Roland ","family":"de Putter","id":"de-Putter-R","orcid":""},{"given":"Jérôme","family":"Gleyzes","id":"Gleyzes-J","orcid":""},{"given":"Olivier","family":"Doré","id":"Doré-O","orcid":"0000-0002-5009-7563"}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"","date":"2017-06-08","date_type":"published","publication":"Physical Review D","volume":"95","number":"12","pagerange":"Art. No. 123507","id_number":"CaltechAUTHORS:20170608-150324472","refereed":true,"issn":"2470-0010","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170608-150324472","related_url":[{"url":"https://doi.org/10.1103/PhysRevD.95.123507","type":"doi","description":"Article"},{"url":"https://journals.aps.org/prd/abstract/10.1103/PhysRevD.95.123507","type":"pub","description":"Article"},{"url":"https://arxiv.org/abs/1612.05248","type":"arxiv","description":"Discussion Paper"}],"referencetext":["A. A. Starobinsky, A new type of isotropic cosmological models without singularity, Phys. Lett. B 91, 99 (1980).\nA. H. Guth, Inflationary universe: A possible solution to the horizon and flatness problems, Phys. Rev. D 23, 347 (1981).\nA. D. Linde, A new inflationary universe scenario: A possible solution of the horizon, flatness, homogeneity, isotropy, and primordial monopole problems, Phys. Lett. B 108, 389 (1982).\nA. Albrecht and P. J. Steinhardt, Cosmology for grand unified theories with radiatively induced symmetry breaking, Phys. Rev. Lett. 48, 1220 (1982).\nP. Svrcek and E. Witten, Axions in string theory, J. High Energy Phys. 2006, 051.\nS. Dimopoulos, S. Kachru, J. McGreevy, and J. G. Wacker et al., N-flation, J. Cosmol. Astropart. Phys. 2008, 003.\nD. Baumann and L. McAllister, Inflation and string theory, http://adsabs.harvard.edu/abs/2015ist..book.....B, 2015.\nE. Komatsu and D. N. Spergel, Acoustic signatures in the primary microwave background bispectrum, Phys. Rev. D 63, 063002 (2001).\nJ. M. Maldacena, Non-Gaussian features of primordial fluctuations in single-field inflationary models, J. High Energy Phys. 2003, 013.\nP. Creminelli and M. Zaldarriaga, Single field consistency relation for the 3-point function, J. Cosmol. Astropart. Phys. 2004, 006.\nX. Chen, H. Firouzjahi, and M. H. Namjoo et al., A single field inflation model with large local non-Gaussianity, Eurphys. Lett. 102, 59001 (2013).\nS. Mooij and G. A. Palma, Consistently violating the non-Gaussian consistency relation, J. Cosmol. Astropart. Phys. 2015, 025.\nC. T. Byrnes and K.-Y. Choi, Review of local Non-Gaussianity from multifield inflation, Adv. Astron. 2010, 724525 (2010).\nP. A. R. Ade and N. Aghanim et al. (Planck Collaboration), Planck 2015 results. XVII. Constraints on primordial non-Gaussianity, Astron. Astrophys. 594, A17 (2016).\nM. Alvarez et al., Testing Inflation with Large Scale Structure: Connecting Hopes with Reality, arXiv:1412.4671.\nN. Dalal, O. Doré, D. Huterer, and A. Shirokov, The imprints of primordial non-gaussianities on large-scale structure: scale dependent bias and abundance of virialized objects, Phys. Rev. D 77, 123514 (2008).\nS. Matarrese and L. Verde, The effect of primordial non-Gaussianity on halo bias, Astrophys. J. Lett. 677, L77 (2008).\nA. Slosar, C. Hirata, U. Seljak, S. Ho, and N. Padmanabhan, Constraints on local primordial non-Gaussianity from large scale structure, J. Cosmol. Astropart. Phys. 2008, 031.\nV. Desjacques and U. Seljak, Primordial non-Gaussianity from the large-scale structure, Classical Quantum Gravity 27, 124011 (2010).\nO. Doré, J. Bock, and M. Ashby et al., Cosmology with the SPHEREX All-Sky Spectral Survey, arXiv:1412.4872.\nO. Dor et al., Science Impacts of the SPHEREx All-Sky Optical to Near-Infrared Spectral Survey: Report of a Community Workshop Examining Extragalactic, Galactic, Stellar and Planetary Science, arXiv:1606.07039.\nhttp://spherex.caltech.edu/.\nP. A. Abell and J. Allison et al. (LSST Science Collaboration), LSST Science Book, Version 2.0, arXiv:0912.0201.\nR. Laureijs, J. Amiaux, and S. Arduini et al., Euclid Definition Study Report, arXiv:1110.3193.\nK. N. Abazajian, P. Adshead, and Z. Ahmed et al., CMB-S4 Science Book, First Edition, arXiv:1610.02743.\nR. de Putter and O. Doré, Designing an Inflation Galaxy Survey: How to Measure \nσ\n(\nf\nNL\n)\n∼\n1\n Using Scale-Dependent Galaxy Bias, arXiv:1412.3854.\nS. Ferraro and K. M. Smith, Using large scale structure to test multifield inflation, Phys. Rev. D 91, 043506 (2015).\nD. Yamauchi, K. Takahashi, and M. Oguri, Constraining primordial non-Gaussianity via a multitracer technique with surveys by Euclid and the Square Kilometre Array, Phys. Rev. D 90, 083520 (2014).\nJ. Gleyzes, R. de Putter, and D. Green et al., Biasing and the search for primordial non-Gaussianity beyond the local type, J. Cosmol. Astropart. Phys. 4, 002 (2017).\nC. T. Byrnes, K.-Y. Choi, and L. M. H. Hall, Conditions for large non-Gaussianity in two-field slow-roll inflation, J. Cosmol. Astropart. Phys. 10, 008 (2008).\nA. Linde and V. Mukhanov, Non-Gaussian isocurvature perturbations from inflation, Phys. Rev. D 56, R535 (1997).\nT. Moroi and T. Takahashi, Cosmic density perturbations from late decaying scalar condensations, Phys. Rev. D 66, 063501 (2002).\nD. H. Lyth, C. Ungarelli, and D. Wands, Primordial density perturbation in the curvaton scenario, Phys. Rev. D 67, 023503 (2003).\nD. H. Lyth and D. Wands, Generating the curvature perturbation without an inflaton, Phys. Lett. B 524, 5 (2002).\nK. Enqvist and M. S. Sloth, Adiabatic CMB perturbations in pre—big bang string cosmology, Nucl. Phys. B626, 395 (2002).\nG. Dvali, A. Gruzinov, and M. Zaldarriaga, A new mechanism for generating density perturbations from inflation, Phys. Rev. D 69, 023505 (2004).\nL. Kofman, Probing String Theory with Modulated Cosmological Fluctuations, arXiv:astro-ph/0303614.\nF. Bernardeau, L. Kofman, and J.-P. Uzan, Modulated fluctuations from hybrid inflation, Phys. Rev. D 70, 083004 (2004).\nG. Dvali, A. Gruzinov, and M. Zaldarriaga, New mechanism for generating density perturbations from inflation, Phys. Rev. D 69, 023505 (2004).\nM. Zaldarriaga, Non-Gaussianities in models with a varying inflaton decay rate, Phys. Rev. D 69, 043508 (2004).\nF. Bernardeau, L. Kofman, and J.-P. Uzan, Modulated fluctuations from hybrid inflation, Phys. Rev. D 70, 083004 (2004).\nD. H. Lyth, Generating the curvature perturbation at the end of inflation, J. Cosmol. Astropart. Phys. 2005, 006.\nQ.-G. Huang, A Geometric Description of the Non-Gaussianity Generated at the End of Multi-Field Inflation.\nM. Kawasaki, T. Takahashi, and S. Yokoyama, Density fluctuations in thermal inflation and non-Gaussianity, J. Cosmol. Astropart. Phys. 2009, 012.\nJ. Elliston, D. J. Mulryne, D. Seery, and R. Tavakol, Evolution of fNL to the adiabatic limit, J. Cosmol. Astropart. Phys. 2011, 005.\nG. Leung, E. R. M. Tarrant, C. T. Byrnes, and E. J Copeland, Reheating, multifield inflation and the fate of the primordial observables, J. Cosmol. Astropart. Phys. 2012, 008.\nJ. Elliston, S. Orani, and D. J. Mulryne, General analytic predictions of two-field inflation and perturbative reheating, Phys. Rev. D 89, 103532 (2014).\nC. T. Byrnes, K.-Y. Choi, and L. M. H. Hall, Large non-Gaussianity from two-component hybrid inflation, J. Cosmol. Astropart. Phys. 2009, 017.\nA. Naruko and M. Sasaki, Large Non-Gaussianity from multi-brid inflation, Prog. Theor. Phys. 121, 193 (2009).\nS. A. Kim and A. R. Liddle, Nflation: Non-Gaussianity in the horizon-crossing approximation, Phys. Rev. D 74, 063522 (2006).\nS. A. Kim, A. R. Liddle, and D. Seery, Non-Gaussianity in Axion N-flation Models, Phys. Rev. Lett. 105, 181302 (2010).\nD. Langlois and L. Sorbo, Primordial perturbations and non-Gaussianities from modulated trapping, J. Cosmol. Astropart. Phys. 2009, 014.\nK. Nakayama and T. Suyama, Curvature perturbation from velocity modulation, Phys. Rev. D 84, 063520 (2011).\nC. M. Peterson and M. Tegmark, Non-Gaussianity in two-field inflation, Phys. Rev. D 84, 023520 (2011).\nC. M. Peterson and M. Tegmark, Testing multi-field inflation: A geometric approach, Phys. Rev. D 87, 103507 (2013).\nL. Alabidi, K. Malik, C. T. Byrnes, and K.-Y. Choi, How the curvaton scenario, modulated reheating and an inhomogeneous end of inflation are related, J. Cosmol. Astropart. Phys. 2010, 037.\nC. T. Byrnes, M. Cortês, and A. R. Liddle, Comprehensive analysis of the simplest curvaton model, Phys. Rev. D 90, 023523 (2014).\nR. J. Hardwick and C. T. Byrnes, Bayesian evidence of the post-Planck curvaton, J. Cosmol. Astropart. Phys. 2015, 010.\nT. L. Smith and D. Grin, Probing a panoply of curvaton-decay scenarios using CMB data, Phys. Rev. D 94, 103517 (2016).\nV. Vennin, K. Koyama, and D. Wands, Encyclopædia curvatonis, J. Cosmol. Astropart. Phys. 2015, 008.\nV. Vennin, K. Koyama, and D. Wands, Inflation with an extra light scalar field after Planck, J. Cosmol. Astropart. Phys. 2016, 024.\nA. A. Starobinskiĭ, Multicomponent de Sitter (inflationary) stages and the generation of perturbations, Sov. J. Exp. Theor. Phys. Lett. 42, 152 (1985).\nM. Sasaki and E. D. Stewart, A General analytic formula for the spectral index of the density perturbations produced during inflation, Prog. Theor. Phys. 95, 71 (1996).\nD. H. Lyth and Y. Rodríguez, Inflationary Prediction for Primordial Non-Gaussianity, Phys. Rev. Lett. 95, 121302 (2005).\nF. Vernizzi and D. Wands, Non-Gaussianities in two-field inflation, J. Cosmol. Astropart. Phys. 2006, 019.\nT. Kobayashi, F. Takahashi, T. Takahashi, and M. Yamaguchi, Spectator field models in light of spectral index after Planck, J. Cosmol. Astropart. Phys. 2013, 042.\nK. Enqvist and T. Takahashi, Mixed inflaton and spectator field models after Planck, J. Cosmol. Astropart. Phys. 2013, 034.\nL. Wang, Spectator Fields and Their Imprints on the Cosmic Microwave Background, arXiv:1610.03123.\nT. Suyama, T. Takahashi, M. Yamaguchi, and S. Yokoyama, Implications of Planck results for models with local type non-Gaussianity, J. Cosmol. Astropart. Phys. 2013, 012.\nS. Renaux-Petel, Primordial non-Gaussianities after Planck 2015: An introductory review, C.R. Phys. 16, 969 (2015).\nJ. M. Bardeen, P. J. Steinhardt, and M. S. Turner, Spontaneous creation of almost scale-free density perturbations in an inflationary universe, Phys. Rev. D 28, 679 (1983).\nD. Wands, K. A. Malik, D. H. Lyth, and A. R. Liddle, A New approach to the evolution of cosmological perturbations on large scales, Phys. Rev. D 62, 043527 (2000).\nS. Weinberg, Adiabatic modes in cosmology, Phys. Rev. D 67, 123504 (2003).\nS. Weinberg, Must cosmological perturbations remain non-adiabatic after multi-field inflation?, Phys. Rev. D 70, 083522 (2004).\nS. Weinberg, Non-Gaussian correlations outside the horizon II: The general case, Phys. Rev. D 79, 043504 (2009).\nJ. Meyers, Non-Gaussian Correlations Outside the Horizon in Local Thermal Equilibrium, arXiv:1212.4438.\nD. Wands, Local non-Gaussianity from inflation, Classical Quantum Gravity 27, 124002 (2010).\nM. Sasaki, J. Valiviita, and D. Wands, Non-Gaussianity of the primordial perturbation in the curvaton model, Phys. Rev. D 74, 103003 (2006).\nG. Leung, E. R. M. Tarrant, C. T. Byrnes, and E. J. Copeland, Reheating, multifield inflation and the fate of the primordial observables, J. Cosmol. Astropart. Phys. 2012, 008.\nJ. Meyers and E. R. M. Tarrant, Perturbative Reheating After Multiple-Field Inflation: The Impact on Primordial Observables, Phys. Rev. D 89, 063535 (2014).\nM. A. Amin, M. P. Hertzberg, D. I. Kaiser, and J. Karouby, Nonperturbative dynamics of reheating after inflation: A review, Int. J. Mod. Phys. D 24, 1530003 (2015).\nD. Seery and J. E. Lidsey, Primordial non-Gaussianities from multiple-field inflation, J. Cosmol. Astropart. Phys. 2005, 011.\nD. Wands, N. Bartolo, S. Matarrese, and A. Riotto, Observational test of two-field inflation, Phys. Rev. D 66, 043520 (2002).\nE. Nelson and S. Shandera, Statistical naturalness and non-Gaussianity in a finite universe, Phys. Rev. Lett. 110, 131301 (2013).\nS. Nurmi, C. T. Byrnes, and G. Tasinato, A non-Gaussian landscape, J. Cosmol. Astropart. Phys. 2013, 004.\nM. LoVerde, E. Nelson, and S. Shandera, Non-Gaussian mode coupling and the statistical cosmological principle, J. Cosmol. Astropart. Phys. 2013, 024.\nL. Alabidi and D. H. Lyth, Inflation models and observation, J. Cosmol. Astropart. Phys. 2006, 016.\nN. Kobayashi, T. Kobayashi, and A. L. Erickcek, Rolling in the modulated reheating scenario, J. Cosmol. Astropart. Phys. 2014, 036.\nJ. Meyers and E. R. M. Tarrant, Perturbative reheating after multiple-field inflation: The impact on primordial observables, Phys. Rev. D 89, 063535 (2014).\nA. Linde, Particle Physics and Inflationary Cosmology, ArXiv High Energy Physics—Theory e-Prints (Mar., 2005), arXiv:hep-th/0503203.\nK. Ichikawa, T. Suyama, T. Takahashi, and M. Yamaguchi, Primordial curvature fluctuation and its non-Gaussianity in models with modulated reheating, Phys. Rev. D 78, 063545 (2008).\nK. Kamada, K. Kohri, and S. Yokoyama, Affleck-Dine baryogenesis with modulated reheating, J. Cosmol. Astropart. Phys. 2011, 027.\nP. A. R. Ade et al. (Planck Collaboration), Planck 2015 results. XX. Constraints on inflation, Astron. Astrophys. 594, A20 (2016).\nP. A. R. Ade et al. (BICEP2, Planck Collaboration), Joint Analysis of BICEP2/Keck?Array and Planck Data, Phys. Rev. Lett. 114, 101301 (2015).\nD. Foreman-Mackey, D. W. Hogg, D. Lang, and J. Goodman, Emcee: The MCMC Hammer, Publ. Astron. Soc. Pac. 125, 306 (2013).\nP. A. R. Ade et al. (Planck Collaboration), Planck 2015 results. XIII. Cosmological parameters, Astron. Astrophys. 594, A13 (2016).\nD. H. Lyth and A. Riotto, Particle physics models of inflation and the cosmological density perturbation, Phys. Rep. 314, 1 (1999).\nT. Banks, M. Dine, P. J. Fox, and E. Gorbatov, On the possibility of large axion decay constants, J. Cosmol. Astropart. Phys. 2003, 001.\nP. Svrcek and E. Witten, Axions in string theory, J. High Energy Phys. 2006, 051."],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Next non-Gaussianity frontier: What can a measurement with \nσ (fNL)≲ 1 tell us about multifield inflation?\nRoland de Putter, Jérôme Gleyzes, and Olivier Doré\nPhys. Rev. D 95, 123507 – Published 8 June 2017","other_numbering_system":null,"funders":[{"agency":"NASA/JPL/Caltech","grant_number":""},{"agency":"NASA ","grant_number":"ATP 14-ATP14-0093"},{"agency":"Heising-Simons Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}