{"title":"Disentangling the Complex Broadband X-ray Spectrum of IRAS 13197-1627 with NuSTAR, XMM-Newton and Suzaku","uri":"","abstract":"We present results from a coordinated XMM-Newton+NuSTAR observation of the type 1.8\nSeyfert galaxy IRAS 13197-1627. This is a highly complex source, with strong contributions\nfrom relativistic reflection from the inner accretion disk, neutral absorption and further\nreprocessing by more distant material, and ionised absorption from an outflow. We undertake\na detailed spectral analysis combining the broadband coverage provided by XMMNewton+NuSTAR\nwith a multi-epoch approach incorporating archival observations performed\nby XMM-Newton and Suzaku. Our focus is on characterising the reflection from the inner accretion\ndisk, which previous works have suggested may dominate the AGN emission, and\nconstraining the black hole spin. Using lamppost disk reflection models, we find that the results\nfor the inner disk are largely insensitive to assumptions regarding the geometry of the\ndistant reprocessor and the precise form of the illuminating X-ray continuum. However, these\nresults do depend on the treatment of the iron abundance of the distant absorber/reprocessor.\nThe multi-epoch data favour a scenario in which the AGN is chemically homogeneous, and\nwe find that a rapidly rotating black hole is preferred, with a\n∗ \u003e 0.7, but a slowly-rotating\nblack hole is not strongly excluded. In addition to the results for the inner disk, we also find\nthat both the neutral and ionised absorbers vary from epoch to epoch, implying that both have\nsome degree of inhomogeneity in their structure.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253386","docid":253386,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268143","fileid":1268143,"datasetid":"document","objectid":253386,"filename":"1706.02088.pdf","mime_type":"application/pdf","hash":"3e3ba771cf046c5075b7b074c8c1dac2","hash_type":"MD5","filesize":557106,"mtime":"2017-06-08 18:30:54","url":"http://authors.library.caltech.edu/78032/1/1706.02088.pdf"}],"eprintid":78032,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"other","main":"1706.02088.pdf","content":"submitted"}],"note":"DJW acknowledges support from an STFC Ernest Rutherford Fellowship, and ACF acknowledges support from ERC Advanced Grant 340442. GM thanks the European Union Seventh Framework Program (FP7/2007–2013) for funding under grant 312789 (StrongGravity). This research has made use of data obtained with NuSTAR, a project led by Caltech, funded by NASA and managed by NASA/JPL, and has utilized the NUSTARDAS software package, jointly developed by the ASDC (Italy) and Caltech (USA). This research has also made use of data obtained with XMM-Newton, an ESA science mission with instruments and contributions directly funded by ESA Member States, and with Suzaku, a collaborative mission between the space agencies of Japan (JAXA) and the USA (NASA).","id":78032,"rev_number":8,"userid":999,"eprint_dir":"disk0/00/07/80/32","datestamp":"2017-06-08 21:12:20","lastmod":"2017-06-08 21:12:20","status_changed":"2017-06-08 21:12:20","type":"monograph","metadata_visibility":"show","creators":[{"given":"D. J.","family":"Walton","id":"Walton-D-J","orcid":""},{"given":"M.","family":"Brightman","id":"Brightman-M","orcid":""},{"given":"G.","family":"Risaliti","id":"Risaliti-G","orcid":""},{"given":"A. C.","family":"Fabian","id":"Fabian-A-C","orcid":""},{"given":"F.","family":"Fürst","id":"Fürst-F","orcid":""},{"given":"F. A.","family":"Harrison","id":"Harrison-F-A","orcid":"0000-0003-2992-8024"},{"given":"A. M.","family":"Lohfink","id":"Lohfink-A-M","orcid":""},{"given":"G.","family":"Matt","id":"Matt-G","orcid":""},{"given":"G.","family":"Miniutti","id":"Miniutti-G","orcid":""},{"given":"M. L.","family":"Parker","id":"Parker-M-L","orcid":""},{"given":"D.","family":"Stern","id":"Stern-D","orcid":""}],"ispublished":"submitted","subjects":null,"full_text_status":"public","keywords":"","date":"2017-06-07","date_type":"submitted","publication":"arXiv","volume":"","number":"","pagerange":"","id_number":"CaltechAUTHORS:20170608-112508378","refereed":true,"issn":"","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170608-112508378","related_url":[{"url":"http://arxiv.org/abs/1706.02088","type":"arxiv","description":"Discussion Paper"}],"referencetext":["Anders E., Grevesse N., 1989, Geochimica Cosmochimica Acta, 53, 197\nArnaud K. A., 1996, in Astronomical Data Analysis Software and Systems\nV, edited by G. H. Jacoby \u0026 J. Barnes, vol. 101 of Astron. Soc. Pac.\nConference Series, Astron. Soc. Pac., San Francisco, 17\nBoldt E., 1987, in Observational Cosmology, edited by A. Hewitt, G. Burbidge,\n\u0026 L. Z. Fang, vol. 124 of IAU Symposium, 611–615\nBonson K., Gallo L. C., 2016, MNRAS, 458, 1927\nBrenneman L. W., Reynolds C. S., Nowak M. A., et al., 2011, ApJ, 736,\n103\nBrightman M., Balokovi´c M., Stern D., et al., 2015, ApJ, 805, 41\nBrightman M., Nandra K., 2011, MNRAS, 413, 1206\nDadina M., Cappi M., 2004, A\u0026A, 413, 921\nDauser T., Garc´ıa J., Parker M. L., Fabian A. C., Wilms J., 2014, MNRAS,\n444, L100\nDauser T., Garc´ıa J., Walton D. J., et al., 2016, A\u0026A, 590, A76\nDauser T., Wilms J., Reynolds C. S., Brenneman L. W., 2010, MNRAS,\n409, 1534\nDors O. L., Cardaci M. V., H¨agele G. F., Krabbe A. C., 2014, MNRAS, 443, ˆ\n1291\nDubois Y., Volonteri M., Silk J., 2014, MNRAS, 440, 1590\nFabian A. C., Kara E., Walton D. J., et al., 2013, MNRAS, 429, 2917\nFabian A. C., Lohfink A., Kara E., Parker M. L., Vasudevan R., Reynolds\nC. S., 2015, MNRAS, 451, 4375\nFabian A. C., Rees M. J., Stella L., White N. E., 1989, MNRAS, 238, 729\nFabian A. C., Zoghbi A., Ross R. R., et al., 2009, Nat, 459, 540\nF ¨urst F., M ¨uller C., Madsen K. K., et al., 2016, ApJ, 819, 150\nGandhi P., H ¨onig S. F., Kishimoto M., 2015, ApJ, 812, 113\nGarc´ıa J., Dauser T., Lohfink A., et al., 2014, ApJ, 782, 76\nGarc´ıa J., Kallman T. R., 2010, ApJ, 718, 695\nGarc´ıa J. A., Dauser T., Steiner J. F., McClintock J. E., Keck M. L., Wilms\nJ., 2015, ApJ, 808, L37\nGrevesse N., Sauval A. J., 1998, Space Sci. Rev., 85, 161\nHaardt F., Maraschi L., 1991, ApJ, 380, L51\nHarrison F. A., Craig W. W., Christensen F. E., et al., 2013, ApJ, 770, 103\nIchikawa K., Ueda Y., Terashima Y., et al., 2012, ApJ, 754, 45\nJansen F., Lumb D., Altieri B., et al., 2001, A\u0026A, 365, L1\nKalberla P. M. W., Burton W. B., Hartmann D., et al., 2005, A\u0026A, 440, 775\nKallman T., Bautista M., 2001, ApJS, 133, 221\nKara E., Garcia J. A., Lohfink A., et al., 2017, ArXiv e-prints\nKoyama K., Tsunemi H., Dotani T., et al., 2007, PASJ, 59, 23\nLaor A., 1991, ApJ, 376, 90\nLobban A. P., Pounds K., Vaughan S., Reeves J. N., 2016, ApJ, 831, 201\nMadsen K. K., Harrison F. A., Markwardt C. B., et al., 2015, ApJS, 220, 8\nMantovani G., Nandra K., Ponti G., 2016, MNRAS, 458, 4198\nMarkowitz A. G., Krumpe M., Nikutta R., 2014, MNRAS, 439, 1403\nMiller L., Turner T. J., Reeves J. N., 2008, A\u0026A, 483, 437\nMiller L., Turner T. J., Reeves J. N., 2009, MNRAS, 399, L69\nMiniutti G., Fabian A. C., 2004, MNRAS, 349, 1435\nMiniutti G., Ponti G., Dadina M., Cappi M., Malaguti G., 2007, MNRAS,\n375, 227\nMurphy K. D., Yaqoob T., 2009, MNRAS, 397, 1549\nNardini E., Fabian A. C., Reis R. C., Walton D. J., 2011, MNRAS, 410,\n1251\nNardini E., Reeves J. N., Gofford J., et al., 2015, Science, 347, 860\nNikutta R., Elitzur M., Lacy M., 2009, ApJ, 707, 1550\nParker M. L., Pinto C., Fabian A. C., et al., 2017, Nat, 543, 83\nParker M. L., Wilkins D. R., Fabian A. C., et al., 2014, MNRAS, 443, 1723\nProga D., Kallman T. R., 2004, ApJ, 616, 688\nReis R. C., Reynolds M. T., Miller J. M., Walton D. J., 2014, Nat, 507, 207\nMNRAS 000, 1–14 (0000)\n14 D. J. Walton et al.\nReynolds C. S., 2014, Space Sci. Rev., 183, 277\nReynolds C. S., Brenneman L. W., Lohfink A. M., et al., 2012, ApJ, 755, 88\nReynolds M. T., Walton D. J., Miller J. M., Reis R. C., 2014, ApJ, 792, L19\nRisaliti G., Bianchi S., Matt G., et al., 2005, ApJ, 630, L129\nRisaliti G., Elvis M., Nicastro F., 2002, ApJ, 571, 234\nRisaliti G., Harrison F. A., Madsen K. K., et al., 2013, Nat, 494, 449\nRisaliti G., Salvati M., Elvis M., et al., 2009, MNRAS, 393, L1\nRivers E., Markowitz A., Rothschild R., 2013, ApJ, 772, 114\nRivers E., Risaliti G., Walton D. J., et al., 2015, ApJ, 804, 107\nSesana A., Barausse E., Dotti M., Rossi E. M., 2014, ArXiv e-prints\nSim S. A., Proga D., Miller L., Long K. S., Turner T. J., 2010, MNRAS,\n408, 1396\nStr ¨uder L., Briel U., Dennerl K., et al., 2001, A\u0026A, 365, L18\nTakahashi T., Abe K., Endo M., et al., 2007, PASJ, 59, 35\nTanaka Y., Nandra K., Fabian A. C., et al., 1995, Nat, 375, 659\nTatum M. M., Turner T. J., Miller L., Reeves J. N., 2013, ApJ, 762, 80\nTitarchuk L., 1994, ApJ, 434, 570\nTortosa A., Marinucci A., Matt G., et al., 2016, ArXiv e-prints\nTurner M. J. L., Abbey A., Arnaud M., et al., 2001, A\u0026A, 365, L27\nVasudevan R. V., Fabian A. C., Gandhi P., Winter L. M., Mushotzky R. F.,\n2010, MNRAS, 402, 1081\nVasudevan R. V., Fabian A. C., Reynolds C. S., Aird J., Dauser T., Gallo\nL. C., 2016, MNRAS, 458, 2012\nVerner D. A., Ferland G. J., Korista K. T., Yakovlev D. G., 1996, ApJ, 465,\n487\nVolonteri M., Sikora M., Lasota J.-P., Merloni A., 2013, ApJ, 775, 94\nWalton D. J., Mooley K., King A. L., et al., 2017, ApJ, 839, 110\nWalton D. J., Nardini E., Fabian A. C., Gallo L. C., Reis R. C., 2013, MNRAS,\n428, 2901\nWalton D. J., Reis R. C., Fabian A. C., 2010, MNRAS, 408, 601\nWalton D. J., Reynolds M. T., Miller J. M., Reis R. C., Stern D., Harrison\nF. A., 2015, ApJ, 805, 161\nWalton D. J., Risaliti G., Harrison F. A., et al., 2014, ApJ, 788, 76\nWalton D. J., Tomsick J. A., Madsen K. K., et al., 2016, ApJ, 826, 87\nWilkins D. R., Fabian A. C., 2012, MNRAS, 424, 1284\nWilms J., Allen A., McCray R., 2000, ApJ, 542, 914\nXu Y., Balokovic M., Walton D. J., Harrison F. A., Garcia J. A., Koss M. J.,\n2017, ArXiv 1702.00073\nZdziarski A. A., Johnson W. N., Magdziarz P., 1996, MNRAS, 283, 193\nZdziarski A. A., Lubi ´nski P., Gilfanov M., Revnivtsev M., 2003, MNRAS,\n342, 355\nZoghbi A., Miller J. M., King A. L., et al., 2016, ApJ, 833, 165\nZycki P. T., Done C., Smith D. A., 1999, MNRAS, 309, 561"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"","other_numbering_system":null,"funders":[{"agency":"Science and Technology Facilities Council (STFC)","grant_number":""},{"agency":"European Research Council (ERC)","grant_number":"340442"},{"agency":"European Research Council (ERC)","grant_number":"312789"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":["Space Radiation Laboratory","NuSTAR"]}