{"title":"Statistical analysis of differential equations: introducing probability measures on numerical solutions","uri":"","abstract":"In this paper, we present a formal quantification of uncertainty induced by numerical solutions of ordinary and partial differential equation models. Numerical solutions of differential equations contain inherent uncertainties due to the finite-dimensional approximation of an unknown and implicitly defined function. When statistically analysing models based on differential equations describing physical, or other naturally occurring, phenomena, it can be important to explicitly account for the uncertainty introduced by the numerical method. Doing so enables objective determination of this source of uncertainty, relative to other uncertainties, such as those caused by data contaminated with noise or model error induced by missing physical or inadequate descriptors. As ever larger scale mathematical models are being used in the sciences, often sacrificing complete resolution of the differential equation on the grids used, formally accounting for the uncertainty in the numerical method is becoming increasingly more important. This paper provides the formal means to incorporate this uncertainty in a statistical model and its subsequent analysis. We show that a wide variety of existing solvers can be randomised, inducing a probability measure over the solutions of such differential equations. These measures exhibit contraction to a Dirac measure around the true unknown solution, where the rates of convergence are consistent with the underlying deterministic numerical method. Furthermore, we employ the method of modified equations to demonstrate enhanced rates of convergence to stochastic perturbations of the original deterministic problem. Ordinary differential equations and elliptic partial differential equations are used to illustrate the approach to quantify uncertainty in both the statistical analysis of the forward and inverse problems.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253446","docid":253446,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268532","fileid":1268532,"datasetid":"document","objectid":253446,"filename":"art%3A10.1007%2Fs11222-016-9671-0.pdf","mime_type":"application/pdf","hash":"186d4c79d09963a8d5404d29613d6fd7","hash_type":"MD5","filesize":2404141,"mtime":"2017-06-09 20:37:59","url":"http://authors.library.caltech.edu/78064/1/art%253A10.1007%252Fs11222-016-9671-0.pdf"}],"eprintid":78064,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"public","license":"cc_by","main":"art%3A10.1007%2Fs11222-016-9671-0.pdf","content":"published"},{"id":"http://authors.library.caltech.edu/id/document/253447","docid":253447,"rev_number":2,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268538","fileid":1268538,"datasetid":"document","objectid":253447,"filename":"11222_2016_9671_MOESM1_ESM.tex","mime_type":"text/x-tex","hash":"1173b9511bea5be8206b505c9341f61e","hash_type":"MD5","filesize":4667,"mtime":"2017-06-09 20:43:11","url":"http://authors.library.caltech.edu/78064/2/11222_2016_9671_MOESM1_ESM.tex"}],"eprintid":78064,"pos":2,"placement":2,"mime_type":"text/x-tex","format":"application/x-latex","language":"en","security":"public","license":"cc_by","main":"11222_2016_9671_MOESM1_ESM.tex","content":"supplemental"}],"note":"© 2016 The Author(s). This article is distributed under the terms of the Creative Commons Attribution 4.0 International License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium, provided you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. \n\nReceived: 05 December 2015; Accepted: 05 May 2016; First Online: 02 June 2016. \n\nThe authors gratefully acknowledge support from EPSRC Grant CRiSM EP/D002060/1, EPSRC Established Career Research Fellowship EP/J016934/2, EPSRC Programme Grant EQUIP EP/K034154/1, and Academy of Finland Research Fellowship 266940. Konstantinos Zygalakis was partially supported by a grant from the Simons Foundation. Part of this work was done during the author’s stay at the Newton Institute for the program “Stochastic Dynamical Systems in Biology: Numerical Methods and Applications.;”","id":78064,"rev_number":11,"userid":18,"eprint_dir":"disk0/00/07/80/64","datestamp":"2017-06-09 21:11:07","lastmod":"2017-06-09 21:11:07","status_changed":"2017-06-09 21:11:07","type":"article","metadata_visibility":"show","creators":[{"given":"Patrick R.","family":"Conrad","id":"Conrad-P-R","orcid":""},{"given":"Mark","family":"Girolami","id":"Girolami-M","orcid":""},{"given":"Simo","family":"Särkkä","id":"Särkkä-S","orcid":""},{"given":"Andrew","family":"Stuart","id":"Stuart-A-M","orcid":""},{"given":"Konstantinos","family":"Zygalakis","id":"Zygalakis-K-C","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"public","keywords":"Numerical analysis; Probabilistic numeric; Inverse problems; Uncertainty quantification ","date":"2017-07","date_type":"published","publication":"Statistics and Computing","volume":"27","number":"4","pagerange":"1065-1082","id_number":"CaltechAUTHORS:20170609-133754387","refereed":true,"issn":"0960-3174","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170609-133754387","related_url":[{"url":"http://dx.doi.org/10.1007/s11222-016-9671-0","type":"doi","description":"Article"},{"url":"https://link.springer.com/article/10.1007%2Fs11222-016-9671-0","type":"pub","description":"Article"}],"referencetext":["\nArnold, A., Calvetti, D., Somersalo, E.: Linear multistep methods, particle filtering and sequential Monte Carlo. Inverse Probl. 29(8), 085,007 (2013)\nMathSciNetCrossRefMATHGoogle Scholar\n\n\nBrunel, N.J.B., Clairon, Q., dAlch Buc, F.: Parametric estimation of ordinary differential equations with orthogonality conditions. J. Am. Stat. Assoc. 109(505), 173–185 (2014). doi:10.1080/01621459.2013.841583 \nMathSciNetCrossRefGoogle Scholar\n\n\nCapistrán, M., Christen, J.A., Donnet, S.: Bayesian analysis of ODE’s: solver optimal accuracy and Bayes factors (2013). arXiv:1311.2281 \n\n\nChakraborty, A., Mallick, B.K., Mcclarren, R.G., Kuranz, C.C., Bingham, D., Grosskopf, M.J., Rutter, E.M., Stripling, H.F., Drake, R.P.: Spline-based emulators for radiative shock experiments with measurement error. J. Am. Stat. Assoc. 108(502), 411–428 (2013). doi:10.1080/01621459.2013.770688 \nMathSciNetCrossRefMATHGoogle Scholar\n\n\nChkrebtii, O.A., Campbell, D.A., Girolami, M.A., Calderhead, B.: Bayesian uncertainty quantification for differential equations (2013). arXiv:1306.2365 \n\n\nCoulibaly, I., Lécot, C.: A quasi-randomized Runge–Kutta method. Math. Comput. Am. Math. Soc. 68(226), 651–659 (1999)\nMathSciNetCrossRefMATHGoogle Scholar\n\n\nDashti, M., Stuart, A.: The Bayesian approach to inverse problems. In: Ghanem, R., Higdon, D., Owhadi, H. (eds.) Handbook of Uncertainty Quantification. Springer, New York (2016)\nGoogle Scholar\n\n\nDiaconis, P.: Bayesian numerical analysis. Stat. Decision Theory Relat. Top. IV 1, 163–175 (1988)\nMathSciNetCrossRefMATHGoogle Scholar\n\n\nEriksson, K.: Computational Differential Equations, vol. 1. Cambridge University Press, Cambridge (1996). https://books.google.co.uk/books?id=gbK2cUxVhDQC \n\n\nHaario, H., Laine, M., Mira, A., Saksman, E.: DRAM: efficient adaptive MCMC. Stat. Comput. 16(4), 339–354 (2006)\nMathSciNetCrossRefGoogle Scholar\n\n\nHairer, E., Nørsett, S., Wanner, G.: Solving Ordinary Differential Equations I: Nonstiff Problems. Solving Ordinary Differential Equations, Springer, New York (1993). https://books.google.co.uk/books?id=F93u7VcSRyYC \n\n\nHairer, E., Lubich, C., Wanner, G.: Geometric Numerical Integration: Structure-Preserving Algorithms for Ordinary Differential Equations, vol. 31. Springer, New York (2006)\nMATHGoogle Scholar\n\n\nHairer, E., McLachlan, R.I., Razakarivony, A.: Achieving Brouwer’s law with implicit Runge–Kutta methods. BIT Numer. Math. 48(2), 231–243 (2008)\nMathSciNetCrossRefMATHGoogle Scholar\n\n\nHennig, P., Hauberg, S.: Probabilistic solutions to differential equations and their application to Riemannian statistics. In: Proceedings of the 17th International Conference on Artificial Intelligence and Statistics (AISTATS), vol. 33 (2014)\n\n\nHennig, P., Osborne, M.A., Girolami, M.: Probabilistic numerics and uncertainty in computations. Proceedings of the Royal Society A (2015) (in press)\n\n\nJohnson, C.: Numerical Solution of Partial Differential Equations by the Finite Element Method. Dover Books on Mathematics Series, Dover Publications, New York (2012). Incorporated, https://books.google.co.uk/books?id=PYXjyoqy5qMC \n\n\nKailath, T.: The divergence and Bhattacharyya distance measures in signal selection. IEEE Trans. Commun. Technol. 15(1), 52–60 (1967). doi:10.1109/TCOM.1967.1089532 \nCrossRefGoogle Scholar\n\n\nKaipio, J., Somersalo, E.: Statistical inverse problems: discretization, model reduction and inverse crimes. J. Comput. Appl. Math. 198(2), 493–504 (2007)\nMathSciNetCrossRefMATHGoogle Scholar\n\n\nKennedy, M.C., O’Hagan, A.: Bayesian calibration of computer models. J. R. Stat. Soc. Ser. B (Stat. Methodol.) 63(3), 425–464 (2001)\nMathSciNetCrossRefMATHGoogle Scholar\n\n\nLiang, H., Wu, H.: Parameter estimation for differential equation models using a framework of measurement error in regression models. J. Am. Stat. Assoc. 103(484), 1570–1583 (2008). doi:10.1198/016214508000000797 \nMathSciNetCrossRefMATHGoogle Scholar\n\n\nLindgren, F., Rue, H., Lindström, J.: An explicit link between Gaussian fields and Gaussian Markov random fields: the stochastic partial differential equation approach. J. R. Stat. Soc. Ser. B (Stat. Methodol.) 73(4), 423–498 (2011)\nMathSciNetCrossRefMATHGoogle Scholar\n\n\nMedina-Aguayo, F.J., Lee, A., Roberts, G.O.: Stability of Noisy Metropolis-Hastings (2015). arxiv:1503.07066 \n\n\nRamsay, J.O., Hooker, G., Campbell, D., Cao, J.: Parameter estimation for differential equations: a generalized smoothing approach. J. R. Stat. Soc. Ser. B (Stat. Methodol.) 69(5), 741–796 (2007)\nMathSciNetCrossRefGoogle Scholar\n\n\nSchober, M., Duvenaud, D.K., Hennig, P.: Probabilistic ODE solvers with Runge–Kutta means. In: Advances in Neural Information Processing Systems, pp. 739–747 (2014)\n\n\nSkilling, J.: Bayesian solution of ordinary differential equations. In: Maximum Entropy and Bayesian Methods, pp 23–37. Springer, New York (1992)\n\n\nStengle, G.: Error analysis of a randomized numerical method. Numer. Math. 70(1), 119–128 (1995)\nMathSciNetCrossRefMATHGoogle Scholar\n\n\nSullivan, T.: Uncertainty Quantification. Springer, New York (2016)\nMATHGoogle Scholar\n\n\nXue, H., Miao, H., Wu, H.: Sieve estimation of constant and time-varying coefficients in nonlinear ordinary differential equation models by considering both numerical error and measurement error. Ann. Stat. 38(4), 2351–2387 (2010)\n\n\nXun, X., Cao, J., Mallick, B., Maity, A., Carroll, R.J.: Parameter estimation of partial differential equation models. J. Am. Stat. Assoc. 108(503), 1009–1020 (2013)\n"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"Conrad, P.R., Girolami, M., Särkkä, S. et al. Stat Comput (2017) 27: 1065. doi:10.1007/s11222-016-9671-0","other_numbering_system":null,"funders":[{"agency":"Engineering and Physical Sciences Research Council (EPSRC)","grant_number":"CRiSM EP/D002060/1"},{"agency":"Engineering and Physical Sciences Research Council (EPSRC)","grant_number":"EP/J016934/2"},{"agency":"Engineering and Physical Sciences Research Council (EPSRC)","grant_number":"EQUIP EP/K034154/1"},{"agency":"Academy of Finland","grant_number":"266940"},{"agency":"Simons Foundation","grant_number":""}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}