{"title":"Ergodicity for SDEs and approximations: locally Lipschitz vector fields and degenerate noise","uri":"","abstract":"The ergodic properties of SDEs, and various time discretizations for SDEs, are studied. The ergodicity of SDEs is established by using techniques from the theory of Markov chains on general state spaces, such as that expounded by Meyn–Tweedie. Application of these Markov chain results leads to straightforward proofs of geometric ergodicity for a variety of SDEs, including problems with degenerate noise and for problems with locally Lipschitz vector fields. Applications where this theory can be usefully applied include damped-driven Hamiltonian problems (the Langevin equation), the Lorenz equation with degenerate noise and gradient systems.\n\nThe same Markov chain theory is then used to study time-discrete approximations of these SDEs. The two primary ingredients for ergodicity are a minorization condition and a Lyapunov condition. It is shown that the minorization condition is robust under approximation. For globally Lipschitz vector fields this is also true of the Lyapunov condition. However in the locally Lipschitz case the Lyapunov condition fails for explicit methods such as Euler–Maruyama; for pathwise approximations it is, in general, only inherited by specially constructed implicit discretizations. Examples of such discretization based on backward Euler methods are given, and approximation of the Langevin equation studied in some detail.","documents":[{"id":"http://authors.library.caltech.edu/id/document/253441","docid":253441,"rev_number":3,"files":[{"id":"http://authors.library.caltech.edu/id/file/1268502","fileid":1268502,"datasetid":"document","objectid":253441,"filename":"1-s2.0-S0304414902001503-main.pdf","mime_type":"application/pdf","hash":"a30a8866732ca5b9436e7972511ade7e","hash_type":"MD5","filesize":462633,"mtime":"2017-06-09 19:50:55","url":"http://authors.library.caltech.edu/78060/1/1-s2.0-S0304414902001503-main.pdf"}],"eprintid":78060,"pos":1,"placement":1,"mime_type":"application/pdf","format":"application/pdf","language":"en","security":"internal","license":"other","main":"1-s2.0-S0304414902001503-main.pdf","content":"published"}],"note":"© 2002 Elsevier Science B.V. \n\nReceived 8 August 2000, Revised 21 March 2002, Accepted 10 April 2002, Available online 28 May 2002. \n\nSupported by the National Science Foundation under grant DMS-9971087. \n\nSupported by the Engineering and Physical Sciences Research Council of the UK under grant GR/N00340. \n\nSupported by the Engineering and Physical Sciences Research Council of the UK under grant GR/M42206.","id":78060,"rev_number":8,"userid":18,"eprint_dir":"disk0/00/07/80/60","datestamp":"2017-06-09 21:14:30","lastmod":"2017-06-09 21:14:30","status_changed":"2017-06-09 21:14:30","type":"article","metadata_visibility":"show","creators":[{"given":"J. C.","family":"Mattingly","id":"Mattingly-J-C","orcid":""},{"given":"A. M.","family":"Stuart","id":"Stuart-A-M","orcid":""},{"given":"D. J.","family":"Higham","id":"Higham-D-J","orcid":""}],"ispublished":"pub","subjects":null,"full_text_status":"none","keywords":"Geometric ergodicity; Stochastic differential equations; Langevin equation; Monotone; Dissipative and gradient systems; Additive noise; Hypoelliptic and degenerate diffusions; Time-discretization","date":"2002-10","date_type":"published","publication":"Stochastic Processes and their Applications","volume":"101","number":"2","pagerange":"185-232","id_number":"CaltechAUTHORS:20170609-125050787","refereed":true,"issn":"0304-4149","official_url":"http://resolver.caltech.edu/CaltechAUTHORS:20170609-125050787","related_url":[{"url":"https://doi.org/10.1016/S0304-4149(02)00150-3","type":"doi","description":"Article"},{"url":"http://www.sciencedirect.com/science/article/pii/S0304414902001503?via%3Dihub","type":"pub","description":"Article"}],"referencetext":["Arnold and Kliemann 1987\nL. Arnold, W. Kliemann\nOn unique ergodicity for degenerate diffusions\nStochastics, 21 (1987), pp. 41-61\nBakry 1997\nBakry, D., 1997. On Sobolev and logarithmic Sobolev inequalities for Markov semigroups. In: Elworthy, K.D. (Ed.), New Trends in Stochastic Analysis (Charingworth, 1994). Longman Scientific \u0026 Technical, River Edge, NJ, pp. 43–75.\nBell 1987\nD.R. Bell\nThe Malliavin Calculus, Longman Scientific \u0026 Technical, Harlow (1987)\nDown 1995\nD. Down, S.P. Meyn, R.L. Tweedie\nExponential and uniform ergodicity of Markov processes\nAnn. Probab., 23 (1995), pp. 1671-1691\nDurrett 1996\nR. Durrett\nStochastic Calculus, A Practical Introduction, CRC Press, Boca Raton, FL (1996)\nE and Mattingly 2001\nW. E, J.C. Mattingly\nErgodicity for the Navier–Stokes equation with degenerate random forcing: finite dimensional approximation\nComm. Pure Appl. Math., 54 (2001), pp. 1386-1402\nFayolle 1995\nG. Fayolle, V.A. Malyshev, M.V. Menshikov\nTopics in the Constructive Theory of Countable Markov Chains, Cambridge Univ. Press, Cambridge (1995)\nFord and Kac 1987\nG.W. Ford, M. Kac\nOn the quantum Langevin equation\nJ. Statist. Phys., 46 (1987), pp. 803-810\nGrorud and Talay 1996\nA. Grorud, D. Talay\nApproximation of Lyapunov exponents of nonlinear stochastic differential equations\nSIAM J. Appl. Math., 56 (1996), pp. 627-650\nHale 1988\nJ.K. Hale\nAsymptotic Behavior of Dissipative Systems, American Mathematical Society, Providence, RI (1988)\nHansen 2002\nHansen, N.R., 2002. Geometric ergodicity of discrete time approximations to multivariante diffusions. Preprint.\nHas'minskii 1980\nR.Z. Has'minskii\nStochastic Stability of Differential Equations, Sijthoff and Noordhoff, Alphen a/d Rijin (1980)\nKifer 1988\nY. Kifer\nRandom Perturbations of Dynamical Systems, Birkhäuser, Boston Inc, Boston, MA (1988)\nKliemann 1987\nW. Kliemann\nRecurrence and invariant measures for degenerate diffusions\nAnn. Probab., 15 (1987), pp. 690-707\nKloeden and Platen 1991\nP.E. Kloeden, E. Platen\nNumerical Solution of Stochastic Differential Equations, Springer, New York (1991)\nKunita 1978\nKunita, H., 1978. Supports of diffusion processes and controllability problems. In: Itô, K. (Ed.), Proceedings of the International Symposium on Stochastic Differential Equations (Res. Inst. Math. Sci., Kyoto Univ., Kyoto, 1976). Wiley, New York, pp. 163–185.\nLedoux\nLedoux, M., Concentration of measure and logarithmic Sobolev inequalities. In: Séminaire de Probabilités, XXXIII, Lecture Notes in Math., vol. 1709, Springer, Berlin, 1999, pp. 120–216.\nMao 1997\nX. Mao\nStochastic Differential Equations and Applications, Horwood, Chichester (1997)\nThe MathWorks, Inc., 1992\nThe MathWorks, Inc., 1992. MATLAB User's Guide. Natick, MA.\nMattingly and Stuart\nMattingly, J., Stuart, A.M., in Preparation. Ergodicity for adaptive approximations of SDEs.\nMeyn and Tweedie 1992\nS. Meyn, R.L. Tweedie\nStochastic Stability of Markov Chains, Springer, New York (1992)\nMeyn and Tweedie 1993\nMeyn, S.P., Tweedie, R.L., 1993. Stability of Markovian processes, I, II and III Adv. Appl. Probab. 24 542–574, 25, 487–517 and 25, 518–548.\nNorris 1986\nNorris, J., 1986. Simplified Malliavin calculus. In: Azéma, J., Yor, M. (Eds.), Séminaire de Probabilités, XX, 1984/85, Springer, Berlin, pp. 101–130.\nOrey 1971\nOrey, S., 1971. Lecture Notes on Limit Theorems for Markov Chain Transition Probabilities. Van Nostrand Reinhold Co., London, Van Nostrand Reinhold Mathematical Studies, No. 34.\nPages 2001\nG. Pages\nSur quelques algorithmes recursifs pour les probabilities numeriques\nESAIM: Probab. Statist., 5 (2001), pp. 141-170\nRoberts and Rosenthal 1998b\nG. Roberts, J.S. Rosenthal\nOptimal scaling of discrete approximations to Langevin diffusions\nJ. Roy. Statist. Soc., 60 (1998), pp. 255-268\nRoberts and Tweedie 1996\nG.O. Roberts, R.L. Tweedie\nExponential convergence of Langevin diffusions and their discrete approximations\nBernoulli, 2 (1996), pp. 341-363\nRoberts and Tweedie 1999\nG.O. Roberts, R.L. Tweedie\nBounds on regeneration times and convergence rates for Markov chains\nStochastic Proc. Applic., 80 (1999), pp. 211-229\nArticlePDF (143KB)\nRogers and Williams 2000\nRogers, L.C.G., Williams, D., 2000. Diffusions, Markov processes and Martingales, Vol. 2, 2nd Edition. Cambridge University Press, Cambridge, reprinted.\nRosenthal 1995\nJ.S. Rosenthal\nMinorization conditions and convergence rates for Markov chain Monte Carlo\nJ. Amer. Statist. Assoc., 90 (1995), pp. 558-566\nSanz-Serna and Stuart 1999\nJ.M. Sanz-Serna, A.M. Stuart\nErgodicity of dissipative differential equations subject to random impulses\nJ. Differential Equations, 155 (1999), pp. 262-284\nArticlePDF (189KB)\nShardlow and Stuart 2000\nT. Shardlow, A.M. Stuart\nA perturbation theory for ergodic Markov chains with application to numerical approximation\nSIAM J. Numer. Anal., 37 (2000), pp. 1120-1137\nSparrow 1982\nC. Sparrow\nThe Lorenz Equations, Bifurcations, Chaos and Strange Attractors, Springer, Berlin (1982)\nStramer and Tweedie 1999a\nO. Stramer, R.L. Tweedie\nLangevin-type models I: diffusions with given stationary distributions, and their discretizations\nMethod. Comput. Appl. Probab., 1 (1999), pp. 283-306\nStramer and Tweedie 1999b\nO. Stramer, R.L. Tweedie\nLangevin-type models II: self-targeting candidates for MCMC algorithms\nMethodol. Comput. Appl. Probab., 1 (1999), pp. 307-328\nStroock 1982\nStroock, D.W., 1982. Lectures on Topics in Stochastic Differential Equations. Tata Institute of Fundamental Research, Bombay (With notes by Satyajit Karmakar).\nStroock and Varadhan 1972\nStroock, D.W., Varadhan, S.R.S., 1972. On the support of diffusion processes with applications to the strong maximum principle. Proceedings of the Sixth Berkeley Symposium on Math. Stat. and Prob., Vol. III, pp. 333–360.\nStuart and Humphries 1996\nA.M. Stuart, A.R. Humphries\nDynamical Systems and Numerical Analysis, Cambridge University Press, Cambridge (1996)\nTalay 1990\nD. Talay\nSecond-order discretization schemes for stochastic differential systems for the computation of the invariant law\nStochastics Stochastics Rep., 29 (1990), pp. 13-36\nTalay 1991\nD. Talay\nApproximation of upper Lyapunov exponents of bilinear stochastic differential systems\nSIAM J. Numer. Anal., 28 (1991), pp. 1141-1164\nTalay 1999\nTalay, D., 1999. Approximation of the invariant probability measure of stochastic Hamiltonian dissipative systems with non globally Lipschitz co-efficients. Appears In: Bouc, R., Soize, C. (Eds.), Progress in Stochastic Structural Dynamics, Vol. 152. Publication du L.M.A.-CNRS.\nTalay 2002\nTalay, D., 2002. Stochastic Hamiltonian dissipative systems with non globally Lipschitz co-efficients: exponential convergence to the invariant measure and discretization by the implicit Euler scheme. Markov Proc. Rel. Fields, submitted.\nTropper 1977\nM.M. Tropper\nErgodic properties and quasideterministic properties of finite-dimensional stochastic systems\nJ. Statist. Phys., 17 (1977), pp. 491-509\nVeretennikov 1997\nA.Y. Veretennikov\nOn polynomial mixing bounds for stochastic differential equations\nStochastic Process. Appl., 70 (1997), pp. 115-127"],"rights":"No commercial reproduction, distribution, display or performance rights in this work are provided.","official_citation":"J.C. Mattingly, A.M. Stuart, D.J. Higham, Ergodicity for SDEs and approximations: locally Lipschitz vector fields and degenerate noise, Stochastic Processes and their Applications, Volume 101, Issue 2, 2002, Pages 185-232, ISSN 0304-4149, http://dx.doi.org/10.1016/S0304-4149(02)00150-3.\n(http://www.sciencedirect.com/science/article/pii/S0304414902001503)","other_numbering_system":null,"funders":[{"agency":"NSF","grant_number":"DMS-9971087"},{"agency":"Engineering and Physical Sciences Research Council (EPSRC)","grant_number":"GR/N00340"},{"agency":"Engineering and Physical Sciences Research Council (EPSRC)","grant_number":"GR/M42206"}],"collection":"CaltechAUTHORS","reviewer":"George Porter","local_group":null}